{"id": "2509.13411", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2509.13411", "abs": "https://arxiv.org/abs/2509.13411", "authors": ["D. J. Walton", "A. Madathil-Pottayil", "P. Kosec", "J. Jiang", "J. Garcia", "A. C. Fabian", "C. Pinto", "D. J. K. Buisson", "M. L. Parker", "W. N. Alston", "C. S. Reynolds"], "title": "The Broadband View of the Bare Seyfert PG 1426+015: Relativistic Reflection, the Soft Excess and the Importance of Oxygen", "comment": "17 pages, 13 figures, accepted for publication in MNRAS", "summary": "We present results from a deep, coordinated $XMM$-$Newton$ + $NuSTAR$\nobservation of the type 1 Seyfert PG 1426+015, a source of particular interest\nas the most massive reverberation-mapped black hole to date ($\\log\n[M_{\\rm{BH}}/M_{\\odot}]$ = $9.01^{+0.11}_{-0.16}$). The high-resolution RGS\ndata confirm the 'bare' nature of the source, showing no evidence for\nabsorption beyond the Galactic column, while the broadband spectrum\nunambiguously reveals the presence of relativistic reflection from the\ninnermost accretion disc (in the form of a relativistically broadened iron\nemission and associated Compton reflection hump) as well as confirming the\npresence of the strong soft excess reported previously. We explore whether\nrelativistic reflection can successfully account for the soft excess along with\nthe higher-energy reflection features, utilizing the two most-commonly used\nreflection codes (REFLIONX, XILLVER). Ultimately we find that both models are\nable to successfully reproduce the soft excess, though in the case of the\nXILLVER model this is contingent on reducing the strength of the O VIII line\nincluded in the model, as otherwise this feature prevents the model from\nreproducing the data. The reflection models that successfully reproduce the\nbroadband data imply a relatively high density for the accretion disc of $\\log\n[n_{\\rm{e}} / \\rm{cm}^{-3}] \\sim 18$, consistent with the loose\nanti-correlation seen from other AGN in the $\\log [n_{\\rm{e}} / \\rm{cm}^{-3}]$\nvs $\\log[m_{\\rm{BH}} \\dot{m}^2]$ plane, as well as a moderate-to-high black\nhole spin of $a^* \\gtrsim 0.7$. This preliminary spin constraint is strongly\ndependent on the assumption that the soft excess is dominated by relativistic\nreflection."}
{"id": "2509.13419", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.13419", "abs": "https://arxiv.org/abs/2509.13419", "authors": ["Shuzhe Zeng", "Alexander Philippov", "James Juno", "Andrei M. Beloborodov", "Elena Popova"], "title": "Origin of Pulsed Radio Emission from Magnetars", "comment": "17 pages, 8 figures", "summary": "Extended periods of radio pulsations have been observed for six magnetars,\ndisplaying characteristics different from those of ordinary pulsars. In this\nLetter, we argue that radio emission is generated in a closed, twisted magnetic\nflux bundle originating near the magnetic pole and extending beyond 100 km from\nthe magnetar. The electron-positron flow in the twisted bundle has to carry\nelectric current and, at the same time, experiences a strong drag by the\nradiation field of the magnetar. This combination forces the plasma into a\n``radiatively locked'' state with a sustained two-stream instability,\ngenerating radio emission. We demonstrate this mechanism using novel\nfirst-principles simulations that follow the plasma behavior by solving the\nrelativistic Vlasov equation with the discontinuous Galerkin method. First,\nusing one-dimensional simulations, we demonstrate how radiative drag induces\nthe two-stream instability, sustaining turbulent electric fields. When extended\nto two dimensions, the system produces electromagnetic waves, including\nsuperluminal modes capable of escaping the magnetosphere. We measure their\nfrequency and emitted power, and incorporate the local simulation results into\na global magnetospheric model. The model explains key features of observed\nradio emission from magnetars: its appearance after an X-ray outburst, wide\npulse profiles, luminosities $\\sim 10^{30}{\\rm{erg/s}}$, and a broad range of\nfrequencies extending up to $\\sim 100\\, \\mathrm{GHz}$."}
{"id": "2509.13540", "categories": ["astro-ph.HE", "astro-ph.CO", "astro-ph.GA", "hep-ph"], "pdf": "https://arxiv.org/pdf/2509.13540", "abs": "https://arxiv.org/abs/2509.13540", "authors": ["Evan Vienneau", "Evan Batteas", "Addy J. Evans", "Odelia V. Hartl", "Nassim Bozorgnia", "Louis E. Strigari"], "title": "Dark matter annihilation signals from the Large Magellanic Cloud and its impact on the Milky Way", "comment": null, "summary": "We study the dark matter (DM) annihilation signals from the Large Magellanic\nCloud (LMC) and the impact of the LMC on the DM annihilation signals from the\nMilky Way (MW) halo, using a MW-LMC analogue from the Auriga\nmagneto-hydrodynamical simulations. We find that the gamma-ray signals from DM\nannihilation from the LMC rises above the MW foreground by a factor of greater\nthan 100 for the s-wave velocity-independent annihilation model, as well as for\nthe Sommerfeld, p-wave, and d-wave velocity-dependent models. We derive upper\nlimits on the annihilation cross section of DM particles in the LMC using\nFermi-LAT data for all velocity-dependent cross section models. Bounds for\nd-wave annihilation are more stringent by $\\sim 4-6$ orders of magnitude\nrelative to previous bounds from dwarf galaxies, and for p-wave emission our\nbounds are $\\sim 2-3$ orders of magnitude more stringent. We also demonstrate\nthat the impact of the LMC on the DM annihilation signals from the MW halo is\ngreatest for the p-wave and d-wave models towards the outer MW halo, while the\nimpact is minimal for Sommerfeld and s-wave models. The LMC boosts the DM\ndensity and velocity distribution in the outer MW halo, both by bringing in\nhigh-speed DM particles and by accelerating the DM particles of the MW,\naffecting the DM annihilation signals from the MW for the p-wave and d-wave\nmodels."}
{"id": "2509.13732", "categories": ["astro-ph.HE", "gr-qc"], "pdf": "https://arxiv.org/pdf/2509.13732", "abs": "https://arxiv.org/abs/2509.13732", "authors": ["Hong-Bo Li", "Shi-Jie Gao", "Xiang-Dong Li", "Ren-Xin Xu"], "title": "Polar Mounds on Strangeon Stars: the Neutrino Emission from Ultraluminous X-ray Pulsars", "comment": "12 pages, 5 figures, 2 tables", "summary": "Ultraluminous X-ray pulsars (ULXPs) serve as unique astrophysical\nlaboratories, offering critical insights into accretion physics under extreme\nconditions, such as strong magnetic fields and super-Eddington accretion rates.\nAdditionally, the nature of pulsars, i.e., the equation of state of\nsupranuclear matter, is still a matter of intense debate, basing on either\nconventional neutron stars or strange stars in the litterateurs. In this work,\nwe investigate accretion columns of ULXPs based on the strangeon-star model,\nfocusing on the thermal mound at the column base. Accounting for Coulomb and\nstrangeness barriers of the strangeon stars, we find that the mound can reach\n$0.7-0.95\\,\\rm km$ in height with temperatures above $10^9\\, \\rm K$, enabling\nsubstantial neutrino emission via electron-positron annihilation. Heat\ntransport along the strangeon star surface contributes a luminosity of $10^{36}\n\\, \\rm erg\\, s^{-1} $, independent of the accretion rate. At low accretion\nrates ($< 10^{20}\\, \\rm g\\,s^{-1}$), photons dominate the luminosity, while at\nhigher rates ($> 10^{21}\\, \\rm g\\, s^{-1}$), photon trapping makes neutrino\nemission the main cooling channel, with total luminosity exceeding photon\nemission, which saturates near $10^{41}\\, \\rm erg\\,s^{-1}$. Estimating neutrino\nfluxes at Earth, we find that only the nearest ULXP, Swift J0243.6$+$6124,\ncould produce a marginally detectable signal, while most extragalactic sources\nremain well below background levels. These results emphasize the key role of\nthe thermal mound and strangeon star properties in determining accretion\nluminosities and neutrino emission, offering insights for future modeling and\nobservations of ULXPs."}
{"id": "2509.13331", "categories": ["astro-ph.IM", "cs.AI", "cs.RO", "cs.SY", "eess.SY"], "pdf": "https://arxiv.org/pdf/2509.13331", "abs": "https://arxiv.org/abs/2509.13331", "authors": ["Reza Pirayeshshirazinezhad"], "title": "Explainable AI-Enhanced Supervisory Control for High-Precision Spacecraft Formation", "comment": null, "summary": "We use artificial intelligence (AI) and supervisory adaptive control systems\nto plan and optimize the mission of precise spacecraft formation. Machine\nlearning and robust control enhance the efficiency of spacecraft precision\nformation of the Virtual Telescope for X-ray Observation (VTXO) space mission.\nVTXO is a precise formation of two separate spacecraft making a virtual\ntelescope with a one-kilometer focal length. One spacecraft carries the lens\nand the other spacecraft holds the camera to observe high-energy space objects\nin the X-ray domain with 55 milli-arcsecond angular resolution accuracy. Timed\nautomata for supervisory control, Monte Carlo simulations for stability and\nrobustness evaluation, and integration of deep neural networks for optimal\nestimation of mission parameters, satisfy the high precision mission criteria.\nWe integrate deep neural networks with a constrained, non-convex dynamic\noptimization pipeline to predict optimal mission parameters, ensuring precision\nmission criteria are met. AI framework provides explainability by predicting\nthe resulting energy consumption and mission error for a given set of mission\nparameters. It allows for transparent, justifiable, and real-time trade-offs, a\ncapability not present in traditional adaptive controllers. The results show\nreductions in energy consumption and improved mission accuracy, demonstrating\nthe capability of the system to address dynamic uncertainties and disturbances."}
{"id": "2509.13812", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.13812", "abs": "https://arxiv.org/abs/2509.13812", "authors": ["Yun-Zhi Shen", "Yang Chen", "Xiao Zhang", "Chen Huang"], "title": "Fermi-LAT Detected Gamma-ray Emission Likely Associated with SNR Kes 78", "comment": "To appear in the Astrophysical Journal. 12 pages, 5 figures", "summary": "We have analyzed the GeV gamma-ray emission in the region of the supernova\nremnant (SNR) Kes 78 using $\\sim$16.7 years of Fermi-LAT observations and found\nthat the catalog sources 4FGL J1852.4+0037e and 4FGL J1851.8$-$0007c are better\nrepresented as two extended sources modeled as `2Ext'. One of them, designated\nas E2, is located at R.A.$=282.86^\\circ$, Dec.$=-0.11^\\circ$ with the 68\\%\ncontainment radius $R_{68} = 0.31^\\circ$, and is detected with a significance\nof 15.2$\\sigma$ in the 0.2--500 GeV energy range. The gamma-ray emission of\nsource E2 is well described by a log-parabola (LogP) spectral model with\nspectral index $\\Gamma$ = 1.2 and curvature $\\beta$ = 0.3. The fitting with\nelectron-proton number ratio $K_{\\rm ep}=0.01$ indicates that the GeV emission\nof source E2 is dominated by hadronic emission. Given the dense molecular\nenvironment surrounding the middle-aged SNR Kes 78, the hadronic scenario\nprovides a natural explanation for the observed GeV emission. The extended\nsource E2 can also be replaced with two point sources. One of them, designated\nas PTS1, is coincident with the newly discovered PSR J1852$-$0002g within the\n68\\% positional uncertainty circle, indicating a possible gamma-ray\ncontribution from this PSR. The gamma-ray spectrum of source PTS1 can be well\ndescribed by a LogP spectral shape. The synchro-curvature radiation model\nprovides a satisfactory spectral fit for source PTS1, suggesting that some of\nthe GeV emission from the Kes 78 region might possibly originate from the\nmagnetosphere of PSR J1852$-$0002g."}
{"id": "2509.13394", "categories": ["astro-ph.IM", "astro-ph.CO"], "pdf": "https://arxiv.org/pdf/2509.13394", "abs": "https://arxiv.org/abs/2509.13394", "authors": ["S. A. K. Leeney", "W. J. Handley", "H. T. J. Bevins", "E. de Lera Acedo"], "title": "Bayesian Anomaly Detection for Ia Cosmology: Automating SALT3 Data Curation", "comment": "14 pages, 8 figures", "summary": "Precision cosmology with Type Ia supernovae (SNe Ia) requires robust quality\ncontrol of large, heterogeneous datasets. Current data processing often relies\non manual, subjective rejection of photometric data, a practice that is not\nscalable for forthcoming surveys like the Vera C. Rubin Observatory's Legacy\nSurvey of Space and Time (LSST). We present a Bayesian framework that automates\nthis step by integrating anomaly detection directly into the light curve\nfitting process. While the framework is model-agnostic and compatible with any\nspectral energy distribution (SED) model, here we demonstrate its application\nwith the SALT3 model, implemented fully on GPU using \\texttt{JAX-bandflux} for\ncomputational efficiency. Our method models the probability of each photometric\nmeasurement being anomalous with respect to the model, simultaneously inferring\nthe physical supernova parameters and each data point's posterior probability\nof being a contaminant. Applying this framework to the Hawaii Supernova Flows\ndataset, we demonstrate its three principal capabilities: (i) robust mitigation\nof isolated outliers; (ii) automated identification and rejection of entirely\ncorrupted bandpasses; and (iii) preservation of valid data by flagging only\nspecific anomalous points within otherwise usable filters. We also find that\ncontaminants are systematically brighter and bluer, which if uncorrected could\nbias subsequent cosmological inference."}
{"id": "2509.14013", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.14013", "abs": "https://arxiv.org/abs/2509.14013", "authors": ["P. Peñil", "A. Domínguez", "S. Buson", "M. Ajello", "S. Adhikari", "A. Rico"], "title": "Extensive Analysis of gamma-Ray Periodicity in Jetted AGN from the 4FGL Catalog Using Fermi-LAT Observations", "comment": "29 pages, 7 figures, 1 table", "summary": "The quest to uncover periodic patterns within the $\\gamma$-ray emissions of\njetted active galactic nuclei (AGN) has recently emerged as a focal point in\nastrophysics. One of the primary challenges has been the necessity for\nprolonged exposures in the $\\gamma$-ray energy band. In our investigation, we\nleverage 12 years' worth of observations from the \\textit{Fermi}-LAT to\nsystematically explore periodicity across 1492 jetted AGN cataloged in 4FGL,\nrepresenting the largest sample analyzed to date. Our analysis involves a\nrobust pipeline employing nine distinct techniques designed to detect potential\nperiodic emissions within their $\\gamma$ rays. We note that 24 objects with\nprevious hints of periodicity are deliberately excluded in the present work\nsince they were reanalyzed in a dedicated paper using a similar methodology.\nUsing this thorough approach, we do not find any evidence for periodic signals\nin the 1492 jetted AGN $\\gamma$-ray light curves analyzed here."}
{"id": "2509.13844", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.13844", "abs": "https://arxiv.org/abs/2509.13844", "authors": ["Tobias Heibges", "Claire Guépin", "Luke Kupari", "Hannah Wistrand", "Randy Lahm", "Johannes Eser", "Mary Hall Reno", "Tonia M. Venters", "Lawrence Wiencke"], "title": "Scheduling follow-up observations of energetic transients with the neutrino target scheduler (NuTS)", "comment": "16 pages, 10 figures", "summary": "Space missions offer unique opportunities for studying ultra-high-energy\n(UHE) cosmic rays and neutrinos by leveraging secondary emissions generated by\nextensive air showers (EAS) resulting from their interactions with the\natmosphere or Earth's crust. Detecting UHE neutrinos associated with transient\nsources holds great potential for unraveling the origins of UHE cosmic rays and\nthe physical processes driving their production. Stratospheric balloon\nmissions, illustrated recently by the Extreme Universe Space Observatory on a\nSuper Pressure Balloon II Mission, serve as crucial precursors to space\nmissions. Due to slewing abilities of their telescopes, they can perform\nfollow-up observations of transient sources foreseen as potential candidates\nfor detectable UHE neutrino emissions. Strategies tailored to stratospheric and\nspace missions are essential for optimizing follow-up observations aimed at\ndetecting these elusive neutrinos for the first time. To address this\nchallenge, we have developed a flexible software dedicated to scheduling\ntransient source observations. The software comprises three main modules: a\nlistener module that aggregates alerts from existing alert systems to construct\na comprehensive source database, an observability module that factors in the\ndetection system's properties and trajectory to determine a list of observable\nsources during a specific timeframe, and a scheduler module that prioritizes\nobservations and proposes an optimized observation schedule. The initial\nrelease of the neutrino target scheduler software is tailored to the\nrequirements of stratospheric balloon missions, with mock observation examples\nprovided for various flight scenarios. This version will be employed for the\nupcoming PBR flight in 2027. Future developments will extend its capabilities,\nand ensure its relevance for various types of missions."}
{"id": "2509.14043", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.14043", "abs": "https://arxiv.org/abs/2509.14043", "authors": ["Marlon L. Bause", "Kamalpreet Kaur", "Isabella Rammala-Zitha", "Laura G. Spitler"], "title": "Searching for radio emission from radio quiet magnetars with MeerKAT", "comment": "13 pages, 8 figures, submitted to A&A", "summary": "Magnetars occupy the neutron star population, with magnetic field strengths\nof more than 10e12 G. They have been proposed as one of the most likely\nprogenitor models for the phenomenon of energetic, ms-duration, extragalactic\nradio bursts (FRBs) intensively since FRB-like bursts emitted from the galactic\nMagnetar SGR 1935+2154. Only a low fraction of the magnetars (six in total) has\nbeen detected in the radio regime and most magnetars are radio quiet. We\nconducted regular observations of 13 radio quiet magnetars to probe the long\nterm radio quietness using MeerKAT. These provide deep constraints on the radio\nemission of magnetars, relevant for the progenitor models of FRBs Given that\nMeerKAT is an interferometer, we probe the magnetars for radio emission in both\nimaging and time domain. We search in the time domain in a DM range of 20\npc/cm^3 to 10000 pc/cm^3 for single pulses using a TransientX based search\npipeline (FRB perspective) as well as from a pulsar perspective by folding the\ndata using the X-ray ephemeris. We use the imaging domain to search for radio\nemission in Stokes I and V as well as to create light curves using snapshot\nimaging having the long transient perspective as well. We find no radio\nemission in the time domain for any of the observed magnetars but provide deep\nlimits of the mean flux density 60 uJy and the single pulse fluence of 39 mJy.\nFrom the image domain, we provide upper limits on the persistent radio radio\nemission and the light curve for the 13 magnetars. Additionally, an ULPT and an\nadditional magnetar were observed in the images. We provide an extensive series\nof deep upper limits in the time domain but also as a novelty limits from the\nimaging domain for the magnetars. We encourage monitoring of radio quiet\nmagnetars independent of their X-ray flux with high cadence for further\ninsights in their potential for emitting in the radio regime."}
{"id": "2509.13865", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.13865", "abs": "https://arxiv.org/abs/2509.13865", "authors": ["Matteo Bachetti", "Yukikatsu Terada", "Megumi Shidatsu", "Craig B. Markwardt", "Yong Chen", "Weiwei Cui", "Giancarlo Cusumano", "Dawei Han", "Shumei Jia", "Chulsoo Kang", "Vinay L. Kashyap", "Lucien Kuiper", "Xiaobo Li", "Yugo Motogami", "Naoyuki Ota", "Simone Pagliarella", "Katja Pottschmidt", "Simon R. Rosen", "Arnold Rots", "Makoto Sawada", "Mutsumi Sugizaki", "Toshihiro Takagi", "Takuya Takahashi", "Toru Tamagawa", "Youli Tuo", "Yi-Jung Yang", "Marina Yoshimoto", "Juan Zhang"], "title": "A simple, flexible method for timing cross-calibration of space missions", "comment": "17 pages, 6 figures, 3 tables. Submitted", "summary": "The timing (cross-)calibration of astronomical instruments is often done by\ncomparing pulsar times-of-arrival (TOAs) to a reference timing model. In\nhigh-energy astronomy, the choice of solar system ephemerides and source\npositions used to barycenter the photon arrival times has a significant impact\non the procedure, requiring a full reprocessing the data each time a new\nconvention is used. Our method, developed as part of the activities of the\nInternational Astronomical Consortium for High Energy Calibration (IACHEC),\nadapts an existing pulsar solution to arbitrary JPL ephemerides and source\npositions by simulating geocentric TOAs and refitting timing models\n(implemented with PINT). We validate the procedure and apply it to thousands of\nobservations of the Crab pulsar from 14 missions spanning 2002--2025,\ndemonstrating inter-ephemeris TOA consistency at the $\\lesssim5\\,\\mu$s level,\nusing the DE200/FK5-based Jodrell Bank Monthly Ephemeris as a reference. We\nrelease open-source tools (TOAextractor) and a TOA database to support future\ncalibration and scientific studies. Instrument timing performance is broadly\nconsistent with mission specifications; the X-ray-to-radio phase offset varies\nwith energy and time at a level that is marginally compatible with the\nuncertainties of the radio ephemeris, motivating coordinated multiwavelength\nfollow-up."}
{"id": "2509.14124", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.14124", "abs": "https://arxiv.org/abs/2509.14124", "authors": ["Zhirui Li", "Zhiwei Chen", "Yang Huang", "Youjun Lu", "Jifeng Liu"], "title": "Systematic Search for Electromagnetic Counterparts to the Binary Neutron Star Merger Candidate GW231109_235456", "comment": "10 pages, 3 figures and 2 tables. Comments are welcome", "summary": "In this letter, we present a systematic search for the electromagnetic\ncounterparts of binary neutron star (BNS) merger candidate GW231109_235456 by\nexamining all transients reported within the 90% probability region and\ndetected within four days of the merger. While non-detection in $\\gamma$-ray,\nwe identify two optical candidates, each associated with and residing in a host\ngalaxy, which locate within 330 Mpc from earth; notably, one of them,\nAT2023xqy, is located at a distance of $178.6$ Mpc, in good agreement with the\nestimated distance of the GW candidate ($\\sim165^{+70}_{-69}~\\mathrm{Mpc}$).\nNear the trigger time of GW231109_235456 (MJD 60257.996), AT2023xqy showed\nevidence of a $\\sim$15-day rise, first detected at $3\\sigma$ significance on\nMJD 60259.097 and confirmed above $5\\sigma$ on MJD 60262.088. This was followed\nby a rapid $\\sim$5-day decline and a plateau lasting at least 50 days, with the\nsubsequent decay unobserved due to a data gap. The spatiotemporal coincidences\nindicate that AT2023xqy could be a candidate for the EM counterpart of BNS\nmerger candidate GW231109_235456, though its lightcurve is difficult to\nreconcile with a standard kilonova. We examine two possible scenarios to\nexplain the origin of AT2023xqy, a BNS merger-irrelevant scenario involving a\npeculiar supernova or a BNS merger-relevant scenario involving a\nmagnetar-powered kilonova under extreme conditions. Follow-up radio\nobservations are strongly encouraged, as they may provide critical insights\ninto the nature of AT2023xqy."}
{"id": "2509.14016", "categories": ["astro-ph.IM", "cs.LG", "cs.SY", "eess.SY", "gr-qc"], "pdf": "https://arxiv.org/pdf/2509.14016", "abs": "https://arxiv.org/abs/2509.14016", "authors": ["Jonas Buchli", "Brendan Tracey", "Tomislav Andric", "Christopher Wipf", "Yu Him Justin Chiu", "Matthias Lochbrunner", "Craig Donner", "Rana X. Adhikari", "Jan Harms", "Iain Barr", "Roland Hafner", "Andrea Huber", "Abbas Abdolmaleki", "Charlie Beattie", "Joseph Betzwieser", "Serkan Cabi", "Jonas Degrave", "Yuzhu Dong", "Leslie Fritz", "Anchal Gupta", "Oliver Groth", "Sandy Huang", "Tamara Norman", "Hannah Openshaw", "Jameson Rollins", "Greg Thornton", "George Van Den Driessche", "Markus Wulfmeier", "Pushmeet Kohli", "Martin Riedmiller", "LIGO Instrument Team"], "title": "Improving cosmological reach of a gravitational wave observatory using Deep Loop Shaping", "comment": null, "summary": "Improved low-frequency sensitivity of gravitational wave observatories would\nunlock study of intermediate-mass black hole mergers, binary black hole\neccentricity, and provide early warnings for multi-messenger observations of\nbinary neutron star mergers. Today's mirror stabilization control injects\nharmful noise, constituting a major obstacle to sensitivity improvements. We\neliminated this noise through Deep Loop Shaping, a reinforcement learning\nmethod using frequency domain rewards. We proved our methodology on the LIGO\nLivingston Observatory (LLO). Our controller reduced control noise in the\n10--30Hz band by over 30x, and up to 100x in sub-bands surpassing the design\ngoal motivated by the quantum limit. These results highlight the potential of\nDeep Loop Shaping to improve current and future GW observatories, and more\nbroadly instrumentation and control systems."}
{"id": "2509.14202", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.14202", "abs": "https://arxiv.org/abs/2509.14202", "authors": ["George N. Wong", "Lia Medeiros", "James M. Stone"], "title": "Mass Transport, Turbulent Mixing, and Inflow in Black Hole Accretion", "comment": "24 pages, 19 figures. submitted", "summary": "We investigate mass transport, mixing, and disk evolution in non-radiative\nblack hole accretion flows using Lagrangian tracer particles embedded in\ngeneral relativistic magnetohydrodynamics simulations. Our simulation suite\nspans magnetically arrested disk (MAD) and standard and normal evolution (SANE)\nstates across a range of black hole spins. By tracking tracer trajectories, we\ndirectly measure both advective inflow and stochastic spreading of fluid\nelements. The tracer distributions are well described by a combination of\ncoherent inward drift and Gaussian-like broadening, consistent with an\nadvection-diffusion picture. MADs exhibit systematically faster inflow than\nSANEs, with retrograde flows showing the most rapid infall; the innermost\nstable circular orbit leaves little imprint in MADs but remains more visible in\nSANEs. Turbulent fluctuations drive strong radial dispersion in all cases, with\na superdiffusive scaling of sigma ~ t^0.95 in MADs and sigma ~ t^0.75 in SANEs\nfor high-spin prograde disks. Mixing times decrease toward the event horizon\nand are consistently shorter in MADs and retrograde configurations. Tracers\nalso reveal how accretion sources shift over time: turbulence draws inflow from\na broad range of initial radii, with rapid torus depletion in MADs driving the\nmean source radius outward as r ~ t^(2/3), while SANEs evolve more gradually\nwith r ~ t^(1/2). We show that the finite mass of the initial torus has a\nstrong influence on late-time behavior, especially in MADs, where imprints of\ndifferently sized initial conditions may be accessible as early as t ~ 10000\nGM/c^3."}
{"id": "2509.13844", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.13844", "abs": "https://arxiv.org/abs/2509.13844", "authors": ["Tobias Heibges", "Claire Guépin", "Luke Kupari", "Hannah Wistrand", "Randy Lahm", "Johannes Eser", "Mary Hall Reno", "Tonia M. Venters", "Lawrence Wiencke"], "title": "Scheduling follow-up observations of energetic transients with the neutrino target scheduler (NuTS)", "comment": "16 pages, 10 figures", "summary": "Space missions offer unique opportunities for studying ultra-high-energy\n(UHE) cosmic rays and neutrinos by leveraging secondary emissions generated by\nextensive air showers (EAS) resulting from their interactions with the\natmosphere or Earth's crust. Detecting UHE neutrinos associated with transient\nsources holds great potential for unraveling the origins of UHE cosmic rays and\nthe physical processes driving their production. Stratospheric balloon\nmissions, illustrated recently by the Extreme Universe Space Observatory on a\nSuper Pressure Balloon II Mission, serve as crucial precursors to space\nmissions. Due to slewing abilities of their telescopes, they can perform\nfollow-up observations of transient sources foreseen as potential candidates\nfor detectable UHE neutrino emissions. Strategies tailored to stratospheric and\nspace missions are essential for optimizing follow-up observations aimed at\ndetecting these elusive neutrinos for the first time. To address this\nchallenge, we have developed a flexible software dedicated to scheduling\ntransient source observations. The software comprises three main modules: a\nlistener module that aggregates alerts from existing alert systems to construct\na comprehensive source database, an observability module that factors in the\ndetection system's properties and trajectory to determine a list of observable\nsources during a specific timeframe, and a scheduler module that prioritizes\nobservations and proposes an optimized observation schedule. The initial\nrelease of the neutrino target scheduler software is tailored to the\nrequirements of stratospheric balloon missions, with mock observation examples\nprovided for various flight scenarios. This version will be employed for the\nupcoming PBR flight in 2027. Future developments will extend its capabilities,\nand ensure its relevance for various types of missions."}
{"id": "2509.13865", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.13865", "abs": "https://arxiv.org/abs/2509.13865", "authors": ["Matteo Bachetti", "Yukikatsu Terada", "Megumi Shidatsu", "Craig B. Markwardt", "Yong Chen", "Weiwei Cui", "Giancarlo Cusumano", "Dawei Han", "Shumei Jia", "Chulsoo Kang", "Vinay L. Kashyap", "Lucien Kuiper", "Xiaobo Li", "Yugo Motogami", "Naoyuki Ota", "Simone Pagliarella", "Katja Pottschmidt", "Simon R. Rosen", "Arnold Rots", "Makoto Sawada", "Mutsumi Sugizaki", "Toshihiro Takagi", "Takuya Takahashi", "Toru Tamagawa", "Youli Tuo", "Yi-Jung Yang", "Marina Yoshimoto", "Juan Zhang"], "title": "A simple, flexible method for timing cross-calibration of space missions", "comment": "17 pages, 6 figures, 3 tables. Submitted", "summary": "The timing (cross-)calibration of astronomical instruments is often done by\ncomparing pulsar times-of-arrival (TOAs) to a reference timing model. In\nhigh-energy astronomy, the choice of solar system ephemerides and source\npositions used to barycenter the photon arrival times has a significant impact\non the procedure, requiring a full reprocessing the data each time a new\nconvention is used. Our method, developed as part of the activities of the\nInternational Astronomical Consortium for High Energy Calibration (IACHEC),\nadapts an existing pulsar solution to arbitrary JPL ephemerides and source\npositions by simulating geocentric TOAs and refitting timing models\n(implemented with PINT). We validate the procedure and apply it to thousands of\nobservations of the Crab pulsar from 14 missions spanning 2002--2025,\ndemonstrating inter-ephemeris TOA consistency at the $\\lesssim5\\,\\mu$s level,\nusing the DE200/FK5-based Jodrell Bank Monthly Ephemeris as a reference. We\nrelease open-source tools (TOAextractor) and a TOA database to support future\ncalibration and scientific studies. Instrument timing performance is broadly\nconsistent with mission specifications; the X-ray-to-radio phase offset varies\nwith energy and time at a level that is marginally compatible with the\nuncertainties of the radio ephemeris, motivating coordinated multiwavelength\nfollow-up."}
