{"id": "2510.07534", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2510.07534", "abs": "https://arxiv.org/abs/2510.07534", "authors": ["Martin G. H. Krause", "Martin A. Bourne", "Silke Britzen", "Adi Foord", "Jenny E. Greene", "Melanie Habouzit", "Maya A. Horton", "Lucio Mayer", "Hannah Middleton", "Rebecca Nealon", "Julia M. Sisk-Reynés", "Christopher S. Reynolds", "Debora Sijacki"], "title": "Evidence for Supermassive Black Hole Binaries", "comment": "20 pages, 8 figures, submitted to PASA, comments welcome", "summary": "We review the state of the evidence for the existence and observational\nappearance of supermassive black hole binaries. Such objects are expected from\nstandard hierarchical galaxy evolution to form after two galaxies, each\ncontaining a supermassive black hole, have merged, in the centre of the merger\nremnant. A complex interaction is predicted to take place with stars and gas in\nthe host galaxy, leading to observable signatures in weakly as well as actively\naccreting phases. Direct observational evidence is available and shows examples\nof dual active galactic nuclei from kpc scales down to parsec scales.\nSignatures of possibly closer supermassive black hole binaries may be seen in\njetted black holes. The interaction with stars and gas in a galaxy\nsignificantly affects the hardening of the binary and hence contributes to\nuncertainties of the expected gravitational wave signal. The Laser\nInterferometer Space Antenna (LISA) should in the future detect actual mergers.\nBefore the launch of LISA, pulsar timing arrays may have the best chance to\ndetect a gravitational wave signal from supermassive black hole binaries. The\nfirst signs of the combined background of inspiralling objects might have been\nseen already."}
{"id": "2510.07615", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.07615", "abs": "https://arxiv.org/abs/2510.07615", "authors": ["Peter Kosec", "Laura Brenneman", "Erin Kara", "Teruaki Enoto", "Takuto Narita", "Koh Sakamoto", "Rudiger Staubert", "Francesco Barra", "Andrew Fabian", "Jon M. Miller", "Ciro Pinto", "Daniele Rogantini", "Dominic Walton", "Yutaro Nagai"], "title": "XRISM/Resolve observations of Hercules X-1: vertical structure and kinematics of the disk wind", "comment": "To be submitted. 19 pages, 8 figures, 5 tables", "summary": "X-ray binary accretion disk winds can carry away a significant fraction of\nthe originally infalling matter and hence strongly affect the accretion flow\nand the long-term evolution of the binary system. However, accurate\nmeasurements of their mass outflow rates are challenging due to uncertainties\nin our understanding of the 3D wind structure. Most studies employ absorption\nline spectroscopy that only gives us a single sightline through the wind\nstreamlines. Hercules X-1 is a peculiar X-ray binary which allows us to avoid\nthis issue, as its warped, precessing accretion disk naturally presents a range\nof sightlines through the vertical structure of its disk wind. Here we present\nthe first results from a large, coordinated campaign on Her X-1 led by the new\nXRISM observatory and supported by XMM-Newton, NuSTAR and Chandra. We perform a\ntime-resolved analysis and constrain the properties of the wind vertical\nstructure. Thanks to the precision spectroscopy of XRISM/Resolve, we directly\ndetect the Her X-1 orbital motion in the evolution of the outflow velocity.\nAfter correcting for this effect, we observe an increase in velocity from 250\nkm/s to 600 km/s as the wind rises to greater heights above the disk. The wind\ncolumn density decreases with height, as expected, but its ionization parameter\nonly evolves weakly, and is consistent with freezing out as the wind expands\naway. Additionally, we detect a new orbital dependence of the wind properties,\nrevealing a likely second wind component that appears only briefly after the\neclipse of Her X-1 by the secondary star."}
{"id": "2510.07763", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.07763", "abs": "https://arxiv.org/abs/2510.07763", "authors": ["Ka-Yui Au", "Kwan-Lok Li", "Albert K. H. Kong", "Jumpei Takata", "Chung-Yue Hui", "Lupin C. C. Lin"], "title": "Two Possible Optical--X-Ray Anti-Correlations of PSR J1023+0038", "comment": "21 pages, 15 figures, accepted by MNRAS", "summary": "X-ray emission is generally believed to be one of the major heating sources\nfor the optical modulation in redback pulsar binaries as we have seen similar\nphenomena in many low mass X-ray binaries (LMXBs). While, e.g., MeV/GeV\ngamma-rays from the neutron stars are also possible heating sources, X-ray\nobservations are currently much more sensitive, and therefore, joint\noptical--X-ray data are observationally unique on the irradiation mechanism\ninvestigation. Using 18 X-ray/B-band simultaneous XMM-Newton observations (717\nks in total) of the redback system PSR J1023+0038 taken during the LMXB state,\nwe find a general trend that the amplitude of the B-band orbital modulation was\nlower when the observed X-ray flux was higher. Depending on the analysis method\nadopted, the statistical significance of the anti-correlation can be from\n1.7sigma to 3.1sigma. We also extended the analysis to the GeV gamma-ray band\nusing the Fermi-LAT data, but the result is insignificant to claim any\nrelations. Moreover, another X-ray/optical correlation regarding the low modes\nof the system was found in some of the \\textit{XMM-Newton} observations, and\nthe astrophysical reason behind is currently unclear yet. These\nanti-correlations likely suggest that the irradiation is generally stronger\nwhen the X-ray flux is in a fainter state, indicating that there is a more\ndominant irradiation source than the X-ray emission."}
{"id": "2510.07764", "categories": ["astro-ph.HE", "astro-ph.IM", "astro-ph.SR", "gr-qc", "nucl-th"], "pdf": "https://arxiv.org/pdf/2510.07764", "abs": "https://arxiv.org/abs/2510.07764", "authors": ["Tianzhe Zhou", "Chun Huang"], "title": "GPU-Accelerated X-ray Pulse Profile Modeling", "comment": "Submitting to ApJS, GitHub repository of this work:\n  https://github.com/zhoutz/gpu_ppm", "summary": "Pulse-profile modeling (PPM) of thermal X-ray emission from rotation-powered\nmillisecond pulsars enables simultaneous constraints on the mass $M$, radius\n$R$, and hence the equation of state of cold, dense matter. However, Bayesian\nPPM has faced a hard accuracy-speed bottleneck: current production resolutions\nused to keep inference tractable can under-resolve extreme hotspot geometries\nand bias the waveform computation, whereas the higher resolutions that remove\nthis bias push forward models to minutes per evaluation, making inference\nimpractical. We break this trade-off with, to our knowledge, the first public\nGPU-accelerated X-ray PPM framework that matches established benchmarks to\nwithin $\\sim10^{-3}$ relative accuracy even for extreme geometries, while\ncollapsing minutes-long high-fidelity computations to $2$--$5$ ms on an RTX\n4080 ($10^{3}$--$10^{4}\\times$ speedups), enabling posterior exploration at\nresolutions and complexities previously out of reach. We further uncover a bias\nnear the interpolation boundaries of atmosphere lookup tables, demonstrate it\nwith two diagnostic tests, and counter it with a mixed-order interpolator.\nTogether, these advances enlarge the feasible hotspot model space and reduce\nkey systematics in PPM, strengthening inferences for current and future X-ray\nmissions."}
{"id": "2510.07344", "categories": ["astro-ph.IM", "astro-ph.EP", "physics.geo-ph"], "pdf": "https://arxiv.org/pdf/2510.07344", "abs": "https://arxiv.org/abs/2510.07344", "authors": ["Devon Stork", "Erika DeBenedictis"], "title": "An Introduction to Mars Terraforming, 2025 Workshop Summary", "comment": null, "summary": "Terraforming Mars is an age old science fiction concept now worth revisiting\nthrough the lens of modern science and technology. This document serves as a\nsummary of contemporary ideas about Mars terraforming, prepared for attendees\nof the 2025 Green Mars Workshop. It presents one illustrative story of how Mars\nmight be transformed into a habitable world. The story is told in reverse,\nbeginning with possible planetary endpoints and tracing backward to the steps\nrequired to reach them. Along the way, it highlights alternative approaches,\ncritical unknowns and research priorities, and the near term applications and\nbenefits of terraforming research for planetary science, climate engineering,\nand sustainable technologies on Earth."}
{"id": "2510.07952", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2510.07952", "abs": "https://arxiv.org/abs/2510.07952", "authors": ["Gaia Fabj", "Christopher Tiede", "Connar Rowan", "Martin Pessah", "Johan Samsing"], "title": "Spin-Orbit Misalignments of Eccentric Black Hole Mergers in AGN Disks", "comment": null, "summary": "The disks of active galactic nuclei (AGNs) provide a natural environment\nwhere stellar-mass black holes (BHs) can dynamically pair, undergo repeated\ninteractions, and eventually merge. It is commonly assumed that gas accretion\nwill both efficiently spin up disk-embedded black holes and align the orbits of\nembedded binaries with the disk plane, leading to mergers with preferentially\npositive effective spin parameters ($\\chi_{\\mathrm{eff}}$). Such predictions\nhave motivated the use of $\\chi_{\\mathrm{eff}}$ as a diagnostic for identifying\ncandidate AGN-embedded mergers in the LIGO-Virgo-KAGRA gravitational-wave\ncatalog. In this work, we perform post-Newtonian $N$-body simulations of nearly\nplanar binary-single encounters and apply an empirically motivated, gas-driven\nalignment prescription to characterize the expected\n$\\chi_{\\mathrm{eff}}$-eccentricity correlations of AGN-embedded mergers. By\ncomparing the alignment and gravitational-wave inspiral timescales, we identify\nthe regions of parameter space, across both disk location and binary\nproperties, where full disk-spin-orbit alignment is effective and where it is\nnot. We find that quasi-circular binaries typically align by the time they\nmerge, supporting the standard picture of spin-orbit aligned orientations. By\ncontrast, eccentric binaries (with in-band eccentricity\n$e_{10\\mathrm{Hz}}\\gtrsim 0.1$) typically inspiral too quickly for gas torques\nto act, preserving the post-encounter spin-orbit misalignments and yielding\nmore isotropic $\\chi_{\\mathrm{eff}}$ distributions when disk densities and\ntorque efficiencies are modest. This interplay naturally establishes a\ncorrelation between binary eccentricity and $\\chi_{\\mathrm{eff}}$ in AGN disks,\nhighlighting a new key observable of the AGN channel and a potential\nexplanation for massive events such as GW190521 and GW231123."}
{"id": "2510.07349", "categories": ["astro-ph.IM", "astro-ph.EP"], "pdf": "https://arxiv.org/pdf/2510.07349", "abs": "https://arxiv.org/abs/2510.07349", "authors": ["Yasuhiro Hasegawa", "Courtney Dressing", "Ludmila Carone"], "title": "Probing the Origin of Water in Planets within Habitable Zones by HWO", "comment": "3 pages; the proceeding of the HWO25 conference", "summary": "How do habitable environments arise and evolve within the context of their\nplanetary systems? This is one fundamental question, and it can be addressed\npartly by identifying how planets in habitable zones obtain water.\nHistorically, astronomers considered that water was delivered to the Earth via\ndynamical shake-up by Jupiter, which took place during the formation and\npost-formation eras (e.g., $\\lesssim 100$ Myr). This hypothesis has recently\nbeen challenged by a more dynamic view of planet formation; planet-forming\nmaterials move in protoplanetary disks via various physical processes such as\npebble drift and planetary migration. \\textit{Habitable Worlds Observatory}\n(HWO) will open a new window to address this important, but difficult question\nby discovering and characterizing Earth-like exoplanets around G-type stars. In\nthis article, we consider two possible working hypotheses: (1) the abundance of\nwater on planets in habitable zones has \\textit{any} correlation with the\npresence of outer planets; and (2) the abundance of water on planets in\nhabitable zones has \\textit{no} correlation with the presence of outer planets.\nWe discuss what physical parameters need to be measured to differentiate these\ntwo hypotheses and what observational capabilities are desired for HWO to\nreliably constrain these physical parameters."}
{"id": "2510.08037", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.08037", "abs": "https://arxiv.org/abs/2510.08037", "authors": ["Lin Yu", "Tianxing Hu", "Zhiyu Lei", "Dong Wu", "Suming Weng", "Min Chen", "Jie Zhang", "Zhengming Sheng"], "title": "Acceleration of Ultrahigh Energy Particles from Fast Radio Bursts", "comment": null, "summary": "Two extreme events in the universe, fast radio bursts (FRBs) and cosmic rays\n(CRs), could be corelated, where FRBs with extreme field strength near their\nsources may contribute to CRs. This study investigates localized particle\nacceleration driven by FRB-like ultra-relativistic electromagnetic pulses. It\nis found ultra-high energy neutral plasma sheets form constantly via the front\nerosion of an FRB pulse. There are two ion acceleration regimes depending upon\nthe field strength and the plasma density: the wakefield regime dominated by\ncharge separation fields, and the piston regime driven by the\n$\\mathbf{V}\\times\\mathbf{B}$ force of the pulses. The predicted energy scalings\nalign well with particle-in-cell simulations. A power-law energy spectrum\nnaturally arises with an index close to the CRs during FRB diffusion outward.\nJoint observations of FRBs and CRs may provide an opportunity to understand\nthese extreme events and advance the development of multi-messenger astronomy."}
{"id": "2510.07370", "categories": ["astro-ph.IM", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2510.07370", "abs": "https://arxiv.org/abs/2510.07370", "authors": ["T. Zhang", "E. Charles", "J. F. Crenshaw", "S. J. Schmidt", "P. Adari", "J. Gschwend", "S. Mau", "B. Andrews", "E. Aubourg", "Y. Bains", "K. Bechtol", "A. Boucaud", "D. Boutigny", "P. Burchat", "J. Chevalier", "J. Chiang", "H. -F. Chiang", "D. Clowe", "J. Cohen-Tanugi", "C. Combet", "A. Connolly", "S. Dagoret-Campagne", "P. N. Daly", "F. Daruich", "G. Daubard", "J. De Vicente", "H. Drass", "K. Fanning", "E. Gawiser", "M. Graham", "L. P. Guy", "Q. Hang", "P. Ingraham", "O. Ilbert", "M. Jarvis", "M. J. Jee", "T. Jenness", "A. Johnson", "C. Juramy-Gilles", "S. M. Kahn", "J. B. Kalmbach", "Y. Kang", "A. Kannawadi", "L. S. Kelvin", "S. Liang", "O. Lynn", "N. B. Lust", "M. Lutfi", "A. Malz", "R. Mandelbaum", "S. Marshall", "J. Meyers", "M. Migliore", "M. Moniez", "J. Neveu", "J. A. Newman", "E. Nourbakhsh", "D. Oldag", "H. Park", "S. Pelesky", "A. A. Plazas Malagón", "B. Quint", "M. Rahman", "A. Rasmussen", "K. Reil", "W. Roby", "A. Roodman", "C. Roucelle", "M. Salvato", "B. Sánchez", "D. Sanmartim", "R. H. Schindler", "J. Scora", "J. Sebag", "N. Sedaghat", "I. Sevilla-Noarbe", "R. Shirley", "A. Shugart", "R. Solomon", "D. Taranu", "G. Thayer", "L. Toribio San Cipriano", "E. Urbach", "Y. Utsumi", "W. van Reeven", "A. von der Linden", "C. W. Walter", "W. M. Wood-Vasey", "J. Zuntz", "LSST Dark Energy Science Collaboration"], "title": "Photometric Redshift Estimation for Rubin Observatory Data Preview 1 with Redshift Assessment Infrastructure Layers (RAIL)", "comment": "14 pages, 8 figures, submitted to MNRAS", "summary": "We present the first systematic analysis of photometric redshifts (photo-z)\nestimated from the Rubin Observatory Data Preview 1 (DP1) data taken with the\nLegacy Survey of Space and Time (LSST) Commissioning Camera. Employing the\nRedshift Assessment Infrastructure Layers (RAIL) framework, we apply eight\nphoto-z algorithms to the DP1 photometry, using deep ugrizy coverage in the\nExtended Chandra Deep Field South (ECDFS) field and griz data in the\nRubin_SV_38_7 field. In the ECDFS field, we construct a reference catalog from\nspectroscopic redshift (spec-z), grism redshift (grism-z), and multiband\nphoto-z for training and validating photo-z. Performance metrics of the photo-z\nare evaluated using spec-zs from ECDFS and Dark Energy Spectroscopic Instrument\nData Release 1 samples. Across the algorithms, we achieve per-galaxy photo-z\nscatter of $\\sigma_{\\rm NMAD} \\sim 0.03$ and outlier fractions around 10% in\nthe 6-band data, with performance degrading at faint magnitudes and z>1.2. The\noverall bias and scatter of our machine-learning based photo-zs satisfy the\nLSST Y1 requirement. We also use our photo-z to infer the ensemble redshift\ndistribution n(z). We study the photo-z improvement by including near-infrared\nphotometry from the Euclid mission, and find that Euclid photometry improves\nphoto-z at z>1.2. Our results validate the RAIL pipeline for Rubin photo-z\nproduction and demonstrate promising initial performance."}
{"id": "2510.08231", "categories": ["astro-ph.HE", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2510.08231", "abs": "https://arxiv.org/abs/2510.08231", "authors": ["Lei Li", "Guoliang Lv", "Chunhua Zhu", "Sufen Guo", "Hongwei Ge", "Weimin Gu", "Zhuowen Li", "Xiaolong He"], "title": "Explanation of the Mass Distribution of Binary Black Hole Mergers", "comment": "Accepted by Physical Review D,16 pages, 5 figures", "summary": "Gravitational wave detectors are observing an increasing number of binary\nblack hole (BBH) mergers, revealing a bimodal mass distribution of BBHs, which\nhints at diverse formation histories for these systems. Using the rapid binary\npopulation synthesis code MOBSE, we simulate a series of population synthesis\nmodels that include chemically homogeneous evolution (CHE). By considering\nmetallicity-specific star formation and selection effects, we compare the\nintrinsic merger rates and detection rates of each model with observations. We\nfind that the observed peaks in the mass distribution of merging BBHs at the\nlow-mass end (10\\msun) and the high-mass end (35\\msun) are contributed by the\ncommon envelope channel or stable mass transfer channel (depending on the\nstability criteria for mass transfer) and the CHE channel, respectively, in our\nmodel. The merger rates and detection rates predicted by our model exhibit\nsignificant sensitivity to the choice of physical parameters. Different models\npredict merger rates ranging from 15.4 to $96.7\\,\\rm{Gpc^{-3}yr^{-1}}$ at\nredshift $z$ = 0.2, and detection rates ranging from 22.2 to\n148.3$\\mathrm{yr^{-1}}$ under the assumption of a detectable redshift range of\n$z \\le$ 1.0."}
{"id": "2510.07747", "categories": ["astro-ph.IM", "astro-ph.GA", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2510.07747", "abs": "https://arxiv.org/abs/2510.07747", "authors": ["B. L. Crompvoets", "H. Kirk", "R. Gutermuth", "J. Di Francesco"], "title": "Object Classification from JWST Catalogs", "comment": "12 pages, plus 16 pages of appendices. Early submission on ArXiv,\n  will be updated following Webb deadline. Comments welcome", "summary": "JWST's exquisite data have opened the doors to new possibilities in detecting\nbroad classes of astronomical objects, but also to new challenges in\nclassifying those objects. In this work, we introduce SESHAT, the Stellar\nEvolutionary Stage Heuristic Assessment Tool for the identification of Young\nStellar Objects, field stars (main sequence through asymptotic giant branch),\nbrown dwarfs, white dwarfs, and galaxies, from any JWST observation. This\nidentification is done using the machine learning method XGBoost to analyze\nthousands of rows of synthetic photometry, modified at run-time to match the\nfilters available in the data to be classified. We validate this tool on real\ndata of both star-forming regions and cosmological fields, and find we are able\nto reproduce the observed classes of objects to a minimum of 80\\% recall across\nevery class, without additional information on the ellipticity or spatial\ndistribution of the objects. Furthermore, this tool can be used to test the\nfilter choices for JWST proposals, to verify whether the chosen filters are\nsufficient to identify the desired class of objects. SESHAT is released as a\nPython package to the community for general use."}
{"id": "2510.08249", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.08249", "abs": "https://arxiv.org/abs/2510.08249", "authors": ["Alessio Berti", "Željka Bošnjak", "Alberto Castro-Tirado", "Stefano Covino", "Susumu Inoue", "Francesco Longo", "Serena Loporchio", "Davide Miceli", "Razmik Mirzoyan", "Elena Moretti", "Lara Nava", "Koji Noda", "David Paneque", "Antonio Stamerra", "Yusuke Suda", "Kenta Terauchi", "Ievgen Vovk", "Katsuaki Asano", "Satoshi Fukami", "Nuria Jordana-Mitjans", "Andrea Melandri", "Carole Mundell", "Michele Palatiello", "Manisha Shrestha", "Iain Steele"], "title": "The very high energy view of gamma-ray bursts with the MAGIC telescopes", "comment": "Proceedings of the ICRC 2025", "summary": "Gamma-ray bursts (GRBs) are one of the main targets for the observations of\nthe MAGIC telescopes. As a result of the effort in improving the sensitivity of\nthe instrument and the automatic follow-up strategy, MAGIC detected two GRBs in\nthe very-high-energy (VHE, $E>100$ GeV) range, namely GRB 190114C and GRB\n201216C. In GRB 190114C ($z=0.42$), the data collected by MAGIC revealed a new\nemission component at sub-TeV energies in the afterglow of the GRB. The very\nrich multi-wavelength dataset, spanning 17 orders of magnitude in energy,\nallowed to perform a detailed modelling of the broadband emission. The\nmulti-wavelength data could be modelled within a one-zone synchrotron-self\nCompton scenario with internal $\\gamma-\\gamma$ absorption, where the model\nparameters are compatible with those found in previous GRB afterglow studies\nbelow GeV energies. Similarly, GRB 201216C broadband emission could be\nexplained using the same model, although the amount of simultaneous\nmulti-wavelength data is reduced with respect to GRB 190114C. In particular,\nGRB 201216C challenged the current MAGIC detection potential, as its redshift\nwas determined to be $z=1.1$, strongly reducing the observed gamma-ray flux but\nmaking it the most distant source detected at VHE. These two detections,\naccompanied by evidence of VHE emission from a few more GRBs, opened up new\nquestions such as the presence of sub-TeV emission in different classes and\nphases of GRBs. In this contribution we will present the status of the MAGIC\nGRB follow-up program, with an highlight on its detected GRBs. Moreover we will\nshow the results on the GRBs observed by MAGIC from 2013 to 2019 with no\nevidence of VHE emission, in particular for those with simultaneous X-ray\nobservations and redshift $z<2$. We will discuss the implications of these\nresults for GRB physics and the challenges and prospects for future GRB\nobservations with MAGIC."}
{"id": "2510.07878", "categories": ["astro-ph.IM", "cs.CV"], "pdf": "https://arxiv.org/pdf/2510.07878", "abs": "https://arxiv.org/abs/2510.07878", "authors": ["Hamees Sayed", "Pranath Reddy", "Michael W. Toomey", "Sergei Gleyzer"], "title": "FlowLensing: Simulating Gravitational Lensing with Flow Matching", "comment": "6 pages, 2 figures, 3 tables", "summary": "Gravitational lensing is one of the most powerful probes of dark matter, yet\ncreating high-fidelity lensed images at scale remains a bottleneck. Existing\ntools rely on ray-tracing or forward-modeling pipelines that, while precise,\nare prohibitively slow. We introduce FlowLensing, a Diffusion Transformer-based\ncompact and efficient flow-matching model for strong gravitational lensing\nsimulation. FlowLensing operates in both discrete and continuous regimes,\nhandling classes such as different dark matter models as well as continuous\nmodel parameters ensuring physical consistency. By enabling scalable\nsimulations, our model can advance dark matter studies, specifically for\nprobing dark matter substructure in cosmological surveys. We find that our\nmodel achieves a speedup of over 200$\\times$ compared to classical simulators\nfor intensive dark matter models, with high fidelity and low inference latency.\nFlowLensing enables rapid, scalable, and physically consistent image synthesis,\noffering a practical alternative to traditional forward-modeling pipelines."}
{"id": "2510.08367", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.08367", "abs": "https://arxiv.org/abs/2510.08367", "authors": ["P. Limaye", "L. G. Spitler", "N. Manaswini", "J. Benáček", "F. Eppel", "M. Kadler", "L. Nicotera", "J. Wongphechauxsorn"], "title": "A broadband study of FRB20240114A with the Effelsberg 100-m radio telescope", "comment": "15 pages, 7 figures, submitted to A&A", "summary": "We present Effelsberg 100-m telescope observations of the hyperactive\nrepeating fast radio burst source FRB 20240110A, discovered by CHIME/FRB in\nJanuary 2024. Using the Ultra BroadBand (UBB) receiver, spanning 1.3-6.0 GHz,\nwe detected over 700 unique bursts across four observing epochs. A\ncomprehensive analysis of their temporal and spectral properties reveals four\ndistinct spectro-temporal morphologies, including simple, complex and\nfrequency-drifting structures. No bursts were detected across the full UBB\nband, confirming the band-limited emission typical of repeating FRBs. We find\nmodest frequency evolution in burst widths but constant fractional bandwidths,\nand strong variability in burst rates that may be influenced by scintillation.\nThe waiting-time distributions indicate predominantly independent burst events,\nwith occasional clustering suggesting a characteristic emission timescale of\n$\\sim$10 ms. Additionally, this study presents a multi-frequency analysis of\nwaiting-time distributions, offering new insights into the complex frequency\ndrifts commonly observed in repeating FRBs. These broadband observations\nprovide a detailed view of the frequency-dependent burst behavior of FRB\n20240110A and offer insights into the variability and temporal structure of\nrepeating FRB emission."}
{"id": "2510.08354", "categories": ["astro-ph.IM", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2510.08354", "abs": "https://arxiv.org/abs/2510.08354", "authors": ["Zechang Sun", "Yuan-Sen Ting", "Yaobo Liang", "Nan Duan", "Song Huang", "Zheng Cai"], "title": "Mephisto: Self-Improving Large Language Model-Based Agents for Automated Interpretation of Multi-band Galaxy Observations", "comment": "17 pages main text + 13 pages appendix. A conference abstract is\n  available at arXiv:2409.14807. Submitted to AAS journal. Comments and\n  feedback are welcome!", "summary": "Astronomical research has long relied on human expertise to interpret complex\ndata and formulate scientific hypotheses. In this study, we introduce Mephisto\n-- a multi-agent collaboration framework powered by large language models\n(LLMs) that emulates human-like reasoning for analyzing multi-band galaxy\nobservations. Mephisto interfaces with the CIGALE codebase (a library of\nspectral energy distribution, SED, models) to iteratively refine physical\nmodels against observational data. It conducts deliberate reasoning via tree\nsearch, accumulates knowledge through self-play, and dynamically updates its\nknowledge base. Validated across diverse galaxy populations -- including the\nJames Webb Space Telescope's recently discovered \"Little Red Dot\" galaxies --\nwe show that Mephisto demonstrates proficiency in inferring the physical\nproperties of galaxies from multi-band photometry, positioning it as a\npromising research copilot for astronomers. Unlike prior black-box machine\nlearning approaches in astronomy, Mephisto offers a transparent, human-aligned\nreasoning process that integrates seamlessly with existing research practices.\nThis work underscores the possibility of LLM-driven agent-based research for\nastronomy, establishes a foundation for fully automated, end-to-end artificial\nintelligence (AI)-powered scientific workflows, and unlocks new avenues for\nAI-augmented discoveries in astronomy."}
{"id": "2510.08505", "categories": ["astro-ph.HE", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2510.08505", "abs": "https://arxiv.org/abs/2510.08505", "authors": ["Anne Inkenhaag", "Andrew J. Levan", "Andrew Mummery", "Peter G. Jonker"], "title": "AT 2018cow at ~5 years: additional evidence for a tidal disruption origin", "comment": "6 pages including references, accepted for publication in MNRAS\n  Letters", "summary": "The Luminous Fast Blue Optical Transient (LFBOT) AT 2018cow is the prototype\nof its class with an extensive set of multi-wavelength observations. Despite a\nrich data set there is, still, no consensus about the physical nature and\norigin of this event. AT 2018cow remained UV bright 2-4 years after the\nexplosion, which points at an additional energy injection source, most likely\nfrom an accretion disk. We present additional late time UV data obtained with\nthe Hubble Space Telescope, to show there is no significant fading in the\noptical since the last epoch and only marginal fading in the UV. The new UV\ndata points match the predictions of previously published accretion disk\nmodels, where the disk is assumed to form from the tidal disruption of a low\nmass star by an intermediate mass black hole. This consistency provides\nevidence that AT 2018cow could indeed be a tidal disruption event. The marginal\ndecay is in contrast with the predictions of light curves produced by\ninteracting supernovae. The difference between expectations for disc emission\nand interacting supernovae will further increase with time, making data at even\nlater times a route to robustly rule out interaction between supernova ejecta\nand circumstellar material."}
{"id": "2510.08411", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2510.08411", "abs": "https://arxiv.org/abs/2510.08411", "authors": ["Oliver Camilleri", "Zahra Sharbaf", "Ignacio Ferreras"], "title": "Emergent Denoising of SDSS Galaxy Spectra Through Unsupervised Deep Learning", "comment": null, "summary": "Spectroscopy represents the ideal observational method to maximally extract\ninformation from galaxies regarding their star formation and chemical\nenrichment histories. However, absorption spectra of galaxies prove rather\nchallenging at high redshift or in low mass galaxies, due to the need to spread\nthe photons into a relatively large set of spectral bins. For this reason, the\ndata from many state-of-the-art spectroscopic surveys suffer from low\nsignal-to-noise (S/N) ratios, and prevent accurate estimates of the stellar\npopulation parameters. In this paper, we tackle the issue of denoising an\nensemble by the use of unsupervised Deep Learning techniques trained on a\nhomogeneous sample of spectra over a wide range of S/N. These methods\nreconstruct spectra at a higher S/N and allow us to investigate the potential\nfor Deep Learning to faithfully reproduce spectra from incomplete data. Our\nmethodology is tested on three key line strengths and is compared with\nsynthetic data to assess retrieval biases. The results suggest a standard\nAutoencoder as a very powerful method that does not introduce systematics in\nthe reconstruction. We also note in this work how careful the analysis needs to\nbe, as other methods can -- on a quick check -- produce spectra that appear\nnoiseless but are in fact strongly biased towards a simple overfitting of the\nnoisy input. Denoising methods with minimal bias will maximise the quality of\nongoing and future spectral surveys such as DESI, WEAVE, or WAVES."}
{"id": "2510.08560", "categories": ["astro-ph.HE", "astro-ph.SR", "nucl-th"], "pdf": "https://arxiv.org/pdf/2510.08560", "abs": "https://arxiv.org/abs/2510.08560", "authors": ["Axel Gross", "Samuel Cupp", "Matthew R Mumpower"], "title": "Gamma-Ray Spectra of $R$-Process Nuclei", "comment": "40 pages, 7 figures, 1 table, submitted to APJS", "summary": "The radioactive decay of unstable nuclei created in the rapid neutron capture\nprocess release a large amount of $\\gamma$-rays. When the ejecta is optically\nthick, these $\\gamma$-rays may contribute to an associated kilonova. Once\ntransparent, prominent spectral features will be directly observable in current\nand future $\\gamma$-ray detectors. In this work, we study and compare the\n$\\gamma$-ray spectra of a limited, weak, strong, and extended $r$-process\nacross a broad timescale, identifying the nuclei which significantly\ncontribute. We discuss these findings in the context of observability, noting\nthat there are several practical challenges to connecting observed signatures\nto specific nuclei. However, if these challenges can be overcome, direct\nobservation of $\\gamma$-rays from $r$-process sites can provide insight into\nthe fundamental physics underpinning the $r$-process."}
{"id": "2510.07764", "categories": ["astro-ph.HE", "astro-ph.IM", "astro-ph.SR", "gr-qc", "nucl-th"], "pdf": "https://arxiv.org/pdf/2510.07764", "abs": "https://arxiv.org/abs/2510.07764", "authors": ["Tianzhe Zhou", "Chun Huang"], "title": "GPU-Accelerated X-ray Pulse Profile Modeling", "comment": "Submitting to ApJS, GitHub repository of this work:\n  https://github.com/zhoutz/gpu_ppm", "summary": "Pulse-profile modeling (PPM) of thermal X-ray emission from rotation-powered\nmillisecond pulsars enables simultaneous constraints on the mass $M$, radius\n$R$, and hence the equation of state of cold, dense matter. However, Bayesian\nPPM has faced a hard accuracy-speed bottleneck: current production resolutions\nused to keep inference tractable can under-resolve extreme hotspot geometries\nand bias the waveform computation, whereas the higher resolutions that remove\nthis bias push forward models to minutes per evaluation, making inference\nimpractical. We break this trade-off with, to our knowledge, the first public\nGPU-accelerated X-ray PPM framework that matches established benchmarks to\nwithin $\\sim10^{-3}$ relative accuracy even for extreme geometries, while\ncollapsing minutes-long high-fidelity computations to $2$--$5$ ms on an RTX\n4080 ($10^{3}$--$10^{4}\\times$ speedups), enabling posterior exploration at\nresolutions and complexities previously out of reach. We further uncover a bias\nnear the interpolation boundaries of atmosphere lookup tables, demonstrate it\nwith two diagnostic tests, and counter it with a mixed-order interpolator.\nTogether, these advances enlarge the feasible hotspot model space and reduce\nkey systematics in PPM, strengthening inferences for current and future X-ray\nmissions."}
