{"id": "2511.07529", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.07529", "abs": "https://arxiv.org/abs/2511.07529", "authors": ["Subhash Bose", "M. D. Stritzinger", "A. Malmgaard", "C. J. Miller", "N. Elias-Rosa", "J. P. U. Fynbo", "C. Ashall", "C. R. Burns", "J. M. DerKacy", "L. Galbany", "C. P. Gutiérrez", "W. B. Hoogendam", "E. A. M. Jensen", "K. Medler", "Alaa Alburai", "J. Anderson", "E. Baron", "J. Duarte", "M. Gromadzki", "C. Inserra", "P. A. Mazzali", "T. E. Müller-Bravo", "P. Lundqvist", "A. Reguitti", "I. Salmaso", "D. J. Sand", "G. Valerin"], "title": "The Type Ia Supernova 2021hem: A 2003fg-like Event in an Apparently Hostless Environment", "comment": "22pages, 15 figures", "summary": "We report observations of Type Ia SN 2021hem, discovered <48 hours of last non-detection, and located in an apparently hostless environment. With a peak absolute B-band magnitude of -19.96 mag, and a lack of secondary maximum in near-infrared and i-band light curves make it resemble 2003fg-like events. The slowly evolving light curves, and the earliest spectrum showing CII absorption lines, further support this classification. Fireball model fit to early light curves yields a time of first light of -16.43 days relative to B-band maximum. The first detection occurs 1.51 days before the onset of the fireball-like flux rise. This early emission, and $(g - r)_0$ color, is inconsistent with circumstellar or companion interaction. Instead, shallow $^{56}$Ni mixing or an asymmetric $^{56}$Ni distribution offers a plausible explanation. SN2021hem is the fifth known 2003fg-like SN with early-time excess flux emission. The estimated mass of radioactive $^{56}$Ni in SN2021hem is $1.00\\pm0.09 M_\\odot$. Deep GTC imaging obtained 2.5 yr after the explosion (with $m_{lim,r}=24.4$ mag and $μ_{lim,r} = 26.3\\rm~mag~arsec^{-2}$), reveals no coincident host, thereby ruling out most faint dwarf and UDGs. Alternatively, assuming the nearest plausible host galaxy, at a distance of 102 kpc, implies a hyper-velocity progenitor ejected at $\\sim$2200 km/s. A faint diffuse feature ~6 kpc from the SN site has also been detected in the image, with its surface brightness of a UDGs. However, it is unclear whether it is a galaxy and is associated with SN2021hem. Considering its large normalized directional light distance ($d_{DLR}\\sim3-4$) from SN, and its unusual elongation, it is a candidate of low probability to be the host galaxy of SN2021hem. These results identify SN2021hem as one of the strongest candidates for a hostless SN Ia, underscoring the diversity of luminous, slowly evolving, 2003fg-like explosions."}
{"id": "2511.07535", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2511.07535", "abs": "https://arxiv.org/abs/2511.07535", "authors": ["Y. Y. Kovalev", "M. F. Aller", "A. K. Erkenov", "J. L. Gómez", "D. C. Homan", "P. I. Kivokurtseva", "Yu. A. Kovalev", "M. L. Lister", "P. V. de la Parra", "A. V. Plavin", "A. V. Popkov", "A. B. Pushkarev", "A. C. S. Readhead", "E. Shablovinskaia", "Yu. V. Sotnikova", "O. I. Spiridonova", "S. V. Troitsky", "V. V. Vlasyuk"], "title": "Multi-messenger flare in the quasar PKS 0446+11", "comment": "10 pages; submitted to A&A", "summary": "The physical mechanisms driving neutrino and electromagnetic flares in blazars remain poorly understood. We investigate a prominent multi-messenger flare in the quasar PKS 0446+11 to identify the processes responsible for its high-energy emission. We analyze the IceCube-240105A high-energy neutrino event together with contemporaneous observations in the gamma-ray, X-ray, optical, and radio bands. The on- and off-flare spectral energy distributions (SEDs) are modeled within a single-zone leptohadronic framework. Multi-epoch VLBA observations from the MOJAVE program provide parsec-scale polarization data that complement the multi-wavelength light curves. No significant time delay is detected between the neutrino arrival and the flares in different energy bands. This is consistent with an extremely small jet viewing angle below 1 deg, inferred from the parsec-scale polarization structure. The flare can be reproduced by the injection of a proton population and an increase of the Doppler factor from 18 to 24. We also detect an approximately 90 deg rotation of the EVPA in the parsec-scale core during the initial phase of the flare, indicating the emergence of a shock formed by the change in the bulk plasma speed. Our comprehensive multi-messenger analysis demonstrates that the extreme beaming and sub-degree viewing angle of this distant blazar can account for the observed neutrino and electromagnetic activity. These findings strengthen the case for blazars as efficient accelerators of hadrons and as significant contributors to the observed high-energy neutrino flux."}
{"id": "2511.07539", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2511.07539", "abs": "https://arxiv.org/abs/2511.07539", "authors": ["Bart F. A. van Baal", "Anders Jerkstrand"], "title": "\\texttt{ExTraSS}: a Domain Decomposed 3D NLTE Radiative Transfer spectral synthesis code for nebular phase transients", "comment": "14 pages, 10 figures, 4 tables. Submitted to MNRAS", "summary": "In the nebular phase, supernovae are powered by radioactive decay and continuously fade, while their densities have decreased enough such that the expanding nebula becomes (largely) optically thin and the entire structure can be studied. Models for the nebular phase need to take Non-Local Thermodynamic Equilibrium (NLTE) effects into account, while at the same time radiative transfer effects often cannot be ignored. To account for the asymmetric morphologies of SNe, 3D input ejecta models must be used. In this work, we present the \\texttt{ExTraSS} (EXplosive TRAnsient Spectral Simulator) code, which has been upgraded to be fully capable of 3D NLTE radiative transfer calculations in order to generate synthetic spectra for explosive transients in the nebular phase, with a focus on supernovae. We solve the long-standing difficulty of 3D NLTE radiative transfer -- to manage generation and storage of millions of photoexcitation rates over $\\sim10^{5}$ of cells -- by developing a new Domain Decomposition algorithm. We describe this new methodology and general code operations in detail, and verify convergence and accuracy."}
{"id": "2511.07540", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.07540", "abs": "https://arxiv.org/abs/2511.07540", "authors": ["Bart F. A. van Baal", "Anders Jerkstrand", "Daniel Kresse", "Hans-Thomas Janka"], "title": "Emission line models for the lowest mass core-collapse supernovae -- II. Full 3D NLTE radiative transfer modelling of a $9.0\\,M_\\odot$ neutrino-driven explosion", "comment": "19 pages, 14 figures. Submitted to MNRAS", "summary": "The nebular phase of a supernova (SN) occurs several months to years after the explosion, when the ejecta become mostly optically thin yet there still is sufficient radioactive material to keep the supernova bright. The asymmetries created by the explosion are encoded into the line profiles of the emission lines which appear in the nebular phase. In order to make accurate predictions for these line profiles, Non-Local Thermodynamic Equilibrium (NLTE) radiative transfer calculations need to be carried out. In this work, we use \\texttt{ExTraSS} (EXplosive TRAnsient Spectral Simulator) -- which was recently upgraded into a full 3D NLTE radiative transfer code (including photoionization and line-by-line transfer effects) -- to carry out such calculations. \\texttt{ExTraSS} is applied to a 3D explosion model of a $9.0\\,M_\\odot$ H-rich progenitor which is evolved into the homologous phase. Synthetic spectra are computed and the lines from different elements are studied for varying viewing angles. The model spectra are also compared against observations of SN 1997D and SN 2016bkv. The model is capable of creating good line profile matches for both SNe, and reasonable luminosity matches for He, C, O, and Mg lines for SN 1997D -- however H$α$ and Fe I lines are too strong."}
{"id": "2511.07430", "categories": ["astro-ph.IM", "nucl-ex", "physics.app-ph"], "pdf": "https://arxiv.org/pdf/2511.07430", "abs": "https://arxiv.org/abs/2511.07430", "authors": ["Li Zhenchao", "Yang Aixiang"], "title": "A Unified Model and Optimization for Deep Space Radiation Shielding Based on Proton Density", "comment": null, "summary": "In the field of deep space radiation shielding design, traditional high-Z metals are being progressively replaced by novel low-Z materials such as hydrogenated graphene foam, polyethylene-carbon nanotube composite fibers, and boron-rich hydrogen-containing metal-organic frameworks. This transition stems from the constraints of the \"gram-scale weight reduction\" bottleneck. However, the mechanisms behind these materials' outstanding \"lightweight performance\" remain at the purely phenomenological level. To address this issue, this paper innovatively proposes a ternary coupled semi-empirical model, with \"proton density\" (rho_p) as the core independent variable (equivalent to electron density), establishing correlations with full absorption threshold (Eth) and proton utilization rate (eta_p). To validate the model's practicality in complex system design, we embedded it into the NSGA-II genetic algorithm (POP=20, MAXGEN=10). Under constraints of 2-5 layer structures with total thickness <=1 cm, the model's predicted optimal solutions showed an average design error of only 6.2%-8.2% compared to Geant4 heavy simulation dose results. This study provides the first quantitative physical explanation of the inherent trade-off between low-Z materials' \"mass savings\" and high-Z materials' \"space savings.\" When rho_p<1 mol cm^-3, materials demonstrate extremely high proton utilization rates (eta_p reaching 60-100 MeV cm^-2 mol^-1), achieving 35%-55% mass savings. Conversely, when rho_p>1 mol cm^-3, although eta_p drops below 30 MeV cm^-2 mol^-1, its exceptionally high full absorption threshold (Eth) enables ultra-thin shielding technology. This work offers a robust, physically interpretable, and scalable design tool for multi-objective optimization of area density, thickness, and dose in deep space missions."}
{"id": "2511.07567", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.07567", "abs": "https://arxiv.org/abs/2511.07567", "authors": ["Adamu Issifu", "Prashant Thakur", "Davood Rafiei Karkevandi", "Franciele M. da Silva", "Débora P. Menezes", "Y. Lim", "Tobias Frederico"], "title": "Dark Matter Heating in Evolving Proto-Neutron Stars: A Two-Fluid Approach", "comment": "15 pages, 5 tables, and 6 figures", "summary": "Neutron stars (NSs) provide a unique laboratory to probe dark matter (DM) through its gravitational imprint on stellar evolution. We use a two-fluid framework with non-annihilating, asymmetric DM, both fermionic and bosonic, that interacts with ordinary matter (OM) solely through gravity. Within this framework, we track proto-neutron stars (PNSs) across their thermal and compositional evolution via quasi-static modeling over the Kelvin--Helmholtz cooling timescale. We uncover a distinct thermal signature: DM cores deepen the gravitational potential, compressing and heating the baryonic matter, while extended DM halos provide external support, leading to cooling of the stellar matter. In contrast, hyperons and other exotic baryons soften the equation of state similarly to DM cores but reduce, rather than increase, the temperature. DM thus alters both temperature and particle distribution profiles in ways that provide a clear diagnostic of its presence. DM cores also enhance compactness and shift hyperon onset, with the strongest effects during deleptonization and neutrino-transparent phases due to reduced neutrino pressure contributions. Consequently, this early thermal evolution, observable through supernova neutrino light curves and young pulsar cooling curves, offers a direct, testable probe of DM in NSs."}
{"id": "2511.07562", "categories": ["astro-ph.IM", "astro-ph.GA", "astro-ph.SR", "physics.flu-dyn"], "pdf": "https://arxiv.org/pdf/2511.07562", "abs": "https://arxiv.org/abs/2511.07562", "authors": ["Giovanni Tedeschi-Prades", "Til Birnstiel", "Klaus Dolag", "Barbara Ercolano", "Mark Hutchison"], "title": "General Implicit Runge-Kutta Integrators for Multifluid Gas-Dust Aerodynamic Drag", "comment": "Accepted for publication in The Astrophysical Journal. 13 pages, 8 figures", "summary": "The integration of aerodynamic drag is a fundamental step in simulating dust dynamics in hydrodynamical simulations. We propose a novel integration scheme, designed to be compatible with Strang splitting techniques, which allows for the straightforward integration of external forces and hydrodynamic fluxes in general-purpose hydrodynamic simulation codes. Moreover, this solver leverages an analytical solution to the problem of drag acceleration, ensuring linear complexity even in cases with multiple dust grain sizes, as opposed to the cubic scaling of methods that require a matrix inversion step. This new General Implicit Runge-Kutta integrator (GIRK) is evaluated using standard benchmarks for dust dynamics such as DUSTYBOX, DUSTYWAVE, and DUSTYSHOCK. The results demonstrate not only the accuracy of the method but also the expected scalings in terms of accuracy, convergence to equilibrium, and execution time. GIRK can be easily implemented in hydrodynamical simulations alongside hydrodynamical steps and external forces, and is especially useful in simulations with a large number of dust grain sizes."}
{"id": "2511.07643", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.07643", "abs": "https://arxiv.org/abs/2511.07643", "authors": ["Rukaiya Khatoon", "Markus Boettcher", "Joshua Robinson"], "title": "Blazar PKS 0446+11 - Neutrino connection study using a lepto-hadronic model", "comment": "Submitted to The Astrophysical Journal: 11 pages, 2 figures, 1 table", "summary": "We present a multi-wavelength study of a blazar PKS 0446+11, motivated by its spatial association with the neutrino event IC240105A detected by the IceCube Neutrino Observatory on 2024 January 5. The source is located 0.4 degrees from the best-fit neutrino direction and satisfies selection criteria for VLBI-selected, radio-bright AGN that have been identified as highly probable neutrino associations. PKS 0446+11 exhibited a major gamma-ray flare in November 2023, reaching approximately 18x its 4FGL-DR4 catalog average. Around the neutrino epoch, PKS 0446+11 remained in an elevated state, with the gamma-ray flux more than six times above its catalog level, the X-ray flux an order of magnitude above the archival measurements, and the optical-UV emission also enhanced. We used Fermi-LAT, Swift-XRT/UVOT, and archival multi-wavelength data to construct multi-wavelength light curves and spectral energy distributions (SEDs). SED modeling shows that the emission is best described by a leptonic scenario, with synchrotron emission at low energies and external Compton scattering of broad-line region and dusty torus photons dominating the X-ray - gamma-ray output. A lepto-hadronic model fails to adequately reproduce the observed SED, although hadronic cascades can broadly account for the X-ray and gamma-ray spectral coverage at lower flux levels. We compute the expected neutrino flux for the hadronic scenario and compare it to the IceCube 90% upper limit. Our results highlight the importance of continued multi-wavelength and neutrino monitoring to better understand the physical conditions under which this blazar may serve as neutrino source."}
{"id": "2511.07679", "categories": ["astro-ph.IM", "gr-qc"], "pdf": "https://arxiv.org/pdf/2511.07679", "abs": "https://arxiv.org/abs/2511.07679", "authors": ["Kohei Yamamoto", "Hannah Tomio", "Charlotte Zehnder", "Kenji Numata", "Holly Leopardi"], "title": "Alternative approach to time-delay interferometry with optical frequency comb", "comment": null, "summary": "Spaceborne gravitational wave observatories, exemplified by the Laser Interferometer Space Antenna (LISA) mission, are designed to remove laser noise and clock noise from interferometric phase measurements in postprocessing. The planned observatories will utilize electro-optic modulators (EOMs) to encode the onboard clock timing onto the beam phase. Recent research has demonstrated the advantage of introducing an optical frequency comb (OFC) in the metrology system with the modified framework of time-delay interferometry (TDI): the removal of the EOM and the simultaneous suppression of the stochastic jitter of the laser and the clock in the observation band. In this paper, we explore an alternative approach with the OFC-based metrology system. We report that after proper treatment, it is possible to use the measured carrier-carrier heterodyne frequencies to monitor the time derivative of the pseudoranges, which represent the physical light travel time and the clock difference. This approach does not require changing the existing TDI framework, as previous OFC based efforts did. We also present the experimental demonstration of our scheme using two separate systems to model two spacecraft. Using this novel approach, we synchronize the two independent phase measurement systems with an accuracy better than 0.47 ns, while the stochastic jitter in the observation band is suppressed down to the setup sensitivity around the LISA performance levels at 15 pm/sqrt(Hz)."}
{"id": "2511.07644", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.07644", "abs": "https://arxiv.org/abs/2511.07644", "authors": ["James K. Leung", "Gemma E. Anderson", "Alexander J. van der Horst", "Claire Morley", "Benjamin Schneider", "Fabio De Colle", "Om Sharan Salafia", "Giancarlo Ghirlanda", "Sarah L. Chastain", "Adelle J. Goodwin", "Ashna Gulati", "Lauren Rhodes", "Stuart D. Ryder", "Ashley A. Chrimes", "Valerio D'Elia", "Mathieu de Bony de Lavergne", "Massimiliano De Pasquale", "Antonio de Ugarte Postigo", "Dieter H. Hartmann", "Benjamin P. Gompertz", "Andrew J. Levan", "Tara Murphy", "Gavin P. Rowell", "Thomas D. Russell", "Fabian Schüssler", "Rhaana L. C. Starling", "Nial R. Tanvir", "Susanna D. Vergani", "Ralph A. M. J. Wijers"], "title": "First results from the PanRadio GRB Collaboration: the 400-day afterglow of GRB~230815A", "comment": "28 pages, 12 figures; submitted to ApJL, comments are welcome", "summary": "We introduce the PanRadio Gamma-ray Burst (GRB) program carried out on the Australia Telescope Compact Array: a systematic, multi-year, radio survey of all southern \\textit{Swift} GRB events, comprehensively following the multi-frequency evolution of their afterglows from within an hour to years post-burst. We present the results of the 400-day observing campaign following the afterglow of long-duration (collapsar) GRB~230815A, the first one detected through this program. Typically, GRB~230815A would not otherwise receive traditional radio follow-up, given it has no known redshift and lacks comprehensive multi-wavelength follow-up due to its high line-of-sight extinction with $A_V = 2.3$. We found its early X-ray jet break at ${\\sim}0.1$ days post-burst to be at odds with the evolution of the multi-frequency radio light curves that were traced over an unusually long duration of $400$ days. The radio light curves approximately evolved (with minor deviations) according to the standard self-similar expansion for a relativistic blast wave in a homogeneous environment prior to jet break, showing no evidence for evolution in the microphysical parameters describing the electron acceleration processes. We reconcile these features by proposing a two-component jet: the early X-ray break originates from a narrow component with a half-opening angle ${\\sim}2.1^{\\circ}$, while the evolution of the radio afterglow stems from a wider component with a half-opening angle $\\gtrapprox 35^{\\circ}$. The PanRadio GRB program will establish a sample of comprehensively followed GRBs, where a rigorous inspection of their microphysical and dynamical parameters can be performed, thereby revealing the diversity of features in their outflows and environments."}
{"id": "2511.07706", "categories": ["astro-ph.IM", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2511.07706", "abs": "https://arxiv.org/abs/2511.07706", "authors": ["Jamila Taaki", "Lia Corrales", "Alfred Hero"], "title": "Identifiability of Rotating Stellar Surfaces from Astrometric Jitter", "comment": "5 pages, 2 figures, submitted to ICASSP", "summary": "Astrometry measures shifts in a star's photocentre and can be used to detect reflex motion due to orbiting exoplanets. Brightness asymmetries (e.g. starspots) rotating in and out of view can also cause apparent motion of the photocenter, termed astrometric jitter, that has previously been considered a source of noise. Here, we explore whether it can be used to map stellar surfaces. We derive a Cramer-Rao bound on the minimum variance for which a stellar surface can theoretically be estimated, quantifying the information content in rotational astrometric jitter. To regularize and break singularities in the Fisher information, we impose a spatial-smoothness Gaussian-Markov random field prior. A key challenge in mapping surfaces arises for stars with unknown rotational axis inclinations, requiring joint estimation of the inclination and the stellar surface. We characterize the coupling between them and quantify the precision gain when inclination is known versus unknown."}
{"id": "2511.07693", "categories": ["astro-ph.HE", "astro-ph.CO"], "pdf": "https://arxiv.org/pdf/2511.07693", "abs": "https://arxiv.org/abs/2511.07693", "authors": ["Fiona Lopez", "Daniel R. Wik", "Cicely Potter", "Randall A. Rojas Bolivar", "Ayşegül Tümer", "Dominique Eckert", "Fabio Gastaldello", "Brian W Grefenstette", "Kristin Madsen", "Ben Maughan", "Eric D. Miller", "Gerrit Schellenberger", "A. N. Wallbank"], "title": "Cross Calibration of Galaxy Cluster Temperatures Measured with NuSTAR, XMM-Newton, and Chandra", "comment": "17 pages, 9 figures", "summary": "The use of galaxy clusters to constrain cosmology is limited in part due to uncertainties in derived cluster masses, which often depend on the gas temperature. Unfortunately, there exists a longstanding discrepancy in temperature measurements of the same galaxy clusters made by the two most sensitive X-ray observatories, Chandra and XMM-Newton. The NuSTAR X-ray Observatory's greater sensitivity to the exponential turnover in the bremsstrahlung continuum allows for more precise and potentially more accurate galaxy cluster temperature estimates, especially given its unique ability to independently calibrate its optics in orbit. We present new NuSTAR spectra of 10 relaxed clusters ($5~\\mathrm{keV} < kT < 10~\\mathrm{keV}$), extracted from identical regions as previous spectra from Chandra and XMM-Newton. The 3--20~keV spectra are well fit by single temperature models, and fits done in narrower bandpasses provide no clear evidence in support of the existence of multi temperature gas. We find NuSTAR temperatures are typically $\\sim 15\\%$ higher than XMM-Newton temperatures. In contrast, good agreement is found between NuSTAR and Chandra temperatures for clusters with $kT \\lesssim 7~\\mathrm{keV}$, with Chandra measurements exceeding NuSTAR's in hotter systems. When more clusters are included, the trend is reinforced and can be extended to higher temperatures. A generic increase to Chandra's $E > 2~\\mathrm{keV}$ effective area ($\\sim 5\\%$ at 5~keV) is found to explain the trend reasonably well. These results demonstrate the potential for NuSTAR data to address the two-decade-old temperature discrepancy between Chandra and XMM-Newton."}
{"id": "2511.07957", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.07957", "abs": "https://arxiv.org/abs/2511.07957", "authors": ["Cunshi Wang", "Zuke Feng", "Difan Yi", "Yuyang Li", "Lirong Xie", "Huanbo Feng", "Yi Liu", "Qian Liu", "Yang Huang", "Hongbang Liu", "Xinyu Qi", "Yangheng Zheng", "Ali Luo", "Guirong Xue", "Jifeng Liu"], "title": "In-Orbit GRB Identification Using LLM-based model for the CXPD CubeSat", "comment": "12 pages, 8 figures", "summary": "To validate key technologies for wide field-of-view (FOV) X-ray polarization measurements, the Cosmic X-ray Polarization Detector (CXPD) CubeSat series has been developed as a prototype platform for the Low-Energy Xray Polarization Detector (LPD) onboard the POLAR-2 mission. The wide-FOV design significantly increases the complexity of the background environment, posing notable challenges for real-time gamma-ray burst (GRB) identification. In this work, we propose an in-orbit GRB identification method based on machine learning, using simulated spectral data as input. A training dataset was constructed using a Geant4-based simulator, incorporating in-orbit background and GRB events modeled within the 2-10 keV energy range. To meet the computational constraints of onboard processing, we employ a multimodal large language model (MLLM), which is fine-tuned using low-rank adaptation (LoRA) based on miniCPM-V2.6 and quantized to 4-bit precision. The model achieves perfect classification accuracy on validation data and demonstrates strong regression performance in estimating GRB spectral indices, with an RMSE of 0.118. Furthermore, we validate the feasibility of onboard deployment through a simulated satellite data processing pipeline, highlighting the potential of our approach to enable future real-time GRB detection and spectral analysis in orbit."}
{"id": "2511.07762", "categories": ["astro-ph.HE", "gr-qc"], "pdf": "https://arxiv.org/pdf/2511.07762", "abs": "https://arxiv.org/abs/2511.07762", "authors": ["Shakibul Chowdhury"], "title": "Kerr Polarization Transport: Accuracy and Performance in General Relativistic Light Propagation", "comment": "11 pages, 2 figures. Submitted to arXiv; to be submitted to The Astrophysical Journal", "summary": "We present a compact and reproducible method for general relativistic polarization transport in the Kerr metric that achieves median electric vector position angle (EVPA) residuals of $\\langle Δ\\mathrm{PA} \\rangle \\approx 0.09^\\circ$, a 95th percentile of $0.31^\\circ$, and a worst case $Δ\\mathrm{PA} \\lesssim 0.32^\\circ$ for spins up to $|a/M|=0.9$, while maintaining a fivefold or greater speedup relative to a strict reference integrator. Across the benchmark grid, typical residuals remain at the sub-tenth-degree level, with only modest degradation ($Δ\\mathrm{PA} \\lesssim 2^\\circ$) near the Thorne spin limit. Photon four-momenta $k^μ$ and polarization four-vectors $f^μ$ are advanced using a fourth order Runge-Kutta scheme with cached Christoffel symbols, maintaining the constraints $u\\cdot f=0$ and $n\\cdot f=0$, where $u^μ$ is the ZAMO four-velocity and $n^μ$ is the disk normal, while keeping $k\\cdot f \\simeq 0$. A physically motivated gauge is enforced by projecting the polarization into the local zero-angular-momentum observer (ZAMO) screen at every substep, ensuring numerical stability of the orthogonality constraints. Accuracy and performance are benchmarked over a representative grid in spin, inclination, image-plane azimuth, and radius. The method comfortably meets IXPE and NICER polarization tolerances and approaches EHT requirements. The approach provides a practical foundation for future general relativistic polarimetry and simulation pipelines."}
{"id": "2511.07996", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.07996", "abs": "https://arxiv.org/abs/2511.07996", "authors": ["B. Hudson", "L. I. Gurvits", "E. Mooij", "A. Ricarte", "D. Palumbo"], "title": "Towards direct imaging and orbital parameter estimation of supermassive black hole binaries with spaceborne VLBI", "comment": "Submitted to Astronomy & Astrophysics. 20 pages, 21 figures", "summary": "Direct electromagnetic observation of the orbital motion of a sub-parsec, supermassive black hole binary (SMBHB) would provide the first conclusive proof of such systems existing. Widely considered to be the sources of gravitational waves, binaries are expected to form as a natural consequence of galactic mergers and determining the processes that drive their evolution is essential for understanding cosmological evolution. In this work, we evaluate the prospects of using ground and spaceborne Very Long Baseline Interferometry (VLBI) to observe supermassive black hole binaries and estimate their orbital parameters. The Black Hole Explorer (BHEX) is considered as the primary case study. Achieving unprecedented resolution, BHEX will provide access to a new volume of binary parameter space, potentially enabling the first, confident detection of an SMBHB. A binary toy model using a post-Newtonian orbit propagation is developed and simulated observations by BHEX and a ground array of telescopes are performed. An orbit fitting approach using Bayesian dynamic nested sampling is presented and its efficacy is demonstrated on the simulated observational data for a set of example binary systems. It is found that for BHEX, binary detection requires a total flux density of 0.04 Jy with a minimum separation of ~2 microarcseconds and an observable mass ratio dependent on the total flux. With three annual observations, BHEX could constrain semi-major axis and eccentricity of binaries with orbital periods <10 years to within 13% of the true values. A curved trajectory could confidently be detected in binaries with period <23 years. Proposals for how candidate sources could be identified in time for the BHEX mission are also provided. Finally, we constrain the requirements of a future spaceborne VLBI system, capable of performing a statistically significant survey of supermassive black hole binaries."}
{"id": "2511.07856", "categories": ["astro-ph.HE", "gr-qc"], "pdf": "https://arxiv.org/pdf/2511.07856", "abs": "https://arxiv.org/abs/2511.07856", "authors": ["Yu-Long Yan", "Quan Cheng", "Xiao-Ping Zheng", "Xiao-Yue Yu"], "title": "Could the stochastic gravitational wave background from newborn magnetars be detected by the advanced LIGO and Einstein Telescope?", "comment": null, "summary": "Newborn magnetars are important gravitational wave sources due to their ultra-strong magnetic fields and fast spins, and the entire population in the Universe may significantly contribute to the stochastic gravitational wave background (SGWB). In this work, we investigate the SGWB from newborn magnetars and assess its detectability by the advanced LIGO (aLIGO) and Einstein Telescope (ET) based on three typical formation mechanisms of magnetars, i.e., the $α-Ω$ dynamo, convective dynamo, and magnetic flux conservation. For the two dynamo scenarios, when calculating the SGWB, we creatively incorporate the anti-correlations between the magnetic fields and initial spin periods $P_{\\rm i}$ with the initial dipole-field distribution of newborn magnetars. For the flux-conservation scenario, a bimodal lognormal form is adopted to describe the distribution of initial dipole fields, and all magnetars are assumed to have the same $P_{\\rm i}$. Our results show that the SGWB from newborn magnetars may be undetectable by the aLIGO and ET if the magnetars are formed due to these mechanisms since the signal-to-noise ratio of the SGWB with respect to the ET for an observation time of one year is only 0.37 for the $α-Ω$ dynamo, $3\\times10^{-4}$ for the convective dynamo, and at most 0.21 for the flux conservation."}
{"id": "2511.08219", "categories": ["astro-ph.IM", "astro-ph.GA", "cs.LG"], "pdf": "https://arxiv.org/pdf/2511.08219", "abs": "https://arxiv.org/abs/2511.08219", "authors": ["Rune Rost", "Lorenzo Branca", "Tobias Buck"], "title": "Emulating Radiative Transfer in Astrophysical Environments", "comment": "Accepted at the Differentiable Systems and Scientific Machine Learning workshop at EurIPS, 2025", "summary": "Radiative transfer is a fundamental process in astrophysics, essential for both interpreting observations and modeling thermal and dynamical feedback in simulations via ionizing radiation and photon pressure. However, numerically solving the underlying radiative transfer equation is computationally intensive due to the complex interaction of light with matter and the disparity between the speed of light and the typical gas velocities in astrophysical environments, making it particularly expensive to include the effects of on-the-fly radiation in hydrodynamic simulations. This motivates the development of surrogate models that can significantly accelerate radiative transfer calculations while preserving high accuracy. We present a surrogate model based on a Fourier Neural Operator architecture combined with U-Nets. Our model approximates three-dimensional, monochromatic radiative transfer in time-dependent regimes, in absorption-emission approximation, achieving speedups of more than 2 orders of magnitude while maintaining an average relative error below 3%, demonstrating our approach's potential to be integrated into state-of-the-art hydrodynamic simulations."}
{"id": "2511.08010", "categories": ["astro-ph.HE", "astro-ph.IM", "gr-qc"], "pdf": "https://arxiv.org/pdf/2511.08010", "abs": "https://arxiv.org/abs/2511.08010", "authors": ["Aknur Sakan", "Nurzhan Ussipov", "Ernazar Abdikamalov", "Almat Akhmetali", "Marat Zaidyn", "Alisher Zhunuskanov", "José A. Font", "Matthew C. Edwards", "Sultan Abylkairov"], "title": "Probing Supernovae through gravitational wave entropy", "comment": "19 pages, 7 figures, 6 tables (4 + 2 appendix)", "summary": "We study an entropy-based framework to analyze gravitational-wave signals from core-collapse supernovae. We use waveforms generated by numerical simulations and analyze them in both the time domain and the time-frequency domain using short-time Fourier and continuous wavelet transforms. From each representation, we compute four entropy measures -- Shannon, exponential, Rényi, and Tsallis -- and apply three feature selection methods to identify the most informative features. We then train machine-learning classifiers on these features to compare the performance of different methodological combinations. We find that the combination of Rényi entropy from the wavelet domain and the Relief-F selection method yields the most effective discrimination among different gravitational-wave signals."}
{"id": "2511.08437", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2511.08437", "abs": "https://arxiv.org/abs/2511.08437", "authors": ["P. R. McCullough", "Joel D. Green"], "title": "WFC3/IR Starter Guide", "comment": "20 pages, 8 figures, 3 tables", "summary": "In this starter guide, we provide a high-level overview of analysis of WFC3/IR data available from the Mikulski Archive for Space Telescopes (MAST). We intend this guide as a starting point for users examining WFC3/IR data for the first time, or for those refreshing their memory on WFC3/IR data analysis. Therefore, we focus on the analysis of archival data, not preparing new observations. Three appendices include A) a summary of the instrument and an optical schematic, B) examples from the Exposure Time Calculator, and C) a glossary of uncommon acronyms. This report addresses only data from WFC3's IR channel; not the UVIS channel."}
{"id": "2511.08153", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.08153", "abs": "https://arxiv.org/abs/2511.08153", "authors": ["Swaraj Pratim Sarmah", "Umananda Dev Goswami"], "title": "Study of Flat Spectrum Radio Quasars and BL Lacertae Objects as Sources of Diffusive Ultra High-Energy Cosmic Rays", "comment": "10 pages, 2 figures", "summary": "We examine whether Flat Spectrum Radio Quasars (FSRQs) and BL Lacertae objects (BL Lacs) can act as plausible astrophysical sources of diffuse ultra-high-energy cosmic rays (UHECRs). Using realistic luminosity-dependent density evolution (LDDE) functions derived from observed gamma-ray luminosity functions for FSRQs and BL Lacs, we calculate the redshift evolution of the cosmic ray source population through integrated luminosity functions. The diffuse UHECRs flux from these sources is modelled by propagating nuclei through extragalactic space, including energy losses from interactions with cosmic photon backgrounds. The resulting UHECRs spectra are compared with observational data from the Pierre Auger Observatory and the Telescope Array, with fluxes normalised at reference energies. In addition to spectral comparisons, we generate HEALPix-based sky maps and identify potential hotspots. Near these hotspots, several galaxies and extragalactic sources are found, suggesting possible associations with the enhanced flux regions. Our results indicate that LDDE-modelled AGNs could contribute significantly to the observed diffuse UHECRs flux and provide constraints on their role as dominant sources."}
{"id": "2511.08498", "categories": ["astro-ph.IM", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2511.08498", "abs": "https://arxiv.org/abs/2511.08498", "authors": ["Christopher M. J. Osborne"], "title": "A Simple Ray Acceleration Structure for Non-LTE Radiative Transfer", "comment": "12 pages, 7 figures. Accepted for publication in RASTI", "summary": "We present a novel ray acceleration structure for radiative transfer outside of local thermodynamic equilibrium (non-LTE), leveraging techniques from computer graphics to improve computational efficiency. By applying mipmapping (local recursive spatial averaging) and sparse voxel grids, we exploit spatial coherence and sparsity in astrophysical models to accelerate the formal solution of the radiative transfer equation. We introduce a variance-limited mipmapping (VLM) scheme with tunable error control, and extend it to handle anisotropic emission via two methods: velocity interpolation, and so-called \"Core and Voigt\". Our approach integrates a hierarchical digital differential analyzer (HDDA) for efficient ray traversal, which, combined with the mipmapping scheme achieves an order of magnitude speedup with less than 0.5 % error in the 99.9th percentile of the level populations. These methods are implemented in the DexRT code and demonstrate significant performance gains in realistic solar atmospheric models."}
{"id": "2511.08239", "categories": ["astro-ph.HE", "physics.comp-ph"], "pdf": "https://arxiv.org/pdf/2511.08239", "abs": "https://arxiv.org/abs/2511.08239", "authors": ["Jonas Pronk", "Oliver Porth", "Jordy Davelaar"], "title": "Fill the gaps: continuous in time interpolation of fluid dynamical simulations", "comment": "submitted to JCOMP", "summary": "Flexible and accurate interpolation schemes using machine learning could be of great benefit for many use-cases in numerical simulations and post-processing, such as temporal upsampling or storage reduction. In this work, we adapt the physics-informed token transformer (PITT) network for multi-channel data and couple it with Fourier neural operator (FNO). The resulting PITT FNO network is trained for interpolation tasks on a dataset governed by the Euler equations. We compare the performance of our machine learning model with a linear interpolation baseline and show that it requires $\\sim6-10$ times less data to achieve the same mean square error of the interpolated quantities. Additionally, PITT FNO has excellent mass and energy conservation as a result of its physics-informed nature. We further discuss the ability of the network to recover fine detail using a spectral analysis. Our results suggest that loss of fine details is related to the decreasing correlation time of the data with increasing Fourier mode which cannot be resolved by simply increasing Fourier mode truncation in FNO."}
{"id": "2511.07539", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2511.07539", "abs": "https://arxiv.org/abs/2511.07539", "authors": ["Bart F. A. van Baal", "Anders Jerkstrand"], "title": "\\texttt{ExTraSS}: a Domain Decomposed 3D NLTE Radiative Transfer spectral synthesis code for nebular phase transients", "comment": "14 pages, 10 figures, 4 tables. Submitted to MNRAS", "summary": "In the nebular phase, supernovae are powered by radioactive decay and continuously fade, while their densities have decreased enough such that the expanding nebula becomes (largely) optically thin and the entire structure can be studied. Models for the nebular phase need to take Non-Local Thermodynamic Equilibrium (NLTE) effects into account, while at the same time radiative transfer effects often cannot be ignored. To account for the asymmetric morphologies of SNe, 3D input ejecta models must be used. In this work, we present the \\texttt{ExTraSS} (EXplosive TRAnsient Spectral Simulator) code, which has been upgraded to be fully capable of 3D NLTE radiative transfer calculations in order to generate synthetic spectra for explosive transients in the nebular phase, with a focus on supernovae. We solve the long-standing difficulty of 3D NLTE radiative transfer -- to manage generation and storage of millions of photoexcitation rates over $\\sim10^{5}$ of cells -- by developing a new Domain Decomposition algorithm. We describe this new methodology and general code operations in detail, and verify convergence and accuracy."}
{"id": "2511.08380", "categories": ["astro-ph.HE", "hep-ph", "hep-th", "nucl-ex", "nucl-th"], "pdf": "https://arxiv.org/pdf/2511.08380", "abs": "https://arxiv.org/abs/2511.08380", "authors": ["Bao-Jun Cai", "Bao-An Li", "Yu-Gang Ma"], "title": "Revisiting the Possibility of a Sharp Phase Transition in Cold Neutron Stars", "comment": "9 pages with 2 figures", "summary": "First-order phase transitions (FOPTs) in cold neutron stars (NSs) have been extensively studied and have provided valuable insights into the behavior of the densest matter visible in our Universe, although a strong consensus has yet to emerge. Revisiting the possibility of a hadron-quark FOPT from a new perspective, we examine the interplay between the coupled nature of gravity and microscopic interactions in Tolman--Oppenheimer--Volkoff (TOV) equations and the fundamental requirements of thermodynamic consistency in NSs. We demonstrate that a sharp FOPT manifested as a plateau in the equation of state (EOS) $P(\\varepsilon)$, i.e., pressure $P$ versus energy density $\\varepsilon$, is intrinsically incompatible with the regularity conditions of the TOV solutions. Although numerical integrations of the TOV equations with EOSs incorporating FOPTs may yield seemingly reasonable mass-radius relations consistent with current observations, such results can mask underlying inconsistencies. Our analysis thus establishes a structural consistency criterion for constraining dense-matter EOSs using NS observables, complementing existing studies of possible phase transitions in NS interiors."}
{"id": "2511.08010", "categories": ["astro-ph.HE", "astro-ph.IM", "gr-qc"], "pdf": "https://arxiv.org/pdf/2511.08010", "abs": "https://arxiv.org/abs/2511.08010", "authors": ["Aknur Sakan", "Nurzhan Ussipov", "Ernazar Abdikamalov", "Almat Akhmetali", "Marat Zaidyn", "Alisher Zhunuskanov", "José A. Font", "Matthew C. Edwards", "Sultan Abylkairov"], "title": "Probing Supernovae through gravitational wave entropy", "comment": "19 pages, 7 figures, 6 tables (4 + 2 appendix)", "summary": "We study an entropy-based framework to analyze gravitational-wave signals from core-collapse supernovae. We use waveforms generated by numerical simulations and analyze them in both the time domain and the time-frequency domain using short-time Fourier and continuous wavelet transforms. From each representation, we compute four entropy measures -- Shannon, exponential, Rényi, and Tsallis -- and apply three feature selection methods to identify the most informative features. We then train machine-learning classifiers on these features to compare the performance of different methodological combinations. We find that the combination of Rényi entropy from the wavelet domain and the Relief-F selection method yields the most effective discrimination among different gravitational-wave signals."}
{"id": "2511.08519", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.08519", "abs": "https://arxiv.org/abs/2511.08519", "authors": ["Miranda Pikus", "Paul Duffell", "Soham Mandal", "Abigail Polin"], "title": "A Novel Parameterization for Rapid Cooling in Supernova Remnants, with applications to the Pa 30 nebula", "comment": "15 pages, 9 figures", "summary": "We systematically study how cooling creates structural changes in supernova remnants as they evolve. Inspired by the peculiar morphology of the Pa 30 nebula, we adopt a framework in which to characterize supernova remnants under different degrees of cooling. Our cooling framework characterizes remnants with a singular parameter called $β$ that sets how rapidly the system's thermal energy is radiated or emitted away. A continuum of morphologies is created by the implementation of different cooling timescales. For $β\\gtrsim 400$, or when the cooling timescale is shorter than $\\approx \\frac{1}{400}$ of the Sedov time, the ejecta is shaped into a filamentary structure similar to Pa 30. We explain the filament creation by the formation of Rayleigh-Taylor Instability fingers where cooling has prevented the Kelvin-Helmholtz Instability from overturning and mixing out the tips. The ejecta in these filaments have not decelerated and are moving almost completely ballistically at $\\approx 95-100\\%$ their free expansion speed. In this rapid cooling regime, an explosion energy $\\approx 3.5 \\times 10^{47}$ erg is inferred. We also propose the cooling mechanism required to create these structures necessitates removing energy at a rate of $2\\%$ of $E_{\\rm ej}/t$, which implies a cooling luminosity of $\\approx 10^{36}$ erg/s."}
{"id": "2511.07957", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.07957", "abs": "https://arxiv.org/abs/2511.07957", "authors": ["Cunshi Wang", "Zuke Feng", "Difan Yi", "Yuyang Li", "Lirong Xie", "Huanbo Feng", "Yi Liu", "Qian Liu", "Yang Huang", "Hongbang Liu", "Xinyu Qi", "Yangheng Zheng", "Ali Luo", "Guirong Xue", "Jifeng Liu"], "title": "In-Orbit GRB Identification Using LLM-based model for the CXPD CubeSat", "comment": "12 pages, 8 figures", "summary": "To validate key technologies for wide field-of-view (FOV) X-ray polarization measurements, the Cosmic X-ray Polarization Detector (CXPD) CubeSat series has been developed as a prototype platform for the Low-Energy Xray Polarization Detector (LPD) onboard the POLAR-2 mission. The wide-FOV design significantly increases the complexity of the background environment, posing notable challenges for real-time gamma-ray burst (GRB) identification. In this work, we propose an in-orbit GRB identification method based on machine learning, using simulated spectral data as input. A training dataset was constructed using a Geant4-based simulator, incorporating in-orbit background and GRB events modeled within the 2-10 keV energy range. To meet the computational constraints of onboard processing, we employ a multimodal large language model (MLLM), which is fine-tuned using low-rank adaptation (LoRA) based on miniCPM-V2.6 and quantized to 4-bit precision. The model achieves perfect classification accuracy on validation data and demonstrates strong regression performance in estimating GRB spectral indices, with an RMSE of 0.118. Furthermore, we validate the feasibility of onboard deployment through a simulated satellite data processing pipeline, highlighting the potential of our approach to enable future real-time GRB detection and spectral analysis in orbit."}
{"id": "2511.07996", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.07996", "abs": "https://arxiv.org/abs/2511.07996", "authors": ["B. Hudson", "L. I. Gurvits", "E. Mooij", "A. Ricarte", "D. Palumbo"], "title": "Towards direct imaging and orbital parameter estimation of supermassive black hole binaries with spaceborne VLBI", "comment": "Submitted to Astronomy & Astrophysics. 20 pages, 21 figures", "summary": "Direct electromagnetic observation of the orbital motion of a sub-parsec, supermassive black hole binary (SMBHB) would provide the first conclusive proof of such systems existing. Widely considered to be the sources of gravitational waves, binaries are expected to form as a natural consequence of galactic mergers and determining the processes that drive their evolution is essential for understanding cosmological evolution. In this work, we evaluate the prospects of using ground and spaceborne Very Long Baseline Interferometry (VLBI) to observe supermassive black hole binaries and estimate their orbital parameters. The Black Hole Explorer (BHEX) is considered as the primary case study. Achieving unprecedented resolution, BHEX will provide access to a new volume of binary parameter space, potentially enabling the first, confident detection of an SMBHB. A binary toy model using a post-Newtonian orbit propagation is developed and simulated observations by BHEX and a ground array of telescopes are performed. An orbit fitting approach using Bayesian dynamic nested sampling is presented and its efficacy is demonstrated on the simulated observational data for a set of example binary systems. It is found that for BHEX, binary detection requires a total flux density of 0.04 Jy with a minimum separation of ~2 microarcseconds and an observable mass ratio dependent on the total flux. With three annual observations, BHEX could constrain semi-major axis and eccentricity of binaries with orbital periods <10 years to within 13% of the true values. A curved trajectory could confidently be detected in binaries with period <23 years. Proposals for how candidate sources could be identified in time for the BHEX mission are also provided. Finally, we constrain the requirements of a future spaceborne VLBI system, capable of performing a statistically significant survey of supermassive black hole binaries."}
