{"id": "2510.02687", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.02687", "abs": "https://arxiv.org/abs/2510.02687", "authors": ["Bernardo Cornejo", "Halim Ashkar", "Matteo Cerruti", "Ilja Jaroschewski", "Pierre Pichard", "Santiago Pita", "Fabian Schussler"], "title": "The H.E.S.S. Gravitational Wave and Gamma-Ray Burst Follow-Up Programs", "comment": "Work presented in ICRC 2025 on behalf of the H.E.S.S. Collaboration", "summary": "Multi-wavelength and multi-messenger astrophysics have experienced rapid\ngrowth over the past decade, seeking a complete picture of different cosmic\nphenomena. Transient sources, in particular, benefit from the input of\nmulti-messenger observations, offering complementary perspectives on the same\nevent while maximizing the detection probability of a rapidly fading signal. In\nthis context, Gravitational Wave (GW) detections serve as perfect triggers for\npotential counterpart detections. Notably, a GW alert could be associated with\na Gamma-Ray Burst (GRB), jetted cataclysmic events produced either by the\ncollision of a binary neutron star system or a core-collapse supernova. These\nsources also radiate across the electromagnetic spectrum, allowing detection by\nX- and gamma-ray instruments aboard various satellites and thus enabling\nmulti-wavelength triggering opportunities. The strong interest in minimizing\nreaction time to capture the full-time evolution of the emission, together with\nthe often challenging localization uncertainties of the alerts, underscores the\nneed for rapid and well-coordinated follow-up programs such as the one\ndeveloped by the H.E.S.S. Collaboration.\n  This contribution will give an overview of the transient follow-up strategy\ncarried out by the H.E.S.S. Collaboration, from the external alert trigger and\nthe automatic reaction of the observatory to the various analysis steps of the\nobtained observations. To illustrate this comprehensive strategy, we will show\ntwo examples of follow-up observations of both GRBs and GWs, highlighting key\nresults and challenges in the search for an associated high-energy gamma-ray\nemission."}
{"id": "2510.02739", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2510.02739", "abs": "https://arxiv.org/abs/2510.02739", "authors": ["Jihyun Kim", "Dmitri Ivanov", "Kazumasa Kawata", "Hiroyuki Sagawa", "Gordon Thomson"], "title": "Medium-scale anisotropies measured by Telescope Array surface detectors", "comment": "ICRC 2025, 11 pages, 5 figures", "summary": "The Telescope Array (TA) experiment, the largest observatory for ultra-high\nenergy cosmic rays in the Northern Hemisphere, has identified two medium-scale\nanisotropies: the TA Hotspot near the constellation Ursa Major and an excess in\nthe direction of the Perseus-Pisces supercluster. Studying these medium-scale\nanisotropies may provide insights into the origins of ultra-high energy cosmic\nrays. This presentation will explore an oversampling analysis of TA surface\ndetector data to evaluate these medium-scale event excesses and will present\nthe latest findings on the TA Hotspot and the Perseus-Pisces supercluster\nexcess."}
{"id": "2510.02740", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.02740", "abs": "https://arxiv.org/abs/2510.02740", "authors": ["Jihyun Kim", "Dmitri Ivanov", "Gordon Thomson"], "title": "Features in the Cosmic Ray Energy Spectrum Observed with Telescope Array Surface Detectors", "comment": "ICRC 2025, 11 pages, 4 figures", "summary": "Ultra-high energy cosmic rays (UHECRs) are extremely energetic charged\nparticles that originate from outer space. The Telescope Array (TA) experiment,\nthe largest UHECR observatory in the Northern Hemisphere, has provided\nhigh-precision measurements of the cosmic ray energy spectrum due to its stable\noperation and efficient data collection. These measurements have revealed three\nsignificant spectral features: the ankle, shoulder, and cutoff. Analyzing these\nfeatures is crucial for understanding the origin and propagation of UHECRs. In\nthis talk, we will present the latest energy spectrum measured by the TA\nsurface detectors and discuss the observed differences in the UHECR energy\nspectrum between the northern and southern skies."}
{"id": "2510.02796", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.02796", "abs": "https://arxiv.org/abs/2510.02796", "authors": ["Jowita Borowska-Naguszewska", "Robert Brose", "Bernardo Cornejo", "Jonathan Mackey", "Robert Daniel Parsons", "Fabian Schüssler"], "title": "H.E.S.S. observations of SN 2024ggi", "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC 2025)", "summary": "Supernova (SN) explosions interacting with dense circumstellar medium are\nconsidered to be very promising sites for efficient cosmic-ray (CR)\nacceleration and subsequent emission of neutral-pion-decay gamma rays. These\nenvironments share similarities with already detected gamma-ray novae, but with\nmuch greater available energy content, so it is important to characterize their\nemission in the very-high-energy range. We present the results of H.E.S.S.\nobservations of one such candidate source - SN 2024ggi, located in NGC 3621 at\na distance of 7.24 Mpc. A total of 30 hours of data, gathered throughout a\nmonth of post-explosion observations, provide flux upper limits that are used\nto constrain source parameters, offering meaningful insights for theoretical\npredictions. We exclude bright gamma-ray emission in the first day after\nexplosion, and later upper limits are consistent with wind densities derived\nfrom optical observations."}
{"id": "2510.02459", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2510.02459", "abs": "https://arxiv.org/abs/2510.02459", "authors": ["Victoria L. Butler", "James J. Bock", "Dongwoo T. Chung", "Abigail T. Crites", "King Lau", "Ian Lowe", "Dan P. Marrone", "Evan C. Mayer", "Benjamin J. Vaughan", "Michael Zemcov"], "title": "TES Bolometer Design and Testing for the Tomographic Ionized-carbon Mapping Experiment Millimeter Array", "comment": null, "summary": "Transition Edge Sensor (TES) bolometers are a well-established technology\nwith a strong track record in experimental cosmology, making them ideal for\ncurrent and future radio astronomy instruments. The Tomographic Ionized-carbon\nMapping Experiment (TIME), in collaboration with JPL, has developed advanced\nsilicon nitride leg isolated superconducting titanium detectors for 200 to 300\nGHz observations of the Epoch of Reionization. Compared to their MHz\ncounterparts, bolometers operating in this frequency range are less common\nbecause of their large absorber size and fragility. TIME aims to fabricate a\ntotal of 1920 high frequency (HF) and low frequency (LF) detectors to fully\npopulate the focal plane. TIME has successfully developed HF (230 to 325 GHz)\nand LF (183 to 230 GHz) wafers that are physically robust and perform well at\ncryogenic temperatures (300 mK). Recent laboratory tests have shown high\noptical efficiencies for the LF wafers (30 to 40%), but low device yield for\nthe HFs. To address this, new HF modules have been designed with improved\ncabling and a reduced backshort distance, and are expected to perform similarly\nto LFs in a similar lab setting. We report on the development of these\ndetectors as well as recent laboratory and on sky tests conducted at the\nArizona Radio Observatory's (ARO) 12 meter prototype antenna at Kitt Peak\nNational Observatory."}
{"id": "2510.02802", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.02802", "abs": "https://arxiv.org/abs/2510.02802", "authors": ["Tina Wach", "Alison M. W. Mitchell"], "title": "TeV Emission from PSR B1055-52 with HESS: Evidence for a Pulsar Halo", "comment": "8 pages, 3 figures, 2 tables. ICRC 2025 conference procceeding", "summary": "Pulsar halos are a recently identified class of TeV $\\gamma$-ray sources,\noffering valuable insights into the evolution of pulsar systems at the highest\nenergies. However, only a handful of such sources have been detected so far,\nmaking each new identification critical for understanding the properties of the\npopulation as a whole. We report the first detection of extended\nvery-high-energy (VHE) $\\gamma$-ray emission around PSR~B1055$-$52 using\nobservations from the H.E.S.S. array. This middle-aged pulsar, previously\ngrouped together with Geminga and PSR~B0656$+$14 as part of the ``Three\nMusketeers'', has now been confirmed to host a TeV pulsar halo, making it the\nthird detected system of its kind, and the first TeV pulsar halo discovered in\nthe southern hemisphere. Our analysis performed in an energy range of\n$0.3-60\\,$TeV, reveals gamma-ray emission with a one sigma extension of $(2.05\n\\pm 0.32)^\\circ$. The analysis indicates that the emission extends beyond the\nregion which was observed with H.E.S.S.. No significant spectral variation is\ndetected across the emission.\n  The diffusion coefficient derived for this halo is significantly lower than\nthe standard ISM value, aligning with findings in the Geminga halo and\nindicating that slow diffusion may be a common property of pulsar halos. The\ndetection of this new TeV pulsar halo provides a crucial data point for\nstudying the population-wide properties of pulsar halos, their impact on\ncosmic-ray propagation, and their role as a source of Galactic electrons and\npositrons."}
{"id": "2510.02479", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2510.02479", "abs": "https://arxiv.org/abs/2510.02479", "authors": ["Enrico Biancalani", "Edward Balaban", "Ruslan Belikov", "Eduardo Bendek", "Valeri Frumkin", "Israel Gabay", "Guangjun Gao", "Qian Gong", "Christine Gregg", "Tyler Groff", "Joseph Howard", "Omer Luria", "Michael McElwain", "Lee Mundy", "Rachel Ticknor", "Sylvain Veilleux", "Neil Zimmerman"], "title": "Optical Design Pathways to Fluidic Space-Assembled Reflectors & Dual-Configuration Spectrographs for Characterizing Exo-Earths", "comment": "Submitted for publication as part of the proceedings for the HWO25\n  symposium", "summary": "$\\textbf{Fluidic Telescopes}$ | We present a conceptual framework for\noptically designing space-assembled telescopes whose primary mirror is formed\n$\\textit{in situ}$ via the enabling, scale-invariant technology of fluidic\nshaping. In-space assembly of optical reflectors can solve light-gathering\naperture scaling, which currently limits space-borne optical telescopes. Our\ncompass reduces the top-level optical design trade to three types of\navenues---a fluidic pathway, a legacy one building upon the James Webb Space\nTelescope, and hybrid solutions---with a focus on exo-Earths. A primarily\nfluidic pathway leads, in the first place, to a post-prime-focus architecture.\nWe apply this configuration to propose the tentative optical design for a ~1-m\ntechnology demonstrator and pathfinder for fluidic-telescope apertures scaling\nup to many tens of meters in diameter.\n  $\\textbf{Dual-Configuration Spectrographs}$ | The Habitable Worlds\nObservatory (HWO) will be the first mission equipped for the high-contrast\ndirect imaging and remote spectral characterization, in reflected starlight, of\nexo-Earths in our galactic neighborhood. We present a novel concept for a\ncompact, dual-configuration HWO spectrograph tailored for a broad wavelength\nrange covering at least 600--1000 nm. Our design can interchange dispersive\nelements via a slider mechanism while preserving the rest of the optical path,\nenabling both a spectral resolving power $R$~140 integral-field spectrograph\nand a single- or multi-object spectrograph with $R$ on the order of 10$^3$.\nAlthough $R$~140 is near-optimal for the $O_2$ absorption $A$-band around 760\nnm, higher values of $R$ can be utilized with spectral cross-correlation\nmatched-filter techniques to enhance, e.g., HWO's atmospheric characterization\ncapabilities."}
{"id": "2510.02832", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.02832", "abs": "https://arxiv.org/abs/2510.02832", "authors": ["Matteo Imbrogno", "Andrea Sacchi", "Giovanni Miniutti", "Francesco Tombesi", "Gian Luca Israel", "Enrico Piconcelli", "Roberta Amato"], "title": "A supermassive black hole under the radar: repeating X-ray variability in a Seyfert galaxy", "comment": "14 pages (9 main text, 5 appendices). 9 figure in main text.\n  Submitted to A&A. Comments are welcome", "summary": "In the last few years, a few supermassive black holes (SMBHs) have shown\nshort-term (of the order of hours) X-ray variability. Given the limited size of\nthe sample, every new addition to this class of SMBHs can bring invaluable\ninformation. Within the context of an automated search for X-ray sources\nshowing flux variability in the \\textit{Chandra} archive, we identified\npeculiar variability patterns in 2MASX J12571076+2724177 (J1257), a SMBH in the\nComa cluster, during observations performed in 2020. We investigated the\nlong-term evolution of the flux, together with the evolution of the spectral\nparameters throughout the \\textit{Chandra} and \\textit{XMM-Newton}\nobservations, which cover a time span of approximately 20 years. We found that\nJ1257 has repeatedly shown peculiar variability over the last 20 years, on\ntypical timescales of $\\simeq20-25$ ks. From our spectral analysis, we found\nhints of a softer-when-brighter behaviour and of two well-separated flux\nstates. We suggest that J1257 might represent a new addition to the\never-growing size of relatively low mass SMBHs\n($M\\simeq10^6-10^7\\mathrm{M}_\\odot$) showing extreme, possibly quasi-periodic\nX-ray variability on short time scales. The available dataset does not allow\nfor a definitive classification of the nature of the variability. However,\ngiven the observed properties, it could either represent a quasi-periodic\noscillation at particularly low frequency or be associated with quasi-periodic\neruptions in an AGN with peculiar spectral properties."}
{"id": "2510.02547", "categories": ["astro-ph.IM", "astro-ph.EP"], "pdf": "https://arxiv.org/pdf/2510.02547", "abs": "https://arxiv.org/abs/2510.02547", "authors": ["Michael W. McElwain", "Dimitri Mawet", "Jean-Baptiste Ruffio", "Roser Juanola Parramon", "Kellen Lawson", "Hervé Le Coroller", "Christian Marois", "Max Millar-Blanchaer", "Bijan Nemati", "Susan Redmond", "Bin Ren", "Laurent Pueyo", "Christopher Stark", "Scott Will"], "title": "Habitable World Discovery and Characterization: Coronagraph Concept of Operations and Data Post-Processing", "comment": "8 pages, 2 figures", "summary": "The discovery and characterization of habitable worlds was the top scientific\nrecommendation of the Astro2020 decadal survey and is a key objective of the\nHabitable Worlds Observatory. Biosignature identification drives exceedingly\nchallenging observations, which require raw contrasts of roughly 10$^{-10}$\ncontrast and ultimately, 1$\\sigma$ photometric precision of roughly 3$\\times\n10^{-12}$ contrast. Despite significant advances for the Nancy Grace Roman\nSpace Telescope's Coronagraph Instrument, technological gaps still exist in a\nwide range of technologies such as starlight suppression, deformable mirrors,\nwavefront control, low noise detectors, and high-contrast spectroscopy. Even\nwith these new technologies matured, the Habitable Worlds Observatory must\ncarefully obtain the observations and rely on post-processing of the data to\nachieve its science objectives.\n  During the START and TAG efforts, a working group was convened to explore the\nCoronagraph Concept of Operations and Post Processing (COPP) in the context of\nthe Habitable Worlds Observatory. This COPP working group evaluated\ncoronagraphic concept of operations to enable different post processing\napproaches, such as reference differential imaging and angular differential\nimaging, polarization differential imaging, orbital differential imaging,\ncoherent differential imaging, spectral processing, and point-spread function\nsubtraction algorithms that incorporate ancillary telemetry and data. Future\nintegrated modeling simulations and testbed demonstrations are needed to\ndetermine the achievable post processing gains for each approach. We report a\nsummary of this working group's activities and findings, as well as an outlook\nfor maturation of these techniques and infusion into the Habitable Worlds\nObservatory technology portfolio."}
{"id": "2510.02834", "categories": ["astro-ph.HE", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2510.02834", "abs": "https://arxiv.org/abs/2510.02834", "authors": ["Andrej Dobrotka", "Jozef Magdolen", "Martin Melicherčík"], "title": "Hunt for the mHz variability in the TESS and XMM-Newton observations of nova-like cataclysmic variables", "comment": "Accepted for publication in Astrophysical journal", "summary": "We analysed the flickering of selected nova-like cataclysmic variables\nobserved by the TESS satellite and XMM-Newton. We searched for break\nfrequencies ($f_{\\rm b}$) in the corresponding power density spectra (PDS), and\nfor any long-term evolution. We found a new optical $f_{\\rm b}$ in three\nnova-like systems and confirmed that the value of this frequency is clustered\naround 1 mHz. V504 Cen and V751 Cyg show possible X-ray counterparts of $f_{\\rm\nb}$ that had previously only been seen in MV Lyr. This points towards the very\ncentral disc for source localisation. We investigated a previously proposed\ncorrelation between white dwarf mass and $f_{\\rm b}$, but thanks to the new\nmeasurements we do not conclude its existence. V3885 Sgr and V1193 Ori show\nflaring activity in the long-term light curve during which TESS observations\nwere made. The corresponding PDSs show changes in shape and disappearance of\n$f_{\\rm b}$. TT Ari and SGRt 062340.2-265715 exhibit smooth changes in the\nlong-term optical light curve, and the corresponding TESS observations show\nvariable $f_{\\rm b}$ during these changes. $f_{\\rm b}$ is higher for lower\nbrightness, which was seen only in MV Lyr so far."}
{"id": "2510.02844", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2510.02844", "abs": "https://arxiv.org/abs/2510.02844", "authors": ["M. Abdullahi", "R. Aloisio", "F. Arneodo", "S. Ashurov", "U. Atalay", "F. C. T. Barbato", "R. Battiston", "M. Bertaina", "E. Bissaldi", "D. Boncioli", "L. Burmistrov", "F. Cadoux", "I. Cagnoli", "E. Casilli", "D. Cortis", "A. Cummings", "M. D'Arco", "S. Davarpanah", "I. De Mitri", "G. De Robertis", "A. Di Giovanni", "A. Di Salvo", "L. Di Venere", "J. Eser", "Y. Favre", "S. Fogliacco", "G. Fontanella", "P. Fusco", "S. Garbolino", "F. Gargano", "M. Giliberti", "F. Guarino", "M. Heller", "T. Ibrayev", "R. Iuppa", "A. Knyazev", "J. F. Krizmanic", "D. Kyratzis", "F. Licciulli", "A. Liguori", "F. Loparco", "L. Lorusso", "M. Mariotti", "M. N. Mazziotta", "M. Mese", "M. Mignone", "T. Montaruli", "R. Nicolaidis", "F. Nozzoli", "A. Olinto", "D. Orlandi", "G. Osteria", "P. A. Palmieri", "B. Panico", "G. Panzarini", "D. Pattanaik", "L. Perrone", "H. Pessoa Lima", "R. Pillera", "R. Rando", "A. Rivetti", "V. Rizi", "A. Roy", "F. Salamida", "R. Sarkar", "P. Savina", "V. Scherini", "V. Scotti", "D. Serini", "D. Shledewitz", "I. Siddique", "L. Silveri", "A. Smirnov", "R. A. Torres Saavedra", "C. Trimarelli", "P. Zuccon", "S. C. Zugravel"], "title": "The simulation chain for the Terzina Cherenkov telescope on board the NUSES space mission", "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC\n  2025). 9 pages, 4 figures", "summary": "The Terzina telescope is designed to detect ultra-high energy cosmic rays\n(UHECRs) and Earth-skimming neutrinos from a 550 km low-Earth orbit (LEO) by\nobserving Cherenkov light emitted by Extensive Air Showers (EAS) in the Earth's\natmosphere pointing towards the telescope and in the field of view. In this\ncontribution, a simulation chain for the Terzina telescope on board the NUSES\nmission will be presented. The chain encompasses all stages of the detection\nprocess, from event generation and EAS modelling with CORSIKA and EASCherSim to\nGeant4-based simulations of the telescope's geometry and optics, followed by\nmodelling of the trigger system and silicon photomultiplier (SiPM) response.\nThe Geant4 module includes the real CAD model of the telescope structure and\noptical components, with aspherical lenses manually implemented to ensure\naccurate representation of the optical efficiency and point spread function in\nGeant4. This comprehensive pipeline, developed using modular C++ code and\nPython tools for event analysis and reconstruction, produces detailed\nperformance assessments of a telescope operating in a LEO mission but can be\nadapted for any high altitude Cherenkov telescope, making it a versatile tool\nfor future observatory designs. The possibility of modelling balloons in the\natmosphere has also been developed."}
{"id": "2510.02843", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.02843", "abs": "https://arxiv.org/abs/2510.02843", "authors": ["Alison M. W. Mitchell", "Lukas Grosspietsch", "Tina Wach"], "title": "Analysis of the Supernova Remnant IC 443 using H.E.S.S. Data", "comment": "8 pages, 3 figures, 1 table. In proceedings of the ICRC2025", "summary": "IC 443 is a well-known supernova remnant that stands out due to its\ninteraction with a dense molecular cloud, creating a complex environment where\nshocks can efficiently accelerate particles to high energies. This makes it a\nkey target for investigating the mechanisms of cosmic-ray acceleration and\ngamma-ray production, particularly in the context of supernova remnants as\npotential sources of PeV cosmic rays. This work presents a first analysis of\nthe region as observed by H.E.S.S.. We detect extended very-high-energy\ngamma-ray emission from IC 443, consistent with previous observations by\nVERITAS and MAGIC. A multi-wavelength comparison incorporating data from\nFermi-LAT, MAGIC, and VERITAS strongly supports a hadronic origin of the\nobserved emission, and highlights the presence of relativistic protons\ninteracting with the surrounding molecular cloud. These findings reinforce the\nrole of IC 443 as a key laboratory for studying supernova remnants as\ncosmic-ray accelerators and their interaction with their surrounding mediums."}
{"id": "2510.02873", "categories": ["astro-ph.IM", "68", "D.1.3"], "pdf": "https://arxiv.org/pdf/2510.02873", "abs": "https://arxiv.org/abs/2510.02873", "authors": ["M. D. Lepinzan", "G. Lacopo", "D. Goz", "G. Taffoni", "P. Monaco", "P. J. Elahi", "U. Varetto", "M. Cytowski"], "title": "Accelerating cosmological simulations on GPUs: a portable approach using OpenMP", "comment": "31 pages, 11 figures", "summary": "In this work we present the porting to Graphics Processing Units (GPUs, using\nOpenMP target directives) and optimization of a key module within the\ncosmological {\\pinocchio} code, a Lagrangian Perturbation Theory (LPT)-based\nframework widely used for generating dark matter (DM) halo catalogs. Our\noptimization focuses on a specific segment of the code responsible for\ncalculating the collapse time of each particle involved in the simulation. Due\nto the embarrassingly parallel nature of this computation, it represents an\nideal candidate for GPU offloading. As part of the porting process, we\ndeveloped fully GPU-native implementations of both cubic spline and bilinear\ninterpolation routines, required for evaluating collapse times. Since GNU\nScientific Library (GSL) does not support GPU offloading, these custom\nimplementations run entirely on the GPU and achieve residuals of only\n$\\sim0.003\\%$ when compared to the CPU-based implementation of GSL. Comparative\nbenchmarking on the LEONARDO (NVIDIA-based) and SETONIX (AMD-based)\nsupercomputers reveals notable portability and performance, with speedups\nof~\\textit{4x} and up to~\\textit{8x}, respectively. While collapse time\ncalculation is not a primary bottleneck in the overall workflow, the\nacceleration reduces full production runs by $\\sim 100$ seconds each leading to\na cumulative saving of $\\sim 160000$ Standard-h ($\\sim28$ hours wall time)\nacross thousands of simulations. Roofline analysis confirms that our GPU\nporting achieves over 80\\% of the theoretical FP64 peak performance, confirming\nefficient compute-bound execution. This work demonstrates that OpenMP\ndirectives offer a portable, effective strategy for accelerating large-scale\ncosmological simulations on heterogeneous hardware."}
{"id": "2510.02905", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2510.02905", "abs": "https://arxiv.org/abs/2510.02905", "authors": ["R. D. Saxton", "T. Wevers", "S. van Velzen", "K. Alexander", "Z. Liu", "A. Mummery", "M. Giustini", "G. Miniutti", "F. Fuerst", "J. J. E. Kajava", "A. M. Read", "P. G. Jonker", "A. Rau", "D. -Y. Li"], "title": "Rapid onset of a Comptonisation zone in the repeating tidal disruption event XMMSL2 J140446.9-251135", "comment": "16 pages, 5 figures. Accepted for publication in A&A", "summary": "We report here on observations of a tidal disruption event, XMMSL2\nJ1404-2511, discovered in an XMM-Newton slew, in a quiescent galaxy at z=0.043.\nX-ray monitoring covered the epoch when the accretion disc transitioned from a\nthermal state, with kT~80 eV, to a harder state dominated by a warm,\noptically-thick corona. The bulk of the coronal formation took place within 7\ndays and was coincident with a temporary drop in the emitted radiation by a\nfactor 4. After a plateau phase of ~100 days, the X-ray flux of XMMSL2\nJ1404-2511 decayed by a factor 500 within 230 days. We estimate the black hole\nmass in the galaxy to be $M_{BH}=4\\pm{2}\\times10^{6}$ solar masses and the peak\nX-ray luminosity $L_{X}\\sim6\\times10^{43}$ ergs/s. The optical/UV light curve\nis flat over the timescale of the observations with $L_{opt}\\sim\n2\\times10^{41}$ ergs/s. We find that TDEs with coronae are more often found in\nan X-ray sample than in an optically-selected sample. Late-time monitoring of\nthe optical sample is needed to test whether this is an intrinsic property of\nTDEs or is due to a selection effect. From the fast decay of the X-ray emission\nwe consider that the event was likely due to the partial stripping of an\nevolved star rather than a full stellar disruption, an idea supported by the\ndetection of two further re-brightening episodes, two and four years after the\nfirst event, in the SRG/eROSITA all-sky survey."}
{"id": "2510.02920", "categories": ["astro-ph.IM", "physics.ins-det"], "pdf": "https://arxiv.org/pdf/2510.02920", "abs": "https://arxiv.org/abs/2510.02920", "authors": ["Merlin Kole", "Nicolas De Angelis"], "title": "Measurements of the Birks' coefficient of GAGG:Ce using hard X-rays", "comment": "Submitted for publication in NIM A", "summary": "Inorganic scintillators continue to be widely used within astrophysical X-ray\nand gamma-ray detectors. This is in part thanks to the development of new\nscintillators, such as GAGG:Ce, as well as the availability of new scintillator\nreadout sensors such as Silicon Photomultipliers and Silicon Drift Detectors.\nIn order to use such scintillator materials for spectrometry or polarimetry, a\ndetailed understanding of their response is important. One parameter that can\naffect the scintillator performance, particularly at lower photon energies, is\ntheir Birks' coefficienct, which correlates the relative light yield to the\nionization energy. While for many high-Z inorganic scintillators this effect\ncan be ignored, for GAGG:Ce this appears to not be the case. Here we provide a\nmeasurement of the Birks' coefficient for GAGG:Ce using data from two different\ndetectors irradiated in the 20-80 keV energy range at the LARIX-A X-ray beam in\nFerrara, Italy. While the effects due to Birks' law are visible below 30 keV,\nthey also significantly influence the performance of GAGG:Ce performance near\none of the K-edges, affecting both the measured gain and the energy resolution.\nHere, we use beam test data to derive the Birks' coefficient from GAGG:Ce. The\nresults indicate that for usage in hard X-ray and soft gamma-ray missions, this\ncoefficient has a significant effect on the measurements."}
{"id": "2510.02907", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.02907", "abs": "https://arxiv.org/abs/2510.02907", "authors": ["V. P. Shyam Prakash", "Vivek K. Agrawal", "Rwitika Chatterjee", "Radhakrishna Vatedka", "Koushal Vadodariya", "A. M. Vinodkumar"], "title": "Spectral nature of Sco X-1 observed using the X-ray SPECtroscopy and Timing (XSPECT) payload on-board XPoSat", "comment": "Accepted for publication in MNRAS", "summary": "Scorpius X-1 is the brightest and first discovered X-ray source in the sky.\nStudying this source in the low-energy band has been challenging in the past\ndue to its high brightness. However, with the X-ray SPECtroscopy and Timing\n(XSPECT) payload on-board Indias first X-ray Polarimetry Satellite (XPoSat), we\nhave the capability to study the source despite its very high brightness,\nthanks to the fast (1 ms) readout of the instrument. We investigate the\nevolution of the spectral and timing properties of Sco X-1 across the\nhorizontal, normal, and flaring branch, as observed with XSPECT. We examine\nchanges in the spectral parameters as a function of position on the color-color\ndiagram (CCD). Spectral studies indicate that the soft X-ray emission can be\nmodeled using a multicolor disk component, with the inner disk temperature\nranging from 0.6 to 0.8 keV. The hard component is described by a Comptonized\ncontinuum using either the nthComp or Comptb model with electron temperatures\nfrom 2.4 to 4.7 keV and optical depth between 5 and 14. Additionally, we\nobserve the presence of an iron K-alpha line at 6.6 keV and an iron K-beta line\nat 7.6 keV. Both spectral models suggest a steep rise in Comptonization flux as\nwell as disk flux in the flaring branch. An increase in neutron star blackbody\ntemperature and inner disk temperature are also observed during flaring. The\nZ-track is driven by changes in the optical depth of the corona, the\nComptonization flux and the disk flux and the inner disk temperature. No\nquasi-periodic oscillations are detected in any branch, suggesting their\nassociation with the high-energy spectrum."}
{"id": "2510.02971", "categories": ["astro-ph.IM", "physics.ins-det", "physics.optics"], "pdf": "https://arxiv.org/pdf/2510.02971", "abs": "https://arxiv.org/abs/2510.02971", "authors": ["Alejandro Pascual Laguna", "Victor Rollano", "Aimar Najarro-Fiandra", "David Rodriguez", "Maria T. Magaz", "Daniel Granados", "Alicia Gomez"], "title": "Millimeter-Wavelength Dual-Polarized Lens-Absorber-Coupled Ti/Al Kinetic Inductance Detectors", "comment": "This work has been submitted to the IEEE for possible publication", "summary": "This work presents Ti/Al bi-layer Microwave Kinetic Inductance Detectors\n(MKIDs) based on lens-coupled spiral absorbers as the quasi-optical coupling\nmechanism for millimeter-wavelength radiation detection. From simulations, the\nlens-coupled absorbers provide a 70% lens aperture efficiency in both\npolarizations over an octave band with a spiral array absorber and over 10%\nrelative bandwidth with a single spiral. We have fabricated and measured two\ndevices with bare Ti/Al MKIDs: a 3x3 cm chip with 9 pixels to characterize the\noptical response at 85 GHz of the two variations of the absorber; and a large\nformat demonstrator with 253 spiral-array pixels showing potential towards a\nlarge format millimeter-wavelength camera. We find a sensitivity of 1\nmK/sqrt{Hz} and a detector yield of 95%."}
{"id": "2510.02980", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2510.02980", "abs": "https://arxiv.org/abs/2510.02980", "authors": ["A. D. Supanitsky", "D. Ravignani", "V. V. Kizakke Covilakam"], "title": "Likelihood-based reconstruction of muon lateral distribution function using combined integrator and binary detector modes", "comment": "Accepted in Astroparticle Physics", "summary": "The origin of ultra-high-energy cosmic rays, with energies $E \\geq 10^{18}$\neV, remains unknown. Among the key observables used to investigate their nature\nare the energy spectrum, the arrival direction distribution, and the\ncomposition as a function of energy. The composition of the primary cosmic ray\nis inferred from properties of the extensive air showers they initiate,\nparticularly from parameters sensitive to the primary mass. The most sensitive\nparameters to the primary mass are the atmospheric depth of the shower maximum,\ntypically measured with fluorescence telescopes, and the muon content of the\nshower, measured using dedicated muon detectors. A commonly used observable in\ncomposition studies is the muon density at a fixed distance from the shower\naxis, derived by evaluating the reconstructed muon lateral distribution\nfunction (MLDF) at a reference distance. A specific type of muon detector\nfeatures two acquisition modes: binary and integrator (commonly referred to as\nADC mode, for Analog-to-Digital Converter). The binary mode allows for direct\nmuon counting, while the ADC mode infers the muon number from the integrated\nsignal of the detector response. Existing methods reconstruct the MLDF using\ndata from either acquisition mode individually, or by combining both, but\nusually assigning a single mode per detector station in a given event. This\nwork presents a novel method to reconstruct the MLDF based on a likelihood\napproach that simultaneously incorporates data from both acquisition modes at\neach detector station. We apply our method to the underground muon detectors of\nthe Pierre Auger Observatory as a case study. However, this general approach\ncan be applied to future detectors with dual acquisition capabilities. Our\nresults demonstrate that the combined method outperforms traditional techniques\nthat rely solely on either binary or ADC mode data."}
{"id": "2510.02977", "categories": ["astro-ph.IM", "physics.ao-ph"], "pdf": "https://arxiv.org/pdf/2510.02977", "abs": "https://arxiv.org/abs/2510.02977", "authors": ["Rolf Buhler", "Philippe Deverchère", "Christophe Plotard", "Sébastien Vauclair"], "title": "Multi-faceted light pollution modelling and its application to the decline of artificial illuminance in France", "comment": null, "summary": "Artificial Light At Night (ALAN) has been increasing steadily over the past\ncentury, particularly during the last decade. This leads to rising light\npollution, which is known to have adverse effects on living organisms,\nincluding humans. We present a new software package to model light pollution\nfrom ground radiance measurements. The software is called Otus 3 and\nincorporates innovative ALAN diffusion models with different atmospheric\nprofiles, cloud covers and urban emission functions. To date, light pollution\nmodelling typically focused on calculating the zenith luminance of the skyglow\nproduced by city lights. In Otus 3 we extend this and additionally model the\nhorizontal illuminance on the ground, including the contributions from skyglow\nand the direct illumination. We applied Otus 3 to France using ground radiance\ndata from the Visible Infrared Imaging Radiometer Suite (VIIRS). We calibrated\nour models using precise sky brightness measurements we obtained over 6 years\nat 139 different locations and make this dataset publicly available. We\nproduced the first artificial illuminance map for France for the periods of\n2013-2018 and 2019-2024. We found that the artificial ground illuminance in the\nmiddle of the night decreased by 23 % between these two periods, in stark\ncontrast to the global trend."}
{"id": "2510.03023", "categories": ["astro-ph.HE", "hep-ph"], "pdf": "https://arxiv.org/pdf/2510.03023", "abs": "https://arxiv.org/abs/2510.03023", "authors": ["Jann Aschersleben", "Dieter Horns", "Emmanuel Moulin", "Manuela Vecchi"], "title": "Search for dark matter around intermediate mass black holes with the H.E.S.S. experiment", "comment": "to appear in the proceedings of ICRC 2025 Conference", "summary": "Intermediate mass black holes (IMBHs), with masses ranging from a hundred and\na million solar masses, are hypothesised to be surrounded by dense regions of\ndark matter known as dark matter spikes, where the annihilation of dark matter\nparticles could produce detectable gamma rays. The detection of dark matter\nannihilation around IMBHs therefore offers a promising approach for probing the\nnature of dark matter. In this work, we search for dark matter annihilation\naround IMBHs using data from the Galactic Plane Survey, the Extragalactic\nSurvey and a selection of satellite galaxies observed by the H.E.S.S. gamma-ray\nexperiment in Namibia. Since no evidence for a gamma-ray signal from dark\nmatter annihilation around IMBHs has been found, we set upper limits on the\nvelocity-weighted annihilation cross section for dark matter masses between 800\nGeV and 100 TeV. Our analysis obtains limits on the velocity-weighted\nannihilation cross section below the thermal relic cross section for dark\nmatter masses between 10 and 100 TeV."}
{"id": "2510.03058", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2510.03058", "abs": "https://arxiv.org/abs/2510.03058", "authors": ["Auxiliadora Padrón-Brito", "Natalia Arteaga-Marrero", "Ian Cunnyngham", "Jeff Kuhn"], "title": "Focal-plane wavefront sensing with moderately broadband light using a short multi-mode fiber", "comment": "15 pages, 7 figures, 2 tables", "summary": "We propose a focal-plane wavefront sensor (FPWFS) based on a short multimode\nfiber (MMF) capable of operating under moderately broadband illumination. By\ncoupling the aberrated focal-plane field into an MMF of length <1 cm, we\npreserve modal interference over a 10 nm bandwidth at near-infrared\nwavelengths. The resulting output intensity pattern encodes pupil phase\ninformation, enabling wavefront recovery via a neural network. Our approach\nresolves the inherent sign ambiguity of even pupil-phase aberrations and\noperates on millisecond timescales using readily available computing hardware,\nsuitable for real-time adaptive optics. Unlike traditional pupil-plane sensors,\nthe proposed FPWFS shares the optical path with the science beam, eliminating\nnon-common-path aberrations by enabling simultaneous wavefront and focal-plane\nintensity retrieval. Its simplicity, compactness, sensitivity, and low cost\nmake it an attractive candidate for next-generation astronomical instruments."}
{"id": "2510.03026", "categories": ["astro-ph.HE", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2510.03026", "abs": "https://arxiv.org/abs/2510.03026", "authors": ["Gregor Rauw"], "title": "Fluorescent Fe K line emission of gamma Cas stars II. Predictions for magnetic interactions and white-dwarf accretion scenarios", "comment": "Accepted for publication in A&A", "summary": "About 12 percent of the early-type Be stars, so-called gamma Cas stars,\nexhibit an unusually hard and bright thermal X-ray emission that could result\nfrom accretion onto a white dwarf companion or from magnetic interactions\nbetween the Be star and its decretion disk. Exploring the full power of\nhigh-resolution X-ray spectroscopy of gamma Cas stars requires comparison of\nobservations of the fluorescent Fe Kalpha emission lines near 6.4 keV with\nsynthetic profiles of this line complex computed in the framework of the\nmagnetic interaction and the accreting WD scenarios. For the latter, we further\ndistinguish between accretion onto a non-magnetic and a magnetic WD. Our models\naccount for different reservoirs of reprocessing material: the Be circumstellar\ndecretion disk, the Be photosphere, an accretion disk around the WD companion,\na magnetically channelled accretion flow and the WD photosphere. We find\nconsiderably different line properties for the different scenarios. For a\nnon-magnetic accreting WD, the global Fe Kalpha complex is extremely broad,\nreaching a full width of 140 eV, whilst it is ~ 40 eV for the magnetic\nstar-disk interaction and the magnetic accreting WD cases. In the magnetic\nstar-disk interaction, the line centroid follows the orbital motion of the Be\nstar, whereas it moves along with the WD in the case of an accreting WD. For\ngamma Cas, given the 15 times larger amplitude of the WD orbital motion, the\nshift in position for an accreting WD should be easily detectable with\nhigh-resolution spectrographs such as Resolve on XRISM, but remains essentially\nundetectable for the magnetic star-disk interaction. Upcoming high-resolution\nspectroscopy of the fluorescent Fe Kalpha emission lines in the X-ray spectra\nof gamma Cas stars will thus allow to distinguish between the competing\nscenarios."}
{"id": "2510.03214", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2510.03214", "abs": "https://arxiv.org/abs/2510.03214", "authors": ["Jonathan W. Arenberg"], "title": "Advancing the Concept Maturity Level of the Servicing Architecture for Habitable Worlds Observer", "comment": "7 pages", "summary": "This paper advances the concept maturity level (CML) of the Habitable Worlds\nObservatory (HWO) servicing architecture. Since servicing has occurred on other\nmissions, this paper argues that the current CML is 2. To advance to CML 3,\noption spaces must be established for trade studies. We introduce the three\nspace ages and the argument that we are on the cusp of a new revolutionary era.\nServicing is only part of that coming change and the other elements of the\nfuture space age are introduced. The challenge of designing a flagship mission\nsuch as HWO is discussed. The value proposition for the adoption of a new\ntechnology, such as servicing HWO, is established. In the latter portion of the\npaper it is shown that these elements have promise of being beneficial to HWO\nand should be included in any trade space."}
{"id": "2510.03073", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2510.03073", "abs": "https://arxiv.org/abs/2510.03073", "authors": ["D. O. Chernyshov", "A. V. Ivlev", "V. A. Dogiel"], "title": "Self-consistent model of cosmic ray penetration into molecular clouds: Effect of energy losses", "comment": "15 pages, 10 figures, accepted to PRD", "summary": "The theory of cosmic-ray (CR) penetration into dense molecular clouds\ndeveloped recently for relativistic particles by Chernyshov et al. (2024) is\nextended to non-relativistic CRs. Interstellar CRs streaming into the clouds\nare able to resonantly excite MHD waves in diffuse cloud envelopes. This leads\nto the self-modulation, such that streaming particles are scattered at the\nself-generated waves. In contrast to relativistic CRs, transport of\nlower-energy particles in the envelopes is generally heavily affected by\nionization losses; furthermore, both CR protons and electrons contribute to\nwave excitation. We show that these effects have profound impact on the\nself-modulation, and can dramatically reduce CR spectra even for clouds with\nmoderate column densities of a few times $10^{21}$ cm$^{-2}$."}
{"id": "2510.02739", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2510.02739", "abs": "https://arxiv.org/abs/2510.02739", "authors": ["Jihyun Kim", "Dmitri Ivanov", "Kazumasa Kawata", "Hiroyuki Sagawa", "Gordon Thomson"], "title": "Medium-scale anisotropies measured by Telescope Array surface detectors", "comment": "ICRC 2025, 11 pages, 5 figures", "summary": "The Telescope Array (TA) experiment, the largest observatory for ultra-high\nenergy cosmic rays in the Northern Hemisphere, has identified two medium-scale\nanisotropies: the TA Hotspot near the constellation Ursa Major and an excess in\nthe direction of the Perseus-Pisces supercluster. Studying these medium-scale\nanisotropies may provide insights into the origins of ultra-high energy cosmic\nrays. This presentation will explore an oversampling analysis of TA surface\ndetector data to evaluate these medium-scale event excesses and will present\nthe latest findings on the TA Hotspot and the Perseus-Pisces supercluster\nexcess."}
{"id": "2510.03139", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.03139", "abs": "https://arxiv.org/abs/2510.03139", "authors": ["Pratyasha Gitika", "Ryan M. Shannon", "Matthew Bailes", "Daniel J. Reardon", "Matthew T. Miles", "David J. Champion", "Kathrin Grunthal"], "title": "Optimising the MeerKAT Pulsar Timing Array and towards precision pulsar timing with SKA-mid", "comment": "18 pages, 11 figures, 3 tables, accepted for publication in PASA", "summary": "Pulsar timing arrays (PTAs) are Galactic-scale nanohertz-frequency\ngravitational wave (GW) detectors. Recently, several PTAs have found evidence\nfor the presence of GWs in their datasets, but none of them have achieved a\ncommunity-defined definitive (> 5$\\sigma$) detection. Here, we identify\nlimiting noise sources for PTAs and quantify their impact on sensitivity to GWs\nunder different observing and noise modelling strategies. First, we search for\nintrinsic pulse jitter in a sample of 89 MSPs observed by the MeerKAT Pulsar\nTiming Array and obtain new jitter measurements for 20 MSPs. We then forecast\njitter noise in pulsars for the future SKA-Mid telescope, finding that the\ntiming precision of many of the best-timed MSPs would be dominated by jitter\nnoise. We then consider dispersion measure variations from the interstellar\nmedium and find that their effects are best mitigated by modelling them as a\nstationary Gaussian process with a power-law spectrum. Improving upon the\nestablished hasasia code for PTA sensitivity analysis, we assess the timing\npotential of the lower frequency UHF-band (544$-$1088\\,MHz) of MeerKAT and find\na potential increase in GW background sensitivity by $\\approx 8$\\%, relative to\nobserving at L-band. We show that this improvement relies on assumptions on the\npropagation through the interstellar medium, and highlight that if observing\nfrequency-dependent propagation effects, such as scattering noise, are present,\nwhere noise is not completely correlated across observing frequency, then the\nimprovement is significantly diminished. Using the multi-frequency receivers\nand sub-arraying flexibility of MeerKAT, we find that focussed, high-cadence\nobservations of the best MSPs can enhance the sensitivity of the array for both\nthe continuous GWs and stochastic GWB. These results highlight the role of\nMeerKAT and the MPTA in the context of international GW search efforts."}
{"id": "2510.02980", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2510.02980", "abs": "https://arxiv.org/abs/2510.02980", "authors": ["A. D. Supanitsky", "D. Ravignani", "V. V. Kizakke Covilakam"], "title": "Likelihood-based reconstruction of muon lateral distribution function using combined integrator and binary detector modes", "comment": "Accepted in Astroparticle Physics", "summary": "The origin of ultra-high-energy cosmic rays, with energies $E \\geq 10^{18}$\neV, remains unknown. Among the key observables used to investigate their nature\nare the energy spectrum, the arrival direction distribution, and the\ncomposition as a function of energy. The composition of the primary cosmic ray\nis inferred from properties of the extensive air showers they initiate,\nparticularly from parameters sensitive to the primary mass. The most sensitive\nparameters to the primary mass are the atmospheric depth of the shower maximum,\ntypically measured with fluorescence telescopes, and the muon content of the\nshower, measured using dedicated muon detectors. A commonly used observable in\ncomposition studies is the muon density at a fixed distance from the shower\naxis, derived by evaluating the reconstructed muon lateral distribution\nfunction (MLDF) at a reference distance. A specific type of muon detector\nfeatures two acquisition modes: binary and integrator (commonly referred to as\nADC mode, for Analog-to-Digital Converter). The binary mode allows for direct\nmuon counting, while the ADC mode infers the muon number from the integrated\nsignal of the detector response. Existing methods reconstruct the MLDF using\ndata from either acquisition mode individually, or by combining both, but\nusually assigning a single mode per detector station in a given event. This\nwork presents a novel method to reconstruct the MLDF based on a likelihood\napproach that simultaneously incorporates data from both acquisition modes at\neach detector station. We apply our method to the underground muon detectors of\nthe Pierre Auger Observatory as a case study. However, this general approach\ncan be applied to future detectors with dual acquisition capabilities. Our\nresults demonstrate that the combined method outperforms traditional techniques\nthat rely solely on either binary or ADC mode data."}
{"id": "2510.03150", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2510.03150", "abs": "https://arxiv.org/abs/2510.03150", "authors": ["Sheng-Chieh Lin", "Yuanyuan Su", "Iraj Vaezzadeh", "William Forman", "Elke Roediger", "Charles Romero", "Paul Nulsen", "Scott W. Randall", "John ZuHone", "Ralph Kraft", "Christine Jones"], "title": "Mapping the Nearest Ancient Sloshing Cold Front in the Sky with XMM-Newton", "comment": "Published in the Open Journal of Astrophysics", "summary": "The Virgo Cluster is the nearest cool core cluster that features two\nwell-studied sloshing cold fronts at radii of $r \\approx 30$ kpc and $r \\approx\n90$ kpc, respectively. In this work, we present results of XMM-Newton mosaic\nobservations of a third, southwestern, cold front at a radius of $r \\approx\n250$ kpc, originally discovered with Suzaku. All three cold fronts are likely\nto be parts of an enormous swirling pattern, rooted in the core. The comparison\nwith a numerical simulation of a binary cluster merger indicates that these\ncold fronts were produced in the same single event $-$ likely the infall of M49\nfrom the northwest of Virgo and it is now re-entering the cluster from the\nsouth. This outermost cold front has probably survived for $2-3$ Gyr since the\ndisturbance. We identified single sharp edges in the surface brightness\nprofiles of the southern and southwestern sections of the cold front, whereas\nthe western section is better characterized with double edges. This implies\nthat magnetic fields have preserved the leading edge of the cold front, while\nits western side is beginning to split into two cold fronts likely due to\nKelvin-Helmholtz instabilities. The slopes of the 2D power spectrum of the\nX-ray surface brightness fluctuations, derived for the brighter side of the\ncold front, are consistent with the expectation from Kolmogorov turbulence. Our\nfindings highlight the role of cold fronts in shaping the thermal dynamics of\nthe intracluster medium beyond the cluster core, which has important\nimplications for cluster cosmology. Next-generation X-ray observatories, such\nas the proposed AXIS mission, will be ideal for identifying and characterizing\nancient cold fronts."}
{"id": "2510.03183", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.03183", "abs": "https://arxiv.org/abs/2510.03183", "authors": ["Karim Sabri", "Yves Gallant", "Justine Devin", "Kirsty Feijen"], "title": "HESS J1831$-$098 -- Exploring a pulsar halo scenario with H.E.S.S. data", "comment": "8 pages, 4 figures, accepted for publication in the ICRC 2025\n  proceedings", "summary": "Pulsar halos are a class of extended very-high-energy (VHE) sources\nhighlighted by the HAWC observatory towards the Geminga pulsar and PSR\nB0656$+$14. These VHE sources are interpreted as the inverse Compton emission\nfrom electrons and positrons diffusing in the interstellar medium at an\ninhibited rate, having escaped the pulsar wind nebula. Our aim is to search for\nnew pulsar halos using H.E.S.S. data and to constrain their physical\nproperties. Using a physically-motivated model of pulsar halos, we created\ntemplate-based models of the spatial and energetic distributions of the\nexpected gamma-ray emission using the Gammapy library. A promising candidate\nsource to which this model can be effectively applied is HESS J1831$-$098, an\nextended VHE source spatially coincident with two energetic pulsars, which also\nexhibits spectral continuity and morphological compatibility with the\nultra-high-energy source 1LHAASO J1831$-$1007u*. It could be powered by the\nradio pulsar PSR J1831$-$0952 with a characteristic age of 128 kyr. We present\na spectro-morphological analysis of this source with H.E.S.S. data, revealing\nthat the emission is well described with a pulsar halo model, although we\ncannot reject a simple 2D Gaussian morphology. We discuss the implication of\nthe derived physical parameters of the model."}
