{"id": "2510.20870", "categories": ["astro-ph.IM", "astro-ph.EP"], "pdf": "https://arxiv.org/pdf/2510.20870", "abs": "https://arxiv.org/abs/2510.20870", "authors": ["Sam de Regt", "Siddharth Gandhi", "Louis Siebenaler", "Darío González Picos"], "title": "pyROX: Rapid Opacity X-sections", "comment": "4 pages. Submitted to the Journal of Open Source Software (JOSS)", "summary": "In recent years, significant advances have been made in exoplanet and brown\ndwarf observations. By using state-of-the-art models, astronomers can determine\nproperties of their atmospheres, such as temperatures, the presence of clouds,\nor the chemical abundances of molecules and atoms. Accurate and up-to-date\nopacities are crucial to avoid inconclusive or biased results, but it can be\nchallenging to compute opacity cross-sections from the line lists provided by\nvarious online databases.\n  We introduce pyROX, an easy-to-use Python package to calculate molecular and\natomic cross-sections. Since pyROX works on CPUs, it can compute a small line\nlist on a regular workstation, but it is also easily parallelised on a cluster\nfor larger line lists. In addition to line opacities, pyROX also supports\ncalculations of collision-induced absorption. Tutorials are provided in the\nonline documentation which explain the configuration parameters and different\nfunctionalities of pyROX."}
{"id": "2510.20833", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.20833", "abs": "https://arxiv.org/abs/2510.20833", "authors": ["Nicoló Cibrario", "Michela Negro"], "title": "Embedding Reliability for Unsupervised Classification of Gamma Ray Burst progenitors from Prompt Gamma-ray Emission", "comment": null, "summary": "We present a statistical method based on scDEED to assess the reliability of\na 2D embedding showing a low-dimensional representation of the distribution of\nGamma-Ray Bursts (GRBs) detected by the Fermi Gamma-ray Burst Monitor (GBM).\nThe original dataset consists of 12 waterfall plots for each event, which\ncontain key information about the prompt emission of each GRB. The dataset's\ndimensionality is first reduced to a 30-dimensional latent space using an\nautoencoder, and subsequently to 2D using UMAP. While the methodology and\nresults are discussed in a previous work (arXiv:2406.03643), here we introduce\na statistical approach to evaluate the reliability of the final 2D distribution\nbased on the scDEED algorithm. Our analysis shows that the 2D embedding\ndemonstrates overall good reliability, with more than 90\\% of the events\nclassified as trustworthy."}
{"id": "2510.21465", "categories": ["astro-ph.IM", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2510.21465", "abs": "https://arxiv.org/abs/2510.21465", "authors": ["Stephen Overall", "John Southworth"], "title": "EBOP MAVEN: A machine learning model to estimate the input parameters for analytic fitting of detached eclipsing binary light curves", "comment": "This is a pre-copyedited, author-produced PDF of an article accepted\n  for publication in RAS Techniques & Instruments (RASTI) following peer\n  review. 20 pages, 10 figures", "summary": "Detached eclipsing binary stars (dEBs) are a key source of data on\nfundamental stellar parameters. Within the light curve databases of survey\nmissions such as Kepler and TESS are a wealth of new systems awaiting\ncharacterisation. We aim to improve the scalability of efforts to process these\ndata by developing a Convolutional Neural Network (CNN) machine learning model\nto assist in the automation of their analysis. From a phase-folded and binned\ndEB light curve the model predicts system parameters relating to stellar\nfractional radii, orbital inclination and eccentricity, and the stellar\nbrightness ratio, for use as input values in subsequent formal analysis with\nthe established JKTEBOP analytic code. We find the model able to predict these\nparameters for a previously unseen test dataset of 20000 synthetic dEB systems\nwith a mean error of 14.1% when compared with the label values, improving to\n8.6% against a subset representative of real systems. When tested with the TESS\nlight curves of a set of real well-characterised systems, the model's\npredictions yield a mean error of $8.7\\pm0.7\\%$ when compared with label values\nderived from existing published analyses. Subsequent fitting of the TESS light\ncurves with the JKTEBOP analytic code while using the model predictions as\ninput values finds 27 of the 28 systems achieving a good fit. On the strength\nof these results, we plan to build a new characterisation pipeline based on the\nmachine learning model and JKTEBOP code with the intention of producing a\ntarget catalogue of dEB systems for potential observation with the forthcoming\nPLATO mission."}
{"id": "2510.20898", "categories": ["astro-ph.HE", "astro-ph.GA", "gr-qc"], "pdf": "https://arxiv.org/pdf/2510.20898", "abs": "https://arxiv.org/abs/2510.20898", "authors": ["Pau Amaro Seoane"], "title": "Illuminating gravitational wave sources with Sgr A* flares", "comment": "Submitted", "summary": "Sagittarius A* (Sgr A*), the supermassive black hole at the center of the\nMilky Way, exhibits daily energetic flares characterized by non-thermal\nemission in the infrared and X-ray bands. While the underlying accretion flow\nis a Radiatively Inefficient Accretion Flow (RIAF) peaking at radio\nfrequencies, the mechanism powering these non-thermal transients remains\ndebated. Stellar dynamics predict a population of faint brown dwarfs orbiting\nSgr A*. These objects are progenitors of Extremely Large Mass Ratio Inspirals\n(XMRIs), crucial sources of low-frequency gravitational waves for the future\nLaser Interferometer Space Antenna (LISA) mission. We investigate whether the\ntidal stripping of brown dwarfs provides a viable fueling mechanism for the\nobserved flares. Here we present high-resolution hydrodynamic simulations of\ngrazing tidal interactions coupled with a parameterized non-thermal radiation\nmodel. We demonstrate that the dynamics of the tidal fallback and subsequent\nviscous evolution naturally reproduce the fundamental temporal characteristics\nof observed flares: the peak luminosity and the characteristic 1-hour duration.\nWe show that this fueling mechanism is dynamically viable and energetically\nconsistent, placing strong constraints on the required efficiency of the\nnon-thermal emission process, suggesting extreme radiative inefficiency. These\nfindings provide compelling evidence for a hidden population of brown dwarfs in\nthe Galactic Center. Crucially, the observed high flare frequency implies tight\norbits characteristic of advanced inspirals. This establishes a direct link\nbetween electromagnetic transients and active gravitational wave sources,\nalerting the LISA consortium years in advance to the presence of specific XMRI\nsystems promising exceptionally high signal-to-noise ratios for precision tests\nof general relativity."}
{"id": "2510.21510", "categories": ["astro-ph.IM", "astro-ph.CO"], "pdf": "https://arxiv.org/pdf/2510.21510", "abs": "https://arxiv.org/abs/2510.21510", "authors": ["Huai-Jin Tang", "Xiao-Lei Meng", "Hu Zhan", "Guo-Liang Li", "Cheng-Liang Wei", "Xian-Min Meng", "Xi-Yang Fu", "You-Hua Xu"], "title": "LEO Satellite Track Correction for CSST Multi-Band Imaging Data", "comment": null, "summary": "Low Earth Orbit satellite (LEOsat) mega-constellations are considered to be\nan unavoidable source of contamination for survey observations to be carried\nout by the China Space Station Telescope (CSST) over the next decade. This\nstudy reconstructs satellite trail profiles based on simulated parameters,\nincluding brightness levels and orbital altitudes, in combination with\nmulti-band simulated images. Compared to our previous work, the simulated\nimages in this study more accurately replicate the realistic observational\nconditions of CSST and extend beyond single-band analysis. Variations in LEOsat\ntrail brightness, source brightness, background noise, and source density\nacross different bands result in differing levels of accuracy in trail\nreconstruction and subsequently affect the reliability of photometric\nmeasurements. The reconstructed trail profiles are subsequently applied to\ncorrect the contaminated regions. Simulation results reveal varying levels of\ncontamination effects across different bands following LEOsat trail correction,\nincluding both reconstruction and subtraction. To evaluate the effectiveness of\nthe correction, we quantified the fraction of affected sources using two\nmetrics: (1) magnitude errors greater than 0.01 mag attributable to LEOsats,\nand (2) LEOsat-induced noise exceeding 10% of other noise contributions.\nFollowing trail repair, the analysis reveals a reduction of over 50% in the\nfraction of affected sources in the NUV band for both 550 km and 1200 km\naltitudes, assuming a maximum brightness of 7 in the V band. In the i band, the\nreduction exceeds 30%. The degree of improvement varies across spectral bands,\nand depends on both satellite altitude and the adopted brightness model."}
{"id": "2510.20904", "categories": ["astro-ph.HE", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2510.20904", "abs": "https://arxiv.org/abs/2510.20904", "authors": ["Amir Michaelis", "Yael Hillman", "Hagai B. Perets"], "title": "It's always the quiet ones: Single Degenerate Double Detonation Type Ia Supernova from Quiescent Helium Accretion", "comment": "15 pages, 4 figures, 1 table", "summary": "We investigate a sub-Chandrasekhar mass double detonation pathway for Type Ia\nsupernovae arising from single degenerate helium accreting carbon-oxygen white\ndwarfs. Building on our previous one dimensional study of recurrent helium\nnovae (Hillman et al. 2025), we evolve a 0.7 solar mass white dwarf through\nsteady accretion at 10^-8 Msun yr^-1 until it reaches 1.1 solar mass, yielding\nrealistic, time evolved helium rich profiles. These profiles are mapped into\nFLASH simulations, incorporating nuclear burning for helium and carbon-oxygen\ndetonation, in multi-dimensional hydrodynamic runs. A localized, modest\ntemperature perturbation near the base of the helium shell robustly triggers an\noutward helium-shell detonation. The ensuing inward propagating shock converges\nin the carbon-oxygen core, igniting a secondary detonation that unbinds the\nstar. We obtain a Ni56 yield of ~0.64 solar mass, an intermediate-mass element\n(Si-Ca) mass of ~0.41 solar mass, and maximum ejecta velocities approaching\n22,000 km/s, values consistent with normal Type Ia supernovae. Our results\ndemonstrate that recurrent helium accretors, typically quiescent over long\ntimescales, can evolve under subtle, \"quiet\" conditions to trigger robust\ndouble detonations, supporting their role as viable progenitors of\nsub-Chandrasekhar mass Type Ia supernovae."}
{"id": "2510.20911", "categories": ["astro-ph.HE", "astro-ph.IM", "hep-ph"], "pdf": "https://arxiv.org/pdf/2510.20911", "abs": "https://arxiv.org/abs/2510.20911", "authors": ["Adriel G B Mocellin", "J. Caraça-Valente", "C. Covault", "E. Dalcan", "T. Fujii", "S. Im", "R. James", "J. Johnsen", "K. H. Kampert", "H. Kern", "J. N. Matthews", "E. Mayotte", "S. Mayotte", "X. Moskala", "H. Que", "J. Rautenberg", "M. Roth", "H. Sagawa", "T. Sako", "F. Sarazin", "R. Sato", "D. Schmidt", "S. B. Thomas", "G. Wörner"], "title": "Auger@TA: In-situ Cross-Calibration of the World's Largest Cosmic Ray Observatories", "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC\n  2025). 15 pages. 5 figures", "summary": "The Pierre Auger Observatory (Auger) and the Telescope Array (TA) are the\nworld's two largest ultra-high-energy cosmic ray (UHECR) observatories. They\noperate in the Southern and Northern hemispheres, respectively, at similar\nlatitudes but with distinct surface detector (SD) designs. A significant\nchallenge in studying UHECR physics across the full sky is the apparent\ndiscrepancy in flux measurements between the two experiments. This discrepancy\ncould arise from astrophysical differences and/or systematic effects related to\ntheir detector designs and sensitivities to extensive air shower components. To\naddress this, the Auger@TA working group aims to cross-calibrate the two\nobservatories with a self-triggering micro-Auger array within the TA array.\nThis micro-array consists of eight Auger Surface Detector (SD) stations\nequipped with Water Cherenkov Detectors (WCDs) and AugerPrime Surface\nScintillator Detectors. Seven SD stations, configured with a centered-1-PMT\ndesign, are arranged in a hexagonal pattern with one station in the center,\nwith 1.5 km spacing, mirroring the Auger layout. The eighth station, which\nfeatures a standard 3-PMT Auger station, is located in conjunction with a TA\ndetector at the center of the hexagon, forming a triplet for high-statistics\nand low-uncertainty cross-calibration. A custom communication system that uses\nreadily available components enables seamless communication between stations\nand remote access to each station through a central computer. The micro-array\nis now fully deployed, and initial data-taking is about to start. This\npresentation will detail the instrumentation, communication systems, central\ndata acquisition system, expected performance of the micro-array, and\npreliminary results as appropriate."}
{"id": "2510.20911", "categories": ["astro-ph.HE", "astro-ph.IM", "hep-ph"], "pdf": "https://arxiv.org/pdf/2510.20911", "abs": "https://arxiv.org/abs/2510.20911", "authors": ["Adriel G B Mocellin", "J. Caraça-Valente", "C. Covault", "E. Dalcan", "T. Fujii", "S. Im", "R. James", "J. Johnsen", "K. H. Kampert", "H. Kern", "J. N. Matthews", "E. Mayotte", "S. Mayotte", "X. Moskala", "H. Que", "J. Rautenberg", "M. Roth", "H. Sagawa", "T. Sako", "F. Sarazin", "R. Sato", "D. Schmidt", "S. B. Thomas", "G. Wörner"], "title": "Auger@TA: In-situ Cross-Calibration of the World's Largest Cosmic Ray Observatories", "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC\n  2025). 15 pages. 5 figures", "summary": "The Pierre Auger Observatory (Auger) and the Telescope Array (TA) are the\nworld's two largest ultra-high-energy cosmic ray (UHECR) observatories. They\noperate in the Southern and Northern hemispheres, respectively, at similar\nlatitudes but with distinct surface detector (SD) designs. A significant\nchallenge in studying UHECR physics across the full sky is the apparent\ndiscrepancy in flux measurements between the two experiments. This discrepancy\ncould arise from astrophysical differences and/or systematic effects related to\ntheir detector designs and sensitivities to extensive air shower components. To\naddress this, the Auger@TA working group aims to cross-calibrate the two\nobservatories with a self-triggering micro-Auger array within the TA array.\nThis micro-array consists of eight Auger Surface Detector (SD) stations\nequipped with Water Cherenkov Detectors (WCDs) and AugerPrime Surface\nScintillator Detectors. Seven SD stations, configured with a centered-1-PMT\ndesign, are arranged in a hexagonal pattern with one station in the center,\nwith 1.5 km spacing, mirroring the Auger layout. The eighth station, which\nfeatures a standard 3-PMT Auger station, is located in conjunction with a TA\ndetector at the center of the hexagon, forming a triplet for high-statistics\nand low-uncertainty cross-calibration. A custom communication system that uses\nreadily available components enables seamless communication between stations\nand remote access to each station through a central computer. The micro-array\nis now fully deployed, and initial data-taking is about to start. This\npresentation will detail the instrumentation, communication systems, central\ndata acquisition system, expected performance of the micro-array, and\npreliminary results as appropriate."}
{"id": "2510.20913", "categories": ["astro-ph.HE", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2510.20913", "abs": "https://arxiv.org/abs/2510.20913", "authors": ["Poonam Chandra"], "title": "Multiwavelength view of circumstellar interaction in supernovae", "comment": "47 Pages, 11 Figures, 7 Tables. Figure 1 has an elaborated supernova\n  classification scheme. Review paper, to appear in the journal \"Universe\", in\n  the special issue \"A Multiwavelength View of Supernovae\"", "summary": "The interaction of post-explosion supernova ejecta with the surrounding\ncircumstellar medium creates emission across the electromagnetic spectrum.\nSince the circumstellar medium is created by the mass lost from the progenitor\nstar, it carries tell-tale signatures of the progenitor. Consequently,\nobservations and modeling of radiation produced by the interaction in various\ntypes of supernovae have provided valuable insights into their progenitors.\nDetailed studies have shown that the interaction in supernovae begins and\nsustains over various timescales and lengthscales, with differing mass-loss\nrates in distinct sub-classes. This reveals diverse progenitor histories for\nthese stellar explosions. This review paper summarizes various supernova\nsubtypes, linking them to stellar death pathways, and presents an updated\nsupernova classification diagram. We then present a multi-wavelength study of\ncircumstellar interaction in different supernova classes. We also present\nunpublished Chandra X-ray as well as radio observations of a type IIn\nsupernova, SN 2010jl, which allow us to extend its circumstellar interaction\nstudies to about 7 years post-explosion. The new data indicates that the\nextreme mass-loss rate 0.1 Msun/yr in SN 2010jl, reported by Chandra et al.\n(2015), commenced within the last 300 years before the explosion. We summarize\nthe current status of the field and argue that via detailed studies of the\ncircumstellar interaction, a.k.a. Time Machine technique, one of the big\nmysteries of stellar evolution, i.e., mapping supernovae progenitors to their\nexplosive outcomes can be solved."}
{"id": "2510.20989", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2510.20989", "abs": "https://arxiv.org/abs/2510.20989", "authors": ["A. J. Drake", "S. G. Djorgovski", "M. J. Graham", "D. Stern", "A. A. Mahabal", "M. Catelan", "J. L. Prieto", "S. Larson"], "title": "Spectroscopic Classification of Extragalactic Transients from CRTS", "comment": "18 pages, Accepted MNRAS", "summary": "The Catalina Real-time Transient Survey (CRTS) carried out a public survey\nfor optical transients between 2007 and 2019, discovering more than 16,000\ntransient candidates. Here we present the spectra and highlight the results of\nthe spectroscopic follow-up of CRTS extragalactic transients. As expected, we\nfind that the bulk of these transients are normal supernovae. However, as we\nprioritised transients exhibiting unusual features or environments during our\nspectroscopic follow-up, we focus on the rarer types of transients. These\nobjects include more than a dozen type-I superluminous supernovae and dozens of\ntype-I and II supernovae that underwent circumstellar medium interactions. We\nhighlight several specific supernovae, including a new analysis of SN 2008iy, a\ntype-IIn which exhibited a bright pre-supernova outburst event similar to SN\n2009ip and lasted more than 1800 days; CSS111225:140122+161705, a type-I\nsupernova that showed an extreme 2.5 magnitude rebrightening event more than\n200 days after its initial outburst; and SN 2009ny, a type-Ibn supernova that\nexhibited strong helium emission lines similar to SN 2002ao. We confirm our\nprevious finding that numerous CRTS transients are associated with galaxies of\nextremely low luminosity. We discuss the difficulty in determining the origin\nof transients associated with outbursts in active galactic nuclei (AGN), tidal\ndisruption events, and type-IIn supernovae. As an example, we present\nCSS150120:110008+385352, a CRTS transient similar to CSS100217:102913+404220\nthat occurred within a quiescent AGN and peaked at Mv = -23.6."}
{"id": "2510.21097", "categories": ["astro-ph.HE", "astro-ph.CO"], "pdf": "https://arxiv.org/pdf/2510.21097", "abs": "https://arxiv.org/abs/2510.21097", "authors": ["Jun-Jie Wei", "Qing-Bo Ma", "Xue-Feng Wu"], "title": "Detecting Population III Gamma-Ray Bursts in the Era of EP and SVOM", "comment": "10 pages, 2 figures, 2 tables", "summary": "High-redshift gamma-ray bursts (GRBs), putative counterparts of massive,\nlow-metallicity Population III (Pop III) stars, are a promising probe of the\nfirst stars. We assess the detectability of these Pop III GRBs using a\nmetallicity-based progenitor criterion and cosmological $N$-body/hydrodynamical\nsimulations with three distinct Pop III initial mass functions (IMFs), focusing\non the capabilities of the Wide-field X-ray Telescope (WXT) aboard the Einstein\nProbe (\\emph{EP}) and the coded-mask gamma-ray imager (ECLAIRs) aboard the\nSpace-based multi-band astronomical Variable Objects Monitor (\\emph{SVOM}). Our\npopulation synthesis model, calibrated to \\emph{Swift} data, predicts the\nfollowing Population II/I (Pop II/I) GRB detection rates at $z>6$:\n$\\sim2.4\\,\\mathrm{events\\,yr^{-1}}$ for \\emph{EP}/WXT and\n$\\sim0.9\\,\\mathrm{events\\,yr^{-1}}$ for \\emph{SVOM}/ECLAIRs. For the IMF with\nvery massive first stars ($\\mathrm{100\\textrm{--}500\\,M_\\odot}$), we derive\nupper limits on the Pop III GRB rate at $z>6$ of\n$<0.06\\,\\mathrm{events\\,yr^{-1}}$ (\\emph{EP}/WXT) and\n$<0.13\\,\\mathrm{events\\,yr^{-1}}$ (\\emph{SVOM}/ECLAIRs), based on the absence\nof confirmed Pop III progenitors in \\emph{Swift} bursts at $z>5.5$. Our results\nindicate that while Pop III GRBs are subdominant to Pop II/I GRBs at $z<10$,\ntheir fractional contribution rises significantly with redshift, reaching\n$\\sim8\\%$ ($\\sim34\\%$) at $z>10$ and $\\sim28\\%$ ($\\sim68\\%$) at $z>16$ for\n\\emph{EP}/WXT (\\emph{SVOM}/ECLAIRs). This trend is systematically enhanced in\nthe other two IMF models, which adopt a lower stellar mass range of\n$\\mathrm{[0.1,\\,100]\\,M_\\odot}$. We conclude that detecting Pop III GRBs at\nhigh redshifts is a realistic prospect, and any GRB detected at $z>16$ is most\nlikely of Pop III origin."}
{"id": "2510.21104", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.21104", "abs": "https://arxiv.org/abs/2510.21104", "authors": ["ARA Collaboration", "N. Alden", "S. Ali", "P. Allison", "S. Archambault", "J. J. Beatty", "D. Z. Besson", "A. Bishop", "P. Chen", "Y. C. Chen", "Y. -C. Chen", "S. Chiche", "B. A. Clark", "A. Connolly", "K. Couberly", "L. Cremonesi", "A. Cummings", "P. Dasgupta", "R. Debolt", "S. de Kockere", "K. D. de Vries", "C. Deaconu", "M. A. DuVernois", "J. Flaherty", "E. Friedman", "R. Gaior", "P. Giri", "J. Hanson", "N. Harty", "K. D. Hoffman", "M. -H. Huang", "K. Hughes", "A. Ishihara", "A. Karle", "J. L. Kelley", "K. -C. Kim", "M. -C. Kim", "I. Kravchenko", "R. Krebs", "C. Y. Kuo", "K. Kurusu", "U. A. Latif", "C. H. Liu", "T. C. Liu", "W. Luszczak", "A. Machtay", "K. Mase", "M. S. Muzio", "J. Nam", "R. J. Nichol", "A. Novikov", "A. Nozdrina", "E. Oberla", "C. W. Pai", "Y. Pan", "C. Pfendner", "N. Punsuebsay", "J. Roth", "A. Salcedo-Gomez", "D. Seckel", "M. F. H. Seikh", "Y. -S. Shiao", "J. Stethem", "S. C. Su", "S. Toscano", "J. Torres", "J. Touart", "N. van Eijndhoven", "A. Vieregg", "M. Vilarino Fostier", "M. -Z. Wang", "S. -H. Wang", "P. Windischhofer", "S. A. Wissel", "C. Xie", "S. Yoshida", "R. Young"], "title": "Observation of In-ice Askaryan Radiation from High-Energy Cosmic Rays", "comment": null, "summary": "We present the first experimental evidence for in-ice Askaryan radiation --\ncoherent charge-excess radio emission -- from high-energy particle cascades\ndeveloping in the Antarctic ice sheet. In 208 days of data recorded with the\nphased-array instrument of the Askaryan Radio Array, a previous analysis has\nincidentally identified 13 events with impulsive radiofrequency signals\noriginating from below the ice surface. We here present a detailed reanalysis\nof these events. The observed event rate, radiation arrival directions, signal\nshape, spectral content, and electric field polarization are consistent with\nin-ice Askaryan radiation from cosmic ray air shower cores impacting the ice\nsheet. For the brightest events, the angular radiation pattern favors an\nextended cascade-like emitter over a pointlike source. An origin from the\ngeomagnetic separation of charges in cosmic ray air showers is disfavored by\nthe arrival directions and polarization. Considering the arrival angles, timing\nproperties, and the impulsive nature of the passing events, the event rate is\ninconsistent with the estimation of the combined background from thermal noise\nevents and on-surface events at the level of $5.1\\,\\sigma$."}
{"id": "2510.21187", "categories": ["astro-ph.HE", "physics.plasm-ph"], "pdf": "https://arxiv.org/pdf/2510.21187", "abs": "https://arxiv.org/abs/2510.21187", "authors": ["Tsun Hin Navin Tsung", "Gregory R. Werner", "Dmitri A. Uzdensky", "Mitchell C. Begelman"], "title": "Dissipation and particle acceleration at intermittent structures with velocity and magnetic shear: Interaction of Kelvin-Helmholtz and Drift-Kink instabilities", "comment": "26 pages, 15 figures, submitted to JPP", "summary": "We present two-dimensional (2D) particle-in-cell simulations of a magnetized,\ncollisionless, relativistic pair plasma subjected to combined velocity and\nmagnetic-field shear, a scenario typical at intermittent structures in plasma\nturbulence. We create conditions where only the Kelvin-Helmholtz (KH) and\nDrift-Kink (DK) instabilities can develop, while tearing modes are forbidden.\nThe interaction of DKI and KHI generates qualitatively new structures, marked\nby a thickened shear layer with very weak electromagnetic field, modulated by\nKH vortices. Over a range of moderately strong velocity shears explored, the\ninteraction of DKI and KHI results in a significant enhancement of dissipation\nover cases with only velocity shear or only magnetic shear. Moreover, we\nobserve a new and efficient way of particle acceleration where particles are\nstochastically accelerated by the motional electric field exterior to the shear\nlayer as they meander in an S-shaped pattern in and out of it. This process\ntakes advantage of the bent geometry of the shear layer caused by the DK-KHI\ninteraction and is responsible for most of the highest-energy particles\nproduced in our simulations. These results further our understanding of\ndissipation and particle acceleration at intermittent structures, which are\npresent in plasma turbulence across a wide range of astrophysical contexts such\nas in AGN jet sheaths, potentially relevant to limb-brightened emission, etc.,\nand highlight the sensitivity of dissipation to multiple interacting\ninstabilities, thus providing a strong motivation for further studies of their\nnonlinear interaction at the kinetic level."}
{"id": "2510.21205", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.21205", "abs": "https://arxiv.org/abs/2510.21205", "authors": ["Jingyu Wu", "Zhihao Ouyang", "Hubing Xiao", "Elisa Prandini", "Shangchun Xie", "Sheng Yang", "Jianzhen Chen", "Shaohua Zhang", "Haoyang Zhang", "Junhui Fan"], "title": "Detection of Quasi-periodic Oscillations in the $γ$-Ray Light Curve of 4FGL J0309.9-6058", "comment": "12 pages, 8 figures, accept for MNRAS", "summary": "In this work, we report, for the first time, a quasi-periodic oscillation\n(QPO) in the $\\gamma$-ray band of 4FGL J0309.9-6058, also known as PKS\n0308-611. We employed three analytical methods (the Lomb-Scargle periodogram,\nREDFIT, and the weighted wavelet Z-transform) to analyze the QPO signal using\n\\textit{Fermi} $\\gamma$-ray light curve data. The analysis reveals a potential\nQPO during MJD 57983$-$60503, with a period of approximately 550 days and a\nmaximum local significance of 3.72$\\sigma$ and global significance of\n2.72$\\sigma$ derived from the WWZ analysis. To validate this result, we applied\nGaussian Process (GP) to the same light curve, which independently confirms the\npresence of QPO signal consistent with our Fourier-based results. We further\nextended the analysis to the full duration of the \\textit{Fermi} observations,\nand the results consistently support and strengthen the presence of this QPO\nsignal. Additionally, a time lag between the optical and $\\gamma$-ray bands\nindicates separate emission regions for these two bands. Given the year-like\ntimescale of the QPO signal and the fact that a QPO signal with local\nsignificance over 3$\\sigma$ for full \\textit{Fermi}-LAT observed time, we\nsuggest that the QPO is most likely caused by a precessing jet."}
{"id": "2510.21263", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2510.21263", "abs": "https://arxiv.org/abs/2510.21263", "authors": ["Yongyun Chen", "Qiusheng Gu", "Junhui Fan", "Dingrong Xiong", "Xiaoling Yu", "Xiaotong Guo", "Nan Ding", "Ting-Feng Yi"], "title": "The relation between the optical variability timescale, magnetic field of jets and black hole spin in active galactic nuclei", "comment": "10 pages, 4 figures, accept for publication in the Astrophysical\n  Journal", "summary": "We investigate the relationship among the jet magnetic field, black hole\nspin, black hole mass, Eddington ratio, and optical variability timescales in\njetted active galactic nuclei (AGNs). By fitting a damped random walk (DRW)\nmodel to the g-band light curves, we obtain the characteristic variability\ntimescale ($\\tau_{\\rm DRW}$) for 41 jetted AGNs with precise supermassive black\nhole (SMBH) mass measurements. Our main results are as follows: (i) Our\nanalysis reveals a significant correlation between the jet magnetic field\n($B_{\\rm 1pc}$), black hole spin ($j$) and the characteristic variability\ntimescale within our sample. These findings suggest that the optical\nvariability of jetted AGNs is influenced by the jet magnetic field and black\nhole spin. Furthermore, the characteristic variability timescale aligns with\nthe electron escape timescale, as evidenced by the relationship between the\ncharacteristic variability timescale and jet magnetic field ($\\tau_{\\rm\nDRW}\\propto B_{\\rm 1pc}^{0.76\\pm0.22}$). (ii) We confirm a significant\ncorrelation between the characteristic variability timescale and SMBH mass,\nexpressed as: $\\log \\rm \\tau_{\\rm DRW} = 0.52(\\pm0.21)\\log M _{\\rm BH}/M_{\\rm\n\\odot}-3.12(\\pm1.90)$, with an intrinsic scatter of 0.08 dex. The slope of this\nrelationship is consistent with that between the thermal timescale and black\nhole mass. Our results support the hypothesis that magnetorotational\ninstability (MRI) fluctuations drive the intrinsic variability observed in the\nlight curves emitted by the AGNs accretion disk."}
{"id": "2510.21331", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.21331", "abs": "https://arxiv.org/abs/2510.21331", "authors": ["R. Mignon-Risse", "P. Varniere", "F. Casse"], "title": "A simple toy model for the electromagnetic variability of lump-dominated circumbinary disks around binary black holes", "comment": "Accepted for publication in A&A. 13 pages, 12 figures", "summary": "The electromagnetic detection of circumbinary disks around pre-merger binary\nblack holes (BBHs) relies on theoretical predictions. These are generally\nobtained through expensive numerical simulations, but simple or fast toy models\nare lacking to unleash the potential of these theoretical advances for\nobservational purposes. We aim to present a simple toy model to compute the\nelectromagnetic variability of circumbinary disks around circular-orbit BBHs at\nrelativistic separations, focusing on the impact of disk non-axisymmetries. We\nassume that the disk is threaded by spiral arms and hosts a hotspot linked to\nan overdense structure (the {\\lq}lump{\\rq}) preferably reported in binaries\nclose to equal mass. We build a simple temperature distribution, and estimate\nits thermal emission, perceived by a distant observer, via a ray-tracing code\nin a BBH approximate metric. We propose a toy model reproducing the main\nlightcurve features and show it is consistent with 2D general-hydrodynamical\nsimulations under the assumption of compressional heating and expansional\ncooling except for purely dynamical effects such as the binary-lump beat. The\nlightcurve exhibits a main modulation at the lump's period (i.e. a few times\nthe orbital period), due to relativistic Doppler effect, and a shorter one at\nthe orbital-like period, due to spiral arms or the beat. These are more\nprominent in the optical/UV band for a total binary mass $M\\, {=} \\,\n10^{4-10}\\mathrm{M_\\odot}$, where the disk energy spectrum peaks. For\n$M=10^{9}\\mathrm{M_\\odot}$, a $4\\%$-amplitude lump modulation is detectable\nwith the Vera Rubin Observatory after six months of observation, up to $z\\,\n{=}\\, 0.5$. We proposed a new, simple toy model that can be used, for instance,\nto test the compatibility of the periodicity of BBH candidate sources with a\ncircumbinary disk origin."}
{"id": "2510.21480", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.21480", "abs": "https://arxiv.org/abs/2510.21480", "authors": ["Rowan Batzofin", "Pierre Cristofari", "Kathrin Egberts"], "title": "The population of Galactic young massive star clusters in the TeV range", "comment": "8 pages, 3 figures, Proceedings for the 39th International Cosmic Ray\n  Conference (ICRC2025)", "summary": "Young massive star clusters (YMSCs) can produce gamma rays in the\nvery-high-energy (VHE, E>100 GeV) range and have been proposed as sources that\ncan accelerate cosmic rays up to PeV energies. Observations with current\ninstruments have lead to the detection of only a few YMSCs but future\ninstruments should significantly increase this number. However, the details of\nthe production of the VHE emission are not well understood: What is the\nspectrum of accelerated particles? What is the efficiency of cosmic-ray\nproduction? What fraction of the wind luminosity is converted into the\nturbulent magnetic field?\n  To address these questions, we simulate the population of YMSCs in the\ngamma-ray domain, by means of Monte Carlo methods, and apply the constraints\nbased on the subsample of YMSCs currently detected at TeV energies. We confront\nour simulated populations with the catalogue of the H.E.S.S. Galactic Plane\nSurvey and the First LHAASO Catalogue of Gamma-Ray Sources, allowing us to\ninvestigate crucial aspects of particle acceleration at YMSCs."}
{"id": "2510.21502", "categories": ["astro-ph.HE", "gr-qc"], "pdf": "https://arxiv.org/pdf/2510.21502", "abs": "https://arxiv.org/abs/2510.21502", "authors": ["Leonardo Ricca", "Matthias Vereecken", "Christoph Raab", "Mathieu Lamoureux", "Giacomo Bruno", "Gwenhaël De Wasseige"], "title": "Multi-Messenger Search for Neutrino and Gravitational-Wave Emissions from Binary Black Holes Near Active Galactic Nuclei", "comment": "8 pages, 1 figure. Presented at the 39th International Cosmic Ray\n  Conference (ICRC2025). Published in Proceedings of Science", "summary": "Binary black holes (BBHs) in the vicinity of Active Galactic Nuclei (AGNs)\nare particularly interesting systems from both a cosmological and astrophysical\npoint of view. Matter and radiation fields within the dense AGN environment\ncould produce electromagnetic and neutrino emission in addition to\ngravitational waves (GWs). Moreover, interactions between BBHs and AGN\naccretion disks are expected to influence BBH formation channels and merger\nrates. Understanding these sources could help explain the unexpectedly high BBH\nmasses observed through GWs by the LIGO-Virgo-KAGRA collaborations. We present\na search for coincident gravitational-wave and neutrino emission from AGNs. Our\ninnovative approach combines information from gravitational-wave data, neutrino\nobservations, and AGN optical catalogs to increase the chances of identifying\npotential sources and studying their properties. We assess the sensitivity of\nthe search using subthreshold gravitational-wave candidates from\nLIGO-Virgo-KAGRA data, neutrino event candidates from public IceCube Neutrino\nObservatory data and AGN candidates from the Quaia catalog. A confident\ndetection of such an event would mark a breakthrough in multi-messenger\nastronomy."}
{"id": "2510.21529", "categories": ["astro-ph.HE", "gr-qc"], "pdf": "https://arxiv.org/pdf/2510.21529", "abs": "https://arxiv.org/abs/2510.21529", "authors": ["Gianluca Pagliaro", "Maria Alessandra Papa", "Jing Ming", "Devina Misra"], "title": "Sco X-1 as a continuous gravitational waves source: modelling the secular evolution using MESA", "comment": null, "summary": "We study the prospects for detecting continuous gravitational waves (GWs)\nfrom Sco X-1 and evaluate the most likely waveform- and progenitor- parameters.\nWe study the evolution of different Sco X-1 progenitors, identifying those that\ngive rise to detectable signals. We model the spin evolution of the neutron\nstar (NS) by the accretion torque and the GW torque. We consider two mechanisms\nfor generating the non-axisymmetry responsible for the GW torque: i) magnetic\nmountains and ii) deformation after crustal breakage. Both torques are\nintertwined with the binary evolution, which we trace from the formation of the\nNS in a binary system with a main-sequence companion. We do this with MESA,\nstarting from a set of initial binary configurations. At current sensitivity, a\nmagnetic ellipticity of $\\varepsilon\\gtrsim 10^{-6}$ is necessary for\ndetection. The highest frequency at which we have detectable signals increases\nwith the accretion efficiency $\\eta$, and it can be as high as 360Hz. At 3G\n(Cosmic Explorer/Einstein telescope) sensitivity, less deformed Sco X-1 NSs,\nwith ellipticities as small as $6\\cdot 10^{-9}$, are detectable, but the\nwaveform highly depends on the binary system: the highest frequency of\ndetectable signals spans the very broad range 600-1700Hz, strongly depending on\n$\\eta$ and mass of the progenitor donor star $M^d$. If $\\eta\\leq$30%, the crust\ndoes not break. When $\\eta\\in$[40%,60%] only progenitors with\n$M^d\\geq[1.1,1.5]M_{\\odot}$ present crustal breakage, while if $\\eta\\geq$70%\nall crusts break. In some systems the crust breaks during their Sco X-1 phase.\nIf Sco X-1 were one of those systems, it would be emitting a very loud GW\nsignal sweeping from O(1000)Hz down to torque-balance frequencies. We estimate\ncurrent detection probability for this signal to be under 1%; this probability\nincreases substantially -- to around 41% -- with third-generation detectors."}
{"id": "2510.21709", "categories": ["astro-ph.HE", "astro-ph.CO", "astro-ph.GA", "gr-qc"], "pdf": "https://arxiv.org/pdf/2510.21709", "abs": "https://arxiv.org/abs/2510.21709", "authors": ["Konstantinos Kritos", "Joseph Silk"], "title": "From nuclear star clusters to Little Red Dots: black hole growth, mergers, and tidal disruptions", "comment": "19 pages, 5 figures", "summary": "Little Red Dots, discovered by the James Webb Space Telescope, are\nhypothesized to be active galactic nuclei containing a supermassive black hole,\npossibly surrounded by a dense stellar cluster, large amounts of gas, and\nlikely by a population of stellar-mass black holes. We develop a simple nuclear\nstar cluster model to evolve the rapid mass growth of black hole seeds into the\nsupermassive regime. The combined processes of tidal disruption events, black\nhole captures, and gas accretion are accounted for self-consistently in our\nmodel. Given the observed number density of Little Red Dots, and under\nreasonable assumptions, we predict at least a few tens of tidal disruption\nevents and at least a few black hole captures at $z=4$-$6$, with a tidal\ndisruption event rate an order of magnitude larger than the black hole capture\nrate. We also estimate the uncertainties in these estimates. Finally, we\ncomment on the low x-ray luminosity of Little Red Dots."}
