{"id": "2511.03834", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.03834", "abs": "https://arxiv.org/abs/2511.03834", "authors": ["Daniel C. M. Palumbo", "George N. Wong", "Angelo Ricarte"], "title": "Photon Orbit Signatures in Spectra of Black Hole Accretion Disks", "comment": "8 pages, 5 figures, accepted to ApJL", "summary": "Light orbiting an accreting black hole may impact the disk or jet multiple\ntimes before escaping to the observer, at a variety of angles with respect to\nthe local magnetic field. In this letter, we characterize the imprints of these\nlong path lengths and disparate magnetic field impacts in synchrotron spectra\nof hot accretion disks, as the strongly lensed ``photon ring'' exhibits a\nhigher synchrotron turnover frequency in each lensed sub-image. We apply tools\nof varying complexity: first, we develop a minimal, unlensed one-zone model\nthat isolates the first two sub-images of the accretion flow. By varying the\nmagnetic field geometry encountered by each sub-image, we show that distinctive\nspectral signatures emerge in both total intensity and fractional linear\npolarization. Second, we examine a semi-analytic radiatively inefficient\naccretion flow (RIAF) model, in which we find that there is generally a\nfrequency at which the first indirect image outshines the direct image even in\ntotal flux density. Lastly, we demonstrate that even general relativistic\nmagnetohydrodynamic (GRMHD) simulation snapshots show this spectral character.\nWe find a typical correction to the unresolved spectrum of order $10\\%$ near\nthe turnover frequency that grows with increasing viewing inclination, growing\nto order unity at higher frequencies. We predict sensitive spectral studies of\nthe cores of Messier 87* and Sagittarius A* at frequencies exceeding $300$ GHz\nto constrain the existence of the photon ring even without imaging, with\nprospects for photon ring detection even in other sources with unresolved\nshadows."}
{"id": "2511.03760", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2511.03760", "abs": "https://arxiv.org/abs/2511.03760", "authors": ["A. Bulgarelli", "N. Parmiggiani", "L. Castaldini", "R. Falco", "A. Di Piano", "V. Fioretti", "G. Panebianco", "A. Rizzo"], "title": "The Real-Time Data Processor Framework for Data Handling and Analysis of High-Energy Instruments", "comment": "4 pages, 2 figures, proceeding of Astronomical Data Analysis Software\n  and System XXXIV (2024), to appear in the ASP conference series", "summary": "We implemented a real-time data processor (rta-dp) framework that can be used\nto develop real-time analysis pipelines and data handling systems to manage\nhigh-throughput data streams with distributed applications in the context of\nground and space astrophysical projects and high-energy instruments. The rta-dp\nis based on the ZeroMQ in-memory communication framework to receive input data,\nshare data between distributed processes, and send or receive commands and\npipeline configuration. The rta-dp framework has a flexible architecture that\nallows the implementation of distributed analysis systems customized to the\nrequirements of several scenarios. The rta-dp framework also provides\nmonitoring capabilities for the running processes and sends housekeeping,\nlogging, alarms, and informative messages that a monitoring process can\nacquire. We are using the rta-dp in several contexts, such as acquiring and\nprocessing data from X-ray detectors to the data quality system of the ASTRI\nProject, as well as reprocessing and archiving data."}
{"id": "2511.03926", "categories": ["astro-ph.HE", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2511.03926", "abs": "https://arxiv.org/abs/2511.03926", "authors": ["Yize Dong", "V. Ashley Villar", "Anya Nugent", "Griffin Hosseinzadeh", "Ryan J. Foley", "Christa Gall", "Monica Gallegos-Garcia", "Conor Ransome", "Aidan Sedgewick", "Daichi Tsuna", "Stefano Valenti", "Henna Abunemeh", "Moira Andrews", "Katie Auchettl", "K. Azalee Bostroem", "David A. Coulter", "Thomas de Boer", "Kaylee de Soto", "Diego A. Farias", "Joseph Farah", "Danielle Frostig", "Hua Gao", "Alex Gagliano", "Emily Hoang", "D. Andrew Howell", "Willem B. Hoogendam", "Mark E. Huber", "David O. Jones", "Chien-Cheng Lin", "Michael Lundquist", "Curtis McCully", "Darshana Mehta", "Anthony L. Piro", "Aravind P. Ravi", "Nicolás Meza Retamal", "César Rojas-Bravo", "S. Karthik Yadavalli", "Qinan Wang"], "title": "Spectral Diversity in Type Ibn Supernovae and the Large Host Offset of SN2024acyl", "comment": null, "summary": "In this paper, we first present observations of SN~2024acyl, a normal Type\nIbn supernova with a large projected offset ($\\sim$35~kpc) from its host\ngalaxy. The low star-formation rate measured at the explosion site raises the\npossibility that the progenitor of SN~2024acyl may not have been a massive\nstar. We then examine, more broadly, the spectral diversity of Type Ibn\nsupernovae around 20--35 days after peak brightness and identify two distinct\ngroups: Group I, which shows bluer rest-frame optical color and narrower He~I\nemission lines; and Group II, which shows redder rest-frame optical color and\nbroader He~I lines. Group~I also tends to show higher peak luminosities. The\ndiversity we identify appears to be closely connected to the diversity observed\naround peak and to persist into late phases ($>80$ days after peak). Given its\nredder color and broader He~I lines, we classify SN~2024acyl as belonging to\nGroup II. Based on the current dataset, we find no clear connection between\nthis spectral diversity and either the host environments of Type Ibn SNe or\ntheir pre-explosion activity. The observed diversity in Type Ibn SNe likely\nreflects differences in circumstellar material properties and/or explosion\nenergetics. These differences could result from a range of progenitor\nproperties, such as different helium star mass, orbital period and companion\ntype if they are in binary systems, and may indicate fundamentally diverse\nprogenitors. Whether a continuous distribution exists between the two groups\nremains to be determined and will require further data to explore."}
{"id": "2511.03910", "categories": ["astro-ph.IM", "astro-ph.HE", "hep-ex"], "pdf": "https://arxiv.org/pdf/2511.03910", "abs": "https://arxiv.org/abs/2511.03910", "authors": ["Nils Heyer", "Christian Glaser", "Thorsten Glüsenkamp", "Martin Ravn"], "title": "Event Reconstruction for Radio-Based In-Ice Neutrino Detectors with Neural Posterior Estimation", "comment": null, "summary": "The detection of ultra-high-energy (UHE) neutrinos in the EeV range is the\ngoal of current and future in-ice radio arrays at the South Pole and in\nGreenland. Here, we present a deep neural network that can reconstruct the main\nneutrino properties of interest from the raw waveforms recorded by the radio\nantennas: the neutrino direction, the energy of the particle shower induced by\nthe neutrino interaction, and the event topology, thereby estimating the\nneutrino flavor. For the first time, we predict the full posterior PDF for the\nenergy and direction reconstruction via neural posterior estimation utilizing\nconditional normalizing flows, enabling event-by-event uncertainty prediction.\nWe improve over previous reconstruction algorithms and obtain a median\nresolution of 0.30 log(E) and 18 square degrees for a 'shallow' detector\ncomponent and 0.08 log(E) and 28 square degrees for a 'deep' detector component\nfor neutral current (NC) events at a shower energy of 1 EeV. This deep learning\napproach also allows us to reconstruct the more stochastic $\\nu_e$ - charged\ncurrent (CC) events. We quantify the impact of different antenna types and\nsystematic uncertainties on the reconstruction and derive a goodness-of-fit\nscore to test the compatibility of measured neutrino signals with the Monte\nCarlo simulations used to train the neural network."}
{"id": "2511.03937", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2511.03937", "abs": "https://arxiv.org/abs/2511.03937", "authors": ["Kohei Kurahara", "Takuya Akahori", "Takumi Ohmura", "Shintaro Yoshiura", "Daisuke Ito", "Yik Ki Ma", "Kazuhiro Nakazawa", "Yuki Omiya", "Kosei Sakai", "Haruka Sakemi", "Motokazu Takizawa"], "title": "Origin and Evolution of the $Ω$ Structure in the Head-Tail Radio Galaxy of Abell 3322", "comment": "15 pages, 10 figures, Accepted to PASJ", "summary": "A head-tail galaxy is thought to be a radio galaxy with bent active galactic\nnuclei (AGN) jets interacting with the intracluster medium (ICM). Study of\nhead-tail galaxies provides us with fruitful insights into the mechanisms of\nshock waves and turbulence, as well as magnetic-field amplification and\ncosmic-ray acceleration. A recent MeerKAT observation revealed that a head-tail\ngalaxy in the galaxy cluster, Abell 3322, exhibits a peculiar ``Omega\"\nstructure in its shape. In this paper, we investigated this Omega-tail galaxy\nusing the upgraded Giant Meterwave Radio Telescope (GMRT) and the Australia\nTelescope Compact Array (ATCA). We found that the southern jet tends to be\nbrighter than the northern jet, with a brightness ratio of about 2. This can be\nattributed to Doppler boost and the inclination of the jets. Our broadband data\nsuggest that the radio spectrum becomes steeper along the jet propagation\ndirection, and the cosmic-ray aging model with a weak reacceleration of cosmic\nrays is preferable to explain the index profile. We further found a gradient of\nthe spectral index perpendicular to the jet propagation. We discussed the\norigin of the gradient and suggested that a shock wave along one side of the\njets is present. The resultant ram pressure as well as the backflow made at the\nearly stage of the jet may produce the tail component of this Omega-tail\ngalaxy, while the observed Omega-shape structure is more likely due to a twin\nvortex seen in the low Reynolds number flow."}
{"id": "2511.04122", "categories": ["astro-ph.IM", "astro-ph.CO"], "pdf": "https://arxiv.org/pdf/2511.04122", "abs": "https://arxiv.org/abs/2511.04122", "authors": ["Adiba Amira Siddiqa", "Sayed Shafaat Mahmud", "Cosmin Ilie"], "title": "Neural Network identification of Dark Star Candidates. II. Spectroscopy", "comment": "9 pages, 4 figures, submitted to the Astrophysical Journal", "summary": "Some of the first stars in the Universe might be powered by Dark Matter (DM)\nannihilations, rather than nuclear fusion. Those objects, i.e. Dark stars (DS),\noffer a unique window into understanding DM via the observational study of the\nformation and evolution of the first stars and their Black Hole (BH) remnants.\nIn \\cite{NNSMDSPhot} (Paper~I) we introduced a feedforward neural network\n(FFNN) trained on synthetic DS photometry in order to detect and characterize\ndark star {\\it photometric} candidates in the early universe based on data\ntaken with the NIRCam instrument onboard the James Webb Space Telescope (JWST).\nIn this work we develop a FFNN trained on synthetic DS spectra in order to\nidentify {\\it spectroscopic} dark star candidates in the data taken with JWST's\nNIRSpec instrument. In order to validate our FFNN model we apply it to real\ndata for the four spectroscopic Supermassive Dark Star (SMDS) candidates\nrecently identified in \\cite{ilie2025spectroscopicsupermassivedarkstar} and\nreconfirm that indeed \\JADESeleven, \\JADESzthirteen, \\JADESfz, and \\JADESfo\nhave spectra that are consistent with those of Supermassive Dark Stars. The\nmain advantage of our FFNN model, in comparison to the Nedleaer-Mead Monte\nCarlo parameter estimator used in\n\\cite{ilie2025spectroscopicsupermassivedarkstar}, is that the approach\nintroduced here predicts parameters in milliseconds, over 10,000 times faster\nthan the traditional method used in\n\\cite{ilie2025spectroscopicsupermassivedarkstar}. With this in mind, the FFNN\nmodel we developed and validated in this work will be adapted for Bayesian\nuncertainty analyses and automatic analyses of NIRSpec publicly available data\nfor high redshift objects. This study establishes a robust and efficient tool\nfor probing Dark Stars and understanding their role in cosmic evolution."}
{"id": "2511.04202", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2511.04202", "abs": "https://arxiv.org/abs/2511.04202", "authors": ["Ji-Shun Lian", "Ze-Rui Wang", "Jin Zhang"], "title": "Hadronic Processes in Advection-Dominated Accretion Flow as the Origin of TeV Excesses in BL Lac Objects", "comment": "13 pages, 6 Figures, 1 Table. Accepted for publication in ApJ", "summary": "The spectral energy distributions (SEDs) of certain BL Lac objects (BL Lacs)\nexhibit an additional hard $\\gamma$-ray component in the TeV energy range that\nsurpasses the predictions of the one-zone leptonic jet model. The origin of\nthis excess emission remains unclear. In this study, we selected five BL Lacs\nwhose SEDs display a very hard intrinsic spectrum in the TeV band and\nsuccessfully reproduced their broadband SEDs using a two-zone lepto-hadronic\nmodel. Within this framework, the emission observed in the optical, X-ray, GeV\n$\\gamma$-ray, and sub-TeV $\\gamma$-ray bands is modeled using the synchrotron\nand synchrotron self-Compton radiation processes of the relativistic electrons\nin the jets. Meanwhile, the TeV excess is attributed to $\\gamma$-ray emission\nresulting from the photomeson ($p\\gamma$) process via $\\pi^0$ decay occurring\nwithin advection-dominated accretion flows (ADAFs). This scenario requires a\nhard proton spectrum with a spectral index of $p \\sim 1.6-1.7$ and a cutoff\nenergy ranging from 30 to 90 TeV, as well as a relatively large ADAF radius.\nSuch hard proton spectra suggest that the dominant acceleration mechanisms are\nlikely magnetic reconnection and/or stochastic acceleration processes within\nADAFs. Additionally, the emission from the cascaded electrons results in a bump\nin the keV--MeV band; however, it is overwhelmed by the jet emission. Although\nthe hadronuclear ($pp$) process cannot be entirely ruled out, it would\nnecessitate an even harder proton spectrum and a higher cutoff energy compared\nto the $p\\gamma$ process, making it a less favorable explanation for the\nobserved TeV excess."}
{"id": "2511.04429", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2511.04429", "abs": "https://arxiv.org/abs/2511.04429", "authors": ["Pablo Gómez", "Laslo Erik Ruhberg", "Kristin Anett Remmelgas", "David O'Ryan"], "title": "Cutana: A High-Performance Tool for Astronomical Image Cutout Generation at Petabyte Scale", "comment": "To be presented at ADASS 2025", "summary": "The Euclid Quick Data Release 1 (Q1) encompasses 30 million sources across\n63.1 square degrees, marking the beginning of petabyte-scale data delivery\nthrough Data Release 1 (DR1) and subsequent releases. Systematic exploitation\nof such datasets requires extracting millions of source-specific cutouts, yet\nstandard tools like Astropy's Cutout2D process sources individually, creating\nbottlenecks for large catalogues. We introduce Cutana, a memory-efficient\nsoftware tool optimised for batch processing in both local and cloud-native\nenvironments. Cutana employs vectorised NumPy operations to extract cutout\nbatches simultaneously from FITS tiles, implements automated memory-aware\nscheduling, and supports both Zarr and FITS output formats with multiple common\nnormalisation schemes (asinh, log, zscale). Cutana outperforms Astropy in all\ntested Q1 subset scenarios achieving near linear scaling and processing\nthousands of cutouts per second. On just four worker threads, Cutana can\nprocess all of Q1 in under four hours. The tool includes an ipywidget interface\nfor parameter configuration and real-time monitoring. Integration with ESA\nDatalabs is underway for the Euclid DR1 release, with open-source release\npending ESA open-source licensing processes."}
{"id": "2511.04264", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.04264", "abs": "https://arxiv.org/abs/2511.04264", "authors": ["Qing-Cang Shui", "Shu Zhang", "Shuang-Nan Zhang", "Hua Feng", "Yu-Peng Chen", "Long Ji", "Ling-Da Kong", "Liang Zhang", "Jing-Qiang Peng", "Peng-Ju Wang"], "title": "Revealing an Oscillating and Contracting Compact Corona near the Event Horizon of the Supermassive Black Hole in 1ES 1927+654", "comment": "17 pages, 11 figures, submitted, comments are welcome", "summary": "Dynamic processes in the accretion flow near black holes produce X-ray flux\nvariability, sometimes quasi-periodic. Determining its physical origin is key\nto mapping accretion geometry but remains unresolved. We perform a novel\nphase-resolved analysis on a newly discovered quasi-periodic oscillation (QPO)\nin the active galactic nucleus 1ES 1927+654. For the first time in a\nsupermassive black hole (SMBH), we detect a unique `U'-shaped QPO lag-energy\nspectrum and observe coronal spectral variability over the QPO phase. We find\nthat the QPO is adequately explained by plasma resonant oscillations within a\ncorona. Modeling of QPO spectral properties and reverberation mapping reveal\nthat the corona is contracting and confined to only a few gravitational radii\nregions near the SMBH, consistent with theoretical predictions for a decreasing\nQPO period of near 10 minutes. These results present the first observational\nevidence for an oscillating and contracting compact corona around an SMBH."}
{"id": "2511.04282", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.04282", "abs": "https://arxiv.org/abs/2511.04282", "authors": ["L. Ducci", "S. Mereghetti", "F. Pintore", "S. Allak", "A. Santangelo", "M. Sasaki", "P. Kavanagh"], "title": "Discovery of a 9.67-s pulsar in an ultraluminous X-ray source in NGC 4631 with XMM-Newton", "comment": "Accepted for publication in ApJ Letters", "summary": "Thanks to a recent observation with XMM-Newton, we discovered periodic\npulsations at P= 9.6652 +/- 0.0002 s in a new ultraluminous X-ray source (ULX)\nin the galaxy NGC 4631. This source, dubbed as X-8, shows one of the largest\nspin-up rates ever observed, dP/dt = (-9.6 +/- 0.5)*1E-8 s/s. These findings\nindicate that the compact object is a neutron star, and X-8 is a new member of\nthe pulsating ULX class. The 0.3-10 keV luminosity of X-8 is ~3.4E39 erg/s, and\nits X-ray spectrum can be described by an absorbed disk blackbody or a cut-off\npower law, similar to what is observed in other pulsating ULXs. We discuss two\npossible causes for the large spin-up rate: Doppler shift from orbital motion\nof the neutron star and intrinsic spin-up due to accretion torque. This new ULX\npulsar adds a key source to the small known population, and will enable future\nstudies to better constrain the physical mechanisms responsible for their\nsuper-Eddington luminosities."}
{"id": "2511.04433", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.04433", "abs": "https://arxiv.org/abs/2511.04433", "authors": ["F. Tavecchio"], "title": "The TeV emission of 3C273: inverse Compton radiation from shear-accelerated high-energy electrons in the large-scale jet?", "comment": "4 pages, 3 figures, accepted for publication in A&A", "summary": "The VERITAS Collaboration recently reported the detection of very-high-energy\n(VHE) gamma-ray emission from the prototypical radio quasar 3C273. The temporal\nand the spectral properties of this component do not appear compatible with the\nextrapolation of the beamed blazar-like emission of the inner, pc-scale jet. We\nexplore the possibility that the VHE component is produced in the jet at kpc\nscale through the inverse Compton emission of a population of ultra-high energy\nelectrons (with Lorentz factor $\\gamma\\sim 10^8$). In the model these electrons\nare accelerated through the shear acceleration mechanism, and they also account\nfor the still puzzling X-ray emission of knots detected by {\\it Chandra} in the\nlarge-scale jets of several powerful quasars (including 3C273). In our scenario\nthe VHE component can be interpreted as the integrated emission from the two\nbrightest knots of the 3C273 jet. We speculate that the decay of the emission\non the timescale of $\\sim 3$ years could be accounted for by the scenario if\nthe VHE radiation is produced in some compact regions in the downstream flow of\na recollimation shock."}
{"id": "2511.04540", "categories": ["astro-ph.HE", "gr-qc"], "pdf": "https://arxiv.org/pdf/2511.04540", "abs": "https://arxiv.org/abs/2511.04540", "authors": ["Lorenz Zwick", "Kai Hendriks", "Pankaj Saini", "János Takátsy", "Connar Rowan", "Johan Samsing", "Jakob Stegmann"], "title": "Environmental effects in stellar mass gravitational wave sources II: Joint detections of eccentricity and phase shifts in binary sub-populations", "comment": "Submitted to ApJ, comments welcome!", "summary": "We demonstrate that the properties of eccentric gravitational wave (GW)\nsignals enhance the detectability of GW phase shifts caused by environmental\neffects (EEs): The signal-to-noise ratio (SNR) of EEs can be boosted by up to\n$\\ell_{\\rm max}^{1 - n}$ with respect to corresponding circular signals, where\n$\\ell_{\\rm max}$ is the highest modeled eccentric GW harmonic and $n$ is the\nfrequency scaling of the GW dephasing prescription associated to the EE. We\ninvestigate the impact on a population level, adopting plausible eccentricity\ndistributions for binary sources observed by LIGO/Virgo/Kagra (A+ and A\\#\nsensitivities), as well as Cosmic Explorer (CE) and the Einstein Telescope\n(ET). For sources in the high eccentricity tail of a distribution ($e \\gtrsim\n0.2$ at 10 Hz), phase shifts can systematically be up to $\\ell_{\\rm max}^{1 -\nn}$ times smaller than in a corresponding circular signal and still be\ndetectable. For typical EEs, such as Roemer delays and gas drag, this effect\namounts to SNR enhancements that range from $10^2$ up to $10^5$. For CE and ET,\nour analysis shows that EEs will be an ubiquitous feature in the eccentric tail\nof merging binaries, regardless of the specific details of the formation\nchannel. Additionally, we find that the joint analysis of eccentricity and\nphase shift is already plausible in current catalogs if a fraction of binaries\nmerge in AGN migration traps."}
{"id": "2511.04663", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.04663", "abs": "https://arxiv.org/abs/2511.04663", "authors": ["Ryan Golant", "Luca Comisso", "Philipp Kempski", "Lorenzo Sironi"], "title": "Intermittency in Collisionless Large-Amplitude Turbulence", "comment": null, "summary": "Large-amplitude turbulence -- characterized by a fluctuating magnetic field\ncomponent, $\\delta B$, that is stronger than the mean component, $B_0$ -- is\ngenerically intermittent, populated with intense localized structures such as\nsharp field-line bends and rapid field reversals. Recent MHD simulations\nsuggest that these structures play an important role in particle transport and\nacceleration; however, MHD is inapplicable in most of our Universe, where the\nplasma is so hot or diffuse that Coulomb collisions are negligible. Therefore,\nin this paper, we analyze the intermittent properties of collisionless\nlarge-amplitude turbulence in electron-positron plasmas via fully kinetic 3D\nsimulations, exploring a wide range of $\\delta B / B_0$ and scale separations\nbetween the turbulence driving scale, $L$, and kinetic scales, $c/\\omega_{\\rm\np}$. The steady-state collisionless turbulence in our simulations broadly\nresembles that of MHD, but the development of pressure anisotropy steepens the\nscaling between magnetic field strength, $B$, and scalar field-line curvature,\n$K_\\parallel$ -- yielding $B \\propto K_\\parallel^{-3/4}$ -- and consequently\nmodifies the power-law slope of the probability density function of\n$K_\\parallel$; this slope hardens from $K_\\parallel^{-2.5}$ to\n$K_\\parallel^{-2.0}$ as $\\delta B / B_0$ increases from 4 to 140. Pressure\nanisotropy also triggers mirror and firehose instabilities, with the\nvolume-filling fractions of these fluctuations increasing with $\\delta B /\nB_0$; for our largest $\\delta B / B_0$, $20\\%$ of the volume is mirror-unstable\nand $6\\%$ is firehose-unstable. Both the curvature and the Larmor-scale\nfluctuations in collisionless large-amplitude turbulence are expected to\nsignificantly influence cosmic ray transport and acceleration in the\ninterstellar medium of our Galaxy and the intracluster medium of galaxy\nclusters."}
{"id": "2511.03910", "categories": ["astro-ph.IM", "astro-ph.HE", "hep-ex"], "pdf": "https://arxiv.org/pdf/2511.03910", "abs": "https://arxiv.org/abs/2511.03910", "authors": ["Nils Heyer", "Christian Glaser", "Thorsten Glüsenkamp", "Martin Ravn"], "title": "Event Reconstruction for Radio-Based In-Ice Neutrino Detectors with Neural Posterior Estimation", "comment": null, "summary": "The detection of ultra-high-energy (UHE) neutrinos in the EeV range is the\ngoal of current and future in-ice radio arrays at the South Pole and in\nGreenland. Here, we present a deep neural network that can reconstruct the main\nneutrino properties of interest from the raw waveforms recorded by the radio\nantennas: the neutrino direction, the energy of the particle shower induced by\nthe neutrino interaction, and the event topology, thereby estimating the\nneutrino flavor. For the first time, we predict the full posterior PDF for the\nenergy and direction reconstruction via neural posterior estimation utilizing\nconditional normalizing flows, enabling event-by-event uncertainty prediction.\nWe improve over previous reconstruction algorithms and obtain a median\nresolution of 0.30 log(E) and 18 square degrees for a 'shallow' detector\ncomponent and 0.08 log(E) and 28 square degrees for a 'deep' detector component\nfor neutral current (NC) events at a shower energy of 1 EeV. This deep learning\napproach also allows us to reconstruct the more stochastic $\\nu_e$ - charged\ncurrent (CC) events. We quantify the impact of different antenna types and\nsystematic uncertainties on the reconstruction and derive a goodness-of-fit\nscore to test the compatibility of measured neutrino signals with the Monte\nCarlo simulations used to train the neural network."}
