{"id": "2511.14997", "categories": ["astro-ph.IM", "astro-ph.HE", "gr-qc"], "pdf": "https://arxiv.org/pdf/2511.14997", "abs": "https://arxiv.org/abs/2511.14997", "authors": ["Pratyusava Baral", "Cody Messick", "Patrick Brady"], "title": "A Neural Network Approach to Preferred Event Selection for Low-Latency Gravitational-Wave Alerts", "comment": "24 pages, 7 figures", "summary": "The LIGO-Virgo-KAGRA collaboration uses multiple independent search pipelines to detect gravitational waves, often resulting in multiple triggers (g-events) for a single astrophysical source. These triggers are grouped into superevents, raising a critical question for multimessenger astronomy: which g-event provides the most accurate sky localization for electromagnetic follow-up? Currently, the g-event with the highest signal-to-noise ratio (SNR) is selected, under the assumption that it should provide the best estimators of the source's parameters, including its location on the sky. Analysis of simulated signals reveals systematic deviations from this expectation. In particular, a false-alarm rate (FAR)-based selector performs slightly better than the SNR-based method, but introduces pipeline biases. We present a neural network-based selector trained on simulated signals to identify the g-event with the minimum searched area -- a metric quantifying localization accuracy. The network uses information (detector SNRs, FAR, and chirp mass) from all of the triggers associated with each astrophysical source and is designed to be pipeline-agnostic. Our results show that the neural network outperforms both traditional selectors, achieving a mean searched area ~2% smaller than the SNR-based selector. Unlike FAR-based selection, the neural network preserves the underlying distribution of pipeline contributions, avoiding systematic biases toward specific pipelines. The network can be trained in approximately one minute on a few thousand events and performs event selection instantaneously, making it suitable for low-latency applications. These results demonstrate that machine learning can enhance multimessenger astronomy capabilities while maintaining fairness across detection pipelines. We recommend implementing this approach for future observing runs."}
{"id": "2511.15471", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2511.15471", "abs": "https://arxiv.org/abs/2511.15471", "authors": ["A. Striffling", "C. -T. Héritier", "R. J. -L Fétick", "O. Fauvarque", "J. -F Sauvage", "A. Carlotti", "B. Neichel T. Fusco"], "title": "Optical gains measurement with a gain scheduling camera: On-sky demonstration with PAPYRUS and perspectives", "comment": "10 pages, 10 figures, 3 tables", "summary": "Reaching the high angular resolution and contrast level desired for exoplanetary science requires us to equip large telescopes with extreme adaptive optics (XAO) systems to compensate for the effect of the atmospheric turbulence at a very fast rate. This calls for the development of ultra-sensitive wavefront sensors (WFSs), such as Fourier filtering wavefront sensors (FFWFSs), to be operated at low flux, as well as an increase in the XAO loop frame rate. These sensors, which constitute the baseline for current and future XAO systems, exhibit such a high sensitivity at the expense of a non-linear behaviour that must be properly calibrated and compensated for to deliver the required performance. We aim to validate on-sky a recently proposed method that associates the FFWFS with a focal plane detector, the gain scheduling camera (GSC), to estimate in real time the first-order terms of the sensor non-linearities, known as modal optical gains. We implemented a GSC on the adaptive-optics (AO) bench PAPYRUS to be associated with the existing pyramid wavefront sensor (PWFS). We compared experimental results to expected results obtained with a high-fidelity numerical twin of the AO system. We validated experimentally the method both in laboratory and on-sky. We demonstrated the capability of the GSC to accurately estimate the optical gains of the PWFS at 100 Hz, corresponding to the current limit in speed imposed by PAPYRUS hardware, but it could be applied at higher frequencies to enable frame-by-frame optical gains tracking. The presented results exhibit good agreement on the optical gains estimation with respect to numerical simulations reproducing the experimental conditions tested. Our experimental results validate the strategy of coupling a FFWFS with a focal-plane camera to master the non-linearities of the sensor. This demonstrates its attractiveness for future XAO application."}
{"id": "2511.15475", "categories": ["astro-ph.IM", "astro-ph.CO"], "pdf": "https://arxiv.org/pdf/2511.15475", "abs": "https://arxiv.org/abs/2511.15475", "authors": ["V. Bonjean", "A. Gkogkou", "J. L. Starck", "P. Tsakalides"], "title": "LCS: A Learnlet-Based Sparse Framework for Blind Source Separation", "comment": "11 pages, 8 figures", "summary": "Blind source separation (BSS) plays a pivotal role in modern astrophysics by enabling the extraction of scientifically meaningful signals from multi-frequency observations. Traditional BSS methods, such as those relying on fixed wavelet dictionaries, enforce sparsity during component separation, but may fall short when faced with the inherent complexity of real astrophysical signals. In this work, we introduce the Learnlet Component Separator (LCS), a novel BSS framework that bridges classical sparsity-based techniques with modern deep learning. LCS utilizes the Learnlet transform: a structured convolutional neural network designed to serve as a learned, wavelet-like multiscale representation. This hybrid design preserves the interpretability and sparsity, promoting properties of wavelets while gaining the adaptability and expressiveness of learned models. The LCS algorithm integrates this learned sparse representation into an iterative source separation process, enabling effective decomposition of multi-channel observations. While conceptually inspired by sparse BSS methods, LCS introduces a learned representation layer that significantly departs from classical fixed-basis assumptions. We evaluate LCS on both synthetic and real datasets, demonstrating superior separation performance compared to state-of-the-art methods (average gain of about 5 dB on toy model examples). Our results highlight the potential of hybrid approaches that combine signal processing priors with deep learning to address the challenges of next-generation cosmological experiments."}
{"id": "2511.15511", "categories": ["astro-ph.IM", "astro-ph.EP"], "pdf": "https://arxiv.org/pdf/2511.15511", "abs": "https://arxiv.org/abs/2511.15511", "authors": ["Jamila Taaki", "Farzad Kamalabadi", "Athol Kemball", "Lia Corrales", "Alfred O. Hero"], "title": "Efficient Exoplanet Imaging Simulations of the Habitable Worlds Observatory", "comment": "23 pages, accepted to AJ", "summary": "Direct imaging simulations of starshades and other proposed mission concepts are needed to characterize planet detection performance and inform mission design trades. In order to assess the complementary role of a 60 m starshade for the Habitable Worlds Observatory (HWO), we develop the optical model of a starshade and simulate solar system imaging at 0 degrees and 60 degrees inclinations. The optical core throughput of a direct-imaging system is a key metric that governs exposure time and the potential exoplanetary yield of a mission. We use our optical model to evaluate core throughput, incorporating 6 m segmented and obscured telescope apertures, over the visible to near-infrared wavelength band (500-1000 nm). Accurate diffractive optical simulations of this form require many large Fourier transforms, with prohibitive run-times, as both the starshade mask and telescope aperture require fine-scale spatial sampling. We introduce a Fourier sampling technique, the Bluestein Fast Fourier Transform (BFFT), to efficiently simulate diffractive optics and enable high-fidelity simulations of core throughput. By characterizing sampling requirements and comparing BFFT's computational complexity to standard Fourier methods (for example, DFT and FFT), we demonstrate its efficiency in our optical pipeline. These methods are implemented in PyStarshade (Taaki 2025), an open-source Python package offering flexible diffraction tools and imaging simulations for starshades. Our results show the HWO starshade used with a segmented off-axis telescope aperture achieves an optimal core throughput measured within a photometric aperture of radius 0.7 lambda/D of 68 percent. With an additionally obscured aperture, a 66 percent core throughput is achieved."}
{"id": "2511.14836", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2511.14836", "abs": "https://arxiv.org/abs/2511.14836", "authors": ["Joseph M. Michail", "Sebastiano D. von Fellenberg", "Garrett K. Keating", "Ramprasad Rao", "Tamojeet Roychowdhury", "S. P. Willner", "Nicole M. Ford", "Daryl Haggard", "Sera Markoff", "Alexander Philippov", "Bart Ripperda", "Sophia Sánchez-Maes", "Zach Sumners", "Gunther Witzel", "Mayura Balakrishnan", "Sunil Chandra", "Kazuhiro Hada", "Macarena Garcia Marin", "Mark A. Gurwell", "Giovanni G. Fazio", "Joseph L. Hora", "Braden Seefeldt-Gail", "Howard A. Smith"], "title": "First Mid-infrared Detection and Modeling of a Flare from Sgr A*. II. Mid-IR Spectral Energy Distribution and Millimeter Polarimetry", "comment": "20 pages, 8 figures, submitted to ApJ; revised version posted after minor referee comments addressed. Extinction companion paper posted to arXiv today (von Fellenberg et al.) and aperture correction results are used in IMBH constraint paper (Roychowdhury et al., 2025, PASP) also posted to arXiv today", "summary": "S. D. von Fellenberg et al. (2025a, Paper I) reported the first mid-infrared detection of a flare from Sgr A*. The JWST/MIRI/MRS observations were consistent with an orbiting hotspot undergoing electron injection with a spectrum that subsequently breaks from synchrotron cooling. However, mid-infrared extinction measurements appropriate for these data were not yet determined, and therefore the temporal evolution of the absolute spectral index remained unknown. This work applies new Galactic Center extinction measurements to the flare observations. The evolution of the spectral index after the peak is fully consistent with that reported in Paper I with a maximum absolute mid-infrared spectral index $α_{\\rm{MIR}}=0.45\\pm0.01_{\\rm{stat}}\\pm0.08_{\\rm{sys}}$ during the second mid-infrared flare peak, matching the known near-infrared spectral index during bright states ($α_{\\rm{NIR}}\\approx0.5$). There was a near-instantaneous change in the mid-infrared spectral index of $Δα_{\\rm{MIR}}=0.33\\pm0.06_{\\rm{stat}}\\pm0.11_{\\rm{sys}}$ at the flare onset. We propose this as a quantitative definition for this infrared flare's beginning, physically interpreted as the underlying electron distribution's transition into a hard power-law distribution. This paper also reports the SMA millimeter polarization during the flare, which shows a small, distorted, but overall clockwise-oriented Stokes Q--U loop during the third mid-infrared peak. Extrapolating the mid-infrared flux power law to the millimeter yields a variable flux consistent with the observed 220 GHz emission. These results, together with the Paper I modeling, plausibly suggest a single hotspot produced both the mid-infrared and millimeter variability during this event. However, additional flares are required to make a general statement about the millimeter and mid-infrared connection."}
{"id": "2511.15636", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2511.15636", "abs": "https://arxiv.org/abs/2511.15636", "authors": ["Valentina Scotti", "Antonio Anastasio", "Mario Bertaina", "Alfonso Boiano", "Rossella Caruso", "Cristian De Santis", "Vincenzo Masone", "Marco Mese", "Giuseppe Osteria", "Beatrice Panico", "Giuseppe Passeggio", "Francesco Perfetto", "Haroon Akhtar Qureshi", "Ester Ricci"], "title": "The Cherenkov Camera for the PBR mission", "comment": "ICRC 2025", "summary": "The POEMMA-Balloon with Radio (PBR) mission is a NASA super-pressure balloon experiment designed to advance the detection of ultra-high-energy cosmic rays, high-altitude horizontal air showers, and astrophysical neutrinos. A key instrument of PBR is the Cherenkov Camera (CC), which utilizes a 2048-pixel SiPM camera to detect the optical Cherenkov emission from cosmic-ray-induced air showers and search for upward-going signals indicative of neutrinos.\n  The CC operates in the 320-900 nm spectral range with a 10 ns integration time, leveraging a bi-focal optical design to enhance detection efficiency. The CC enables precise reconstruction of shower trajectories and provides valuable data on cosmic rays' composition and energy distribution. PBR's sub-orbital altitude is particularly advantageous for these measurements, offering a unique vantage point that bridges the observational gap between ground-based and space-based instruments. Additionally, the CC will play a critical role in neutrino searches, detecting tau-lepton decay showers from Earth-skimming neutrinos associated with astrophysical transients. By integrating the CC with fluorescence and radio detection systems, PBR will pioneer a multi-messenger approach to high-energy cosmic phenomena, refining observational techniques for future space-based missions.\n  This contribution will describe the current status of the development of the CC as well as its expected performance."}
{"id": "2511.14858", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2511.14858", "abs": "https://arxiv.org/abs/2511.14858", "authors": ["Vidushi Sharma", "Ronit Agarwala", "Judith L. Racusin", "Leo P. Singer", "Tyler Barna", "Eric Burns", "Michael W. Coughlin", "Dakota Dutko", "Courey Elliott", "Rahul Gupta", "Ashish Mahabal", "Nikhil Mukund"], "title": "Large Language Model Driven Analysis of General Coordinates Network (GCN) Circulars", "comment": "61 pages, 11 figures, 7 tables. Accepted for publication in ApJS", "summary": "The General Coordinates Network (GCN) is NASA's time-domain and multi-messenger alert system. GCN distributes two data products - automated ``Notices,'' and human-generated ``Circulars,'' that report the observations of high-energy and multi-messenger astronomical transients. The flexible and non-structured format of GCN Circulars, comprising of more than 40500 Circulars accumulated over three decades, makes it challenging to manually extract observational information, such as redshift or observed wavebands. In this work, we employ large language models (LLMs) to facilitate the automated parsing of transient reports. We develop a neural topic modeling pipeline with open-source tools for the automatic clustering and summarization of astrophysical topics in the Circulars database. Using neural topic modeling and contrastive fine-tuning, we classify Circulars based on their observation wavebands and messengers. Additionally, we separate gravitational wave (GW) event clusters and their electromagnetic (EM) counterparts from the Circulars database. Finally, using the open-source Mistral model, we implement a system to automatically extract gamma-ray burst (GRB) redshift information from the Circulars archive, without the need for any training. Evaluation against the manually curated Neil Gehrels Swift Observatory GRB table shows that our simple system, with the help of prompt-tuning, output parsing, and retrieval augmented generation (RAG), can achieve an accuracy of 97.2 % for redshift-containing Circulars. Our neural search enhanced RAG pipeline accurately retrieved 96.8 % of redshift circulars from the manually curated database. Our study demonstrates the potential of LLMs, to automate and enhance astronomical text mining, and provides a foundation work for future advances in transient alert analysis."}
{"id": "2511.15644", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2511.15644", "abs": "https://arxiv.org/abs/2511.15644", "authors": ["Valentina Scotti", "Antonio Anastasio", "Alfonso Boiano", "Francesco Cafagna", "Vincenzo Masone", "Marco Mese", "Giuseppe Osteria", "Giuseppe Passeggio", "Francesco Perfetto", "Haroon Akhtar Qureshi"], "title": "The data processing system of the POEMMA-Balloon with Radio mission", "comment": null, "summary": "The POEMMA-Balloon with Radio (PBR) mission incorporates an advanced data processing system (DP) to enable the detection and characterization of ultra-high-energy cosmic rays and astrophysical neutrinos. The data acquisition (DAQ) system integrates inputs from the Cherenkov Camera, the Fluorescence Camera, the Radio Instrument and the X-Gamma detectors, ensuring synchronized event detection. Built upon the heritage of the EUSO-SPB2 DAQ architecture, the system has been adapted to support both the hybrid focal surface and radio instrumentation.\n  The DP features two redundant CPUs, differential GPS receivers, and environmental monitoring capabilities, including temperature, humidity, and gyroscope-based orientation tracking. A central clock board synchronizes data collection across all instruments, ensuring precise event reconstruction. The main trigger and clock board manages trigger signals from different detectors, supporting both joint and independent data acquisition modes. These advancements enhance the mission's contribution to multi-messenger astrophysics and provide valuable insights for future space-based observatories.\n  In this paper, we describe the system's main components and the design developed for this new mission."}
{"id": "2511.14863", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.14863", "abs": "https://arxiv.org/abs/2511.14863", "authors": ["S. D. von Fellenberg", "R. Arcodia", "P. Benke", "A. Goodwin", "Y. Y. Kovalev", "E. Ros", "M. Janssen", "M. Giustini", "G. Miniutti"], "title": "Radio properties of the quasi-periodic eruption source RXJ1301.9+2747 at parsec scales", "comment": "Accepted for publication in A&A", "summary": "Quasi-periodic eruptions (QPEs) are repeating soft X-ray flares associated with galactic nuclei. Several recent works have found evidence that the accretion flow in the galactic nuclei of QPEs is of recent origin, and that it is unlike canonical active galactic nuclei (AGN). A precursor tidal disruption event has been observed in a few cases. In this work we report new radio observations of the QPE host galaxy RXJ\\,1301.9+2747 taken at 5.0\\,GHz with the High Sensitivity Array (HSA), to complement archival 1.7\\,GHz observations reported previously. Our new observations confirm the presence of a highly compact radio source in RXJ\\,1301.9+2747, which is smaller than $0.9\\times0.4~\\mathrm{pc}$ at 5.0\\,GHz. The nonsimultaneous very long baseline interferometry (VLBI) compact flux of the source is consistent with a negative spectral index, and thus is similar to the larger non-VLBI scale radio spectral index. Contrary to earlier results at 1.7\\,GHz, we find the 5\\,GHz emission offset from the optical Gaia position, which may be due to dust extinction in the host galaxy. In addition, there is a significant offset between the 1.7 and 5.0\\,GHz data, which may result from astrophysical uncertainties in the calibration source. This sheds new light on the elusive properties of the radio-detected QPE sources. Consistent with previous results, our observations disfavor a star formation or jet-core-region origin of the radio emission. We cannot rule out a reconnection-driven scenario for the radio emission, but we favor a remnant jet or outflow scenario. This is overall in agreement with the radio properties of radio-detected QPE sources at lower angular resolution."}
{"id": "2511.14858", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2511.14858", "abs": "https://arxiv.org/abs/2511.14858", "authors": ["Vidushi Sharma", "Ronit Agarwala", "Judith L. Racusin", "Leo P. Singer", "Tyler Barna", "Eric Burns", "Michael W. Coughlin", "Dakota Dutko", "Courey Elliott", "Rahul Gupta", "Ashish Mahabal", "Nikhil Mukund"], "title": "Large Language Model Driven Analysis of General Coordinates Network (GCN) Circulars", "comment": "61 pages, 11 figures, 7 tables. Accepted for publication in ApJS", "summary": "The General Coordinates Network (GCN) is NASA's time-domain and multi-messenger alert system. GCN distributes two data products - automated ``Notices,'' and human-generated ``Circulars,'' that report the observations of high-energy and multi-messenger astronomical transients. The flexible and non-structured format of GCN Circulars, comprising of more than 40500 Circulars accumulated over three decades, makes it challenging to manually extract observational information, such as redshift or observed wavebands. In this work, we employ large language models (LLMs) to facilitate the automated parsing of transient reports. We develop a neural topic modeling pipeline with open-source tools for the automatic clustering and summarization of astrophysical topics in the Circulars database. Using neural topic modeling and contrastive fine-tuning, we classify Circulars based on their observation wavebands and messengers. Additionally, we separate gravitational wave (GW) event clusters and their electromagnetic (EM) counterparts from the Circulars database. Finally, using the open-source Mistral model, we implement a system to automatically extract gamma-ray burst (GRB) redshift information from the Circulars archive, without the need for any training. Evaluation against the manually curated Neil Gehrels Swift Observatory GRB table shows that our simple system, with the help of prompt-tuning, output parsing, and retrieval augmented generation (RAG), can achieve an accuracy of 97.2 % for redshift-containing Circulars. Our neural search enhanced RAG pipeline accurately retrieved 96.8 % of redshift circulars from the manually curated database. Our study demonstrates the potential of LLMs, to automate and enhance astronomical text mining, and provides a foundation work for future advances in transient alert analysis."}
{"id": "2511.14911", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2511.14911", "abs": "https://arxiv.org/abs/2511.14911", "authors": ["Brenna Mockler", "Erica Hammerstein", "Eric R. Coughlin", "Matt Nicholl"], "title": "Tidal Disruption Events", "comment": "A chapter for the Encyclopedia of Astrophysics (Edited by I. Mandel, section editor J. Andrews)", "summary": "Stars that orbit too close to a black hole can be ripped apart by strong tides, producing a type of luminous transient event called a ``tidal disruption event\" (TDE). Tidal disruption events of stars by supermassive black holes (SMBHs) provide windows into the nuclei of galaxies at size scales that are difficult to observe directly outside our own galactic neighborhood. They provide a unique opportunity to study these supermassive black holes under feeding conditions that change dramatically over ~week-month timescales, and that regularly reach super-Eddington mass inflow rates. Their light curves are dependent on the properties of the disrupting black hole, and can be used to help constrain the lower mass end of the SMBH mass function -- a region of parameter space that is difficult to access with classic dynamical mass measurements."}
{"id": "2511.15313", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2511.15313", "abs": "https://arxiv.org/abs/2511.15313", "authors": ["Zhi-Qiang Ding", "Xin-Qiao Li", "Da-Li Zhang", "Zheng-Hua An", "Zhen-Xia Zhang", "Roberto Battiston", "Roberto Iuppa", "Zhuo Li", "Yan-Qiu Zhang", "Yan Huang", "Chao Zheng", "Yan-Bing Xu", "Xiao-Yun Zhao", "Lu Wang", "Ping Wang", "Hong Lu"], "title": "A Method for Gamma-Ray Energy Spectrum Inversion and Correction", "comment": "The Astrophysical Journal has accepted", "summary": "Accurate spectral analysis of high-energy astrophysical sources often relies on comparing observed data to incident spectral models convolved with the instrument response. However, for Gamma-Ray Bursts and other high-energy transient events observed at high count rates, significant distortions (e.g., pile-up, dead time, and large signal trailing) are introduced, complicating this analysis. We present a method framework to address the model dependence problem, especially to solve the problem of energy spectrum distortion caused by instrument signal pile-up due to high counting rate and high-rate effects, applicable to X-ray, gamma-ray, and particle detectors. Our approach combines physics-based Monte Carlo (MC) simulations with a model-independent spectral inversion technique. The MC simulations quantify instrumental effects and enable correction of the distorted spectrum. Subsequently, the inversion step reconstructs the incident spectrum using an inverse response matrix approach, conceptually equivalent to deconvolving the detector response. The inversion employs a Convolutional Neural Network, selected for its numerical stability and effective handling of complex detector responses. Validation using simulations across diverse input spectra demonstrates high fidelity. Specifically, for 27 different parameter sets of the brightest gamma-ray bursts, goodness-of-fit tests confirm the reconstructed spectra are in excellent statistical agreement with the input spectra, and residuals are typically within $\\pm 2σ$. This method enables precise analysis of intense transients and other high-flux events, overcoming limitations imposed by instrumental effects in traditional analyses."}
{"id": "2511.14916", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.14916", "abs": "https://arxiv.org/abs/2511.14916", "authors": ["Aysha Aamer", "Matt Nicholl", "Charlotte Angus", "Shubham Srivastav", "Jeff Cooke", "Natasha Van Bemmel", "Frédérick Poidevin", "Stefan Geier", "Joseph P. Anderson", "Thomas de Boer", "Kenneth C. Chambers", "Ting-Wan Chen", "Mariusz Gromadzki", "Claudia P. Gutiérrez", "Erkki Kankare", "Réka Könyves-Tóth", "Chien-Cheng Lin", "Thomas B. Lowe", "Eugene Magnier", "Paolo Mazzali", "Kyle Medler", "Paloma Minguez", "Tomás E. Müller-Bravo", "Ben Warwick"], "title": "SN 2023taz: Implications for the UV Diversity of Superluminous Supernovae", "comment": "Submitted to ApJ", "summary": "Superluminous supernovae (SLSNe) are some of the brightest explosions in the Universe representing the extremes of stellar deaths. At the upper end of their distribution is SN\\,2023taz, one of the most luminous SLSNe discovered to date with a peak absolute magnitude of $M_{g,\\rm{peak}}=-22.75 \\pm 0.03$ and a lower limit for energy radiated of $E=2.9 \\times 10^{51}$\\,erg. Magnetar model fits reveal individual parameter values typical of the SLSN population, but the combination of a low $B$-field and ejecta mass with a short spin period places SN\\,2023taz in a unusual region of parameter space, accounting for its extreme luminosity. The optical data around peak are consistent with a temperature of $\\sim$17\\,000\\,K but SN\\,2023taz shows a surprising deficit in the UV compared to other events in this temperature range. We find no indication of dust extinction that could plausibly explain the UV deficit. The lower level of UV flux is reminiscent of the absorption seen in lower-luminosity events like SN\\,2017dwh, where Fe-group elements are responsible for the effect. However, in the case of SN\\,2023taz, there is no evidence for a larger amount of Fe-group elements which could contribute to line blanketing. Comparing to SLSNe with well-observed UV spectra, an underlying temperature of $8000-9000$\\,K would match the UV spectral slope, but is not consistent with the optical colour temperatures of these events. The most likely explanation is enhanced absorption by intermediate-mass elements, challenging previous findings that SLSNe exhibit similar UV absorption line equivalent widths. This highlights the need for expanded UV spectroscopic coverage of SLSNe, especially at early times, to build a framework for interpreting their diversity and to enable classification at higher redshifts where optical observations will exclusively probe rest-frame UV emission."}
{"id": "2511.14932", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.14932", "abs": "https://arxiv.org/abs/2511.14932", "authors": ["Nicholas Corso", "Dong Lai"], "title": "Simulations of a Conducting Sphere Moving through Magnetized Plasma: Alfvén Wings, Slow Magnetosonic Wings, and Drag Force", "comment": "12 pages, 11 figures, submitted to ApJ, awaiting review", "summary": "Plasma-mediated interaction between astrophysical objects can play an important role and produce electromagnetic radiation in various binary systems, ranging from planet-moon and star-planet systems to binary compact objects. We perform 3D magnetohydrodynamic numerical simulations to study an ideal magnetized plasma flowing past an unmagnetized conducting sphere. Such flow generates magnetic disturbances and produces a drag force on the sphere, and we explore the corresponding drag coefficient as a function of the flow speed relative to Alfvén speed and the $β$ parameter of the background plasma. We find that the drag is generally well-described by the Alfvén wing model, but we also show that slow magnetosonic waves provide a correction through their own wing-like features. These give rise to a nontrivial dependence of the drag coefficient on the plasma $β$, as well as enhanced drag as the flow speed approaches the Alfvén speed."}
{"id": "2511.14941", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.14941", "abs": "https://arxiv.org/abs/2511.14941", "authors": ["Pau Bosch-Cabot", "Alexandra J. Tetarenko", "Erik Rosolowsky", "Francesco Carotenuto", "James Miller-Jones", "David M. Russell", "Stéphane Corbel", "Thomas D. Russell", "Gregory R. Sivakoff"], "title": "Constraining the Jet Energetics of the Transient X-ray Binaries MAXI J1348-630 and MAXI J1820+070 through Calorimetry", "comment": "19 pages, 9 figures (including references and appendices). Accepted to ApJ", "summary": "We present Atacama Large Millimeter/Submillimeter Array (ALMA) observations aimed at identifying potential jet-ISM interaction sites in the vicinity of the transient black hole X-ray binaries MAXI J1348-630 and MAXI J1820+070, both of which have recently undergone an outburst, and displayed powerful large scale jets. Using this dataset, we construct molecular line emission maps. By analyzing the morphological, spectral, and kinematic properties of the detected emission, we identify a molecular structure that provides compelling evidence for a jet-driven cavity in the local environment of MAXI J1348-630 but find no significant emission in the local environment of MAXI J1820+070. We use the properties of the detected molecular emission surrounding MAXI J1348-630 to constrain the jet power, finding our results to be consistent with other independent studies of this source, and further validating the utility of astrochemistry for constraining jet energetics. Additionally, our findings provide the first assessment on the formation timescales for jet-ISM interaction regions in the transient black hole X-ray binary population."}
{"id": "2511.15056", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.15056", "abs": "https://arxiv.org/abs/2511.15056", "authors": ["Yun-Feng Wei", "Tong Liu", "Bao-Quan Huang"], "title": "Hyperaccretion-driven relativistic jets from massive collapsars in active galactic nucleus disks", "comment": "12 pages, 11 figures, accepted for publication in ApJ", "summary": "The observable characteristics of gamma-ray bursts (GRBs) embedded in the accretion disk of active galactic nuclei (AGNs) are mainly determined by the jet propagation within the disk. In the massive collapsar scenario, we consider that the mass and metallicity of progenitor stars can significantly affect the jet durations and luminosities, which in turn influence whether the jet can break out from AGN disks. For the cases with low metallicity, massive stars tend to keep their massive envelopes. Thus the hyperaccretion of these envelopes onto the newborn black holes (BHs) can prolong the activity duration of the central engine, thereby allowing the jets to potentially break out from the disks. For successful jets, we further study their prompt emission and afterglows for different supermassive BHs and locations and discuss the detectability of these signals by instruments such as \\emph{Swift} and Einstein Probe. Future related observations will help constrain the structure, components, and evolutionary history of AGN disks and the massive stars embedded within them."}
{"id": "2511.15134", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.15134", "abs": "https://arxiv.org/abs/2511.15134", "authors": ["Wenhao Dong", "Andrew Melatos", "Nicholas J. O'Neill", "Patrick M. Meyers", "Daniel K. Boek"], "title": "Measuring the crust-superfluid coupling time-scale for 105 UTMOST pulsars with a Kalman filter", "comment": "15 pages of main text, 6 appendices. Accepted for publication in MNRAS", "summary": "Crust-superfluid coupling plays an important role in neutron star rotation, particularly with respect to timing noise and glitches. Here, we present new timing-noise-based estimates of the crust-superfluid coupling time-scale \\(τ\\) for 105 radio pulsars in the UTMOST dataset, by Kalman filtering the pulse times of arrival. The 105 objects are selected because they favor a two-component, crust-superfluid model over a one-component model with log Bayes factor \\(\\ln \\mathfrak{B}_{\\rm BF} \\geq 5\\). The median estimate of \\(τ\\) ranges from \\(10^{4.6\\pm0.4}\\)\\,s for PSR J2241$-$5236 to \\(10^{7.7^{+0.7}_{-0.4}}\\)\\,s for PSR J1644$-$4559 among 28 out of 105 objects with sharply peaked \\(τ\\) posteriors. A hierarchical Bayesian analysis is performed on 101 out of 105 objects that are canonical (i.e.\\ neither recycled nor magnetars) and reside in the populous core of the \\(Ω_{\\rm c}\\)-\\(\\dotΩ_{\\rm c}\\) plane. It returns the population-level scaling \\(τ\\propto Ω_{\\rm c}^{0.19^{+0.50}_{-0.52}} |\\dotΩ_{\\rm c}|^{0.18^{+0.18}_{-0.19}}\\), where \\(Ω_{\\rm c}\\) and \\(\\dotΩ_{\\rm c}\\) are the angular velocity and spin-down rate of the crust respectively. The variances of the stochastic crust and superfluid torques are also estimated hierarchically, with \\(Q_{\\rm c} \\propto Ω_{\\rm c}^{1.23^{+0.80}_{-0.75}} |\\dotΩ_{\\rm c}|^{0.49^{+0.27}_{-0.32}}\\) and \\(Q_{\\rm s} \\propto Ω_{\\rm c}^{0.71^{+0.76}_{-0.78}} |\\dotΩ_{\\rm c}|^{1.27^{+0.30}_{-0.28}}\\) respectively. Implications for the physical origin of crust-superfluid coupling, e.g.\\ through mutual friction, are discussed briefly."}
{"id": "2511.15154", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.15154", "abs": "https://arxiv.org/abs/2511.15154", "authors": ["Lilia Ferrario"], "title": "Electron Cyclotron Maser Emission as the Driving Mechanism in Long-Period Radio Transients", "comment": "12 pages, 3 figures, submitted to MNRAS", "summary": "Long-period radio transients (LPRTs) are highly polarised, coherent radio sources with periods of minutes to hours and bursts typically lasting 10-100s. We argue that electron cyclotron maser emission (ECME) explains their narrow duty cycles and polarisation properties. In this picture, a rotating oblique magnetosphere beams radiation into a thin, hollow emission cone whose surface lies almost perpendicularly to the local magnetic field. The observed very narrow pulses arise when the line of sight skims the cone. Broader profiles and weak leading or trailing components occur when multiple azimuths along the emission ring satisfy the maser resonance condition. The observed isotropic-equivalent luminosities of ~10^{30}-10^{31} erg s^{-1} correspond to modest intrinsic powers once strong ECME beaming is taken into account, which is readily achievable through accretion from the interstellar medium."}
{"id": "2511.15193", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2511.15193", "abs": "https://arxiv.org/abs/2511.15193", "authors": ["Hiromichi Tagawa", "Connar Rowan", "János Takátsy", "Lorenz Zwick", "Kai Hendriks", "Wen-Biao Han", "Johan Samsing"], "title": "Gravitational Wave Phase shifts of black hole mergers in AGN Disks", "comment": "14 pages, 8 figures", "summary": "Ground-based gravitational wave (GW) detectors have discovered about 200 compact object mergers. The astrophysical origins of these events are highly debated, and it is possible that at least a fraction of them originate from dynamical environments. Among these, the disks of active galactic nuclei (AGN) are particularly interesting as promising environments, as some observed properties may be more readily produced there. When compact objects merge in these environments, acceleration from the central supermassive black hole (SMBH) or nearby companions is inevitable. Such acceleration induces a phase shift in the observed GW waveforms, which can serve as a useful tool to distinguish the underlying merging environments for each GW event. In this paper, we investigate the expected distribution of such acceleration-induced GW phase shifts, using a semi-analytical model combined with a one-dimensional AGN population synthesis code. We find significant contributions from three-body interactions involving a nearby third object. Our results indicate that the GW phase shift is likely to be larger compared to other channels, making it distinguishable by future GW facilities such as TianQin, DECIGO, Taiji, Einstein Telescope, and Cosmic Explorer. Interestingly, a notable fraction of mergers in fact exhibit a significant GW phase shift ($\\gtrsim~{\\rm 1\\ rad}$) at frequencies above $10~{\\rm Hz}$, which could even be detectable by current GW detectors such as LIGO/Virgo/KAGRA. Additionally, if gas-hardening during three-body interactions is taken into account, the GW frequency can be boosted to $\\gtrsim 10~{\\rm Hz}$, potentially further aiding in the detection of the phase shift."}
{"id": "2511.15313", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2511.15313", "abs": "https://arxiv.org/abs/2511.15313", "authors": ["Zhi-Qiang Ding", "Xin-Qiao Li", "Da-Li Zhang", "Zheng-Hua An", "Zhen-Xia Zhang", "Roberto Battiston", "Roberto Iuppa", "Zhuo Li", "Yan-Qiu Zhang", "Yan Huang", "Chao Zheng", "Yan-Bing Xu", "Xiao-Yun Zhao", "Lu Wang", "Ping Wang", "Hong Lu"], "title": "A Method for Gamma-Ray Energy Spectrum Inversion and Correction", "comment": "The Astrophysical Journal has accepted", "summary": "Accurate spectral analysis of high-energy astrophysical sources often relies on comparing observed data to incident spectral models convolved with the instrument response. However, for Gamma-Ray Bursts and other high-energy transient events observed at high count rates, significant distortions (e.g., pile-up, dead time, and large signal trailing) are introduced, complicating this analysis. We present a method framework to address the model dependence problem, especially to solve the problem of energy spectrum distortion caused by instrument signal pile-up due to high counting rate and high-rate effects, applicable to X-ray, gamma-ray, and particle detectors. Our approach combines physics-based Monte Carlo (MC) simulations with a model-independent spectral inversion technique. The MC simulations quantify instrumental effects and enable correction of the distorted spectrum. Subsequently, the inversion step reconstructs the incident spectrum using an inverse response matrix approach, conceptually equivalent to deconvolving the detector response. The inversion employs a Convolutional Neural Network, selected for its numerical stability and effective handling of complex detector responses. Validation using simulations across diverse input spectra demonstrates high fidelity. Specifically, for 27 different parameter sets of the brightest gamma-ray bursts, goodness-of-fit tests confirm the reconstructed spectra are in excellent statistical agreement with the input spectra, and residuals are typically within $\\pm 2σ$. This method enables precise analysis of intense transients and other high-flux events, overcoming limitations imposed by instrumental effects in traditional analyses."}
{"id": "2511.15401", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2511.15401", "abs": "https://arxiv.org/abs/2511.15401", "authors": ["Suo-Ning Wang", "Bin-Bin Zhang", "Rubén García Benito"], "title": "Explosions in the Empty: A Survey of Transients in Local Void Galaxies", "comment": "52 pages, 4 figures, 6 tables", "summary": "We present a systematic analysis of transient astrophysical events -- including supernovae (SNe), gamma-ray bursts (GRBs), and fast radio bursts (FRBs) -- in void and non-void galaxies within the local universe ($0.005 < z < 0.05$). Cosmic voids, defined by low galaxy densities and characterized by minimal environmental interactions, offer a natural laboratory for isolating the impact of large-scale underdensities on stellar evolution and transient production. Using multi-wavelength data from the Sloan Digital Sky Survey, the Sternberg Astronomical Institute Supernova Catalogue, and high-energy space observatories, we compare transient occurrence rates and host galaxy properties across environments. We find that core-collapse supernovae (CCSNe) are significantly more common in void galaxies, indicating that massive star formation remains active in underdense regions. In contrast, Type Ia supernovae are less frequent in voids, consistent with a scarcity of older stellar populations. Notably, we identify a short-duration GRB hosted by a void galaxy, demonstrating that compact object mergers can occur in isolated environments. Additionally, we find no FRBs associated with void galaxies. Taken together, these results show that cosmic voids exert a measurable influence on the star formation history of galaxies and hence on the production of transients."}
{"id": "2511.15470", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.15470", "abs": "https://arxiv.org/abs/2511.15470", "authors": ["Peng Zhang", "Bing Li", "Ren-Zhou Gui", "Shao-Lin Xiong", "Yu Wang", "Shi-Jie Zheng", "Guang-Cheng Xiao", "Xiao-Bo Li", "Yue Huang", "Chen-Wei Wang", "Jia-Cong Liu", "Yan-Qiu Zhang", "Wang-Chen Xue", "Chao Zheng", "Yue Wang"], "title": "Advancing Identification method of Gamma-Ray Bursts with Data and Feature Enhancement", "comment": "Under review. Dataset and model related discussions are welcome!", "summary": "Gamma-ray bursts (GRBs) are challenging to identify due to their transient nature, complex temporal profiles, and limited observational datasets. We address this with a one-dimensional convolutional neural network integrated with an Adaptive Frequency Feature Enhancement module and physics-informed data augmentation. Our framework generates 100,000 synthetic GRB samples, expanding training data diversity and volume while preserving physical fidelity-especially for low-significance events. The model achieves 97.46% classification accuracy, outperforming all tested variants with conventional enhancement modules, highlighting enhanced domain-specific feature capture. Feature visualization shows model focuses on deep-seated morphological features and confirms the capability of extracting physically meaningful burst characteristics. Dimensionality reduction and clustering reveal GRBs with similar morphologies or progenitor origins cluster in the feature space, linking learned features to physical properties. This perhaps offers a novel diagnostic tool for identifying kilonova- and supernova-associated GRB candidates, establishing criteria to enhance multi-messenger early-warning systems. The framework aids current time-domain surveys, generalizes to other rare transients, and advances automated detection in large-volume observational data."}
{"id": "2511.15482", "categories": ["astro-ph.HE", "astro-ph.GA", "gr-qc"], "pdf": "https://arxiv.org/pdf/2511.15482", "abs": "https://arxiv.org/abs/2511.15482", "authors": ["Ainara Saiz-Pérez", "Christian M. Fromm", "Yosuke Mizuno", "Matthias Kadler", "Karl Mannheim", "Ziri Younsi"], "title": "Probing the disk-jet coupling in M87", "comment": null, "summary": "Context. Recent GMVA observations of M 87 at event horizon scales revealed a ring-like structure which is 50% larger at 86 GHz than the ring observed by the Event Horizon Telescope at 230 GHz. Aims. In this paper, we study a possible origin of the increased ring size at 86 GHz. We specifically aim to study the role the nonthermal electron population plays in the observed event horizon scales. Methods. We carry out 3D general relativistic magnetohydrodynamic simulations followed by radiative transfer calculations. We incorporate into the latter synchrotron emission from both thermal and nonthermal electrons. To better compare our results to observations, we generate synthetic interferometric data adjusted to the properties of the observing arrays. We fit geometrical models to this data in Fourier space through Bayesian analysis to monitor the variable ring size and width over the simulated time span of years. Results. We find that the 86 GHz ring is always larger than the 230 GHz ring, which can be explained by the increased synchrotron self-absorption at 86 GHz and the mixed emission from both the accretion disk and the jet footpoints, as well as flux arcs ejected from a magnetized disk. We find agreement with the observations, particularly within the error range of the observational value of M/D for M 87. Conclusions. We show that state-of-the art 3D GRMHD simulations combined with thermal and nonthermal emitting particles can explain the observed frequency-dependent ring size in M 87. Importantly we found that MAD events triggered in the accretion disk can significantly increase the lower frequency ring sizes."}
{"id": "2511.15542", "categories": ["astro-ph.HE", "hep-ph"], "pdf": "https://arxiv.org/pdf/2511.15542", "abs": "https://arxiv.org/abs/2511.15542", "authors": ["Filip Rescic", "Luis Recabarren Vergara", "Michele Doro", "Tomislav Terzić"], "title": "Is There New Physics Beyond 30 TeV in the BOAT?", "comment": "5 pages, 3 figures", "summary": "We show that the GRB 221009A spectrum detected by LHAASO can be used to probe effects of quadratic subluminal Lorentz Invariance Violation (LIV) through the enhancement of the observed flux at the highest energies. In particular, we argue that excesses in the GRB 221009A data currently classified as non-detections at energies $E \\gtrsim 30$ TeV warrant further investigation, as they may indicate a recovery of the intrinsic source spectrum consistent with the LIV-induced suppression of $γγ\\to e^-e^+$ interactions within the quadratic subluminal scenario. This would increase the accessible parameter space of the energy scale of new physics."}
{"id": "2511.15559", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.15559", "abs": "https://arxiv.org/abs/2511.15559", "authors": ["Gajanan D Harale", "Surajit Paul"], "title": "Excess of diffuse gamma-ray emission detected from the galaxy cluster Abell 119 from 14-year Fermi-LAT Data", "comment": "20 pages, 9 figures, Published in Physical Review D, This is the accepted manuscript. The final published version is available at https://doi.org/10.1103/gn1q-pzx3", "summary": "Galaxy clusters are among the most massive gravitationally bound systems in the Universe and are considered major reservoirs of high-energy cosmic rays, yet no conclusive $γ$-ray detection from them has been achieved. This non-detection may stem from limited sensitivity and source localization of current $γ$-ray instruments, as well as strong interactions of $γ$-rays with intervening material that restrict detectable signals to only a few nearby and dynamically active clusters. Motivated by these constraints, we selected a sample of nearby ($z<0.05$) merging clusters and analyzed 14 years of \\textit{Fermi}-LAT data. In this work, we present a detailed study of Abell 119 (A119), a merging cluster with significant X-ray luminosity and complex dynamics. Using \\textit{Fermipy} and \\textit{Fermi} Science Tools, we modeled all potential $γ$-ray sources and confirmed the 4FGL point sources 4FGL J0059.3$-$0152, 4FGL J0101.0$-$0059, and 4FGL J0059.2+0006 with significant TS values.s. It further reveals, a $\\sim4σ$ excess of diffuse $γ$-ray emission offset by $\\sim0.25^\\circ$ from the cluster center, plausibly associated with the cluster halo. An extended model provides the best fit, yielding luminosity bounds of $\\sim 12.21^{+2.74}_{-3.95}\\times10^{42}\\,\\mathrm{erg\\,s^{-1}}$ and a particle spectral index of $\\sim2.25^{+0.38}_{-0.13}$, consistent with earlier expectations for cluster-scale non-thermal emission. These results suggest a hadronic origin for the detected signal. Although the $\\sim4σ$ excess is compelling, uncertainties in localization and instrumental limitations prevent a definitive detection. Nonetheless, the results highlight the potential for deeper cluster studies, and the estimated neutrino flux $E^{2}φ_ν\\approx3\\times10^{-10}\\,\\mathrm{GeV\\,cm^{-2}\\,s^{-1}\\,sr^{-1}}$ motivates future observations with upcoming neutrino telescopes."}
{"id": "2511.15601", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2511.15601", "abs": "https://arxiv.org/abs/2511.15601", "authors": ["Giorgos Michailidis", "Efthalia Traianou", "Nicola Marchili", "Giorgos Filippos Paraschos", "Thomas P. Krichbaum", "Uwe Bach", "P. A. Vergara de la Parra", "Dong-Jin Kim", "Victor Manuel Patiño-Álvarez", "Matthias Kadler", "Mark Gurwell"], "title": "Catching the 2021 γ-ray flare in the blazar TXS 2013+370", "comment": "10 pages, 14 figures, accepted in A&A", "summary": "The $γ$-ray-loud blazar TXS 2013+370, a powerful multiwavelength emitter at $z = 0.859$, underwent an exceptional GeV outburst in late 2020-early 2021. In this work, we present full-polarization VLBI imaging at 22, 43, and 86 GHz together with contemporaneous single-dish monitoring (radio and $γ$-rays) to localize the high-energy dissipation site and probe the inner-jet structure and magnetic field topology. The images revealed a compact near-core knot at $r \\simeq 40$-$60~μ\\mathrm{as}$ contemporaneously with the GeV flare and a flat, core-dominated spectrum ($α\\gtrsim -0.5$). The core has strong linear polarization and exhibits a $\\sim 50^{\\circ}$ EVPA rotation at 86 GHz; pixel-based and integrated fits yield a high, uniform rotation measure, ${\\rm RM} = (7.8 \\pm 0.2) \\times 10^{4}~{\\rm rad~m^{-2}}$, consistent with an external Faraday screen. Cross-correlation of Fermi-LAT and 15 GHz data shows a significant peak with the $γ$ rays leading by $Δt = (102 \\pm 12)\\,\\mathrm{d}$; adopting $β_{\\rm app} = 4.2 \\pm 0.5$ and $θ= 4.1^{\\circ} \\pm 0.2^{\\circ}$ implies a de-projected separation $Δr_{γ-15} = (2.71 \\pm 0.47)\\,\\mathrm{pc}$ and locates the GeV emission between the jet apex and $\\sim 0.42$ pc ($1σ$ range) downstream. Our results do not uniquely pinpoint the emission site; rather, they support two valid scenarios. The $γ$-ray production may occur within the BLR ($\\sim 0.07$pc), where external-Compton scattering of optical/UV photons produces the $γ$ rays, or beyond the BLR, reaching $\\sim 0.42$ pc ($1σ$) within the inner parsecs, where external-Compton scattering of dusty-torus infrared photons dominates. Both scenarios are compatible within the allowed range of emission distances, while opacity-driven core shifts modulate the observed radio-$γ$ delay without requiring large relocations of the dissipation zone."}
{"id": "2511.15695", "categories": ["astro-ph.HE", "astro-ph.CO"], "pdf": "https://arxiv.org/pdf/2511.15695", "abs": "https://arxiv.org/abs/2511.15695", "authors": ["Víctor M. Patiño-Álvarez", "Jonhatan U. Guerrero-González", "Vahram Chavushyan", "Douglas E. Monjardin-Ward", "Tigran G. Arshakian", "Irene Cruz-González"], "title": "The Relationship Between Emission Line and Continuum Luminosity and the Baldwin Effect in Blazars. I. The Case of the Mg II λ2798 Å Emission Line", "comment": "17 pages, 14 figures, 5 tables, accepted for publication in Astronomy & Astrophysics", "summary": "Aims. This study investigates the relationship between the Mg II λ2798 Å emission line and the 3000 Å continuum luminosity, as well as the Baldwin Effect, in a sample of 40,685 radio-quiet (RQ) quasars and 441 Flat Spectrum Radio Quasars (FSRQs). Methods. We perform a comprehensive re-evaluation of the Mg II-3000 Å correlation, explicitly accounting for dispersion introduced by AGN variability. After excluding >3000 radio-loud sources, we employ a binning technique to mitigate variability effects, yielding a refined empirical relation. We also further examine the Non-Thermal Dominance (NTD) parameter, to investigate the dominant source of the continuum. Results. Our analysis reveals statistically significant differences in the slopes of the line-continuum luminosity relation between RQ quasars and FSRQs, with a parallel discrepancy in the Baldwin Effect. These findings imply either (1) intrinsic differences in the accretion disk spectra of RQ AGNs and FSRQs or (2) jet-induced continuum emission in FSRQs contributing to Broad Line Region (BLR) ionization. We also found that a substantial fraction of both RQ quasars (43.8\\%) and blazars (55.5\\%) exhibit NTD < 1. For blazars, this suggests that the accretion disk alone cannot fully explain BLR ionization; while we interpret NTD < 1 in radio-quiet quasars as a signature of several physical mechanisms: anomalies in the BLR structure (such as outflow or inflows), time lags between continuum and line variations, and the suppression of the UV continuum by a strong corona that diverts accretion power. Finally, we demonstrate that the Baldwin Effect emerges naturally from the line-continuum luminosity relationship, requiring no additional physical mechanism to explain its origin"}
{"id": "2511.14997", "categories": ["astro-ph.IM", "astro-ph.HE", "gr-qc"], "pdf": "https://arxiv.org/pdf/2511.14997", "abs": "https://arxiv.org/abs/2511.14997", "authors": ["Pratyusava Baral", "Cody Messick", "Patrick Brady"], "title": "A Neural Network Approach to Preferred Event Selection for Low-Latency Gravitational-Wave Alerts", "comment": "24 pages, 7 figures", "summary": "The LIGO-Virgo-KAGRA collaboration uses multiple independent search pipelines to detect gravitational waves, often resulting in multiple triggers (g-events) for a single astrophysical source. These triggers are grouped into superevents, raising a critical question for multimessenger astronomy: which g-event provides the most accurate sky localization for electromagnetic follow-up? Currently, the g-event with the highest signal-to-noise ratio (SNR) is selected, under the assumption that it should provide the best estimators of the source's parameters, including its location on the sky. Analysis of simulated signals reveals systematic deviations from this expectation. In particular, a false-alarm rate (FAR)-based selector performs slightly better than the SNR-based method, but introduces pipeline biases. We present a neural network-based selector trained on simulated signals to identify the g-event with the minimum searched area -- a metric quantifying localization accuracy. The network uses information (detector SNRs, FAR, and chirp mass) from all of the triggers associated with each astrophysical source and is designed to be pipeline-agnostic. Our results show that the neural network outperforms both traditional selectors, achieving a mean searched area ~2% smaller than the SNR-based selector. Unlike FAR-based selection, the neural network preserves the underlying distribution of pipeline contributions, avoiding systematic biases toward specific pipelines. The network can be trained in approximately one minute on a few thousand events and performs event selection instantaneously, making it suitable for low-latency applications. These results demonstrate that machine learning can enhance multimessenger astronomy capabilities while maintaining fairness across detection pipelines. We recommend implementing this approach for future observing runs."}
