{"id": "2510.11961", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2510.11961", "abs": "https://arxiv.org/abs/2510.11961", "authors": ["P. Kabáth", "M. Skarka", "A. Hatzes", "E. Guenther", "L. Vanzi", "R. Brahm", "J. Janík", "P. Pintr", "P. Gajdoš", "J. Lipták", "J. Žák", "H. M. J. Boffin", "L. Antonucci", "G. Avila", "Z. Balkóová", "M. E. Ball", "M. Flores", "A. Fuentes", "J. Fuchs", "R. Greimel", "A. Gajardo", "V. D. Ivanov", "J. Köhler", "M. Leitzinger", "T. Moravčík", "J. Nečásek", "R. J. U. Neubert", "P. Odert", "G. Olguin", "M. Tala Pinto", "M. Roth", "L. Řezba", "V. Schaffenroth", "M. Sigwarth", "J. Srba", "A. Suárez", "P. Škoda", "J. Šubjak", "J. Václavík", "M. Veselý", "R. Veselý", "M. Vítková", "J. U. Winkler", "M. Zummer", "E. Ždárská"], "title": "PLATOSpec: a precise spectrograph in support of space missions", "comment": "submitted to MNRAS", "summary": "The upcoming space missions that will characterize exoplanets, such as PLATO\nand Ariel, will collect huge amounts of data that will need to be complemented\nwith ground-based observations. The aim of the PLATOSpec project is to perform\nscience with an echelle spectrograph capable of measuring precise radial\nvelocities. The main focus of the spectrograph will be to perform the initial\nscreening and validation of exoplanetary candidates, in addition to study\nstellar variability. It will be possible to determine the physical properties\nof large exoplanets. The PLATOSpec blue-sensitive spectrograph, with a spectral\nrange of 380 to 700\\,nm and a resolving power of R=70,000, is installed on the\n1.5-m telescope at the ESO La Silla Observatory in Chile. Initial results show\nthat the radial-velocity limit given by the wavelength calibration is about 2-3\nm/s. Tests on bright F-K main-sequence standard stars reveal a scatter of about\n5 m/s over a few hours. The scatter over a few months is slightly higher. We\ndemonstrate the capabilities of PLATOSpec on the mass determination of WASP-79\nb and the spin-orbit alignment of WASP-62\\,b via the Rossiter-McLaughlin\neffect. We show its possible usage on variable star research as demonstrated on\nthe false-positive exoplanetary candidate TIC 238060327, which is proven a\nbinary star. Investigation of line-profile variations of the roAp star alpha\nCir shows that PLATOSpec can also be used for the surface mapping. Finally, we\npresent new results on the active star UY Pic in the PLATO southern field. Our\nresults show that PLATOSpec is a versatile spectrograph with great precision."}
{"id": "2510.12093", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2510.12093", "abs": "https://arxiv.org/abs/2510.12093", "authors": ["Samuel Lai", "Nithyanandan Thyagarajan", "O. Ivy Wong", "Foivos Diakogiannis"], "title": "Very-Long Baseline Interferometry Imaging with Closure Invariants using Conditional Image Diffusion", "comment": "20 pages, 8 figures, 2 tables, accepted in PASA", "summary": "Image reconstruction in very-long baseline interferometry operates under\nseverely sparse aperture coverage with calibration challenges from both the\nparticipating instruments and propagation medium, which introduce the risk of\nbiases and artefacts. Interferometric closure invariants offers\ncalibration-independent information on the true source morphology, but the\ninverse transformation from closure invariants to the source intensity\ndistribution is an ill-posed problem. In this work, we present a generative\ndeep learning approach to tackle the inverse problem of directly reconstructing\nimages from their observed closure invariants. Trained in a supervised manner\nwith simple shapes and the CIFAR-10 dataset, the resulting trained model\nachieves reduced chi-square data adherence scores of $\\chi^2_{\\rm CI} \\lesssim\n1$ and maximum normalised cross-correlation image fidelity scores of $\\rho_{\\rm\nNX} > 0.9$ on tests of both trained and untrained morphologies, where\n$\\rho_{\\rm NX}=1$ denotes a perfect reconstruction. We also adapt our model for\nthe Next Generation Event Horizon Telescope total intensity analysis challenge.\nOur results on quantitative metrics are competitive to other state-of-the-art\nimage reconstruction algorithms. As an algorithm that does not require finely\nhand-tuned hyperparameters, this method offers a relatively simple and\nreproducible calibration-independent imaging solution for very-long baseline\ninterferometry, which ultimately enhances the reliability of sparse VLBI\nimaging results."}
{"id": "2510.12162", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2510.12162", "abs": "https://arxiv.org/abs/2510.12162", "authors": ["Eliza Gazda", "Quintin Meyers", "James R. Burgoyne", "Scott Chapman", "Steve K. Choi", "Cody J. Duell", "Anthony I. Huber", "Inchara Jagadeesh", "David Faulkner Katz", "Ben Keller", "Lawrence T. Lin", "Paul Malachuk", "Michael D. Niemack", "Darshan A. Patel", "Gordon J. Stacey", "Benjamin J. Vaughan", "Eve M. Vavagiakis", "Samantha Walker", "Yuhan Wang", "Ruixuan", "Xie"], "title": "CCAT: Optical Responsivity, Noise, and Readout Optimization of KIDs for Prime-Cam", "comment": null, "summary": "The Prime-Cam instrument of the Fred Young Submillimeter Telescope (FYST) at\nthe CCAT Observatory will conduct sensitive millimeter to submillimeter surveys\nfor a range of astrophysical and cosmological sciences. Prime-Cam will use\nkinetic inductance detectors (KIDs) sensitive to multiple frequency bands\nspanning 280--850 GHz. With over 100,000 sensors under development, these KID\narrays will soon form the largest submillimeter focal plane ever built. With\nfixed microwave tones probing amplitude and phase modulations in the KIDs due\nto incoming radiation, challenges arise in determining the optimal readout\nsettings, especially under varying atmospheric loading. Realizing the science\ngoals of FYST requires operating the detectors at optimal performance and\ndetermining accurate responsivities, which depend on readout tone placement and\npower. To address these challenges, we present laboratory measurements of\nsample pixels from the 280 GHz TiN and Al arrays using a blackbody cold load to\nsimulate observing conditions. These measurements probe detector responsivity\nand noise across varying optical loading, tone power, and tone placement,\nproviding the foundation to guide in situ calibration and operation of the\n$>$100,000 KIDs. We characterize detector sensitivity via the Noise Equivalent\nPower (NEP) as a function of readout tone power and placement, and measure the\nimpact of detuning due to varying optical power on the NEP. Our test setup and\nmethodology will inform the commissioning of Prime-Cam, in situ detector\ncalibration procedures, the cadence of probe tone resetting, and potential\ndesign refinements for future arrays, supporting FYST's planned first light in\n2026."}
{"id": "2510.12213", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2510.12213", "abs": "https://arxiv.org/abs/2510.12213", "authors": ["Giuseppe Greco", "Thomas Boch", "Pierre Fernique", "Manon Marchand", "Mark Allen", "Francois Xavier Pineau", "Matthieu Baumann", "Marco Molinaro", "Roberto De Pietri", "Marica Branchesi", "Steven Schramm", "Gergely Dalya", "Elahe Khalouei", "Barbara Patricelli", "Giulia Stratta"], "title": "Encapsulating Textual Contents into a MOC data Structure for Advanced Applications", "comment": "Published in Astronomy and Computing; 11 pages, 4 figures", "summary": "Context. The Multi-Order Coverage map (MOC) is a widely adopted standard\npromoted by the International Virtual Observatory Alliance (IVOA) to support\ndata sharing and interoperability within the Virtual Observatory (VO)\necosystem. This hierarchical data structure efficiently encodes and visualizes\nirregularly shaped regions of the sky, enabling applications such as\ncross-matching large astronomical catalogs. Aims. This study aims to explore\npotential enhancements to the MOC data structure by encapsulating textual\ndescriptions and semantic embeddings into sky regions. Specifically, we\nintroduce \"Textual MOCs\", in which textual content is encapsulated, and\n\"Semantic MOCs\" that transform textual content into semantic embeddings. These\nenhancements are designed to enable advanced operations such as similarity\nsearches and complex queries and to integrate with generative artificial\nintelligence (GenAI) tools. Method. We experimented with Textual MOCs by\nannotating detailed descriptions directly into the MOC sky regions, enriching\nthe maps with contextual information suitable for interactive learning tools.\nFor Semantic MOCs, we converted the textual content into semantic embeddings,\nnumerical representations capturing textual meanings in multidimensional\nspaces, and stored them in high-dimensional vector databases optimized for\nefficient retrieval. Results. The implementation of Textual MOCs enhances user\nengagement by providing meaningful descriptions within sky regions. Semantic\nMOCs enable sophisticated query capabilities, such as similarity-based searches\nand context-aware data retrieval. Integration with multimodal generative AI\nsystems allows for more accurate and contextually relevant interactions\nsupporting both spatial, semantic and visual operations for advancing\nastronomical data analysis capabilities."}
{"id": "2510.11772", "categories": ["astro-ph.HE", "astro-ph.CO", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2510.11772", "abs": "https://arxiv.org/abs/2510.11772", "authors": ["Andrew D. Santarelli", "Claire B. Campbell", "Ebraheem Farag", "Earl P. Bellinger", "Priyamvada Natarajan", "Matthew E. Caplan"], "title": "MESA-QUEST: Tracing the formation of direct collapse black hole seeds via quasi-stars", "comment": "14 pages, 3 figures, presented at Simons Foundation SCEECS Annual\n  Meeting in Feb. 2025 and comprised a portion of author A.D.S's Masters thesis", "summary": "The origin of the first supermassive black holes (SMBHs) observed at\nredshifts $z\\geq 9$ remains one of the most challenging open questions in\nastrophysics. Their rapid emergence suggests that massive ``heavy seeds'' must\nhave formed early, possibly through the direct collapse of pristine gas clouds\nin the first galaxies. We present MESA-QUEST, a new framework built upon the\nModules for Experiments in Stellar Astrophysics (MESA) code, designed to model\nthe structure and evolution of quasi-stars -- massive, radiation-supported\nenvelopes hosting accreting black holes at their cores -- believed to be the\nprogenitors of direct-collapse black hole (DCBH) seeds. Our implementation\nintroduces flexible boundary conditions representing both Bondi accretion and\nsaturated-convection regimes, and explores the impact of several stellar wind\nand mass-loss prescriptions, including Reimers, Dutch, and super-Eddington\nradiation-driven winds. We find that quasi-stars can grow central black holes\nto $\\geq 10^3\\,M_{\\odot}$ under favorable conditions, with saturated-convection\nmodels yielding BH-to-total mass ratios up to 0.55$M_*$ -- five times higher\nthan Bondi-limited cases. However, strong radiation-driven winds can\ndramatically curtail growth, potentially quenching heavy-seed formation unless\nbalanced by sustained envelope accretion. Our results delineate the physical\nlimits under which quasi-stars can remain stable and produce heavy seeds\ncapable of evolving into the earliest SMBHs detected by JWST and Chandra.\nFuture extensions will incorporate rotation, magnetic fields, and GR-radiation\nhydrodynamics to refine accretion physics and constrain the viability of the\nquasi-star pathway for early SMBH formation."}
{"id": "2510.12270", "categories": ["astro-ph.IM", "astro-ph.EP"], "pdf": "https://arxiv.org/pdf/2510.12270", "abs": "https://arxiv.org/abs/2510.12270", "authors": ["Manon Lizzana", "Fabien Malbet", "Alain Leger", "Fabrice Pancher", "Sébastien Soler", "Hugo Rousset", "Thierry Lepine", "Julien Michelot", "Yahya Er-Rahmaouy", "Youssef Bakka"], "title": "Experimental tests of the calibration of high precision differential astrometry for HWO", "comment": null, "summary": "Many different scientific applications require sub-micro arcsecond precision\nastrometry, including researching rocky exoplanets in the vicinity of the Sun\nand studying dark matter. The Habitable Worlds Observatory (HWO) is a promising\ncandidate to carry an astrometric instrument because it provides a stable,\nspace-based telescope with a large aperture, which allows faint sources and\nsmall displacements to be observed. This paper presents the characterization of\nan appropriate detector for an astrometric instrument: the 46Mpx Gigapyx from\nPyxalis. Moreover it explains the implementation of a testbed enabling\ninterferometric characterization of pixel positions. Finally, the paper\nintroduces a method for calibrating the telescope's optical distortion. This\nmethod was implemented in simulation and tested thanks to an optical bench\ndeveloped at IPAG in France."}
{"id": "2510.11781", "categories": ["astro-ph.HE", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2510.11781", "abs": "https://arxiv.org/abs/2510.11781", "authors": ["Rüdiger Pakmor", "Ken J. Shen", "Aakash Bhat", "Abinaya Swaruba Rajamuthukumar", "Christine E. Collins", "Cillian O'Donnell", "Evan B. Bauer", "Fionntan P. Callan", "Friedrich K. Röpke", "Joshua M. Pollin", "Kate Maguire", "Lindsey A. Kwok", "Ravi Seth", "Stefan Taubenberger", "Stephen Justham"], "title": "Violent mergers revisited: The origin of the fastest stars in the Galaxy", "comment": "12 pages, 8 figures, submitted to A&A", "summary": "Binary systems of two carbon-oxygen white dwarfs are one of the most\npromising candidates for the progenitor systems of Type Ia supernovae.\n  Violent mergers, where the primary white dwarf ignites when the secondary\nwhite dwarf smashes onto it while being disrupted on its last orbit, were the\nfirst proposed double degenerate merger scenario that ignites dynamically.\n  However, violent mergers likely contribute only a few per cent to the total\nType Ia supernova rate and do not yield normal Type Ia supernova light curves.\n  Here we revisit the scenario, simulating a violent merger with better\nmethods, and in particular a more accurate treatment of the detonation.\n  We find good agreement with previous simulations, with one critical\ndifference. The secondary white dwarf, being disrupted and accelerated towards\nthe primary white dwarf, and impacted by its explosion, does not fully burn.\nIts core survives as a bound object.\n  The explosion leaves behind a $0.16\\,\\mathrm{M_\\odot}$ carbon-oxygen white\ndwarf travelling $2800\\,\\mathrm{km/s}$, making it an excellent (and so far the\nonly) candidate to explain the origin of the fastest observed hyper-velocity\nwhite dwarfs.\n  We also show that before the explosion, $5\\times10^{-3}\\,\\mathrm{M_\\odot}$ of\nmaterial consisting predominantly of helium, carbon, and oxygen has already\nbeen ejected at velocities above $1000\\,\\mathrm{km/s}$.\n  Finally, we argue that if a violent merger made D6-1 and D6-3, and violent\nmergers require the most massive primary white dwarfs in binaries of two\ncarbon-oxygen white dwarfs, there has to be a much larger population of white\ndwarf mergers with slightly lower-mass primary white dwarfs. Because of its\nsize, this population can essentially only give rise to normal Type Ia\nsupernovae, likely exploding via the quadruple detonation channel and leaving\nno bound object behind."}
{"id": "2510.12649", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2510.12649", "abs": "https://arxiv.org/abs/2510.12649", "authors": ["Ali Raza", "Huihai He", "Faisal Akram", "The LHAASO Collaboration"], "title": "Energy calibration of LHAASO-KM2A using the cosmic ray Moon shadow", "comment": "12 pages, 13 figures, 2 tables", "summary": "We present a precise measurement of the westward, rigidity-dependent shift of\nthe Moon's shadow using three and a half years of cosmic-ray data collected by\nthe Kilometer Square Array (KM2A) of the Large High Altitude Air Shower\nObservatory (LHAASO). These measurements enable us to calibrate the detector\nenergy response in the range 20-260 TeV, with results showing excellent\nagreement with the response derived from Monte Carlo (MC) simulations of the\nKM2A detector. We also measure a best-fit parameter $\\epsilon = 0.015 \\pm\n0.08$, corresponding to a 95% confidence interval of [-14%, +17%] for the\nenergy-scale estimation. This result establishes the exceptional accuracy of\nthe KM2A-MC in simulating the detector's response within this energy range."}
{"id": "2510.11799", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.11799", "abs": "https://arxiv.org/abs/2510.11799", "authors": ["A. Gkini", "C. Fransson", "R. Lunnan", "S. Schulze", "J. Sollerman K. Tsalapatas", "N. Sarin", "M. Nicholl", "C. Angus", "U. Burgaz", "S. J. Brennan", "T. -W. Chen", "A. Gal-Yam", "A. Gangopadhyay", "Y. Hu", "M. M. Kasliwal", "R. R. Laher", "P. J. Pessi", "B. Rusholme", "E. Russeil", "A. Singh", "C. Skoglund", "R. Smith", "B. van Baal", "S. L. West", "L. Yan"], "title": "Eruptive mass loss less than a year before the explosion of superluminous supernovae. II. A systematic search for pre-explosion eruptions with VLT/X-shooter", "comment": "16 pages, 9 + 12 figures. Submitted in A&A", "summary": "We present X-shooter observations of a sample of 21 hydrogen-poor\nsuperluminous supernovae (SLSNe-I), spanning a redshift range of z=0.13-0.95,\naimed at searching for shells of circumstellar material (CSM). Specifically, we\nfocus on identifying broad Mg II absorption features that are blueshifted by\nseveral thousand kilometers per second and have previously been interpreted as\narising from resonance line scattering of the SLSN continuum by rapidly\nexpanding CSM ejected shortly before explosion. Utilizing high-quality spectra,\nwe model the region around 2800A to characterize the Mg II line profiles,\nenabling us to either confirm their presence or place constraints on undetected\nCSM shells. We identify five objects in our sample that show broad Mg II\nabsorption features consistent with the presence of CSM. While SN2018ibb,\nSN2020xga and SN2022xgc have been previously reported, we identify previously\nundiscovered CSM shells in DES15S2nr and DES16C3ggu. These shells were likely\nexpelled approximately two and three months, respectively, before the explosion\nof their associated SNe, timescales consistent with late-stage mass-loss\nepisodes. We do not find any correlations between the shell properties and the\nSN properties, except for a marginal correlation between the light curve\ndecline time scale and the shell velocities. We further demonstrate that CSM\nconfigurations similar to the majority of the detected shells would have been\nobservable in spectra with signal-to-noise >8 per resolution element, and that\nthe lines from a shell are in general detectable except in the cases where the\nshell is either very geometrically and/or optically thin. Therefore, we\nconclude that the detection of CSM shells is not a selection effect, but may\ninstead point to the existence of a subclass of SLSNe-I undergoing late-stage\nshell ejections shortly before explosion."}
{"id": "2510.11916", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.11916", "abs": "https://arxiv.org/abs/2510.11916", "authors": ["Silvia Gagliardini", "Simone Dall'Osso", "Dafne Guetta", "Angela Zegarelli", "Silvia Celli", "Antonio Capone", "Irene Di Palma"], "title": "Ultraviolet radiation and neutrinos: two messengers from CCSNe in the CSM scenario", "comment": null, "summary": "Massive stars (>8 $M_{\\odot}$) often undergo intense mass loss through winds\nor eruptive events in the final stages of their evolution, leading to the\nformation of a dense circumstellar medium (CSM). This material, expelled months\nto years before core collapse, shapes the pre-explosion environment and\ninfluences the early supernova (SN) emission. In particular, the interaction of\nthe SN ejecta with the dense CSM can power an extended emission into the\nUV/optical bands, as seen in a growing fraction of type II SN. Recent events\nsuch as SN 2023ixf and SN 2024ggi confirm the relevance of dense environments\nand highlight the value of UV observations. Moreover, Fast Blue Optical\nTransients (FBOTs) may represent extreme cases of this interaction, possibly\nlinked to more compact/massive CSM. In this work, we model the SN-CSM shock\ninteraction in order to (i) estimate the maximum detection horizons and\nexpected rates for future UV missions like ULTRASAT, and (ii) to estimate the\nintensity and expected rate of potential neutrino signals detectable by IceCube\nand KM3NeT. We then discuss the prospects for multi-messenger observations of\nsuch events in the near future."}
{"id": "2510.11971", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.11971", "abs": "https://arxiv.org/abs/2510.11971", "authors": ["Xing-Yao Wang", "Jia-Sheng Li", "Mi-Xiang Lan"], "title": "Rotation of Polarization Angle in Gamma-Ray Burst Prompt Phase. III. The Influence of the Magnetic Field Orientation", "comment": "9 pages, 2 figures, 1 table, ApJ accepted", "summary": "Polarization is very sensitive to the configuration of the magnetic field in\nthe radiation region. In addition to polarization curve and polarization\nspectrum, studies of polarization angle (PA) rotation spectrum is also crucial.\nIn this paper, we use a simple parametric magnetic reconnection model with a\nlarge-scale aligned magnetic field in the radiation region to study the effects\nof field orientation on the PA rotations. Under different field orientations,\nvariations of the PA rotation with parameters and the PA rotation spectra are\nstudied. We find that the conclusions obtained in our previous works are almost\nindependent of the field orientations. The area of the parameter space with\n$\\Delta$PA $>10^\\circ$ will shrink as the value of field orientation ($\\delta$)\nincreases for $0^\\circ<\\delta<90^\\circ$. The $\\Delta$PA values would be the\nsame for two complementary field orientations. For two particular magnetic\nfield orientations ($\\delta=0^\\circ$ and $90^\\circ$), the $\\Delta$PA would also\nonly be $0^\\circ$ or $90^\\circ$ within the burst duration."}
{"id": "2510.11988", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.11988", "abs": "https://arxiv.org/abs/2510.11988", "authors": ["Keito Watanabe", "Stefanie Walch", "Tim-Eric Rathjen", "Jonathan Mackey", "Pierre Nürnberger", "Philipp Girichidis"], "title": "Impact of Cosmic Ray Acceleration on the Early Evolution of Bow Shocks around Massive Runaway Stars", "comment": "25 pages, 26 figures (7 figures in Appendix). Submitted to A&A", "summary": "Bow shocks generated from the interaction of winds from massive runaway stars\nwith the interstellar medium have been shown to be prominent particle\naccelerators through recent $\\gamma$-ray and radio synchrotron observations.\nHere, we study particle acceleration from bow shocks by conducting 3D ideal\ncosmic ray magnetohydrodynamic simulations in the advection-diffusion limit. We\nuse the Eulerian grid-based code FLASH, where stellar winds are injected\nthrough tabulated wind velocities and mass loss rates. We implement a\ngradient-based shock detection algorithm to resolve the shocked regions where\nthe CRs are injected dynamically. Simulations are performed for different\nvalues of the CR diffusion coefficient and star velocities within an ISM-like\nenvironment up to 180 kyr to showcase the impact of dynamical CR injection on\nthe early evolution of the wind-driven bow shock. With a simplified spectral\nmodel in post-processing, we calculate the expected upper limits of\n$\\gamma$-ray and synchrotron emission and compare with those from current\nobservations. We observe that variations of CR diffusion rates can strongly\ndictate the morphology of the bow shock and the overall $\\gamma$-ray and radio\nsynchrotron luminosity due to the balance between the CR injection efficiency\nand diffusion. Our results yield qualitatively comparable results with current\nobservations, primarily attributed to the high-energy protons and electrons\ncontributing to non-thermal emission from efficient acceleration at the forward\nshock through the approximations and assumptions in the injection algorithm. We\nconclude that CR acceleration, with varying CR diffusion rates, may\nsubstantially affect the morphology of wind-driven bow shocks and their\nnon-thermal emission, if there is efficient particle acceleration in the\nforward shock. [abridged]"}
{"id": "2510.12317", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.12317", "abs": "https://arxiv.org/abs/2510.12317", "authors": ["Masahiro Tsujimoto", "Daiki Miura", "Hiroya Yamaguchi", "Ehud Behar", "Chris Done", "Maria Diaz Trigo", "Chamani M. Gunasekera", "Peter A. M. van Hoof", "Stefano Bianchi", "Maryam Dehghanian", "Gary J. Ferland"], "title": "Fe XVIII-XXIV K beta Inner-shell Absorption Lines in the X-ray Spectra of Neutron Star and Black Hole Binaries with XRISM", "comment": "4 pages, 6 figures, accepted for publication in Plasma and Fusion\n  Research", "summary": "The advent of the X-ray microcalorimeter spectrometer Resolve onboard the\nXRISM space telescope opened a new era for high-resolution X-ray spectroscopy\nof astrophysical plasmas. Many spectral features were newly detected, including\nthe K alpha and K beta inner-shell transition lines of mildly ionized (F- to\nLi-like) Fe at 6-8 keV in the spectra of X-ray binaries and active galactic\nnuclei. The widely used atomic databases contain information on the K alpha but\nnot K beta lines of these ions. We conducted the atomic structure calculation\nusing FAC to derive the Fe K alpha and K beta lines and verified the result\nagainst ground experiments and other calculations of the Fe K alpha lines. We\nthen implemented the Fe K beta lines in a radiative transfer code (cloudy) and\ncompared the synthesized and observed spectra with XRISM. A reasonably good\nagreement was obtained between the observation and the ab initio calculations.\nThis exemplifies the need to expand the atomic databases to interpret\nastrophysical spectra."}
{"id": "2510.12413", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.12413", "abs": "https://arxiv.org/abs/2510.12413", "authors": ["Quentin Pognan", "Kyohei Kawaguchi", "Shinya Wanajo", "Sho Fujibayashi", "Anders Jerkstrand"], "title": "Lanthanide Impact on the Infra-Red Spectra of Nebular Phase Kilonovae", "comment": "25 pages, 15 figures, submitted to MNRAS", "summary": "Nebular phase kilonovae (KNe) have significant infra-red (IR) emission\nthought to be mostly forbidden emission lines from rapid neutron capture\n(r-process) species in neutron star merger ejecta. Lanthanide elements in\nparticular have complex atomic structures with many IR transitions. Using\nnon-local thermodynamic equilibrium (NLTE) radiative transfer simulations, we\nexplore the impact of lanthanides on the IR spectra of KNe in the nebular\nphase, exploring a parameter space of ejecta mass and lanthanide fraction. We\nfind that lanthanide impact is greater at higher densities, corresponding to\nearlier epochs and greater ejecta masses. The wavelengths most affected are\nfound to be $\\lambda \\lesssim 4~\\mu$m, with the species Ce\\,\\textsc{iii} and Nd\n\\textsc{ii} being the most important contributors to spectral formation. We\nalso find significant emission from species proposed in observations, notably\nTe\\,\\textsc{iii} at 2.1 $\\mu$m, and Se\\,\\textsc{iii} at 4.5 and 5.7 $\\mu$m,\nwhile W\\,\\textsc{iii} is subdominant at 4.5 $\\mu$m. The Te\\,\\textsc{iii}\nfeature at 2.1 $\\mu$m is always blended, particularly with Zr\\,\\textsc{ii},\nCe\\,\\textsc{iii}, and Nd\\,\\textsc{ii}. We do not reproduce the smooth\nblackbody-like continua observed in AT2023vfi. Based on our results, we argue\nthat line opacity alone is likely insufficient to produce optically thick\ncontinua in the nebular phase, even in the case of lanthanide/actinide-rich\nejecta, as our models are optically thin in the IR at these epochs. Given that\nlanthanide contributions are dominant below 4 $\\mu$m, we suggest that NIR\nobservations best probe these elements, while MIR spectroscopy with\n\\textit{JWST} can reliably probe non-lanthanide emission even in relatively\nlanthanide-rich cases."}
{"id": "2510.12465", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2510.12465", "abs": "https://arxiv.org/abs/2510.12465", "authors": ["Stefano Torniamenti", "Michela Mapelli", "Lumen Boco", "Filippo Simonato", "Giuliano Iorio", "Erika Korb"], "title": "Optically thick winds of very massive stars suppress intermediate-mass black hole formation", "comment": "10 pages, 7 figures. Comments welcome", "summary": "Intermediate-mass black holes (IMBHs) are the link between stellar-mass and\nsupermassive black holes. Gravitational waves have started unveiling a\npopulation of IMBHs in the $\\sim 100-300 \\, \\mathrm{M_{\\odot}}$ range. Here, we\ninvestigate the formation of IMBHs from very massive stars (VMSs, $>100\\,{}\n\\mathrm{M_{\\odot}}$). We calculate new VMS models that account for the\ntransition from optically thin to optically thick winds, and study how this\nenhanced mass loss affects IMBH formation and the black hole mass function at\nintermediate and high metallicity ($Z=10^{-4}-0.02$). We show that optically\nthick winds suppress the formation of IMBHs from direct VMS collapse at\nmetallicities $Z>0.001$, one order of magnitude lower than predicted by\nprevious models. Our models indicate that the stellar progenitors of GW231123\nmust have had a metallicity $Z<0.002$, if the primary black hole formed via\ndirect VMS collapse."}
{"id": "2510.12505", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.12505", "abs": "https://arxiv.org/abs/2510.12505", "authors": ["Christopher N. Everett", "Marc Klinger-Plaisier", "Garret Cotter"], "title": "DIPLODOCUS II: Implementation of transport equations and test cases relevant to micro-scale physics of jetted astrophysical sources", "comment": "26 pages, 24 figures, submitted to Physical Review D", "summary": "DIPLODOCUS (Distribution-In-PLateaux methODOlogy for the CompUtation of\ntransport equationS) is a novel framework being developed for the general\ntransport of particle distribution functions through the seven dimensions of\nphase space, including forcing terms and interactions between particles.\nFollowing Paper I, which details the background analytic framework, this second\npaper provides an overview of the numerical implementation in the form of the\ncode package Diplodocus$.$jl, written in Julia, including the description of a\nnovel Monte-Carlo sampling technique for the pre-computation of anisotropic\ncollision integrals. In addition to the discussion of numerical implementation,\na selection of test cases are presented to examine the package's capabilities.\nThese test cases focus on micro-scale physical effects: binary collisions,\nemissive interactions and external forces that are relevant to the modelling of\njetted astrophysical sources, such as Active Galactic Nuclei and X-Ray\nBinaries."}
{"id": "2510.12506", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.12506", "abs": "https://arxiv.org/abs/2510.12506", "authors": ["Lingqi Meng", "Paulo C. C. Freire", "Kevin Stovall", "Norbert Wex", "Xueli Miao", "Weiwei Zhu", "Michael Kramer", "James M. Cordes", "Huanchen Hu", "Jinchen Jiang", "Emilie Parent", "Lijing Shao", "Ingrid H. Stairs", "Mengyao Xue", "Adam Brazier", "Fernando Camilo", "David J. Champion", "Shami Chatterjee", "Fronefield Crawford", "Ziyao Fang", "Qiuyang Fu", "Yanjun Guo", "Jason W. T. Hessels", "Maura MacLaughlin", "Chenchen Miao", "Jiarui Niu", "Ziwei Wu", "Jumei Yao", "Mao Yuan", "Youlin Yue", "Chengmin Zhang"], "title": "The double neutron star PSR J1946+2052 I. Masses and tests of general relativity", "comment": "12 figures and 3 tables, accepted for publication in A&A", "summary": "We conducted high-precision timing of PSR J1946+2052 to determine the masses\nof the two neutron stars in the system, test general relativity (GR) and\nassessed the system's potential for future measurement of the moment of inertia\nof the pulsar. We analysed seven years of timing data from the Arecibo 305-m\nradio telescope, the Green Bank Telescope (GBT), and the Five-hundred-meter\nAperture Spherical radio Telescope (FAST). The data processing accounted for\ndispersion measure variations and relativistic spin precession-induced profile\nevolution. We employed both DDFWHE and DDGR binary models to measure the spin\nparameters, kinematic parameters and orbital parameters. The timing campaign\nhas resulted in the precise measurement of five post-Keplerian parameters,\nwhich yield very precise masses for the system and three tests of general\nrelativity. One of these is the second most precise test of the radiative\nproperties of gravity to date: the intrinsic orbital decay, $\\dot{P}_{\\rm\nb,int}=-1.8288(16)\\times10^{-12}\\rm\\,s\\,s^{-1}$, represents $1.00005(91)$ of\nthe GR prediction, indicating that the theory has passed this stringent test.\nThe other two tests, of the Shapiro delay parameters, have precisions of 6\\%\nand 5\\% respectively; this is caused by the moderate orbital inclination of the\nsystem, $\\sim 74^{\\circ}$; the measurements of the Shapiro delay parameters\nalso agree with the GR predictions. Additionally, we analysed the higher-order\ncontributions of $\\dot{\\omega}$, including the Lense-Thirring contribution.\nBoth the second post-Newtonian and the Lense-Thirring contributions are larger\nthan the current uncertainty of $\\dot{\\omega}$\n($\\delta\\dot{\\omega}=4\\times10^{-4}\\,\\rm deg\\,yr^{-1}$), leading to the\nhigher-order correction for the total mass."}
{"id": "2510.12510", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.12510", "abs": "https://arxiv.org/abs/2510.12510", "authors": ["A. Inventar", "G. Peron", "S. Recchia", "S. Gabici"], "title": "Gamma-rays from Wolf-Rayet stellar winds", "comment": "8 pages, 2 figures, ICRC proceeding", "summary": "Gamma-ray observations of young star clusters have recently provided evidence\nfor particle acceleration occurring at stellar wind termination shocks, fueled\nby the mechanical energy of stellar winds from massive stars. In this work, we\nexplore the possibility that the wind from a single powerful star, whether\nisolated or part of a cluster, can alone provide sufficient energy to generate\ngamma-ray emission detectable by current instruments. This scenario is\nparticularly relevant given that a significant fraction of Wolf-Rayet (WR)\nstars are not found within clusters. To investigate this, we compiled a large\nsample of WR stars and ranked them based on their wind luminosity divided by\nthe square of their distance, a proxy for their potential gamma-ray flux. We\nthen searched for spatial coincidences between the most promising candidates\nand cataloged gamma-ray sources. This analysis leads us to propose associations\nbetween the stars WR14, WR110, WR111, and WR114 and several unidentified\ngamma-ray sources. These results suggest that WR stellar winds could represent\na distinct and previously unrecognized population of gamma-ray emitters."}
{"id": "2510.12562", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.12562", "abs": "https://arxiv.org/abs/2510.12562", "authors": ["A. Inventar", "S. Gabici", "E. Peretti"], "title": "Modeling gamma-ray signatures of particle acceleration in stellar clusters from GeV to PeV", "comment": "8 pages, 3 figures, ICRC proceeding", "summary": "Young massive stellar clusters (YMSCs) have recently regained interest as\nPeVatron candidates, potentially accounting for the cosmic-ray (CR) knee as\nalternatives to isolated supernova remnants (SNRs). LHAASO's unique capability\nto detect photons above 0.1 PeV, hence tracing multi-PeV CRs, can provide\ncritical constraints on galactic acceleration models when combined with\nH.E.S.S. and Fermi-LAT data. We investigate the transport of particles from\nYMSCs acceleration sites, namely wind termination shocks (WTS) or embedded\nSNRs, to nearby dense molecular clouds where proton-proton interactions produce\nhigh-energy gamma rays. We determine the necessary conditions, such as the\ndistance between the acceleration site and the target, or the cluster's power\nand age, for detectable gamma-ray excesses and identify viable systems through\nparameter space exploration. By comparing with observations, we can constrain\nkey physical parameters including WTS efficiency, diffusion coefficient and\ninjection slope. Our analysis also examines whether some of LHAASO's\nunidentified sources might correspond to such cluster-cloud systems."}
{"id": "2510.12572", "categories": ["astro-ph.HE", "astro-ph.GA", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2510.12572", "abs": "https://arxiv.org/abs/2510.12572", "authors": ["Kishore C. Patra", "Ryan J. Foley", "Nicholas Earl", "Kyle W. Davis", "Enrico Ramirez-Ruiz", "V. Ashley Villar", "Sebastian Gomez", "K. Decker French", "Kirsty Taggart", "Prasiddha Arunachalam", "Phillip Macias", "Ravjit Kaur", "Samaporn Tinyanont"], "title": "JWST and Keck Observations of the Off-Nuclear TDE AT 2024tvd: A Massive Nuclear Star Cluster and Minor-Merger Origin for its Black Hole", "comment": "22 pages, 9 figures, comments welcome", "summary": "We present JWST/NIRSpec and NIRCam observations of the first optically\nselected off-nuclear tidal disruption event (TDE), AT 2024tvd, along with\nKeck/KCWI integral field unit spectroscopy. The spectra show broad H and He\nemission lines that are characteristic of a TDE. Stellar kinematics show smooth\nhost-galaxy morphology and ordered bulge rotation, with no evidence of\ndisturbances in velocity, dispersion, age or metallicity space. We construct\nthe first quasi-simultaneous spectral-energy distribution (SED) from X-rays to\ninfrared for a TDE and decompose it into three components: the TDE accretion\nflow, an unresolved nuclear star cluster (NSC), and heated dust emission. The\naccretion component implies a black hole mass of $\\log(M_\\bullet/M_\\odot) =\n5.50\\pm 0.04$, an instantaneous super-Eddington accretion rate of $\\log\n(\\dot{M}/M_{\\odot} yr^{-1}) = -1.22 \\pm 0.04$, and an outer disk photosphere\nradius of $\\log(r_{out}/r_{g}) = 3.8 \\pm 0.1$. The dust emission is well\ndescribed by a blackbody with $T_{dust} = 873\\pm 15$ K and peak luminosity\n$\\log (L_{dust}/erg$ $s^{-1}) = 40.80\\pm 0.01$, consistent with a dust echo\nnear the sublimation radius. The SED is best fit when including additional\nstellar emission above the galaxy background at the TDE location, corresponding\nto $\\log(M_{\\star}/M_\\odot) = 7.97^{+0.16}_{-0.26}$, which we interpret as a\nmassive NSC or an ultra-compact dwarf galaxy. These results support a\nminor-merger origin for the MBH responsible for the TDE over scenarios\ninvolving gravitational recoil or dynamical ejection from the nucleus."}
{"id": "2510.12649", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2510.12649", "abs": "https://arxiv.org/abs/2510.12649", "authors": ["Ali Raza", "Huihai He", "Faisal Akram", "The LHAASO Collaboration"], "title": "Energy calibration of LHAASO-KM2A using the cosmic ray Moon shadow", "comment": "12 pages, 13 figures, 2 tables", "summary": "We present a precise measurement of the westward, rigidity-dependent shift of\nthe Moon's shadow using three and a half years of cosmic-ray data collected by\nthe Kilometer Square Array (KM2A) of the Large High Altitude Air Shower\nObservatory (LHAASO). These measurements enable us to calibrate the detector\nenergy response in the range 20-260 TeV, with results showing excellent\nagreement with the response derived from Monte Carlo (MC) simulations of the\nKM2A detector. We also measure a best-fit parameter $\\epsilon = 0.015 \\pm\n0.08$, corresponding to a 95% confidence interval of [-14%, +17%] for the\nenergy-scale estimation. This result establishes the exceptional accuracy of\nthe KM2A-MC in simulating the detector's response within this energy range."}
{"id": "2510.12654", "categories": ["astro-ph.HE", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2510.12654", "abs": "https://arxiv.org/abs/2510.12654", "authors": ["Jesús A. Toalá", "Diego A. Vasquez-Torres"], "title": "The Influence of the Accretion Disc Structure on X-ray Spectral States in Symbiotic Binaries", "comment": "12 pages, 12 figures; Accepted to MNRAS", "summary": "Symbiotic stars are binary systems where a white dwarf (WD) accretes material\nfrom the wind of an evolved, late-type companion. X-ray-emitting symbiotic\nsystems are classified into $\\alpha$, $\\beta$, $\\delta$, and $\\beta/\\delta$\ntypes, attributed to distinct physical mechanisms such as thermonuclear\nburning, wind interactions, and accretion-driven boundary layers. We present\nsynthetic X-ray spectra derived from hydrodynamics simulations using the\nPHANTOM code, coupled with radiative-transfer calculations from SKIRT. We\nreproduce all X-ray spectral types by exploring different density structure of\nthe accretion disc, the viewing angle, the plasma temperature of the boundary\nlayer, and/or the presence of extended emission. The synthetic X-ray spectra\nconsist of both absorbed and reflected components. In systems with massive,\nhigh-column density discs and viewing angles close to edge-on, the reflected\ncontinuum can dominate the X-ray emission. This effect is less pronounced in\nsystems with low-mass, lower-column density discs. We explore i) systems going\nfrom $\\delta$ to $\\beta$ states, ii) $\\delta$-types that become $\\beta/\\delta$\nsources, iii) the variability of the three Fe emission lines in the 6.0-7.0\nenergy range, and iv) the possible physical processes behind the $\\alpha$\nsources. The observations from iconic symbiotic systems are discussed in line\nof the present models. Our framework offers predictive power for future X-ray\nmonitoring and provides a path toward connecting accretion disc physics with\nobserved spectral states in symbiotic binaries with accreting WDs."}
{"id": "2510.12674", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.12674", "abs": "https://arxiv.org/abs/2510.12674", "authors": ["Noam Soker"], "title": "Tycho supernova exploded inside a planetary nebula (SNIP)", "comment": "It will be submitted in two days to allow for comments (including\n  missing references)", "summary": "I examine recent observations of the type Ia supernova remnant (SNR Ia) Tycho\nand conclude that Tycho is an SN Ia inside a planetary nebula (SNIP). The\nobservations reveal two opposite protrusions, termed ears, projected on the\nmain shell of Tycho. The pair of ear structures resembles that of the SNRs Ia\nKepler, SNR G299-2.9, and SNR G1.9+0.3, which earlier studies considered as\nSNIPs. The requirement that the explosion occurs within hundreds of thousands\nof years after the formation of the planetary nebula (by the second star to\nevolve) makes the core-degenerate scenario the most likely for Tycho. Several\nother possible scenarios lead to an SNIP, but they are unlikely for Tycho. The\nidentification of Tycho as an SNIP leads to two general conclusions. (1) The\nfraction of SNIPs among normal SNe Ia is very large, ~70-90%. Namely, the vast\nmajority of normal SNe Ia are SNIPs. (2) To accommodate the large fraction of\nSNIPs, the delay time distribution of normal SNe Ia includes not only the\nstellar evolution timescale (as usually assumed), but also includes pockets of\nyounger stellar populations in galaxies without ongoing star formation; the\nSNIPs come from the younger stellar populations in galaxies."}
{"id": "2510.12782", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2510.12782", "abs": "https://arxiv.org/abs/2510.12782", "authors": ["Congyao Zhang", "Irina Zhuravleva", "Annie Heinrich", "Elena Bellomi", "Nhut Truong", "John ZuHone", "Eugene Churazov", "Megan E. Eckart", "Yutaka Fujita", "Julie Hlavacek-Larrondo", "Yuto Ichinohe", "Maxim Markevitch", "Kyoko Matsushita", "François Mernier", "Eric D. Miller", "Koji Mori", "Hiroshi Nakajima", "Anna Ogorzalek", "Frederick S. Porter", "Ayşegül Tümer", "Shutaro Ueda", "Norbert Werner"], "title": "Mapping the Perseus Galaxy Cluster with XRISM: Gas Kinematic Features and their Implications for Turbulence", "comment": "15 pages, 17 figures, submitted to A&A", "summary": "In this paper, we present extended gas kinematic maps of the Perseus cluster\nby combining five new XRISM/Resolve pointings observed in 2025 with four\nPerformance Verification datasets from 2024, totaling 745 ks net exposure. To\ndate, Perseus remains the only cluster that has been extensively mapped out to\n~0.7$r_{2500}$ by XRISM/Resolve, while simultaneously offering sufficient\nspatial resolution to resolve gaseous substructures driven by mergers and AGN\nfeedback. Our observations cover multiple radial directions and a broad\ndynamical range, enabling us to characterize the intracluster medium kinematics\nup to the scale of ~500 kpc. In the measurements, we detect high velocity\ndispersions ($\\simeq$300 km/s) in the eastern region of the cluster,\ncorresponding to a nonthermal pressure fraction of $\\simeq$7-13%. The velocity\nfield outside the AGN-dominant region can be effectively described by a single,\nlarge-scale kinematic driver based on the velocity structure function, which\nstatistically favors an energy injection scale of at least a few hundred kpc.\nThe estimated turbulent dissipation energy is comparable to the gravitational\npotential energy released by a recent merger, implying a significant role of\nturbulent cascade in the merger energy conversion. In the bulk velocity field,\nwe observe a dipole-like pattern along the east-west direction with an\namplitude of $\\simeq\\pm$200-300 km/s, indicating rotational motions induced by\nthe recent merger event. This feature constrains the viewing direction to\n~30$^\\circ$-50$^\\circ$ relative to the normal of the merger plane. Our\nhydrodynamic simulations suggest that Perseus has experienced at least two\nenergetic mergers since redshift z~1, the latest associated with the radio\ngalaxy IC310. This study showcases exciting scientific opportunities for future\nmissions with high-resolution spectroscopic capabilities (e.g., HUBS, LEM, and\nNewAthena)."}
