{"id": "2510.12853", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2510.12853", "abs": "https://arxiv.org/abs/2510.12853", "authors": ["Quentin Villegas", "Laurence Denneulin", "Simon Prunet", "André Ferrari", "Nelly Pustelnik", "Éric Thiébaut", "Julian Tachella", "Maud Langlois"], "title": "Diffusion models for polarimetric reconstruction of circumstellar environments", "comment": "in French language. GRETSI 2025 -- XXXe Colloque sur le Traitement du\n  Signal et des Images, Aug 2025, Strasboug, France", "summary": "In this paper, we propose an approach combining diffusion models and inverse\nproblems for the reconstruction of circumstellar disk images. Our method builds\nupon the Rhapsodie framework for polarimetric imaging, substituting its\nclassical prior with a diffusion model trained on synthetic data. Our\nformulation explicitly incorporates stellar leakage while efficiently handling\nmissing data and high level noise inherent to high-contrast polarimetric\nimaging. Experiments show significant improvement over conventional methods\nwithin our framework of assumptions, opening new perspectives for studying\ncircumstellar environments."}
{"id": "2510.12861", "categories": ["astro-ph.IM", "85-10 (Primary)"], "pdf": "https://arxiv.org/pdf/2510.12861", "abs": "https://arxiv.org/abs/2510.12861", "authors": ["Richard J. Mathar"], "title": "Simulation of Time-dependent Karhunen-Loeve Phase Screens: an Ergodic Approach", "comment": "14 pages, 7 figures, mode list in the anc directory", "summary": "Time-dependent phase screens in ground-based astronomy are typically\nsimulated in the so-called frozen-screen approximation by establishing a static\nphase screen on a large pupil and dragging an aperture equivalent to the size\nof the actual input pupil across this oversized phase screen. The speed of this\nmotion sweeping through the large phase screen is equivalent to a wind speed\nthat changes the phase screen as a function of time.\n  The ergodic ansatz replaces this concept by constructing the structure\nfunction in a three-dimensional volume -- a sphere for reasons of computational\nefficiency -- , sampling phase screens by two-dimensional planar cuts through\nthat volume, and dragging them along the surface normal at some speed which\ngenerates a video of a phase screen.\n  This manuscript addresses the linear algebra of populating the\nthree-dimensional volume with phase screens of the von-Karman model of\natmospheric turbulence."}
{"id": "2510.12920", "categories": ["astro-ph.IM", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.12920", "abs": "https://arxiv.org/abs/2510.12920", "authors": ["Justin Z. Tam", "Pascal Grosset", "Divya Banesh", "Nesar Ramachandra", "Terece L. Turton", "James Ahrens"], "title": "InferA: A Smart Assistant for Cosmological Ensemble Data", "comment": null, "summary": "Analyzing large-scale scientific datasets presents substantial challenges due\nto their sheer volume, structural complexity, and the need for specialized\ndomain knowledge. Automation tools, such as PandasAI, typically require full\ndata ingestion and lack context of the full data structure, making them\nimpractical as intelligent data analysis assistants for datasets at the\nterabyte scale. To overcome these limitations, we propose InferA, a multi-agent\nsystem that leverages large language models to enable scalable and efficient\nscientific data analysis. At the core of the architecture is a supervisor agent\nthat orchestrates a team of specialized agents responsible for distinct phases\nof the data retrieval and analysis. The system engages interactively with users\nto elicit their analytical intent and confirm query objectives, ensuring\nalignment between user goals and system actions. To demonstrate the framework's\nusability, we evaluate the system using ensemble runs from the HACC cosmology\nsimulation which comprises several terabytes."}
{"id": "2510.12938", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2510.12938", "abs": "https://arxiv.org/abs/2510.12938", "authors": ["Nicholas Kirschner", "Zachary Metzler", "Lucas D. Smith", "Carolyn Kierans", "Regina Caputo", "Nicholas Cannady", "Makoto Sasaki", "Daniel Shy", "Priyarshini Ghosh", "Sean Griffin", "J. Eric Grove", "Elizabeth Hays", "Iker Liceaga-Indart", "Emily Kong", "Julie McEnery", "John Mitchell", "A. A. Moiseev", "Lucas Parker", "Jeremy S. Perkins", "Bernard Phlips", "Adam J. Schoenwald", "Clio Sleator", "Jacob Smith", "Janeth Valverde", "Sambid Wasti", "Richard Woolf", "Eric Wulf", "Anna Zajczyk"], "title": "Calibration of the ComPair Balloon Instrument", "comment": "23 pages", "summary": "ComPair, the prototype of the All-sky Medium Energy Gamma-ray Observatory\n(AMEGO) mission concept, is a combined Compton imager and pair production\ntelescope. It consists of four subsystems: a double-sided silicon strip\ndetector (DSSD) Tracker, a virtual Frisch-grid cadmium zinc telluride (CZT) Low\nEnergy Calorimeter, a cesium iodide (CsI) High Energy Calorimeter, and a\nplastic scintillator Anti-Coincidence Detector (ACD) to reject the charged\nparticle background. These subsystems work together to reconstruct events, by\ntracking the locations and energies of gamma-ray scatters and pair production\nevents. To quantify ComPair's scientific capabilities prior to a balloon launch\nin 2023, calibrations were performed to benchmark the instrument's performance\nin terms of angular resolution, energy resolution, and effective area. In this\npaper we provide an overview of the ComPair instrument and detail the\ncalibration campaign. Finally, we compare our results to the expected\nperformance based on simulations."}
{"id": "2510.12869", "categories": ["astro-ph.HE", "physics.plasm-ph"], "pdf": "https://arxiv.org/pdf/2510.12869", "abs": "https://arxiv.org/abs/2510.12869", "authors": ["Rei Nishiura", "Shoma F. Kamijima", "Kunihito Ioka"], "title": "Unified kinetic theory of induced scattering: Compton, Brillouin, and Raman processes in magnetized electron and positron pair plasma", "comment": "34 pages, 6 figures. Comments welcome", "summary": "We present a unified theoretical framework for induced (stimulated)\nscattering-parametric instabilities of electromagnetic waves, including induced\nCompton, stimulated Brillouin, and stimulated Raman scattering (SRS) in\nstrongly magnetized electron-positron pair plasma. By solving the dispersion\nrelations derived from kinetic theory, taking into account the ponderomotive\nforce due to the beat of incident and scattered waves, we obtain analytical\nexpressions for the linear growth rates of the ordinary, neutral, and charged\nmodes of density fluctuations. Our results clarify which type of scattering\ndominates under different thermal coupling, resonance, and density conditions.\nIn strong magnetic fields, scattering of perpendicularly polarized waves is\ngenerally suppressed, but by different powers of the cyclotron frequency.\nMoreover, SRS, which is forbidden in unmagnetized electron and positron pair\nplasma, becomes possible in the charged mode. This framework enables a\ncomprehensive evaluation of induced scattering in extreme astrophysical and\nlaboratory plasma, such as fast radio burst (FRB) emission and propagation in\nmagnetar magnetospheres."}
{"id": "2510.12940", "categories": ["astro-ph.IM", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2510.12940", "abs": "https://arxiv.org/abs/2510.12940", "authors": ["Sepideh Eskandarlou", "Mohammad Akhlaghi", "Johan H. Knapen", "Carlos López-Sanjuan", "Raúl Infante-Sainz", "Helena Domínguez Sánchez", "Zahra Sharbaf", "Héctor Vázquez Ramió", "Juan Antonio Fernández Ontiveros", "César Iñiguez García", "Tamara Civera Lorenzo", "David José Muniesa Gallardo", "Paula R. T. Coelho", "Alessandro Ederoclite", "Jesus Varela", "Fran Jiménez-Esteban", "A. Javier Cenarro", "Antonio Marín-Franch", "Renato A. Dupke", "Mariano Moles", "Carlos Hernández-Monteagudo", "Rahna P. T.", "David Cristóbal-Hornillos", "Jailson Alcaniz", "Laerte Sodré Jr.", "Raul E. Angulo"], "title": "J-PLUS: Turning Off the Bright Stars", "comment": "Accepted for publication in A&A. Supplementary data on Zenodo\n  (http://doi.org/10.5281/zenodo.17348653), project source on Gitlab\n  (https://gitlab.com/Sepideh.Esk/psf-j-plus) and archived on Software Heritage\n  (swh:1:dir:fc95ed9ad173de6fa64690e3d71ab041c630f32c; see text for usage).\n  Abstract is summarized to fit arXiv limit", "summary": "Photometric surveys require precise point spread function (PSF)\ncharacterization, as it varies across filters and is crucial for accurate\nphotometry and low surface brightness (LSB) studies. However, the small PSF\nsize provided by default pipelines suits only barely resolved objects, making\nit difficult to analyze regions near bright stars (rendering those regions\nunusable). These components are then combined to generate a final PSF for each\nexposure and filter, spanning 15 mag arcsec-2 in surface brightness and 4\narcmin in radius in the broad bands. In narrow-band filters, the J-PLUS PSF\nexhibits two rings, whereas in broad-band filters, only one ring is observed.\nAdditionally, the position of the ring shifts with filter wavelength: as the\nfilters become redder, the ring radius increases. We find that there is no\nsignificant variation in the extended PSF observed as a function of time\n(within 2.5h) or position in the field of view. The radial profile of NGC 4212\n(which is close to a star) is also studied before/after PSF-subtraction. We\ndeveloped a novel method to determine the central coordinates of saturated\nstars, and classify stars without using Gaia magnitudes. Additionally, mirror\nreflections are automatically detected and masked. Furthermore, in combining\ndifferent stars and various components of the PSF, we avoided the use of a\nfixed radius by introducing a new method that does not depend on radial\nmeasurements. Accurate characterization of the extended PSF and its subtraction\nimproves sky subtraction, increases the effective area of the survey by about\n10%, and enables the study of extended large LSB features in wide area surveys\nlike J-PLUS. Our pipeline is published as free software (GNU GPLv3) an can be\ncustomized to other surveys such as J-PAS, where its impact will be even\ngreater due to its depth. This paper is fully reproducible and produced from\nCommit 4860c70."}
{"id": "2510.12895", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.12895", "abs": "https://arxiv.org/abs/2510.12895", "authors": ["Marguerite Epstein-Martin", "Nicholas Stone", "Juliette Becker"], "title": "Mean Motion Resonances in AGN Disks", "comment": "23 pages, 7 figures", "summary": "Mean motion resonances (MMRs) are a generic outcome of convergent migration\nfor bodies embedded in accretion disks around a central mass. Long studied in\nplanetary systems, the same phenomenon should occur for stellar-mass black\nholes (BHs) in AGN disks. In this work, we derive simple analytic criteria\ndescribing when BH pairs are driven out of resonance, and use them to chart MMR\nstability across AGN parameter space, accounting for disruption from\ngeneral-relativistic apsidal precession, hydrodynamic turbulence, and stellar\nstirring. Across plausible AGN disk models, we find three MBH mass regimes: (i)\nfor $M/ M_\\odot\\gtrsim 10^{7.5}$, first order resonances are generically\nunstable; (ii) for $M/ M_\\odot\\lesssim 10^{6.5}$, stable MMRs are always\npresent; (iii) for $10^{6.5}\\lesssim M / M_\\odot \\lesssim 10^{7.5}$, stability\ndepends on disk mass flux, the summed mass of the orbiters, and the\nnuclear-cusp slope. When present, stable MMRs commonly occur between an inner\nanti-trap and an outer trap set by thermal torque, a region where embedded\nobjects migrate outward in the disk. These results imply that high-mass AGN\nallow convergent migration to proceed to LVK-band mergers largely without\nresonant chains, whereas low/intermediate-mass AGN can host MMRs, with the\npotential to reshape merger pathways."}
{"id": "2510.12958", "categories": ["astro-ph.IM", "astro-ph.HE", "astro-ph.SR", "cs.LG"], "pdf": "https://arxiv.org/pdf/2510.12958", "abs": "https://arxiv.org/abs/2510.12958", "authors": ["Rithwik Gupta", "Daniel Muthukrishna", "Jeroen Audenaert"], "title": "Simulation-Based Pretraining and Domain Adaptation for Astronomical Time Series with Minimal Labeled Data", "comment": null, "summary": "Astronomical time-series analysis faces a critical limitation: the scarcity\nof labeled observational data. We present a pre-training approach that\nleverages simulations, significantly reducing the need for labeled examples\nfrom real observations. Our models, trained on simulated data from multiple\nastronomical surveys (ZTF and LSST), learn generalizable representations that\ntransfer effectively to downstream tasks. Using classifier-based architectures\nenhanced with contrastive and adversarial objectives, we create domain-agnostic\nmodels that demonstrate substantial performance improvements over baseline\nmethods in classification, redshift estimation, and anomaly detection when\nfine-tuned with minimal real data. Remarkably, our models exhibit effective\nzero-shot transfer capabilities, achieving comparable performance on future\ntelescope (LSST) simulations when trained solely on existing telescope (ZTF)\ndata. Furthermore, they generalize to very different astronomical phenomena\n(namely variable stars from NASA's \\textit{Kepler} telescope) despite being\ntrained on transient events, demonstrating cross-domain capabilities. Our\napproach provides a practical solution for building general models when labeled\ndata is scarce, but domain knowledge can be encoded in simulations."}
{"id": "2510.12932", "categories": ["astro-ph.HE", "astro-ph.CO"], "pdf": "https://arxiv.org/pdf/2510.12932", "abs": "https://arxiv.org/abs/2510.12932", "authors": ["Simon Stevenson", "Anais Möller", "Jade Powell"], "title": "Strategy for identifying Vera C. Rubin Observatory kilonova candidates for targeted gravitational-wave searches", "comment": "Submitted to ApJ", "summary": "Since the observation of the binary neutron star merger GW170817 and the\nassociated kilonova AT2017gfo, the next joint gravitational-wave/optical\nkilonova has been highly anticipated. Overlapping observations between the Vera\nC. Rubin Observatory and the international gravitational-wave detector network\nare expected soon. Wide-field survey facilities, such as Rubin, can serve dual\nroles in gravitational-wave astronomy: conducting dedicated optical counterpart\nsearches following gravitational-wave triggers and, through surveys such as the\nLegacy Survey of Space and Time (LSST), providing opportunities for fortuitous\nkilonova discoveries during routine operations. We use simulations to develop a\nstrategy for identifying kilonova candidates observed by Rubin and processed by\nthe Fink broker. These candidates can be used as astrophysical triggers for a\ntargeted gravitational-wave search. We simulate kilonovae light-curves for the\nfirst year of Rubin with the latest observing strategy for the Wide-Fast-Deep\nand the Deep Drilling Fields. Assuming a kilonova rate of 250 Gpc$^{-3}$\nyr$^{-1}$, we find that Rubin brokers should observe $\\sim 4$ kilonovae per\nyear with at least one alert above a signal-to-noise ratio of 5 within the\ngravitational-wave detector horizon ($\\sim 350$ Mpc). Most of these will be\nfaint, and detected 1-2 days following the neutron star merger. Photometric and\nspectroscopic follow-up will be limited to large telescopes. Using archival\ndata from the Zwicky Transient Facility (ZTF) and our proposed selection\ncriteria, we estimate a minimum contamination of at least 30 events per month\nfrom other transients and variables, even under our strictest selection\ncriteria. A deep gravitational-wave search targeting Rubin kilonova candidates\nmay lead to the next multi-messenger discovery."}
{"id": "2510.12978", "categories": ["astro-ph.IM", "astro-ph.HE", "nucl-th"], "pdf": "https://arxiv.org/pdf/2510.12978", "abs": "https://arxiv.org/abs/2510.12978", "authors": ["Patrick Chi-Kit Cheong", "Christopher L. Fryer"], "title": "Toward First-Principles Multi-Messenger Predictions: Coupling Nuclear Networks with GR Radiation-MHD in {\\tt Gmunu}", "comment": null, "summary": "We present a new implementation of nuclear reaction networks in the\n\\texttt{G}eneral-relativistic \\texttt{mu}ltigrid \\texttt{nu}merical\n(\\texttt{Gmunu}) code, a framework for general relativistic radiation\nmagnetohydrodynamics (GRRMHD). The extended code self-consistently evolves\nnuclear species coupled to hydrodynamics, magnetic fields, and neutrino\nradiation transport under the conformal flatness approximation to Einstein's\nequations. Four approximate nuclear networks are included, with stiff source\nterms integrated using implicit-explicit Runge-Kutta schemes. Validation is\nperformed through benchmarks including conserved-to-primitive recovery with a\ntabulated stellar equation of state, one-zone silicon burning, and hydrodynamic\ntests of shock tubes, acoustic pulses, and detonation fronts of Type Ia\nsupernovae. These tests confirm accurate coupling between nuclear reactions and\nfluid dynamics, conserving electron and nuclear mass fractions to machine\nprecision.\n  As an application, we conduct spherically symmetric core-collapse supernova\nsimulations. The models reproduce the expected non-exploding behavior of\nstandard progenitors, while enhanced neutrino heating revives the shock.\nIncluding nuclear burning modifies the post-shock composition and dynamics,\nconverting silicon and oxygen layers into iron-group nuclei and strengthening\nthe explosion. This demonstrates the impact of explosive burning on ejecta\ncomposition and shock evolution, and establishes the stability of the coupled\nGR radiation-MHD-nuclear framework. The implementation is fully compatible with\nmultidimensional GRMHD simulations and represents the first GRRMHD code\ncombining M1 neutrino transport with fully coupled nuclear burning."}
{"id": "2510.12965", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.12965", "abs": "https://arxiv.org/abs/2510.12965", "authors": ["Lucas Barreto-Mota", "Elisabete M. de Gouveia Dal Pino", "Siyao Xu", "Alexandre Lazarian", "Rafael Alves-Batista", "Gaetano Di Marco", "Stela Adduci Faria"], "title": "Cosmic Ray Transport and Gamma-Ray Signatures in the Interstellar Medium", "comment": "Proceeding ICRC 2025", "summary": "The interaction of cosmic rays (CRs) with magnetic fields and the interstelar\nmedium (ISM) leads to the production of nonthermal radiation. Although this has\nbeen a topic of study for many years, it still poses many challenges to the\nunderstanding of these processes. In this work we present a short review of\nrecent advances in the understanding of CR propagation in magnetohydrodynamical\n(MHD) turbulence, in particular the process of mirror diffusion, and how it can\nhelp explain recent observational constraints for CR diffusion away from\nsources. We also present preliminary results from Monte Carlo simulations of CR\ncascading and propagation within a young massive stellar cluster (YMSC), aimed\nat probing the origin of very-high-energy (VHE) emission from these sources."}
{"id": "2510.13032", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2510.13032", "abs": "https://arxiv.org/abs/2510.13032", "authors": ["A. R. Polish", "P. A. R. Ade", "Z. Ahmed", "M. Amiri", "D. Barkats", "R. Basu Thakur", "C. A. Bischoff", "D. Beck", "J. J. Bock", "H. Boenish", "V. Buza", "B. Cantrall", "J. R. Cheshire IV", "J. Connors", "J. Cornelison", "M. Crumrine", "A. J. Cukierman", "E. Denison", "L. Duband", "M. Echter", "M. Eiben", "B. D. Elwood", "S. Fatigoni", "J. P. Filippini", "A. Fortes", "M. Gao", "C. Giannakopoulos", "N. Goeckner-Wald", "D. C. Goldfinger", "S. Gratton", "J. A. Grayson", "A. Greathouse", "P. K. Grimes", "G. Hall", "G. Halal", "M. Halpern", "E. Hand", "S. A. Harrison", "S. Henderson", "T. D. Hoang", "J. Hubmayr", "H. Hui", "K. D. Irwin", "J. H. Kang", "K. S. Karkare", "S. Kefeli", "J. M. Kovac", "C. Kuo", "K. Lasko", "K. K. Lau", "M. Lautzenhiser", "A. Lennox", "T. Liu", "S. Mackey", "N. Maher", "K. G. Megerian", "L. Minutolo", "L. Moncelsi", "Y. Nakato", "H. T. Nguyen", "R. O'Brient", "S. N. Paine", "A. Patel", "M. A. Petroff", "T. Prouve", "C. Pryke", "C. D. Reintsema", "T. Romand", "M. Salatino", "A. Schillaci", "B. Schmitt", "B. Singari", "A. Soliman", "T. St. Germaine", "A. Steiger", "B. Steinbach", "R. Sudiwala", "K. L. Thompson", "C. Tsai", "C. Tucker", "A. D. Turner", "C. Verges", "A. G. Vieregg", "A. Wandui", "A. C. Weber", "J. Willmert", "W. L. K. Wu", "H. Yang", "C. Yu", "L. Zheng", "C. Zhang", "S. Zhang"], "title": "Improved Absolute Polarization Calibrator for BICEP CMB Polarimeters", "comment": "As submitted to the proceedings of the mm Universe conference, 2025", "summary": "Cosmic birefringence is a hypothesized parity violation in electromagnetism\nthat predicts a frequency-independent polarization rotation as light\npropagates. This would rotate the light from the Cosmic Microwave Background,\nproducing an unexpected EB correlation. However, cosmic birefringence angle is\ndegenerate with instrument polarization angle, and breaking this degeneracy\nrequires an absolute polarization calibration. We calibrate the BICEP3\ntelescope (a 95GHz CMB polarimeter) by observing a rotating polarized source\n(RPS) with both the telescope and a small test receiver called the In-Situ\nAbsolute Angle Calibrator (ISAAC)."}
{"id": "2510.12982", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.12982", "abs": "https://arxiv.org/abs/2510.12982", "authors": ["Vikash Maan", "Aman Katira", "Kunal. P. Mooley"], "title": "Galactic X-ray Transients in the First eROSITA All Sky Survey", "comment": "30 pages, 18 figures, Accepted for publication in MNRAS", "summary": "Although a multitude of studies have focused on targeted observations of\nGalactic X-ray transients, blind surveys and population studies have been\nlimited. We have used the ROSAT, eROSITA and Gaia source catalogs to find\nGalactic X-ray transients having timescales $<$30 years. We report the\nproperties of 738 transients found in our search, majority of which are active\nstars or interacting binaries. We have also found $\\sim$40 compact object\nsystems among which are at least 8 newly-identified white-dwarf systems, 3\nknown X-ray binaries, and one known pulsar. We use eROSITA (soft X-ray) spectra\nof the Galactic transients to show that two distinct types of flaring systems\nare prevalent: one having peak around 1 keV, well fit by thermal models, and\nanother having peak below 0.2 keV and requiring a power-law component. Our\nstudy also reveals that single star or interacting binary systems (X-ray\ntransients) involving giant stars exhibit significantly higher X-ray\nluminosities than systems involving only main-sequence stars or young stellar\nobjects. Finally, we discuss the properties of the transients in the context of\ntheir putative emission mechanisms, the fraction of transients with respect to\nthe total population, and the rates of Galactic transients expected in blind\nsearches of the X-ray sky."}
{"id": "2510.13064", "categories": ["astro-ph.IM", "astro-ph.EP"], "pdf": "https://arxiv.org/pdf/2510.13064", "abs": "https://arxiv.org/abs/2510.13064", "authors": ["Chelsea Adelman", "Steph Sallum", "Matthew De Furio", "Josh Eisner"], "title": "First Demonstration of Kernel Phase Interferometry on JWST/MIRI: Prospects for Future Planet Searches Around Post Main Sequence Stars", "comment": "11 pages, 5 figures. Submitted to SPIE Optics and Photonics\n  Astronomical Applications Proceedings Volume 13627, Techniques and\n  Instrumentation for Detection of Exoplanets XI, paper #13627-21", "summary": "Kernel phase interferometry (KPI) is a post-processing technique that treats\na conventional telescope as an interferometer by accurately modeling a\ntelescope pupil as an array of virtual subapertures. KPI provides angular\nresolution within the diffraction limit by eliminating instrumental phase\nerrors to first order. It has been successfully demonstrated to boost angular\nresolution on both space- and ground-based observatories, and is especially\nuseful for enhancing space telescopes, as their diameters are smaller than the\nlargest ground-based facilities. Here we present the first demonstration of KPI\non JWST/MIRI data at 7.7 microns, 10 microns, and 15 microns. We generate\ncontrast curves for 16 white dwarfs from the MIRI Exoplanets Orbiting White\ndwarfs (MEOW) Survey, finding significantly deeper contrast at small angular\nseparations compared to traditional imaging with JWST/MIRI, down to within\n$\\lambda$/D. Additionally, we use our KPI setup to successfully recover four\nknown companions orbiting white dwarfs and brown dwarfs. This analysis shows\nthat at these wavelengths KPI can uniquely access the orbital parameter space\nwhere inward-migrating post-main-sequence giant exoplanets are now thought to\nexist. We discuss the prospects for applying KPI to a larger sample of white\ndwarfs observed with JWST, increasing the volume of directly imaged close-in\npost-main-sequence exoplanets."}
{"id": "2510.13015", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.13015", "abs": "https://arxiv.org/abs/2510.13015", "authors": ["R. L. Becerra", "Yu-Han Yang", "Eleonora Troja", "Massine El Kabir", "Simone Dichiara", "Niccolò Passaleva", "Brendan O'Connor", "Roberto Ricci", "Chris Fryer", "Lei Hu", "Qinyu Wu", "Muskan Yadav", "Alan M. Watson", "Anastasia Tsvetkova", "Camila Angulo-Valdez", "María D. Caballero-García", "Alberto J. Castro-Tirado", "C. C. Cheung", "Dmitry Frederiks", "Maria Gritsevich", "J. E. Grove", "M. Kerr", "William H. Lee", "Alexandra L. Lysenko", "Margarita Pereyra Talamantes", "Anna Ridnaia", "Rubén Sánchez-Ramírez", "Hui Sun", "Dmitry Svinkin", "Mikhail Ulanov", "R. Woolf", "Bing Zhang"], "title": "Exploring the connection between compact object mergers and fast X-ray transients: The cases of LXT 240402A & EP250207b", "comment": "Submitted to A&A. Comments are welcome", "summary": "The connection between compact object mergers and some extragalactic fast\nX-ray transients (FXRTs) has long been hypothesized, but never ultimately\nestablished. In this work, we investigate two FXRTs, the LEIA X-ray Transient\nLXT\\,240402A and the Einstein Probe EP\\,250207b, whose precise positions lie\nclose to nearby ($z\\!\\lesssim\\!0.1$) quiescent galaxies with negligible\nprobability of chance coincidence, identifying them as particularly promising\ncases of merger-driven explosions in the local Universe. We used Chandra to\nderive accurate localizations for both events and secure otherwise ambiguous\nassociations with their optical counterparts. Deep optical and near-infrared\nobservations with VLT, GTC, and LBT were performed to characterize the\nsurrounding environment and search for kilonova emission, the hallmark of\nneutron star mergers. Complementary early-time X-ray monitoring with Swift and\nEinstein Probe was used to constrain the non-thermal afterglow. We find that\nboth FXRTs remain compatible with a compact binary merger progenitor, which\nproduced low-mass ejecta and kilonova emission subdominant to the afterglow.\nHowever, alternative explanations such as a distant ($z\\!\\gtrsim\\!1$)\ncore-collapse supernova cannot be conclusively ruled out."}
{"id": "2510.13502", "categories": ["astro-ph.IM", "physics.acc-ph", "physics.optics"], "pdf": "https://arxiv.org/pdf/2510.13502", "abs": "https://arxiv.org/abs/2510.13502", "authors": ["Christopher Carilli", "Bojan Nikolic", "Laura Torino", "N. Thyagarajan", "Ubaldo Iriso"], "title": "A New Method for Aperture Masking Interferometric Imaging: Demonstration with the JWST", "comment": "18 pages, 7 figures, 2 tables, submitted to Optical Engineering\n  (SPIE)", "summary": "We present a new method for aperture masking interferometric (AMI) imaging at\nnear-IR wavelengths using radio astronomical techniques. The method starts with\nderivation of interferometric visibilities from a Fourier transform of the\ninterferograms. An iterative joint optimization process is then employed, using\nself-calibration of the interferometric element-based complex voltage gains\n(i.e. electric fields), and CLEAN deconvolution to obtain the source structure.\nWe demonstrate the efficacy of the method using the NIRISS aperture masking\ninterferometer on the James Webb Space Telescope (JWST) at 4.8~$\\mu$m and\n3.8~$\\mu$m. Due to a number of effects (the large pixel size, charge migration,\nnear-field optics), the method also requires an initial visibility-based\namplitude normalization using observations of a well know point-source\ncalibration star. We employ early science observations of the dusty binary\nWolf-Rayet star WR137. Images with a dynamic range (peak/rms) of $\\sim 240$ on\nthe target, and $\\sim 1000$ on the calibrator, are synthesized from a short\nintegration. The self-calibration process determines the photon path-lengths\nthrough the optical system to each aperture using data on the target source\nitself, thereby representing an essentially 'real-time', precise wavefront\nerror sensor. Four independent measures of the JWST mirror segment pistons (two\nwavelengths for two sources), agree to within 10~nm to 15~nm, comparable to the\nexpected errors based on an analysis of closure phases on the calibrator star.\nIncluding a baseline-based phase correction improves the dynamic range of the\nfinal images by about 23\\%."}
{"id": "2510.13066", "categories": ["astro-ph.HE", "gr-qc"], "pdf": "https://arxiv.org/pdf/2510.13066", "abs": "https://arxiv.org/abs/2510.13066", "authors": ["Evgeni Grishin", "Isobel M. Romero-Shaw", "Alessandro A. Trani"], "title": "Gravitational-Wave Signatures of Highly Eccentric Stellar-Mass Binary Black Holes in Galactic Nuclei", "comment": "MNRAS submitted, comments welcome!", "summary": "A significant fraction of compact-object mergers in galactic nuclei are\nexpected to be eccentric in the Laser-Interferometer-Space-Antenna (LISA)\nfrequency sensitivity range, $10^{-4} - 10^{-1}\\ \\rm Hz$. Several compact\nbinaries detected by the LIGO-Virgo-KAGRA Collaboration may retain hints of\nresidual eccentricity at $10$~Hz, suggesting dynamical or triple origins for a\nsignificant fraction of the gravitational-wave-observable population. In triple\nsystems, von-Zeipel-Lidov-Kozai oscillations perturb both the eccentricity and\nthe argument of pericentre, $\\omega$, of the inner black hole binary. The\nlatter could be fully \\textit{circulating}, where $\\omega$ cycles through\n$2\\pi$, or may \\textit{librate}, with $\\omega$ ranges about a fixed value with\nsmall or large variation. We use \\texttt{TSUNAMI}, a regularised N-body code\nwith up to 3.5 post-Newtonian (PN) term corrections, to identify four different\nfamilies of orbits: (i) circulating, (ii) small and (iii) large amplitude\nlibrating, and (iv) merging orbits. We develop and demonstrate a new method to\nconstruct gravitational waveforms using the quadrupole formula utilising the\ninstantaneous {\\it total} acceleration of each binary component in\n\\texttt{TSUNAMI}. We show that the four orbital families have distinct waveform\nphenomenologies, enabling them to be distinguished if observed in LISA. The\norbits are also distinguishable from an isolated binary or from a binary\nperturbed by a different tertiary orbit, even if the secular timescale is the\nsame. Future burst timing models will be able to distinguish the different\norbital configurations. For efficient binary formation, about $\\sim 50$\nbinaries can have librating orbits in the Galactic Centre."}
{"id": "2510.13506", "categories": ["astro-ph.IM", "physics.comp-ph"], "pdf": "https://arxiv.org/pdf/2510.13506", "abs": "https://arxiv.org/abs/2510.13506", "authors": ["Cyril Alispach", "Matthieu Heller", "Teresa Montaruli"], "title": "Design of an Imaging Air Cherenkov Telescope array layout with differential programming", "comment": "9 pages, 15 figures, presented at Fifth MODE Workshop on\n  Differentiable Programming for Experiment Design (MODE2025) on the 8-13 June\n  2025 in Kolymbari, Crete, Greece", "summary": "Current optimization of ground-based Cherenkov telescopes arrays, also called\nImaging Air Cherenkov Telescope (IACT) arrays, relies on brute-force\nhuman-driven approaches based on large simulations requiring both high amount\nof storage and long computation time. To explore the full phase space of\ntelescope positioning of a given array even more simulations would be required.\nTo optimize any array layout, we explore the possibility of developing a\ndifferential program with surrogate models of IACT arrays based on high-level\ninstrument response functions (IRFs). The simulation time of a single telescope\nto a cosmic-ray event can be significantly reduced with its instrument response\nfunction or with generative models. However, it is not straight forward to\nmodel the array of telescopes from a set of single telescope surrogate models\nas the array is a stereoscopic imaging system. The complexity increases as well\nif the telescopes in the array are of different types. Additionally, the\noptimum of the array layout depends on the scientific use case. Current array\nlayout optimization are obtained by minimizing the sensitivity of the array, a\nmetric that depends on several high-level parameters such as the trigger\nefficiency, the energy and angular resolution, as well as the background\nrejection capability. The variety of telescopes types in IACT arrays, such as\nin the Cherenkov Telescope Array Observatory (CTAO), not only extends the\nsensitive energy range but also allows for cross-calibration of the\ninstruments. Therefore, the optimal array layout is not only which minimizes\nsensitivity but also which reduces the systematic uncertainties. We focus on\nthe optimization of a telescope array based on the SST-1M IACTs in Hanle,\nLadakh India aiming at building a generic optimization pipeline for future\nground-based cosmic-ray observatories"}
{"id": "2510.13074", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.13074", "abs": "https://arxiv.org/abs/2510.13074", "authors": ["Evgeni Grishin", "Isobel M. Romero-Shaw", "Alessandro A. Trani"], "title": "Gravitational-Wave Signatures of Highly Eccentric Stellar Binary Black-Holes in Galactic Nuclei", "comment": "4 pages, 3 figures. Proceedings contribution to IAU Symposium 398\n  (MODEST-25, Seoul, June 2025); to appear in the IAU Proceedings Series", "summary": "A significant fraction of gravitational-wave mergers are expected to be\neccentric in the Laser-Interferometer-Space-Antenna (LISA) frequency band,\n$10^{-4} - 10^{-1}$ Hz. Several LIGO-Virgo-KAGRA events show potential hints of\nresidual eccentricity at 10 Hz, pointing to dynamical or triple origins for\npart of the population, where von-Zeipel-Lidov-Kozai oscillations can perturb\nboth the eccentricity and the inclination of the binary. Moreover, the argument\nof pericentre, $\\omega$ could be fully circulating, or librating, with a\nlimited range for $\\omega$. We use TSUNAMI, a regularised N-body code with\n3.5PN corrections to identify four different orbital families: (i) circulating,\n(ii) small-amplitude and (iii) large-amplitude librating, and (iv) merging. We\ndevelop a new method to construct gravitational-wave waveforms using the\nquadrupole formula from the instantaneous acceleration in TSUNAMI. The four\norbital families have distinct waveform phenomenologies, enabling them to be\ndistinguished if observed in LISA. In particular, the properties of the\ntertiary companion can be inferred and serve as an independent mass measurement\nand distinguish field triple dynamics from galactic dynamics."}
{"id": "2510.13765", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2510.13765", "abs": "https://arxiv.org/abs/2510.13765", "authors": ["Anurag Garg"], "title": "Optimizing Supernova Classification with Interpretable Machine Learning Models", "comment": "9 pages, 6 figures. Accepted for publication in Journal of\n  Astrophysics and Astronomy (JAA), Ref: JOAA-D-25-00085R1. Uses jaa.cls class\n  file", "summary": "Photometric classification of Type Ia supernovae (SNe Ia) is critical for\ncosmological studies but remains difficult due to class imbalance and\nobservational noise. While deep learning models have been explored, they are\noften resource-intensive and lack interpretability. We present a\ncomputationally efficient and interpretable classification framework that\nmaintains high performance on imbalanced datasets. We emphasize the use of\nPR-AUC and F1-score as more informative metrics than ROC-AUC in severely\nimbalanced settings. Using an XGBoost ensemble optimized via Bayesian\nhyperparameter tuning, we classified light curves from the Supernova\nPhotometric Classification Challenge (SPCC), comprising 21,318 events with a\n3.19 imbalance ratio (non-Ia to Ia). Our model achieved a PR-AUC of\n$0.993^{+0.03}_{-0.02}$, an F1-score of $0.923 \\pm 0.008$, and a ROC-AUC of\n$0.976 \\pm 0.004$, matching or exceeding deep learning performance on\nprecision-recall trade-offs while using fewer resources. Despite slightly lower\noverall accuracy, our method balances false positives and false negatives,\nimproving the efficiency of spectroscopic follow-up. We show that optimized\nensemble models offer a reproducible and lightweight alternative to complex\narchitectures, particularly for large-scale surveys such as the Legacy Survey\nof Space and Time (LSST) where transparency and efficiency are essential."}
{"id": "2510.13187", "categories": ["astro-ph.HE", "astro-ph.CO"], "pdf": "https://arxiv.org/pdf/2510.13187", "abs": "https://arxiv.org/abs/2510.13187", "authors": ["A. P. Mahtessian", "G. S. Karapetian", "H. F. Khachatryan", "M. A. Hovhannisyan", "L. A. Mahtessian", "L. E. Byzalov", "J. M. Sarkissian"], "title": "Some problems associated with the standardization of the light curve of type 1a supernovae", "comment": "13 pages, 5 figures", "summary": "We show that the parameters used to standardize the luminosity of Type 1a\nsupernovae in the SALT2 and SiFTO models are strongly dependent on the redshift\nz. Consequently, when standardized with increasing z, the average absolute\nmagnitudes of Type 1a supernovae are artificially increased. This means that\nfor a given apparent magnitude they are, on average, assigned larger distances\nthan they actually are, creating the appearance of their recession with\nacceleration and requiring the introduction of the concept of antigravity (dark\nenergy) to explain it. We also show that after standardization, Type 1a\nsupernovae cease to be standard candles. We therefore argue that such a\nstandardization is not suitable for measuring the distances to Type 1a\nsupernovae, and hence the accelerating expansion of the Universe is called into\nquestion."}
{"id": "2510.13249", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.13249", "abs": "https://arxiv.org/abs/2510.13249", "authors": ["Wei Meng", "Yuan You", "Shuang-Nan Zhang", "Jia-Ying Cao"], "title": "Monte Carlo simulation of the Compton scattering and disk reflection of a cylinder with hot electrons moving away from a black hole", "comment": "26 pages, 27 figures, 2 tables, submitted", "summary": "For accreting black holes (BHs), the lamp-post scenario is a simple and\npopular model: a hot and point-like corona is located above the black hole,\nirradiating the accretion disk with hard X-ray radiation, which is believed to\nbe generated by inverse Compton scattering in the corona. Although the\nlamp-post model successfully explains the disk reflection component, it fails\nto address the origin of seed photons and the geometry of the hot corona,\nbecause this model simplistically treats the corona as a point-like source\ngenerating a cutoff powerlaw spectrum. In this paper, we make simulations on a\npossible physical realization of the lamp-post scenario: the shape of the\nscattering zone is set to be a cylinder, corresponding to the jet base near a\nBH. The source of seed photons in this system is assumed to be the multicolor\nblackbody radiation of the accretion disk. In our simulations, the Compton\nscattering process is simulated with a custom Monte Carlo program based on the\nGeant4 package and the disk reflection process is simulated with the xilconv\nmodel in XSPEC. Our simulation results have confirmed that the relativistic\nmotion of the jet can weaken or even completely suppress the reflection of the\naccretion disk, and simultaneously, the Comptonization of disk photons in the\njet can still make a major contribution to the observed X-ray spectrum in high\nenergy range. We discuss the implications of our simulation results, in light\nof the recent observations of a very weak reflection component in the presence\nof a strong hard X-ray radiation from the outburst of Swift J1727.8-1613."}
{"id": "2510.13337", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.13337", "abs": "https://arxiv.org/abs/2510.13337", "authors": ["Alexey D. Nekrasov", "Thomas Dauser", "Javier A. Garcia", "Dominic J. Walton", "Christian M. Fromm", "Andrew J. Young", "Fergus J. E. Baker", "Amy M. Joyce", "Ole Koenig", "Stefan Licklederer", "Julia Haefner", "Joern Wilms"], "title": "Relativistic reflection within an extended hot plasma geometry", "comment": "14 pages, 10 figures, accepted for publication by A&A, the new\n  RELXILL model can be downloaded at\n  https://www.sternwarte.uni-erlangen.de/research/relxill/", "summary": "Reflection of X-rays at the inner accretion disk around black holes imprints\nrelativistically broadened features in the observed spectrum. Besides the black\nhole properties and the ionization and density of the accretion disk the\nfeatures also depend on the location and geometry of the primary source of\nX-rays, often called the corona. We present a fast general relativistic model\nfor spectral fitting of a radially extended, ring-like corona above the\naccretion disk. A commonly used model to explain observed X-ray reflection\nspectra is the lamp post, which assumes a point-like source on the rotational\naxis of the black hole. While often being able to explain the observations,\nthis geometric model does not allow for a constraint on the radial size of the\ncorona. We therefore extend the publicly available relativistic reflection\nmodel RELXILL by implementing a radially extended, ring-like primary source.\nWith the new RELXILL model allowing us to vary the position of the primary\nsource in two dimensions, we present simulated line profiles and spectra and\ndiscuss implications of data fitting compared to the lamp post model. We then\napply this extended RELXILL model to XMM-Newton and NuSTAR data of the\nradio-quiet Seyfert-2 AGN ESO 033-G002. The new model describes the data well,\nand we are able to constrain the distance of the source to the black hole to be\nless than three gravitational radii, while the angular position of the source\nis poorly constrained. We show that a compact, radially extended corona close\nto the ISCO can explain the observed relativistic reflection equally well as\nthe point-like lamp post corona. The model is made freely available to the\ncommunity."}
{"id": "2510.13403", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.13403", "abs": "https://arxiv.org/abs/2510.13403", "authors": ["R. Abbasi", "M. Ackermann", "J. Adams", "S. K. Agarwalla", "J. A. Aguilar", "M. Ahlers", "J. M. Alameddine", "S. Ali", "N. M. Amin", "K. Andeen", "C. Argüelles", "Y. Ashida", "S. Athanasiadou", "S. N. Axani", "R. Babu", "X. Bai", "J. Baines-Holmes", "A. Balagopal V.", "S. W. Barwick", "S. Bash", "V. Basu", "R. Bay", "J. J. Beatty", "J. Becker Tjus", "P. Behrens", "J. Beise", "C. Bellenghi", "B. Benkel", "S. BenZvi", "D. Berley", "E. Bernardini", "D. Z. Besson", "E. Blaufuss", "L. Bloom", "S. Blot", "I. Bodo", "F. Bontempo", "J. Y. Book Motzkin", "C. Boscolo Meneguolo", "S. Böser", "O. Botner", "J. Böttcher", "J. Braun", "B. Brinson", "Z. Brisson-Tsavoussis", "R. T. Burley", "D. Butterfield", "M. A. Campana", "K. Carloni", "J. Carpio", "S. Chattopadhyay", "N. Chau", "Z. Chen", "D. Chirkin", "S. Choi", "B. A. Clark", "A. Coleman", "P. Coleman", "G. H. Collin", "D. A. Coloma Borja", "A. Connolly", "J. M. Conrad", "D. F. Cowen", "C. De Clercq", "J. J. DeLaunay", "D. Delgado", "T. Delmeulle", "S. Deng", "P. Desiati", "K. D. de Vries", "G. de Wasseige", "T. DeYoung", "J. C. Díaz-Vélez", "S. DiKerby", "T. Ding", "M. Dittmer", "A. Domi", "L. Draper", "L. Dueser", "D. Durnford", "K. Dutta", "M. A. DuVernois", "T. Ehrhardt", "L. Eidenschink", "A. Eimer", "P. Eller", "E. Ellinger", "D. Elsässer", "R. Engel", "H. Erpenbeck", "W. Esmail", "S. Eulig", "J. Evans", "P. A. Evenson", "K. L. Fan", "K. Fang", "K. Farrag", "A. R. Fazely", "A. Fedynitch", "N. Feigl", "C. Finley", "L. Fischer", "D. Fox", "A. Franckowiak", "S. Fukami", "P. Fürst", "J. Gallagher", "E. Ganster", "A. Garcia", "M. Garcia", "G. Garg", "E. Genton", "L. Gerhardt", "A. Ghadimi", "T. Glüsenkamp", "J. G. Gonzalez", "S. Goswami", "A. Granados", "D. Grant", "S. J. Gray", "S. Griffin", "S. Griswold", "K. M. Groth", "D. Guevel", "C. Günther", "P. Gutjahr", "C. Ha", "C. Haack", "A. Hallgren", "L. Halve", "F. Halzen", "L. Hamacher", "M. Ha Minh", "M. Handt", "K. Hanson", "J. Hardin", "A. A. Harnisch", "P. Hatch", "A. Haungs", "J. Häußler", "K. Helbing", "J. Hellrung", "B. Henke", "L. Hennig", "F. Henningsen", "L. Heuermann", "R. Hewett", "N. Heyer", "S. Hickford", "A. Hidvegi", "C. Hill", "G. C. Hill", "R. Hmaid", "K. D. Hoffman", "D. Hooper", "S. Hori", "K. Hoshina", "M. Hostert", "W. Hou", "M. Hrywniak", "T. Huber", "K. Hultqvist", "K. Hymon", "A. Ishihara", "W. Iwakiri", "M. Jacquart", "S. Jain", "O. Janik", "M. Jansson", "M. Jeong", "M. Jin", "N. Kamp", "D. Kang", "W. Kang", "X. Kang", "A. Kappes", "L. Kardum", "T. Karg", "M. Karl", "A. Karle", "A. Katil", "M. Kauer", "J. L. Kelley", "M. Khanal", "A. Khatee Zathul", "A. Kheirandish", "H. Kimku", "J. Kiryluk", "C. Klein", "S. R. Klein", "Y. Kobayashi", "A. Kochocki", "R. Koirala", "H. Kolanoski", "T. Kontrimas", "L. Köpke", "C. Kopper", "D. J. Koskinen", "P. Koundal", "M. Kowalski", "T. Kozynets", "A. Kravka", "N. Krieger", "J. Krishnamoorthi", "T. Krishnan", "K. Kruiswijk", "E. Krupczak", "A. Kumar", "E. Kun", "N. Kurahashi", "N. Lad", "C. Lagunas Gualda", "L. Lallement Arnaud", "M. Lamoureux", "M. J. Larson", "F. Lauber", "J. P. Lazar", "K. Leonard DeHolton", "A. Leszczyńska", "J. Liao", "C. Lin", "Q. R. Liu", "Y. T. Liu", "M. Liubarska", "C. Love", "L. Lu", "F. Lucarelli", "W. Luszczak", "Y. Lyu", "M. Macdonald", "J. Madsen", "E. Magnus", "Y. Makino", "E. Manao", "S. Mancina", "A. Mand", "I. C. Mariş", "S. Marka", "Z. Marka", "L. Marten", "I. Martinez-Soler", "R. Maruyama", "J. Mauro", "F. Mayhew", "F. McNally", "J. V. Mead", "K. Meagher", "S. Mechbal", "A. Medina", "M. Meier", "Y. Merckx", "L. Merten", "J. Mitchell", "L. Molchany", "S. Mondal", "T. Montaruli", "R. W. Moore", "Y. Morii", "A. Mosbrugger", "M. Moulai", "D. Mousadi", "E. Moyaux", "T. Mukherjee", "R. Naab", "M. Nakos", "U. Naumann", "J. Necker", "L. Neste", "M. Neumann", "H. Niederhausen", "M. U. Nisa", "K. Noda", "A. Noell", "A. Novikov", "A. Obertacke", "V. O'Dell", "A. Olivas", "R. Orsoe", "J. Osborn", "E. O'Sullivan", "V. Palusova", "H. Pandya", "A. Parenti", "N. Park", "V. Parrish", "E. N. Paudel", "L. Paul", "C. Pérez de los Heros", "T. Pernice", "T. C. Petersen", "J. Peterson", "M. Plum", "A. Pontén", "V. Poojyam", "Y. Popovych", "M. Prado Rodriguez", "B. Pries", "R. Procter-Murphy", "G. T. Przybylski", "L. Pyras", "C. Raab", "J. Rack-Helleis", "N. Rad", "M. Ravn", "K. Rawlins", "Z. Rechav", "A. Rehman", "I. Reistroffer", "E. Resconi", "S. Reusch", "C. D. Rho", "W. Rhode", "L. Ricca", "B. Riedel", "A. Rifaie", "E. J. Roberts", "M. Rongen", "A. Rosted", "C. Rott", "T. Ruhe", "L. Ruohan", "D. Ryckbosch", "J. Saffer", "D. Salazar-Gallegos", "P. Sampathkumar", "A. Sandrock", "G. Sanger-Johnson", "M. Santander", "S. Sarkar", "J. Savelberg", "M. Scarnera", "P. Schaile", "M. Schaufel", "H. Schieler", "S. Schindler", "L. Schlickmann", "B. Schlüter", "F. Schlüter", "N. Schmeisser", "T. Schmidt", "F. G. Schröder", "L. Schumacher", "S. Schwirn", "S. Sclafani", "D. Seckel", "L. Seen", "M. Seikh", "S. Seunarine", "P. A. Sevle Myhr", "R. Shah", "S. Shefali", "N. Shimizu", "B. Skrzypek", "R. Snihur", "J. Soedingrekso", "A. Søgaard", "D. Soldin", "P. Soldin", "G. Sommani", "C. Spannfellner", "G. M. Spiczak", "C. Spiering", "J. Stachurska", "M. Stamatikos", "T. Stanev", "T. Stezelberger", "T. Stürwald", "T. Stuttard", "G. W. Sullivan", "I. Taboada", "S. Ter-Antonyan", "A. Terliuk", "A. Thakuri", "M. Thiesmeyer", "W. G. Thompson", "J. Thwaites", "S. Tilav", "K. Tollefson", "S. Toscano", "D. Tosi", "A. Trettin", "A. K. Upadhyay", "K. Upshaw", "A. Vaidyanathan", "N. Valtonen-Mattila", "J. Valverde", "J. Vandenbroucke", "T. Van Eeden", "N. van Eijndhoven", "L. Van Rootselaar", "J. van Santen", "J. Vara", "F. Varsi", "M. Venugopal", "M. Vereecken", "S. Vergara Carrasco", "S. Verpoest", "D. Veske", "A. Vijai", "J. Villarreal", "C. Walck", "A. Wang", "E. H. S. Warrick", "C. Weaver", "P. Weigel", "A. Weindl", "J. Weldert", "A. Y. Wen", "C. Wendt", "J. Werthebach", "M. Weyrauch", "N. Whitehorn", "C. H. Wiebusch", "D. R. Williams", "L. Witthaus", "M. Wolf", "G. Wrede", "X. W. Xu", "J. P. Yanez", "Y. Yao", "E. Yildizci", "S. Yoshida", "R. Young", "F. Yu", "S. Yu", "T. Yuan", "A. Zander Jurowitzki", "A. Zegarelli", "S. Zhang", "Z. Zhang", "P. Zhelnin", "P. Zilberman"], "title": "Evidence for Neutrino Emission from X-ray Bright Active Galactic Nuclei with IceCube", "comment": "24 pages, 13 figures, 3 tables", "summary": "Recently, IceCube reported neutrino emission from the Seyfert galaxy NGC\n1068. Using 13.1 years of IceCube data, we present a follow-up search for\nneutrino sources in the northern sky. NGC 1068 remains the most significant\nneutrino source among 110 preselected gamma-ray emitters while also being\nspatially compatible with the most significant location in the northern sky.\nIts energy spectrum is characterized by an unbroken power-law with spectral\nindex $\\gamma = 3.4 \\pm 0.2$. Consistent with previous results, the observed\nneutrino flux exceeds its gamma-ray counterpart by at least two orders of\nmagnitude. Motivated by this disparity and the high X-ray luminosity of the\nsource, we selected 47 X-ray bright Seyfert galaxies from the Swift/BAT\nspectroscopic survey that were not included in the list of gamma-ray emitters.\nWhen testing this collection for neutrino emission, we observe a 3.3$\\sigma$\nexcess from an ensemble of 11 sources, with NGC 1068 excluded from the sample.\nOur results strengthen the evidence that X-ray bright cores of active galactic\nnuclei are neutrino emitters."}
{"id": "2510.13533", "categories": ["astro-ph.HE", "hep-ph"], "pdf": "https://arxiv.org/pdf/2510.13533", "abs": "https://arxiv.org/abs/2510.13533", "authors": ["Yizhou Guo", "Houdun Zeng", "Junjie Wei", "Hao Zhou", "Zhiping Jin", "Xuefeng Wu", "Daming Wei"], "title": "The Formation Rate and Luminosity Function of Fast X-ray transients from Einstein probe", "comment": "9 pages, 4 figures, and 1 table", "summary": "Following its launch on January 9, 2024, the Einstein Probe (EP) telescope\nhas detected hundreds of fast X-ray transients (FXTs), yet their physical\norigins remain elusive. Understanding their luminosity function and formation\nrate is crucial for elucidating their nature. Based on the latest catalog of\nEP-detected FXTs, we present, a model-independent, non-parametric approach to\nderive the luminosity function and formation rate of FXTs. Our analysis reveals\nsignificant cosmological luminosity evolution, characterized by a scaling\nrelationship of $(1+z)^{3.58}$. After accounting for this evolution, we\nestablish that the local luminosity function is best represented by a broken\npower law, with a break luminosity of $(4.17 \\pm 0.34) \\times 10^{46}$ erg/s.\nThe formation rate exhibits a gentle decline with redshift, following the\nrelation $(1+z)^{-0.21}$, yielding a local rate of approximately\n$28.0_{-16.4}^{+27.3}$ Gpc$^{-3}$ yr$^{-1}$. This rate is comparable to that of\nlow-luminosity long gamma-ray bursts (LGRBs). Our findings indicate a potential\ncorrelation between FXTs and LGRBs, supporting the majority of FXTs may be\nlinked to collapsar progenitors."}
{"id": "2510.13556", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.13556", "abs": "https://arxiv.org/abs/2510.13556", "authors": ["Aromal P", "Unnati Kashyap", "Manoneeta Chakraborty", "Sudip Bhattacharyya", "Thomas J. Maccarone", "Vijay Choudhary"], "title": "The 2024 outburst of the neutron star LMXB EXO 0748-676: an investigation of bursts and eclipses with AstroSat", "comment": "32 pages, 12 figures, 5 tables", "summary": "We present a detailed analysis of the Type-I (thermonuclear) X-ray bursts and\neclipses observed from the neutron star low-mass X-ray binary (LMXB) EXO\n0748--676 with AstroSat during the second known outburst of the source\nfollowing a 16-year-long quiescence period. We detect three thermonuclear X-ray\nbursts, with two displaying simultaneous coverage in the soft X-rays.\nSimultaneous UV observations show evidence of reprocessed burst emissions in\nthe far-ultraviolet band. The time-resolved spectral analysis reveals the\nphotospheric radius expansion (PRE) nature for two bursts. We estimate the\ndistance to the source to be $7.42\\pm0.53$ kpc using the peak flux of PRE.\nNotably, one of the bursts exhibited a secondary peak, $\\sim30$ s after the\nprimary, particularly dominating in the softer X-rays, which reveals a\ncorrelation with the evolution of burst hotspot radius with no temperature\ndependence. The burst properties and corresponding flux values suggest that\nmixed H/He burning may have fueled the bursts. We also detect evidence of a\nsoft excess during one burst, likely arising from the interaction of the burst\nphotons with the surroundings. We uncover evidence for a hard X-ray deficit\nduring the peak of all bursts and a hard lag of $\\sim4$ s, which can be\nattributed to the Compton cooling of the corona by the burst photons. We also\nprobe the temporal evolution and the energy dependence of the eclipses, which\noffer insights into the binary environment. Our study helps gain deeper insight\ninto the physics of burst ignition, flame propagation, the burst-accretion\ninteraction, and the evolution of LMXBs."}
{"id": "2510.13574", "categories": ["astro-ph.HE", "astro-ph.SR", "hep-ph"], "pdf": "https://arxiv.org/pdf/2510.13574", "abs": "https://arxiv.org/abs/2510.13574", "authors": ["Franciele M. da Silva", "Adamu Issifu", "Luis C. N. Santos", "Tobias Frederico", "Débora P. Menezes"], "title": "Hyperons and $Δ$'s in rotating protoneutron stars: Local properties", "comment": null, "summary": "The structural evolution of rotating protoneutron stars encodes essential\ninformation about their observable signatures, while microscopic properties\nprovide complementary knowledge to advance observational investigations. Using\na relativistic mean-field model with density-dependent couplings that account\nfor temperature and particle composition, we investigate rotation,\nneutrino-emission-driven changes in angular momentum, particle distributions,\ntemperature profiles, and sound speed to probe the internal dynamics of\nprotoneutron star matter. Additionally, we track the evolution of macroscopic\nquantities such as energy distribution and gravitational mass and establish\ndirect links between microphysics and global evolution. Extending the framework\nof Phys. Rev. D 112, 023007 (2025), which focuses on the global properties of\nrotating protoneutron star evolution, our results reveal that protoneutron star\ndeformation and thermal evolution are governed by angular momentum, mass, and\ncomposition. Exotic matter (hyperons and $\\Delta$-resonances) and rapid\nrotation enhance deformation leading to a reduction in core temperature,\nwhereas slowly rotating stars like PSR J0740$+$6620 remain nearly spherical.\nOur predicted equatorial radii for PSR J0740$+$6620, $13.0\\ \\mathrm{km} < R_e <\n13.5\\ \\mathrm{km}$, are consistent with NICER measurements. These findings\nconstrain the EoS, requiring a self-consistent treatment of rotation,\nmass-dependent compression, and composition-driven modeling to accurately model\nprotoneutron star evolution in the context of multi-messenger astrophysics."}
{"id": "2510.13610", "categories": ["astro-ph.HE", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2510.13610", "abs": "https://arxiv.org/abs/2510.13610", "authors": ["N. Gopalswamy", "P. Mäkela", "S. Akiyama", "S. Yashiro", "H. Xie"], "title": "Solar Cycle Variation of Sustained Gamma-ray Emission Events from the Sun and Related Energetic Events", "comment": "10 pages, 5 figures, 2 tables, Proc 17th workshop on Solar Influences\n  on the Magnetosphere, Ionosphere and Atmosphere Primorsko, Bulgaria, June\n  2025", "summary": "The sustained gamma ray emission (SGRE) from the Sun is one of the\nfascinating high energy phenomena closely related to the acceleration of\nprotons to energies >300 MeV. Here we report on the solar cycle variation of\nSGRE events based on observations from Fermi's Large Area Telescope (LAT). This\nreport covers solar cycles (SCs) 24 and 25 during which Fermi has been\noperating. Since SGRE events are closely related to solar energetic particle\n(SEP) events and interplanetary type II radio bursts caused by fast and wide\ncoronal mass ejections (CMEs), we consider these phenomena as well. Many\nstudies have shown that SC 25 is similar or slightly stronger than SC 24. The\nnumber of SEP events, GLE events, IP type II bursts, and fast and wide CMEs\nconfirm this conclusion. However, the number of SGRE events observed by Fermi\nLAT has diminished significantly in SC 25 relative to SC 24. One of the issues\nhas been the reduced coverage of the Sun since 2018 due to a mechanical problem\nwith a solar array of the Fermi mission. By identifying the Fermi LAT gaps and\nthe number of energetic events (fast and wide CMEs, interplanetary type II\nbursts) we conclude that about three times more SGRE events must have occurred\nthan the 15 events observed by Fermi."}
{"id": "2510.13739", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.13739", "abs": "https://arxiv.org/abs/2510.13739", "authors": ["R. M. Ludlam", "J. M. Miller", "E. M Cackett", "J. A. Garcia"], "title": "XRISM Resolves Relativistic Effects from the Innermost Accretion Disk in Serpens X-1", "comment": "10 pages, 4 figures, 2 tables, accepted for publication in ApJL", "summary": "We present the first XRISM/Resolve observation of the persistently accreting\nneutron star (NS) low-mass X-ray binary Serpens X-1. The source was observed on\nOctober 17th, 2024, for approximately 350 ks of elapsed time, resulting in 171\nks of exposure. The source exhibited 22% variability with respect to the\naverage count rate of 73.1 count/s during the observation, but remained in a\nspectrally soft state throughout. The time averaged spectrum was analyzed in\nconjunction with spectra extracted from periods of different count rate to\ncheck for variations in spectral components. The unprecedented energy\nresolution of 4.5 eV at 6 keV of XRISM/Resolve provides a detailed look at the\nshape and structure of the Fe emission line within the data, which shows a\ndual-peaked structure with an extended red-wing, and steep decline in the\nblue-wing of the line profile. Fits with the reflection model relxillNS are\nable to describe the structure in the Fe line region, and confirms previous\nresults that the disk is close to the NS ($R_{\\rm in}$ = $1.02_{-0.01}^{+0.21}\\\nR_{\\rm ISCO}$). These models also measure a low systemic inclination\n($i=5^{\\circ}\\pm1^{\\circ}$), confirming prior X-ray and optical studies.\nAlternative models were explored to describe the structure of the Fe line\nprofile, however, relativistic reflection provides the simplest and\nstatistically best explanation of the data."}
{"id": "2510.13741", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.13741", "abs": "https://arxiv.org/abs/2510.13741", "authors": ["Kiran Eiden", "Daniel Kasen"], "title": "Dynamics and Observational Signatures of Core-Collapse Supernovae with Central Engines: Hydrodynamics Simulations with Monte Carlo Post-Processing", "comment": "Submitted to MNRAS", "summary": "A long-lived central engine embedded in expanding supernova ejecta can alter\nthe dynamics and observational signatures of the event, producing an unusually\nluminous, energetic, and/or rapidly-evolving transient. We use two-dimensional\nhydrodynamics simulations to study the effect of a central energy source,\nvarying the amount, rate, and isotropy of the energy deposition. We\npost-process the results with a time-dependent Monte Carlo radiation transport\ncode to extract observational signatures. The engine excavates a bubble at the\ncentre of the ejecta, which becomes Rayleigh-Taylor unstable. Sufficiently\npowerful engines are able to break through the edge of the bubble and\naccelerate, shred, and compositionally mix the entire ejecta. The breakout of\nthe engine-driven wind occurs at distinct rupture points, and the outflowing\nhigh-velocity gas may eventually give rise to radio emission. The dynamical\nimpact of the engine leads to faster rising optical light curves, with photon\nescape facilitated by the faster expansion of the ejecta and the opening of\nlow-density channels. For models with strong engines, the spectra are initially\nhot and featureless, but later evolve to resemble those of broad-line Ic\nsupernovae. Under certain conditions, line emission from ionized, low-velocity\nmaterial near the centre of the ejecta may be able to escape and produce narrow\nemission similar to that seen in interacting supernovae. We discuss how\nvariability in the engine energy reservoir and injection rate could give rise\nto a heterogeneous set of events spanning multiple observational classes,\nincluding the fast blue optical transients, broad-line Ic supernovae, and\nsuperluminous supernovae."}
{"id": "2510.13765", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2510.13765", "abs": "https://arxiv.org/abs/2510.13765", "authors": ["Anurag Garg"], "title": "Optimizing Supernova Classification with Interpretable Machine Learning Models", "comment": "9 pages, 6 figures. Accepted for publication in Journal of\n  Astrophysics and Astronomy (JAA), Ref: JOAA-D-25-00085R1. Uses jaa.cls class\n  file", "summary": "Photometric classification of Type Ia supernovae (SNe Ia) is critical for\ncosmological studies but remains difficult due to class imbalance and\nobservational noise. While deep learning models have been explored, they are\noften resource-intensive and lack interpretability. We present a\ncomputationally efficient and interpretable classification framework that\nmaintains high performance on imbalanced datasets. We emphasize the use of\nPR-AUC and F1-score as more informative metrics than ROC-AUC in severely\nimbalanced settings. Using an XGBoost ensemble optimized via Bayesian\nhyperparameter tuning, we classified light curves from the Supernova\nPhotometric Classification Challenge (SPCC), comprising 21,318 events with a\n3.19 imbalance ratio (non-Ia to Ia). Our model achieved a PR-AUC of\n$0.993^{+0.03}_{-0.02}$, an F1-score of $0.923 \\pm 0.008$, and a ROC-AUC of\n$0.976 \\pm 0.004$, matching or exceeding deep learning performance on\nprecision-recall trade-offs while using fewer resources. Despite slightly lower\noverall accuracy, our method balances false positives and false negatives,\nimproving the efficiency of spectroscopic follow-up. We show that optimized\nensemble models offer a reproducible and lightweight alternative to complex\narchitectures, particularly for large-scale surveys such as the Legacy Survey\nof Space and Time (LSST) where transparency and efficiency are essential."}
{"id": "2510.13776", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.13776", "abs": "https://arxiv.org/abs/2510.13776", "authors": ["Benjamin de Jonge", "Haocheng Zhang", "Manel Errando", "Andrea Gokus", "Pazit Rabinowitz"], "title": "Polarization dynamics of X-ray synchrotron emission from a multi-zone blazar jet", "comment": "15 pages, 11 figures", "summary": "The polarization of X-ray synchrotron emission in blazars offers a direct\nprobe into the magnetic field geometry and particle acceleration processes\noperating in relativistic jets. We use particle-in-cell simulations of magnetic\nreconnection and magnetized turbulence, coupled to polarization-sensitive\nradiative transfer code, to interpret IXPE observations of Mrk 421 during a\nhigh flux state recorded in December of 2023. To evaluate the fitness of the\ntheoretical scenarios, we rely on a quantitative comparison the statistical\nproperties of simulated and observed X-ray flux and polarization light curves\nusing five evaluation metrics, rather than attempting to fit individual data\npoints. We propose a multi-zone model where jet emission is represented as the\nsum of the radiative output of many independent cells, each described by a\nsimulation run viewed at different orientations. Comparison of ensembles of\nsimulated Stokes-parameter light curves with IXPE data shows that magnetic\nreconnection dominated models provide the best match to the observed X-ray flux\nand polarization dynamics. The optimal configuration corresponds to N = 15\nemitting cells, which reproduces the observed amplitudes and timescales of the\nX-ray flux and polarization variations. Magnetized turbulence models\nunderpredict both the flux and polarization variability. Our results indicate\nthat a multi-zone, reconnection-powered emission scenario can describe the\nX-ray polarization behavior of Mrk 421 and establish a quantitative framework\nfor testing theoretical models against IXPE observations of other\nhigh-synchrotron-peaked blazars."}
{"id": "2510.13788", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.13788", "abs": "https://arxiv.org/abs/2510.13788", "authors": ["V. De Henau", "S. Bouma", "J. Bray", "S. Buitink", "A. Corstanje", "M. Desmet", "E. Dickinson", "L. van Dongen", "B. Hare", "H. He", "J. R. Hörandel", "T. Huege", "C. W. James", "M. Jetti", "P. Laub", "H. -J. Mathes", "K. Mulrey", "A. Nelles", "O. Scholten", "C. Sterpka", "S. ter Veen", "K. Terveer", "P. Turekova", "T. N. G. Trinh", "S. Saha", "S. Sharma", "R. Spencer", "D. Veberič", "K. Watanabe", "M. Waterson", "C. Zhang", "P. Zhang", "Y. Zhang"], "title": "Investigating double bump air showers with the SKA-Low", "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC\n  2025). 9 pages, 6 figures", "summary": "Double-bump showers are a rare class of extensive air showers (EAS) predicted\nby Monte Carlo simulations. They occur when a high-energy secondary particle,\nthe leading particle, travels significantly farther than the rest, creating a\ndistinct double-peaked longitudinal profile. So far, no experiment has been\nable to directly detect these showers. The unique radio footprint of\ndouble-bump showers, characterized by multiple Cherenkov rings, provides a way\nto reconstruct longitudinal profiles from radio observations. With its dense\nantenna array and broad frequency range, the Square Kilometer Array Observatory\n(SKAO) will be the first experiment capable of detecting these features,\noffering a new opportunity to probe hadronic interactions and constrain\nparticle cross sections at high energies.\n  In our analysis, we simulate the EAS using CORSIKA with the CoREAS plugin for\nradio. We developed a new method based on the Akaike information criterion to\nidentify double bump showers in simulations by analyzing their longitudinal\nprofiles. Then we investigate the prevalence of these double bump showers\nacross different cosmic ray primary particles and various hadronic interaction\nmodels. We create a skeleton of the EAS which consists of all the particles\nwith at least $1\\%$ of the primary energy, allowing us to confirm the leading\nparticle hypothesis and track shower development following these particles.\nThis will enable us to relate the attributes of the leading particle to\nmeasurable parameters. Depending on the exact shower properties, the radio\nfootprint of a double bump shower can create a complex interference pattern,\nconsisting of multiple rings. From this information, the longitudinal profiles\ncan be extracted. SKA due to its dense antenna array and frequency range will\nbe the first experiment able to observe these double bump showers in detail."}
{"id": "2510.12958", "categories": ["astro-ph.IM", "astro-ph.HE", "astro-ph.SR", "cs.LG"], "pdf": "https://arxiv.org/pdf/2510.12958", "abs": "https://arxiv.org/abs/2510.12958", "authors": ["Rithwik Gupta", "Daniel Muthukrishna", "Jeroen Audenaert"], "title": "Simulation-Based Pretraining and Domain Adaptation for Astronomical Time Series with Minimal Labeled Data", "comment": null, "summary": "Astronomical time-series analysis faces a critical limitation: the scarcity\nof labeled observational data. We present a pre-training approach that\nleverages simulations, significantly reducing the need for labeled examples\nfrom real observations. Our models, trained on simulated data from multiple\nastronomical surveys (ZTF and LSST), learn generalizable representations that\ntransfer effectively to downstream tasks. Using classifier-based architectures\nenhanced with contrastive and adversarial objectives, we create domain-agnostic\nmodels that demonstrate substantial performance improvements over baseline\nmethods in classification, redshift estimation, and anomaly detection when\nfine-tuned with minimal real data. Remarkably, our models exhibit effective\nzero-shot transfer capabilities, achieving comparable performance on future\ntelescope (LSST) simulations when trained solely on existing telescope (ZTF)\ndata. Furthermore, they generalize to very different astronomical phenomena\n(namely variable stars from NASA's \\textit{Kepler} telescope) despite being\ntrained on transient events, demonstrating cross-domain capabilities. Our\napproach provides a practical solution for building general models when labeled\ndata is scarce, but domain knowledge can be encoded in simulations."}
{"id": "2510.12978", "categories": ["astro-ph.IM", "astro-ph.HE", "nucl-th"], "pdf": "https://arxiv.org/pdf/2510.12978", "abs": "https://arxiv.org/abs/2510.12978", "authors": ["Patrick Chi-Kit Cheong", "Christopher L. Fryer"], "title": "Toward First-Principles Multi-Messenger Predictions: Coupling Nuclear Networks with GR Radiation-MHD in {\\tt Gmunu}", "comment": null, "summary": "We present a new implementation of nuclear reaction networks in the\n\\texttt{G}eneral-relativistic \\texttt{mu}ltigrid \\texttt{nu}merical\n(\\texttt{Gmunu}) code, a framework for general relativistic radiation\nmagnetohydrodynamics (GRRMHD). The extended code self-consistently evolves\nnuclear species coupled to hydrodynamics, magnetic fields, and neutrino\nradiation transport under the conformal flatness approximation to Einstein's\nequations. Four approximate nuclear networks are included, with stiff source\nterms integrated using implicit-explicit Runge-Kutta schemes. Validation is\nperformed through benchmarks including conserved-to-primitive recovery with a\ntabulated stellar equation of state, one-zone silicon burning, and hydrodynamic\ntests of shock tubes, acoustic pulses, and detonation fronts of Type Ia\nsupernovae. These tests confirm accurate coupling between nuclear reactions and\nfluid dynamics, conserving electron and nuclear mass fractions to machine\nprecision.\n  As an application, we conduct spherically symmetric core-collapse supernova\nsimulations. The models reproduce the expected non-exploding behavior of\nstandard progenitors, while enhanced neutrino heating revives the shock.\nIncluding nuclear burning modifies the post-shock composition and dynamics,\nconverting silicon and oxygen layers into iron-group nuclei and strengthening\nthe explosion. This demonstrates the impact of explosive burning on ejecta\ncomposition and shock evolution, and establishes the stability of the coupled\nGR radiation-MHD-nuclear framework. The implementation is fully compatible with\nmultidimensional GRMHD simulations and represents the first GRRMHD code\ncombining M1 neutrino transport with fully coupled nuclear burning."}
