{"id": "2509.20407", "categories": ["astro-ph.IM", "astro-ph.EP"], "pdf": "https://arxiv.org/pdf/2509.20407", "abs": "https://arxiv.org/abs/2509.20407", "authors": ["Spencer Devins", "Svitlana Kuklenko", "Abhik Das", "Cora Abrams-McCabe", "Holly Herman", "Madison Schooley", "Matvey Zubkov", "Sebastian Colussi", "Dmitry Kuklenko", "Abeljohn Burke-Raymond", "Rae Chauvaux", "Jonah Martinez", "Mika Villanueva", "Jorell Sakamoto", "Alejandro Municio", "Eduardo Duran", "Elbert Chang", "Advik Jain", "Satvik Magganmane", "Marcus Gonsalves", "Antonio Corona", "Anishka Chauhan", "Zephra Blake"], "title": "UNAGI: A Conceptual Electrodynamic Tethered Spacecraft Demonstration Mission for Propellantless Landing on Io", "comment": "9 pages, 2 figures. Presented at the AIAA 2025 Regional Student\n  Conference", "summary": "This paper presents UNAGI, a novel spacecraft mission developed by Spartan\nSpace Systems, a student engineering team at San Jose State University, aiming\nfor the first controlled landing on Jupiter's volcanically active moon Io.\nInspired by the Japanese freshwater eel's agility, UNAGI employs an\nelectrodynamic tether system that interacts with Jupiter's magnetic field to\ngenerate Lorentz forces, enabling dynamic modulation of the spacecraft's\nvelocity without the need for traditional propellant. This system allows the\nspacecraft to precisely match Io's orbital velocity, similar to a surfer riding\na wave. By optimizing tether current and orientation, UNAGI transitions from an\nouter Jovian insertion orbit to an orbit around Io, achieving a controlled\nlanding for on-surface science operations. The landing is strategically timed,\nleveraging the gravitational influence of Jupiter and its moons to decelerate\ndescent and mitigate impact forces.\n  UNAGI leverages technologies from missions like Juno, JUICE, and Europa\nClipper to ensure reliable operation in the challenging Jovian environment. The\nmission follows a phased approach, including cruise, orbital insertion, tether\ndeployment, Jovian orbital operations, and final descent, with extensive risk\nmitigation through simulations and experimental validation. The concept\nsupports rideshare integration on future NASA or ESA missions or a dedicated\nlaunch, emphasizing cost effectiveness and adaptability. UNAGI carries a\nscientific payload including infrared spectrometers, magnetometers,\nseismometers, and chromatographs, designed to probe Io's interior dynamics,\nvolcanic activity, tectonic deformation, and magnetospheric interactions. This\nmission aims to advance understanding of Io's geophysical processes and Jupiter\nsystem dynamics, setting a new standard for deep space exploration of extreme\nenvironments."}
{"id": "2509.20469", "categories": ["astro-ph.IM", "astro-ph.EP"], "pdf": "https://arxiv.org/pdf/2509.20469", "abs": "https://arxiv.org/abs/2509.20469", "authors": ["Joseph Masiero"], "title": "Technical Memo: The impact of Nancy Grace Roman Telescope's default image processing on the detectability of moving Solar system objects", "comment": "Technical Memo, 7 pages", "summary": "The Nancy Grace Roman Telescope is scheduled to launch in 2026 to conduct a\nwide-field survey of the sky at near-infrared wavelengths. Although Roman is\nunable to track objects moving at non-sidereal rates, there is recent interest\nin the potential capability of the telescope to support planetary defense by\ntracking and characterizing asteroids and comets (Holler et al, 2025,\narXiv:2508.14412). However, the standard pipeline image processing scheme that\nthe mission is planning to implement for the majority of its survey data will\npreferentially reject flux from all moving objects during the process of cosmic\nray rejection. Here we describe the impact of the default Wide Field Imager\n(WFI) processing on moving object detection, and possible mitigations that\ncould be employed to recover moving object observations."}
{"id": "2509.20613", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.20613", "abs": "https://arxiv.org/abs/2509.20613", "authors": ["Sebastian Espinosa", "Mario L. Vicuña", "Rene A. Mendez", "Jorge F. Silva", "Marcos Orchard"], "title": "The impact of the point spread function fitting radius on photometric uncertainty based on the Fisher information matrix", "comment": null, "summary": "In point spread function (PSF) photometry, the selection of the fitting\naperture radius plays a critical role in determining the precision of flux and\nbackground estimations. Traditional methods often rely on maximizing the\nsignal-to-noise ratio (S/N) as a criterion for aperture selection. However,\nS/N-based approaches do not necessarily provide the optimal precision for joint\nestimation problems as they do not account for the statistical limits imposed\nby the Fisher information in the context of the Cram\\'er-Rao lower bound\n(CRLB). This study aims to establish an alternative criterion for selecting the\noptimal fitting radius based on Fisher information rather than S/N. Fisher\ninformation serves as a fundamental measure of estimation precision, providing\ntheoretical guarantees on the achievable accuracy for parameter estimation. By\nleveraging Fisher information, we seek to define an aperture selection strategy\nthat minimizes the loss of precision. We conducted a series of numerical\nexperiments that analyze the behavior of Fisher information and estimator\nperformance as a function of the PSF aperture radius. Specifically, we\nrevisited fundamental photometric models and explored the relationship between\naperture size and information content. We compared the empirical variance of\nclassical estimators, such as maximum likelihood and stochastic weighted least\nsquares, against the theoretical CRLB derived from the Fisher information\nmatrix. Our results indicate that aperture selection based on the Fisher\ninformation provides a more robust framework for achieving optimal estimation\nprecision."}
{"id": "2509.20718", "categories": ["astro-ph.IM", "astro-ph.HE", "physics.pop-ph"], "pdf": "https://arxiv.org/pdf/2509.20718", "abs": "https://arxiv.org/abs/2509.20718", "authors": ["Naoki Seto"], "title": "Hybrid Strategy for Coordinated Interstellar Signaling: Linking the Galactic Center and Extragalactic Bursts", "comment": "11 pages, 5 figures, accepted for publication in ApJ", "summary": "The search for extraterrestrial intelligence (SETI) is largely limited by the\nvastness of the signaling parameter space. The concurrent signaling scheme\noffers a framework in which civilizations can coordinate their transmission and\nreception by referring to a common astrophysical event. Building on this idea,\nI propose a hybrid strategy that combines the Galactic Center as a spatial\nreference with an extragalactic burst as a temporal marker. If such a scheme is\nindeed employed, the sky area to be surveyed in SETI could be reduced by more\nthan two orders of magnitude, based solely on existing astronomical data. I\nexamine records of three types of extragalactic bursts (supernovae, neutron\nstar mergers, and gamma-ray bursts [GRBs]) to identify suitable temporal\nmarkers. Among them, GRB 221009A is particularly notable due to its high\nfluence and favorable sky location."}
{"id": "2509.20424", "categories": ["astro-ph.HE", "hep-ph"], "pdf": "https://arxiv.org/pdf/2509.20424", "abs": "https://arxiv.org/abs/2509.20424", "authors": ["Yu-Bin Wang", "Xia Zhou", "Abdusattar Kurban"], "title": "Plasma lens with frequency-dependent dispersion measure effects on fast radio bursts", "comment": null, "summary": "Radio signals propagating through inhomogeneous plasma media deviate from\ntheir original paths, producing frequency-dependent magnification effects. In\nthis paper, after reviewing the classical plasma-lensing theory, we have found\na fundamental contradiction: the classical model assumes that the distribution\nof lensing plasma medium is related to the frequency-independent image\nposition; however, our analysis demonstrates that both the image position\n($\\theta(\\nu)$) and dispersion measure (DM$(\\nu)$) are inherently\nfrequency-dependent when signals traverse a structured plasma medium.\n  We have been able to resolve this paradox by developing a framework that\nexplicitly incorporates frequency-dependent dispersion measures (DMs) following\npower-law relationships ($\\rm DM\\propto \\nu^\\gamma$). Our analysis shows that\nthe signal magnification decreases systematically with decreasing frequency,\noffering a plausible explanation for the frequency-dependent peak flux\ndensities observed in fast radio bursts (FRBs), particularly in the case of the\nrepeating FRB 180814.J0422+73. Our results suggest these FRBs could originate\nfrom the magnetized compact star magnetospheres. By considering these\nplasma-lensing effects on the sub-pulses of an FRB across different\nfrequencies, we have the ability to more accurately investigate the intrinsic\nproperties of FRBs via precise measurements of radio signals."}
{"id": "2509.20735", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.20735", "abs": "https://arxiv.org/abs/2509.20735", "authors": ["Mohammad Ful Hossain Seikh", "Dave Besson", "Pawan Giri"], "title": "Techniques for Continuous Wave Identification and Filtering in the Askaryan Radio Array", "comment": "39th International Cosmic Ray Conference (ICRC2025)", "summary": "The Askaryan Radio Array (ARA), located near the South Pole, is among the\nfirst experiments there designed to detect ultra-high energy neutrinos through\nthe Askaryan effect. When such neutrinos interact in dense media like ice, they\ninitiate particle cascades that generate coherent radio pulses. Operating in\nthe 150-850 MHz band, ARA is deployed 80-200 meters deep in Antarctic ice,\nwhere the radio background is exceptionally low. Despite this, experiments such\nas ARA must still account for continuous wave (CW) signals, which can originate\nfrom anthropogenic sources, instrumental noise, and other environmental\nfactors. These CW signals can obscure faint neutrino-induced pulses,\ncomplicating data analysis and event identification. Over the years, ARA has\ndeveloped and refined techniques for CW filtering and identification, including\nspectral analysis, notch filtering, and phase-variance methods. These\napproaches exploit CW characteristics such as their narrowband nature and\npersistence to separate contamination from genuine impulsive events. We review\nthe main CW identification and filtering techniques developed within the ARA\ncollaboration and present recent improvements in adaptive, multi-stage\nfiltering pipelines. These advances have led to faster processing, simpler\noperation, and more accurate CW suppression, improving data analysis quality.\nTheir efficacy is demonstrated across all ARA stations, underscoring their role\nin reducing event misclassification and enhancing performance. By refining\nthese techniques, this work not only improves the sensitivity of ARA but also\nhighlights the importance of robust CW filtering for current and future\nneutrino radio detection experiments."}
{"id": "2509.20515", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.20515", "abs": "https://arxiv.org/abs/2509.20515", "authors": ["P. Bangale", "X. Wang"], "title": "Multiwavelength study of Galactic PeVatron LHAASO J0341+5258", "comment": "Proceedings paper presented at the 39th International Cosmic Ray\n  Conference (ICRC2025), held 15-24 July, 2025, in Geneva, Switzerland", "summary": "Galactic PeVatrons are astrophysical sources accelerating particles up to a\nfew PeV (~10$^{15}$ eV). The primary method to identify both electron and\nproton PeVatrons is the observation of $\\gamma$-ray radiation at ultra-high\nenergies (UHE; E$>$100 TeV). In 2021, LHAASO detected 14 steady $\\gamma$-ray\nsources with photon energies above 100 TeV and up to 1.4 PeV. Most of these\nsources can be plausibly associated with objects such as supernova remnants,\npulsar wind nebulae, and stellar clusters. However, LHAASO J0341$+$5258 is\ndetected as an unidentified PeVatron, emitting $\\gamma$ rays at energies above\nhundreds of TeV. It is extended in nature and notably bright, with a flux $>$\n20% of the Crab Nebula's flux above 25 TeV. Multiwavelength observations are\nrequired to identify the PeVatron responsible for the UHE $\\gamma$ rays,\nunderstand the source morphology and association, and shed light on the\nemission processes. Here, we will present the results from the VERITAS and HAWC\nobservations of this PeVatron, along with a discussion on potential emission\nscenarios through multiwavelength modeling."}
{"id": "2509.21306", "categories": ["astro-ph.IM", "hep-ex", "hep-ph"], "pdf": "https://arxiv.org/pdf/2509.21306", "abs": "https://arxiv.org/abs/2509.21306", "authors": ["GRAND Collaboration", "Jaime Álvarez-Muniz", "Rafael Alves Batista", "Aurélien Benoit-Lévy", "Teresa Bister", "Martina Bohacova", "Mauricio Bustamante", "Washington Carvalho", "Yiren Chen", "LingMei Cheng", "Simon Chiche", "Jean-Marc Colley", "Pablo Correa", "Nicoleta Cucu Laurenciu", "Zigao Dai", "Rogerio M. de Almeida", "Beatriz de Errico", "João R. T. de Mello Neto", "Krijn D. de Vries", "Valentin Decoene", "Peter B. Denton", "Bohao Duan", "Kaikai Duan", "Ralph Engel", "William Erba", "Yizhong Fan", "Arsène Ferrière", "Juan Pablo Góngora", "QuanBu Gou", "Junhua Gu", "Marion Guelfand", "Gang Guo", "Jianhua Guo", "Yiqing Guo", "Claire Guépin", "Lukas Gülzow", "Andreas Haungs", "Matej Havelka", "Haoning He", "Eric Hivon", "Hongbo Hu", "Guoyuan Huang", "Xiaoyuan Huang", "Yan Huang", "Tim Huege", "Wen Jiang", "Sei Kato", "Ramesh Koirala", "Kumiko Kotera", "Jelena Köhler", "Bruno L. Lago", "Zhisen Lai", "Jolan Lavoisier", "François Legrand", "Antonios Leisos", "Rui Li", "Xingyu Li", "Cheng Liu", "Ruoyu Liu", "Wei Liu", "Pengxiong Ma", "Oscar Macias", "Frédéric Magnard", "Alexandre Marcowith", "Olivier Martineau-Huynh", "Zach Mason", "Thomas McKinley", "Paul Minodier", "Miguel Mostafá", "Kohta Murase", "Valentin Niess", "Stavros Nonis", "Shoichi Ogio", "Foteini Oikonomou", "Hongwei Pan", "Konstantinos Papageorgiou", "Tanguy Pierog", "Lech Wiktor Piotrowski", "Simon Prunet", "Clément Prévotat", "Xiangli Qian", "Markus Roth", "Takashi Sako", "Sarvesh Shinde", "Dániel Szálas-Motesiczky", "Szymon Sławiński", "Kaoru Takahashi", "Xishui Tian", "Charles Timmermans", "Petr Tobiska", "Apostolos Tsirigotis", "Matías Tueros", "George Vittakis", "Vincent Voisin", "Hanrui Wang", "Jiale Wang", "Shen Wang", "Xiangyu Wang", "Xu Wang", "Daming Wei", "Feng Wei", "Emily Weissling", "Juan Wu", "Xiangping Wu", "Xuefeng Wu", "Xin Xu", "Xing Xu", "Fufu Yang", "Lili Yang", "Xuan Yang", "Qiang Yuan", "Philippe Zarka", "Houdun Zeng", "Chao Zhang", "Jianli Zhang", "Kewen Zhang", "Pengfei Zhang", "Qingchi Zhang", "Songbo Zhang", "Yi Zhang", "Hao Zhou"], "title": "Towards the Giant Radio Array for Neutrino Detection (GRAND): the GRANDProto300 and GRAND@Auger prototypes", "comment": "28 pages, 16 figures, 2 tables", "summary": "The Giant Radio Array for Neutrino Detection (GRAND) is a proposed\nmulti-messenger observatory of ultra-high-energy (UHE) particles of cosmic\norigin. Its main goal is to find the long-sought origin of UHE cosmic rays by\ndetecting large numbers of them and the secondary particles created by their\ninteraction -- gamma rays, and, especially, neutrinos. GRAND will do so using\nlarge arrays of radio antennas that look for the radio signals emitted by the\nair showers initiated by the interactions of the UHE particles in the\natmosphere. Since 2023, three small-scale prototype GRAND arrays have been in\noperation: GRAND@Nan\\c{c}ay in France, GRAND@Auger in Argentina, and\nGRANDProto300 in China. Together, their goal is to validate the detection\nprinciple of GRAND under prolonged field conditions, achieving efficient,\nautonomous radio-detection of air showers. We describe the hardware, software,\nlayout, and operation of the GRAND prototypes and show the first radio spectra\nmeasured by them. Despite challenges, the successful operation of the\nprototypes confirms that the GRAND instrumentation is apt to address the goals\nof the experiment and lays the groundwork for its ensuing stages."}
{"id": "2509.20578", "categories": ["astro-ph.HE", "hep-ex", "hep-ph"], "pdf": "https://arxiv.org/pdf/2509.20578", "abs": "https://arxiv.org/abs/2509.20578", "authors": ["Pooja Bhattacharjee", "Christopher Eckner", "Gabrijela Zaharijas", "Gert Kluge", "Giacomo D'Amico"], "title": "Probing the Parameter Space of Axion-Like Particles Using Simulation-Based Inference", "comment": "5 pages, 3 figures", "summary": "Axion-like particles (ALPs), hypothetical pseudoscalar particles that couple\nto photons, are among the most actively investigated candidates for new physics\nbeyond the Standard Model. Their interaction with gamma rays in the presence of\nastrophysical magnetic fields can leave characteristic, energy-dependent\nmodulations in observed spectra. Capturing such subtle features requires\nprecise statistical inference, but standard likelihood-based methods often fall\nshort when faced with complex models, large number of nuisance parameters and\nlimited analytical tractability. In this work, we investigate the application\nof simulation-based inference (SBI), specifically Truncated Marginal Neural\nRatio Estimation (TMNRE), to constrain ALP parameters using simulated\nobservations from the upcoming Cherenkov Telescope Array Observatory (CTAO). We\nmodel the gamma-ray emission from the active galactic nucleus NGC 1275,\naccounting for photon-ALP mixing, extragalactic background light (EBL)\nabsorption, and the full CTAO instrument response. Leveraging the Swyft\nframework, we infer posteriors for the ALP mass and coupling strength and\ndemonstrate its potential to extract meaningful constraints on ALPs from future\nreal gamma-ray data with CTAO."}
{"id": "2509.21203", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.21203", "abs": "https://arxiv.org/abs/2509.21203", "authors": ["Sofia V. Sosa Fiscella", "Michael T. Lam", "Gabriella Agazie", "Akash Anumarlapudi", "Anne M. Archibald", "Zaven Arzoumanian", "Paul T. Baker", "Paul R. Brook", "H. Thankful Cromartie", "Kathryn Crowter", "Maria Silvina De Biasi", "Megan E. DeCesar", "Paul B. Demorest", "Timothy Dolch", "Elizabeth C. Ferrara", "William Fiore", "Emmanuel Fonseca", "Gabriel E. Freedman", "Nate Garver-Daniels", "Peter A. Gentile", "Joseph Glaser", "Deborah C. Good", "Jeffrey S. Hazboun", "Ross J. Jennings", "Megan L. Jones", "David L. Kaplan", "Matthew Kerr", "Duncan R. Lorimer", "Jing Luo", "Ryan S. Lynch", "Alexander McEwen", "Maura A. McLaughlin", "Natasha McMann", "Bradley W. Meyers", "Cherry Ng", "David J. Nice", "Timothy T. Pennucci", "Benetge B. P. Perera", "Nihan S. Pol", "Henri A. Radovan", "Scott M. Ransom", "Paul S. Ray", "Ann Schmiedekamp", "Carl Schmiedekamp", "Brent J. Shapiro-Albert", "Ingrid H. Stairs", "Kevin Stovall", "Abhimanyu Susobhanan", "Joseph K. Swiggum", "Haley M. Wahl"], "title": "The NANOGrav 15-Year Data Set: Improved Timing Precision With VLBI Astrometric Priors", "comment": null, "summary": "Accurate pulsar astrometric estimates play an essential role in almost all\nhigh-precision pulsar timing experiments. Traditional pulsar timing techniques\nrefine these estimates by including them as free parameters when fitting a\nmodel to observed pulse time-of-arrival measurements. However, reliable\nsub-milliarcsecond astrometric estimations require years of observations and,\neven then, power from red noise can be inadvertently absorbed into astrometric\nparameter fits, biasing the resulting estimations and reducing our sensitivity\nto red noise processes, including gravitational waves (GWs). In this work, we\nseek to mitigate these shortcomings by using pulsar astrometric estimates\nderived from Very Long Baseline Interferometry (VLBI) as priors for the timing\nfit. First, we calibrated a frame tie to account for the offsets between the\nreference frames used in VLBI and timing. Then, we used the VLBI-informed\npriors and timing-based likelihoods of several astrometric solutions consistent\nwith both techniques to obtain a maximum-posterior astrometric solution. We\nfound offsets between our results and the timing-based astrometric solutions,\nwhich, if real, would lead to absorption of spectral power at frequencies of\ninterest for single-source GW searches. However, we do not find significant\npower absorption due to astrometric fitting at the low-frequency domain of the\nGW background."}
{"id": "2509.20601", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.20601", "abs": "https://arxiv.org/abs/2509.20601", "authors": ["Joseph R. Farah", "Logan J. Prust", "Giacomo Terreran", "D. Andrew Howell", "Michael Bietenholz", "Norbert Bartel", "Curtis McCully", "Michael D. Johnson"], "title": "The First 4 Years of SN 1993J Revisited: Geometric $m$-ring Modeling of the Radio Shell with Closure Quantities Only", "comment": "16 pages, 7 figures; to be submitted to ApJ", "summary": "SN 1993J is the best-studied radio supernova, with observations using\nvery-long-baseline interferometry (VLBI) spanning from within weeks of\nexplosion through nearly three decades of ejecta evolution. Imaging and\nmodeling techniques have revealed an expanding shell-like ejecta structure,\nwith a width well-constrained after ~1000 days. In this work, we present a\nre-analysis of the first ~1700 days of SN 1993J evolution, using a new VLBI\nanalysis technique with somewhat intrinsically higher angular resolution and\ncompare our results with those from previous conventional techniques. We adopt\nthe m-ring model, with potentially somewhat higher angular resolution, but only\nas a phenomenological alternative to the physically-motivated spherical shell\nmodel used in past analyses and shape the profile to approximately match that\nof the shell. We use closure quantities only, providing calibration insensitive\nconstraints on ejecta geometry and largely independent comparisons with\nprevious results from the same data sets. Using this approach we find the\nejecta expanding with a power-law exponent $\\omega=0.80\\pm0.01$ averaged for\nthe time from 175 to 1693 days, consistent with shell-fitting analyses. For the\nfirst time, we report estimates of the ejecta width at t < 1000 days -- as\nearly as 264 days post-explosion -- finding a mean fractional width with\nstandard deviation of $0.24 \\pm 0.04$ (of the radius) with no significant\nevolution. We present a fit of the azimuthal brightness modulation over time\nwith the maximum of a horseshoe pattern rotating from east to south-southwest\nfrom 175 to 1000 d and then evolving to a more complex behavior, quantifying\nprevious results from images only. The constraints on the angular brightness\nmodulation and width over time and ~700 days earlier than existing analyses\nprovide an avenue to test more advanced simulations of the explosion and\ninteraction mechanisms."}
{"id": "2509.20611", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.20611", "abs": "https://arxiv.org/abs/2509.20611", "authors": ["Rahul Sengar", "David L. Kaplan", "Emil Lenc", "Akash Anumarlapudi", "Natasha Hurley-Walker", "Ziteng Wang", "Laura Driessen", "Dougal Dobie", "Tara Murphy"], "title": "Discovery of Two Highly Scattered Pulsars from Image-Based Circular Polarization Searches with the Australian SKA Pathfinder", "comment": "Submitted to The Astrophysical Journal", "summary": "We report the discovery and timing of two pulsars from a sample of four\ncircularly polarized sources identified in radio continuum images taken as part\nof the Australian SKA Pathfinder (ASKAP) Variables and Slow Transients (VAST)\nsurvey. Observations with the Parkes (Murriyang) radio telescope confirmed both\nsources as normal pulsars with high dispersion measures. PSR J1646$-$4451 has a\nspin period of 217 ms and a dispersion measure (DM) of 928 $\\rm cm^{-3} \\, pc$,\nwhile PSR J1837$-$0616 exhibits a spin period of 118 ms and a DM of 793 $\\rm\ncm^{-3} \\, pc$. These pulsars show extreme pulse broadening due to scattering,\nwith measured scattering timescales of 290 ms and 343 ms at observing\nfrequencies of 1.8 GHz and 1.9 GHz, respectively. These measurements imply\nextrapolated scattering timescales at 1 GHz of 2479 ms and 2154 ms, placing\nthem among the most heavily scattered pulsars known to date. Our findings\nunderscore the potential of using circular polarization in radio continuum\nimages as a tool for identifying highly scattered pulsars. Future wide-field\nradio continuum surveys are poised to uncover a broader population of extreme\npulsars particularly those that are heavily scattered at 1.4 GHz, intrinsically\nfaint, or residing in binaries$-$offering valuable insights into both pulsar\ndemographics and the complex structure of the interstellar medium."}
{"id": "2509.20614", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.20614", "abs": "https://arxiv.org/abs/2509.20614", "authors": ["Rahul Sengar", "Akash Anumarlapudi", "David L. Kaplan", "Dale A. Frail", "Scott D. Hyman", "Emil Polisensky"], "title": "Millisecond Pulsar Discoveries in an Image-based MeerKAT Survey of the Galactic Bulge", "comment": "Submitted to The Astrophysical Journal", "summary": "We report on the follow-up observations of circularly polarized sources\nidentified in the MeerKAT image-based survey of the Galactic bulge. Using the\nParkes radio telescope, we observed sixteen circularly polarized sources with\nthe UWL receiver and detected nine pulsars among which six of them are new\ndiscoveries. All pulsars are fast rotators with spin periods under 100\\,ms.\nAmong the new discoveries five are millisecond pulsars (MSPs) and one has a\nspin period of 55\\,ms. At least four new MSPs exhibit clear signs of binary\nmotion in their discovery observations. The dispersion measures (DMs) of these\npulsars fall between 18 and 330\\,pc\\,cm$^{-3}$, which is lower than expected\nfor Galactic bulge members and indicates that these pulsars lie in the\nforeground along the line of sight rather than within the bulge itself. This is\nthe first time such a large number of pulsars have been confirmed via an\nimage-based survey. These discoveries underscore the exceptional efficacy of\ncircular polarization selection in image-based pulsar surveys, and demonstrate\nthe powerful synergy between high-sensitivity imaging and targeted time-domain\nfollow-up using wide-band receivers and strengthen prospects for future deep\npulsation searches$-$e.g., with MeerKAT or the forthcoming SKA or DSA-2000$-$to\nuncover the true millisecond pulsar population in the Galactic bulge."}
{"id": "2509.20675", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.20675", "abs": "https://arxiv.org/abs/2509.20675", "authors": ["Qiliang Fang", "Hiroki Nagakura", "Takashi J. Moriya"], "title": "Reconciling the Tension Between Light Curve Modeling of Type II Supernovae and Neutrino-Driven Core-Collapse Supernovae Models with Late-Phase Spectroscopy", "comment": "16 pages, 5 figures. Accepted by ApJ", "summary": "Type II supernovae (SNe II) are the most frequently observed outcome of\ncore-collapse explosions and provide a valuable window into the physical\nmechanisms governing the deaths of massive stars. However, estimates of\nexplosion properties based on optical light curve modeling often show tension\nwith the predictions of modern neutrino-driven explosion models. In particular,\nwhen based on light curves from the explosions of red supergiant (RSG) tied to\nspecific stellar wind models, many SNe II are found to originate from low-mass\nprogenitors yet exhibit unusually high explosion energies ($E_{\\rm K}$), far\nexceeding theoretical predictions. In this study, we incorporate late-phase\n(nebular) spectroscopy to estimate the helium core mass of the progenitor\n($M_{\\rm He\\,core}$), which serves as an additional constraint to break\ndegeneracies in light curve modeling. This approach is applied to a sample of\n32 well-observed SNe II, using a light curve model grid constructed from RSGs\nwith arbitrarily stripped hydrogen-rich envelopes, rather than assuming a fixed\nwind model. Examining the resulting correlations among the physical parameters,\nwe find that the tension between the observed $M_{\\rm He\\,core}$-$E_{\\rm K}$\nand $E_{\\rm K}$-$M_{\\rm Ni}$ relations and those predicted by neutrino-driven\nexplosion models has significantly lessened by incorporating nebular\nspectroscopy in light curve modeling. This study highlights the crucial role of\nnebular spectroscopy in interpreting SNe II observations and provides support\nto the neutrino-driven explosion mechanism as the dominant engine powering\nthese events."}
{"id": "2509.20694", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.20694", "abs": "https://arxiv.org/abs/2509.20694", "authors": ["Zhipeng Zhang", "Ruizhi Yang", "Shoushan Zhang"], "title": "Performance of LACT Array: Instrument Response Functions and Source Prospects", "comment": "39th International Cosmic Ray Conference proceedings(ICRC2025)", "summary": "Large Array of imaging atmospheric Cherenkov Telescope (LACT) is an array of\n32 Cherenkov telescopes with 6-meter diameter mirrors to be constructed at the\nLHAASO site, aiming to enhance our understanding of ultra-high energy gamma ray\nastronomy. This work presents a detailed performance assessment of the LACT\narray, focusing on the IRFs for both an 8-telescope subarray configuration\noptimized for large zenith angle observations (60{\\deg}) and the full\n32-telescope array, with a particular emphasis on a 20{\\deg} zenith angle\nconfiguration for lower energy threshold observations.\n  We have generated IRFs using extensive Monte Carlo simulations of gamma-ray\nshowers and the detector response. The IRFs include the effective area, angular\nresolution, and energy resolution as a function of energy and offset angle.\nCrucially, these IRFs are produced in the standard Data format for Gamma ray\nastronomy (GADF), ensuring interoperability with existing analysis tools like\nGammapy and ctools and enabling seamless integration into scientific workflows.\n  In this work, we also have used these GADF-format IRFs to simulate\nobservations towards the Galactic Center Region."}
{"id": "2509.20704", "categories": ["astro-ph.HE", "hep-ex"], "pdf": "https://arxiv.org/pdf/2509.20704", "abs": "https://arxiv.org/abs/2509.20704", "authors": ["Mohammad Ful Hossain Seikh", "Victor Grachev", "Ilya Kravchenko", "Mohammad Sajjad Athar", "Dave Besson"], "title": "First Radio Neutrino & Cosmic Rays Astronomy Workshop in India", "comment": "Editorial for the collection \"Radio detection of ultra-high energy\n  neutrino and cosmic rays'' from the International Radio Neutrino & Cosmic Ray\n  Astronomy Workshop, Aligarh Muslim University, India", "summary": "We summarize the motivation for (as well as the presentations from) the\nApril, 2024 workshop held in India and focused on radiowave techniques for\ncosmic ray and neutrino detection."}
{"id": "2509.20752", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.20752", "abs": "https://arxiv.org/abs/2509.20752", "authors": ["Songcheng Li", "Abdurakhmon Nosirov", "Cosimo Bambi", "Honghui Liu", "Zuobin Zhang", "Shafqat Riaz"], "title": "Assessing the Power-Law Emissivity Assumption in X-ray Reflection Spectroscopy: A Simulation-Based Evaluation of Different Coronal Geometries", "comment": "13 pages, 24 figures", "summary": "The emissivity profile assumed in X-ray reflection spectroscopy significantly\nimpacts black hole spin measurements. Using simulated NuSTAR spectra generated\nfor lamppost and disk-like coronae with the relxill model suite, we evaluate\nsystematic biases introduced when fitting with power-law or broken power-law\nemissivity profiles. We find that a simple power-law can accurately recover\nspins for low-height lamppost coronae with long exposures and low inclination\nangle, while broken power-laws introduce degeneracies when the simple power-law\nalready performs adequately. However, for extended or high-height coronae,\nespecially at high inclinations, both models produce large systematic biases\nunresolved by longer exposure times. Our results demonstrate that power-law\napproximations are reliable for compact coronae, highlighting the need for\ngeometry-specific models in complex cases."}
{"id": "2509.20806", "categories": ["astro-ph.HE", "astro-ph.GA", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2509.20806", "abs": "https://arxiv.org/abs/2509.20806", "authors": ["Qingru Hu", "Bin Liu", "Wei Zhu"], "title": "Exciting Stellar Eccentricity in Gaia BH3 via a Hidden Black Hole Binary", "comment": "10 pages, 6 figures, submitted to ApJL, comments are welcome", "summary": "We propose that the high eccentricity of the stellar orbit in Gaia BH3 system\ncould be excited through a secular resonance effect if the inner dark object\nis, in effect, a tight and eccentric black hole binary (BHB). During the\norbital decay of the inner BHB, the apsidal precession rate of the inner binary\nmatches that of the outer stellar orbit, and this resonance advection can drive\nthe outer eccentricity into some extreme values. For a Gaia BH3-like system, we\nshow that a near equal-mass ($q=0.8$) BHB with an initial semi-major axis of\n1--3 au and an initial eccentricity $\\gtrsim 0.95$ is able to excite the outer\norbit to the observed value, leaving a current BHB with semi-major axis\n0.25--0.5 au and eccentricity $\\sim 0.8$. The eccentric inner BHB imprints two\nobservable signatures on the outer star: (1) short-term RV modulations with an\namplitude $\\lesssim 100$ m/s and (2) long-term apsidal precession with a rate\n$\\lesssim 0.1^{\\circ}$/yr. Although neither of these is detected in the\ncurrently available astrometry and RV data, we show that these signals are\ndetectable with the full Gaia astrometry data and dedicated high-precision\nand/or long-term RV observations. Our work provides a new perspective on the\ndynamical formation of Gaia BH3, and the methodology is readily applicable to\nsimilar systems such as HD 130298, Gaia BH1, and Gaia BH2."}
{"id": "2509.20970", "categories": ["astro-ph.HE", "hep-ph"], "pdf": "https://arxiv.org/pdf/2509.20970", "abs": "https://arxiv.org/abs/2509.20970", "authors": ["Pablo de la Torre", "Miguel Gutiérrez", "Manuel Masip", "Alejandro Oliver"], "title": "High energy gammas and neutrinos from the Sun, Jupiter and Earth", "comment": "17 pages", "summary": "Cosmic rays reaching the atmosphere of an astrophysical object produce\nshowers of secondary particles that may then scape into space. Here we obtain\nthe flux of gammas and neutrinos of energy $E>10$ GeV emited by the Sun,\nJupiter and Earth. We show that, while the solar magnetic field induces an\nalbedo flux of gammas from all the points in the Sun's surface, the dipolar\nmagnetic field in the planets implies gammas only from the very peripheral\nregion. Neutrinos, in contrast, can cross these objects and emerge from any\npoint in their surface. The emission from these astrophysical objects is above\nthe diffuse flux from cosmic ray interactions with the interstellar medium and\nhas a distinct spectrum and gamma to neutrino ratio."}
{"id": "2509.21063", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.21063", "abs": "https://arxiv.org/abs/2509.21063", "authors": ["Tobias Kleiner"], "title": "VERITAS Observations of the Microquasar SS 433", "comment": "Submitted to Proceedings of Science \"39th International Cosmic Ray\n  Conference (ICRC2025)\"", "summary": "Microquasars are increasingly recognized as efficient particle accelerators,\npotentially contributing to the cosmic-ray flux up to the \"knee\". Among them,\nSS 433 stands out as a unique system with precessing relativistic jets embedded\nwithin the W50 supernova remnant. Recent detections of very- and\nultra-high-energy gamma rays from SS 433 have solidified its role as a key\nlaboratory for studying particle acceleration in jet-powered astrophysical\nsources. We present results from over 100 hours of observations of SS 433 with\nVERITAS, spanning more than a decade. These high-resolution measurements allow\nfor a detailed morphological study of the eastern and western jet lobes with an\nangular resolution of <0.1{\\deg}. By analyzing the spatial and spectral\ncharacteristics of the gamma-ray emission, we investigate the particle\nacceleration mechanisms within the jets and at the jet-medium interaction in\nW50."}
{"id": "2509.21103", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.21103", "abs": "https://arxiv.org/abs/2509.21103", "authors": ["Shan-Shan Weng", "Xiao-Tian Xu", "Han-Long Peng", "Yu-Jing Xu", "Yan Zhang", "Ying-Han Mao", "Xiang-Dong Li", "Jing-Zhi Yan", "Qing-Zhong Liu"], "title": "A statistical study of type II outbursts of XRPs: Brighter accreting pulsars rotate faster", "comment": "23 pages, 9 figures, 6 tables", "summary": "X-ray pulsars (XRPs) consist of a magnetized neutron star (NS) and an optical\ndonor star. The NS accretes matter from the donor star producing pulsed X-ray\nemission. In most cases the donor stars are Be stars, and accretion is\nepisodic, that is, the NSs are generally X-ray dim, but occasionally experience\noutbursts. Here, we carry out a statistical study with the X-ray monitoring\ndata, and obtain strong correlations between the spin periods of the NSs and\nthe outburst parameters for the first time. We show that XRPs containing faster\nrotating NSs tend to display more violent eruptions. In addition, pulsating\nultraluminous X-ray sources in nearby galaxies follow the similar relationship.\nWe demonstrate that most of these systems are close to the spin equilibrium,\nand that brighter pulsars have acquired more angular momentum by accreting\nmatter from their companion stars, resulting in faster rotating NSs."}
{"id": "2509.21109", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.21109", "abs": "https://arxiv.org/abs/2509.21109", "authors": ["Julian Hamo", "Jonathan Biteau", "Julien Peloton"], "title": "A new era for multi-wavelength studies of blazars with Rubin and the CTAO", "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC\n  2025), 2025", "summary": "Both the Rubin Observatory and the first telescopes of the CTAO will be\ncollecting data by 2026, marking a new era in optical and gamma-ray astronomy.\nCompared to predecessors, their enhanced sensitivity will extend extragalactic\nobservations to a redshift of at least 2.5. This advancement offers insights\ninto non-thermal astrophysical sources, particularly blazars. The 3-night\ncadence monitoring with Rubin, in one of its six filters, will produce blazar\nlight curves that, when combined with targeted in-depth observations from the\nCTAO, could help distinguish acceleration and radiative models. Existing data\nfrom the ZTF and Fermi-LAT, though less sensitive, offer insights into what\nRubin and the CTAO may achieve. However, the real-time processing of the\nimmense data stream coming from Rubin/LSST presents a major challenge.\n  Addressing this challenge is the work of brokers such as Fink, which we\ndevelop for multi-messenger astrophysics. Fink processes data in real-time\nbefore sending relevant information to other observatories like the CTAO. In\nthis contribution, we present how we characterize the optical variability of\nblazars that emit in the gamma-ray range using the ZTF, with timescales\nspanning from the intra-night to multi-years. We identify properties in the\nresulting parameter space that could not only enable the identification of\nblazar-like sources, but also the characterization of the continuum of states.\nWe describe our fast identification of transitions from one state to another,\nenabling the trigger of observations in the gamma-ray band and follow-up\nspectroscopic observations. Finally, we review the communication channel we set\nfrom the ZTF to the CTAO via Fink for blazars and discuss its outlook in light\nof the Rubin Observatory. This method is also applicable to other astrophysical\nsources and helps lay the groundwork for a fruitful era for time-domain\nastronomy."}
{"id": "2509.21142", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.21142", "abs": "https://arxiv.org/abs/2509.21142", "authors": ["A. Hennessy", "R. L. C. Starling", "A. Rowlinson", "I. de Ruiter", "A. J. van der Horst", "G. E. Anderson", "N. R. Tanvir", "S. ter Veen", "K. Wiersema", "R. A. M. J. Wijers"], "title": "A LOFAR search for coherent radio emission accompanying prompt engine activity in gamma-ray bursts", "comment": "Accepted for publication in MNRAS", "summary": "Relativistic jets generated in gamma-ray bursts (GRBs) produce luminous\ntransient events, yet the fundamentals of jet composition and radiation\nmechanisms remain unclear. One means of identifying a magnetically-dominated\noutflow would be detection of prompt, coherent radio emission at low\nfrequencies, and we are able to search for this using the LOw Frequency ARray\n(LOFAR) coupled with modelling of high energy pulses detected by the Neil\nGehrels Swift Observatory (Swift). We present the rapid response mode follow-up\nLOFAR observations of four long GRBs, each beginning within a few hundred\nseconds of the initial Swift-BAT trigger. We interpreted our findings under the\nframework of a magnetic wind model, predicting coherent radio emission\nanalogous to prompt emission pulses. Using 60 second and 180 second time sliced\nimaging at 120-168 MHz, we obtain upper limits on radio pulse emission, finding\nno significant signals. In the case of GRB 200925B, we observed a small\nincrease of radio flux seen at $\\sim$60-360 s post burst. In this model, this\ncould represent the radio emission related to the Swift-BAT pulses, for a\nredshift of $z=1.8$, however, with a low signal-to-noise ratio of $\\sim 2$, it\nis not deemed significant enough to confirm coincident prompt radio and\ngamma-ray emission. Instead, we can constrain the $\\epsilon_{B}$ parameter,\nderiving upper limits of $\\epsilon_{B} < 4.2 \\times 10^{-4}$ for GRB 200925B.\nIn GRB 240414A, with a reported redshift of $z=1.833$, we constrain\n$\\epsilon_{B} < 2.8 \\times 10^{-4}$. We discuss these results in the context of\nour whole LOFAR rapid response sample of six long gamma-ray bursts, finding our\n$\\epsilon_{B}$ values are generally consistent with previous GRB studies."}
{"id": "2509.21177", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.21177", "abs": "https://arxiv.org/abs/2509.21177", "authors": ["Xiangyu Ivy Wang", "Shi-Jie Gao", "Xiang-Dong Li"], "title": "A Two-Stage Kick Scenario for the Peculiar LMXB GX 1+4", "comment": "9 pages, 5 figures; Published in the Astrophysical Journal Letters", "summary": "The low-mass X-ray binary (LMXB) GX 1+4 stands out with its unique\nproperties. Despite being an old system, it hosts a strongly magnetized neutron\nstar (NS), a trait usually linked to younger systems. Its exceptionally long\norbital period (1160 days) and low eccentricity (0.101) imply that the NS\nformed with minimal mass loss and a weak natal kick. These features\ncollectively point towards the NS having formed through the accretion induced\ncollapse (AIC) of a white dwarf (WD). However, GX 1+4's unusually high peculiar\nvelocity (~ 189.36 km/s) defies standard AIC explanations. To address this\ndiscrepancy, we propose a two-stage kick scenario within the AIC framework: an\ninitial natal kick followed by a delayed electromagnetic \"rocket effect\" kick.\nOur Monte Carlo simulations indicate that while the natal kick (< 100 km/s) can\ngenerate a wide range of orbital eccentricities, the subsequent rocket kick (~\n240-480 km/s) explains both the high systemic velocity and low eccentricity.\nThis two-stage kick mechanism naturally reproduces the observed characteristics\nof GX 1+4, provided that the NS's initially buried magnetic field re-emerges\nafter the acceleration process ends. Our study represents the first attempt to\nquantitatively constrain the kick velocities in GX 1+4 and underscores the\nimportance of possible rocket kicks in forming such peculiar LMXB systems."}
{"id": "2509.21203", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.21203", "abs": "https://arxiv.org/abs/2509.21203", "authors": ["Sofia V. Sosa Fiscella", "Michael T. Lam", "Gabriella Agazie", "Akash Anumarlapudi", "Anne M. Archibald", "Zaven Arzoumanian", "Paul T. Baker", "Paul R. Brook", "H. Thankful Cromartie", "Kathryn Crowter", "Maria Silvina De Biasi", "Megan E. DeCesar", "Paul B. Demorest", "Timothy Dolch", "Elizabeth C. Ferrara", "William Fiore", "Emmanuel Fonseca", "Gabriel E. Freedman", "Nate Garver-Daniels", "Peter A. Gentile", "Joseph Glaser", "Deborah C. Good", "Jeffrey S. Hazboun", "Ross J. Jennings", "Megan L. Jones", "David L. Kaplan", "Matthew Kerr", "Duncan R. Lorimer", "Jing Luo", "Ryan S. Lynch", "Alexander McEwen", "Maura A. McLaughlin", "Natasha McMann", "Bradley W. Meyers", "Cherry Ng", "David J. Nice", "Timothy T. Pennucci", "Benetge B. P. Perera", "Nihan S. Pol", "Henri A. Radovan", "Scott M. Ransom", "Paul S. Ray", "Ann Schmiedekamp", "Carl Schmiedekamp", "Brent J. Shapiro-Albert", "Ingrid H. Stairs", "Kevin Stovall", "Abhimanyu Susobhanan", "Joseph K. Swiggum", "Haley M. Wahl"], "title": "The NANOGrav 15-Year Data Set: Improved Timing Precision With VLBI Astrometric Priors", "comment": null, "summary": "Accurate pulsar astrometric estimates play an essential role in almost all\nhigh-precision pulsar timing experiments. Traditional pulsar timing techniques\nrefine these estimates by including them as free parameters when fitting a\nmodel to observed pulse time-of-arrival measurements. However, reliable\nsub-milliarcsecond astrometric estimations require years of observations and,\neven then, power from red noise can be inadvertently absorbed into astrometric\nparameter fits, biasing the resulting estimations and reducing our sensitivity\nto red noise processes, including gravitational waves (GWs). In this work, we\nseek to mitigate these shortcomings by using pulsar astrometric estimates\nderived from Very Long Baseline Interferometry (VLBI) as priors for the timing\nfit. First, we calibrated a frame tie to account for the offsets between the\nreference frames used in VLBI and timing. Then, we used the VLBI-informed\npriors and timing-based likelihoods of several astrometric solutions consistent\nwith both techniques to obtain a maximum-posterior astrometric solution. We\nfound offsets between our results and the timing-based astrometric solutions,\nwhich, if real, would lead to absorption of spectral power at frequencies of\ninterest for single-source GW searches. However, we do not find significant\npower absorption due to astrometric fitting at the low-frequency domain of the\nGW background."}
{"id": "2509.21299", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2509.21299", "abs": "https://arxiv.org/abs/2509.21299", "authors": ["Lei Yang", "Xinwen Shu", "Goubin Mou", "Yongquan Xue", "Luming Sun", "Fabao Zhang", "Zhumao Zhang", "Yibo Wang", "Tao Wu", "Ning Jiang", "Hucheng Ding", "Tinggui Wang"], "title": "Outflow-cloud interaction as the possible origin of the peculiar radio emission in the tidal disruption event AT2018cqh", "comment": "12 pages, 6 figures, accepted for publication in ApJL", "summary": "AT2018cqh is a unique optical tidal disruption event (TDE) discovered in a\ndwarf galaxy exhibiting delayed X-ray and radio flares. We present the results\nfrom high-resolution VLBA and e-MERLIN radio observations of AT2018cqh\nextending to $\\delta$t $\\sim$ 2250 days post discovery, which reveal a compact\nradio emission, unresolved at a scale of <~ 0.13 pc at 7.6 GHz, with a high\nbrightness temperature of $T_b$ ~> 4.03 $\\times$ 10$^{9}$ K. The radio spectral\nenergy distribution (SED) is found to gradually shift towards a higher peak\nflux density and frequency over a period of $\\sim$1000 days. An equipartition\nanalysis suggests that there is a little change in the radio emitting region\nover this period, while the electron density increases by a factor of 3. The\nradio light curve at 0.89 GHz continues to rise, with a bump feature lasting\nfor 240 days. These properties are in contrast to the predictions of standard\nshockwave model from a diffuse circumnuclear medium, but could be explained if\ndense clouds exist in the circumnuclear environment. The latter scenario is\nsupported by our hydrodynamic simulations of the interaction of TDE outflow\nwith a cloud, which can reproduce the temporal evolution in the radio SED. This\nwork highlights the importance of the outflow-cloud interaction in explaining\nthe delayed, fast-rising radio emission observed in some TDEs, especially those\noccurring in galaxies with pre-existing AGN activity."}
{"id": "2509.21307", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.21307", "abs": "https://arxiv.org/abs/2509.21307", "authors": ["C. J. Clark", "M. Di Mauro", "J. Wu", "B. Allen", "O. Behnke", "H. B. Eggenstein", "B. Machenschalk", "L. Nieder", "P. M. Saz Parkinson", "A. Ashok", "P. Bruel", "B. McGloughlin", "M. A. Papa", "F. Camilo", "M. Kerr", "P. Voraganti Padmanabh", "S. M. Ransom"], "title": "Einstein@Home Searches for Gamma-ray Pulsars in the Inner Galaxy", "comment": "26 pages, 5 figures. Accepted for publication in ApJ", "summary": "The Fermi Large Area Telescope (LAT) has revealed a mysterious extended\nexcess of GeV gamma-ray emission around the Galactic Center, which can\npotentially be explained by unresolved emission from a population of pulsars,\nparticularly millisecond pulsars (MSPs), in the Galactic bulge. We used the\ndistributed volunteer computing system Einstein@Home to search the Fermi-LAT\ndata for gamma-ray pulsations from sources in the inner Galaxy, to try to\nidentify the brightest members of this putative population. We discovered four\nnew pulsars, including one new MSP and one young pulsar whose angular\nseparation to the Galactic Center of 0.93{\\deg} is the smallest of any known\ngamma-ray pulsar. We demonstrate a phase-resolved difference imaging technique\nthat allows the flux from this pulsar to be disentangled from the diffuse\nGalactic Center emission. No radio pulsations were detected from the four new\npulsars in archival radio observations or during the MPIfR-MeerKAT Galactic\nPlane Survey. While the distances to these pulsars remain uncertain, we find\nthat it is more likely that they are all foreground sources from the Galactic\ndisk, rather than pulsars originating from the predicted bulge population.\nNevertheless, our results are not incompatible with an MSP explanation for the\nGC excess, as only one or two members of this population would have been\ndetectable in our searches."}
{"id": "2509.21314", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.21314", "abs": "https://arxiv.org/abs/2509.21314", "authors": ["Nibedita Mondal", "Sandeep Kumar Mondal", "Nayantara Gupta"], "title": "Explaining the Origin of TeV Gamma Rays from M87 During High and Low States", "comment": "18 pages, 4 figures", "summary": "The detection of very high-energy gamma-rays from M87 can provide crucial\ninsights into particle acceleration and radiation mechanisms in jets. The\nrecent observations by the Large High Altitude Air Shower Observatory (LHAASO)\ndetector extend the energy range of TeV gamma-ray astronomy, and also the\nvariability study to the TeV energy domain. We have modelled the low state and\nflare state multi-wavelength spectral energy distributions of M87 within a\ntime-dependent framework. In our model, the low state gamma-ray flux results\nfrom the emissions from the sub-parsec and the kilo-parsec scale jets of M87,\nwhereas the flare state gamma-ray flux is mainly produced in the sub-parsec\nscale jet. We have shown that the spectral and temporal features of the TeV\ngamma-ray spectrum of M87 are consistent with this two-zone model, where the\ncontribution from the sub-parsec scale jet significantly increases during the\nflare state."}
{"id": "2509.20718", "categories": ["astro-ph.IM", "astro-ph.HE", "physics.pop-ph"], "pdf": "https://arxiv.org/pdf/2509.20718", "abs": "https://arxiv.org/abs/2509.20718", "authors": ["Naoki Seto"], "title": "Hybrid Strategy for Coordinated Interstellar Signaling: Linking the Galactic Center and Extragalactic Bursts", "comment": "11 pages, 5 figures, accepted for publication in ApJ", "summary": "The search for extraterrestrial intelligence (SETI) is largely limited by the\nvastness of the signaling parameter space. The concurrent signaling scheme\noffers a framework in which civilizations can coordinate their transmission and\nreception by referring to a common astrophysical event. Building on this idea,\nI propose a hybrid strategy that combines the Galactic Center as a spatial\nreference with an extragalactic burst as a temporal marker. If such a scheme is\nindeed employed, the sky area to be surveyed in SETI could be reduced by more\nthan two orders of magnitude, based solely on existing astronomical data. I\nexamine records of three types of extragalactic bursts (supernovae, neutron\nstar mergers, and gamma-ray bursts [GRBs]) to identify suitable temporal\nmarkers. Among them, GRB 221009A is particularly notable due to its high\nfluence and favorable sky location."}
{"id": "2509.20735", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.20735", "abs": "https://arxiv.org/abs/2509.20735", "authors": ["Mohammad Ful Hossain Seikh", "Dave Besson", "Pawan Giri"], "title": "Techniques for Continuous Wave Identification and Filtering in the Askaryan Radio Array", "comment": "39th International Cosmic Ray Conference (ICRC2025)", "summary": "The Askaryan Radio Array (ARA), located near the South Pole, is among the\nfirst experiments there designed to detect ultra-high energy neutrinos through\nthe Askaryan effect. When such neutrinos interact in dense media like ice, they\ninitiate particle cascades that generate coherent radio pulses. Operating in\nthe 150-850 MHz band, ARA is deployed 80-200 meters deep in Antarctic ice,\nwhere the radio background is exceptionally low. Despite this, experiments such\nas ARA must still account for continuous wave (CW) signals, which can originate\nfrom anthropogenic sources, instrumental noise, and other environmental\nfactors. These CW signals can obscure faint neutrino-induced pulses,\ncomplicating data analysis and event identification. Over the years, ARA has\ndeveloped and refined techniques for CW filtering and identification, including\nspectral analysis, notch filtering, and phase-variance methods. These\napproaches exploit CW characteristics such as their narrowband nature and\npersistence to separate contamination from genuine impulsive events. We review\nthe main CW identification and filtering techniques developed within the ARA\ncollaboration and present recent improvements in adaptive, multi-stage\nfiltering pipelines. These advances have led to faster processing, simpler\noperation, and more accurate CW suppression, improving data analysis quality.\nTheir efficacy is demonstrated across all ARA stations, underscoring their role\nin reducing event misclassification and enhancing performance. By refining\nthese techniques, this work not only improves the sensitivity of ARA but also\nhighlights the importance of robust CW filtering for current and future\nneutrino radio detection experiments."}
