{"id": "2509.16303", "categories": ["astro-ph.HE", "hep-ph"], "pdf": "https://arxiv.org/pdf/2509.16303", "abs": "https://arxiv.org/abs/2509.16303", "authors": ["Luca Orusa", "Mattia Di Mauro", "Fiorenza Donato"], "title": "New determination of the neutrino hadronic production cross sections from GeV to beyond PeV energies", "comment": "11 pages, 6 figures. Submitted to PRD", "summary": "The flux of astrophysical neutrinos is now measured with unprecedented\naccuracy and on several decades of energy spectrum. Their origin traces back to\nhadronic collisions between protons and nuclei in the cosmic rays with hydrogen\nand helium in the target gas. To accurately interpret the data, a precise\ndetermination of the underlying cross sections is therefore mandatory. We\npresent a new evaluation of the neutrino production cross section from $p+p$\ncollisions, building on our previous analysis of the production cross section\nfor $\\pi^\\pm$, $K^\\pm$, and minor baryonic and mesonic channels. Cross sections\nfor scatterings involving nuclei heavier than protons are also derived. The\nnovelty of our approach is the analytical description of the Lorentz invariant\ncross section $\\sigma_{\\rm inv}$, and the fit of the model to the available\naccelerator data. We work with neutrino energies from $10$ GeV to $10^7$ GeV,\nand, correspondingly, to incident proton (nuclei) energies from $10$ GeV to\n$10^9$ GeV (GeV/n). We obtain the total differential cross section,\n$d\\sigma(p+p\\rightarrow \\nu+X)/dE_{\\nu}$ as a function of neutrino and proton\nenergies, with an estimated uncertainty of 5% for neutrino energies below 100\nGeV, increasing to 10% above TeV energies. Predictions are given for $\\nu_e,\n\\nu_\\mu, \\bar{\\nu_e}$ and $\\bar{\\nu_\\mu}$. A comparison with state-of-the-art\ncross sections, all relying on Monte Carlo generators, is also presented. To\nfacilitate the use by the community, we provide numerical tables and a script\nfor accessing our energy-differential cross sections."}
{"id": "2509.16304", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2509.16304", "abs": "https://arxiv.org/abs/2509.16304", "authors": ["L. Hernández-García", "P. Sánchez-Sáez", "J. Chakraborty", "J. Cuadra", "G. Miniutti", "R. Arcodia", "P. Arévalo", "M. Giustini", "E. Kara", "C. Ricci", "D. R. Pasham", "Z. Arzoumanian", "K. Gendreau", "P. Lira"], "title": "NICER observations reveal doubled timescales in Ansky's quasi-periodic eruptions (QPEs)", "comment": "7 pages, 6 figures, accepted in A&A", "summary": "Quasi-periodic eruptions (QPEs) are recurring X-ray bursts originating from\nthe vicinity of supermassive black holes, but their driving mechanisms remain\nunder debate. This study analyzes new NICER observations of QPEs in Ansky (a\ntransient event in the nucleus of the galaxy SDSS J1335+0728), taken between\nJanuary and June 2025. By examining flare durations, peak-to-peak recurrence\ntimes, and profiles, we compare the 2025 data with those from 2024 to\ninvestigate changes in energy, timescales, and flare shapes. The 2025 QPEs are\nfound to be four times more energetic, with recurrence times of approximately\n10 days and flare durations ranging from 2.5 to 4 days, making them both about\ntwice as long as in 2024. Additionally, the flare profiles have become more\nasymmetric, showing longer decays. We explore different theoretical scenarios\nto explain the observed properties of the QPEs in Ansky, including evolving\nstream-disk interactions in an extreme mass-ratio inspiral (EMRI) system as a\npotential mechanism behind the observed changes in recurrence time and\nenergetics, while also considering alternative models based on mass transfer\nand accretion disk instabilities. Continued observational efforts will be\ncrucial for unveiling the nature of Ansky."}
{"id": "2509.16306", "categories": ["astro-ph.HE", "hep-ph"], "pdf": "https://arxiv.org/pdf/2509.16306", "abs": "https://arxiv.org/abs/2509.16306", "authors": ["Georg G. Raffelt", "Hans-Thomas Janka", "Damiano F. G. Fiorillo"], "title": "Neutrinos from core-collapse supernovae", "comment": "Contribution to Encyclopedia of Particle Physics", "summary": "The core of a massive star (M > 8 Msun) eventually collapses. This implosion\nusually triggers a supernova (SN) explosion that ejects most of the stellar\nenvelope and leaves behind a neutron star (NS) with a mass of up to about 2\nMsun. Sometimes the explosion fails and a black hole forms instead. The NS\nradiates its immense binding energy (some 10% of its rest mass or\n$2-4\\times10^{53}$ erg) almost entirely as neutrinos and antineutrinos of all\nflavors with typical energies of some 10 MeV. This makes core-collapse SNe the\nmost powerful neutrino factories in the Universe. Such a signal was observed\nonce - with limited statistics - from SN 1987A in the Large Magellanic Cloud.\nToday, however, many large neutrino detectors act as SN observatories and would\nregister a high-statistics signal. A future Galactic SN, though rare (1-3 per\ncentury), would produce a wealth of astrophysical and particle-physics\ninformation, including possible signatures for new particles. Neutrinos are key\nto SN dynamics in the framework of the Bethe-Wilson delayed explosion paradigm.\nAfter collapse, they are trapped in the core for a few seconds, forming a dense\nneutrino plasma that can exhibit collective flavor evolution caused by the weak\ninteraction, a subject of intense theoretical research."}
{"id": "2509.16313", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.16313", "abs": "https://arxiv.org/abs/2509.16313", "authors": ["Ross Ferguson", "Ben Margalit"], "title": "Numerical Modeling of Relativistic Effects in Synchrotron-Emitting Shocks", "comment": "25 pages, 8 figures. Submitted to ApJ. Comments welcome!", "summary": "Synchrotron emission is seen in a vast array of astrophysical transients,\nsuch as gamma-ray bursts (GRBs), radio supernovae, neutron star (NS) mergers,\ntidal disruption events (TDEs), and fast blue optical transients (FBOTs).\nDespite the ubiquity of synchrotron-emitting sources, modeling of the emergent\nflux from these events often relies on simplified analytic approximations.\nThese approximations are inaccurate for high-velocity shocks, where\nspecial-relativistic effects are important. Properly incorporating these\neffects considerably complicates calculations, and generally requires a\nnumerical treatment. In this work we present a novel numerical model which\nsolves the full radiative-transfer problem in synchrotron-emitting shocks,\naccounting for all relativistic effects. This `full-volume' model is capable of\ncalculating synchrotron emission from a shock of arbitrary velocity, and is\ndesigned to be flexible and applicable to a wide range of astrophysical\nsources. Using this new code, we evaluate the accuracy of more commonly-used\napproximate models. We find that the full-volume treatment is generally\nnecessary once the shock proper-velocity exceeds $(\\Gamma\\beta)_{\\rm sh}\\gtrsim\n0.1$, and that approximate models can be inaccurate by $\\gtrsim$ an\norder-of-magnitude in trans-relativistic shocks. This implies that there may be\na bias in the inferred physical properties of some FBOTs, jetted TDEs, and\nother relativistic explosions, where approximate analytic models are typically\nemployed. The code associated with our model is made publicly available, and\ncan be used to study the growing population of relativistic\nsynchrotron-emitting transients."}
{"id": "2509.16280", "categories": ["astro-ph.IM", "astro-ph.CO", "physics.ins-det"], "pdf": "https://arxiv.org/pdf/2509.16280", "abs": "https://arxiv.org/abs/2509.16280", "authors": ["Madhurima Choudhury", "Jonathan C. Pober"], "title": "Towards a Robust Machine-Learning Pipeline for 21-cm Cosmology Data Analysis I: A Roadmap for Development and Demonstration of Robustness Against PSF Modeling Errors", "comment": null, "summary": "The 21-cm signal from the Epoch of Reionization (EoR) is a powerful probe of\nthe evolution of the Universe. However, accurate measurements of the EoR signal\nfrom radio interferometric observations are sensitive to efficient foreground\nremoval, mitigating radio-frequency interference and accounting for\ninstrumental systematics. This work represents the first in a series of papers,\nwhere we will be introducing a novel ML based pipeline, step-by-step, to\ndirectly infer reionization parameters from 21-cm radio-interferometric images.\nIn this paper, we investigate the impact of the variations in the point spread\nfunction (PSF) on parameter estimation by simulating visibilities corresponding\nto input 21-cm maps as observed by the 128-antenna configuration of the\nMurchison Widefield Array (MWA) Phase II. These visibilities are imaged to\nobtain dirty images, which are then used to train a 2D convolutional neural\nnetwork (CNN) to predict $\\rm x_{HI}$. To systematically assess the effect of\nPSF mis-modelling, we generate multiple test sets by varying the MWA's antenna\nlayout, thereby introducing controlled variations in the PSF; we then feed\nthese alternative PSF dirty images to our CNN trained using only dirty images\nwith the PSF of the true antenna layout. Our results demonstrate that PSF\nvariations introduce biases in the CNN's predictions of $\\rm x_{HI}$, with\nerrors depending on the extent of PSF distortion. We quantify these biases and\ndiscuss their implications for the reliability of machine-learning-based\nparameter inference in 21-cm cosmology and how they can be utilized to improve\nthe robustness of estimation against PSF-related systematics in future 21-cm\nsurveys. In concluding, we also discuss how this approach to incorporating\nrealistic instrument error into an ML analysis pipeline can be expanded to\ninclude multiple other effects."}
{"id": "2509.16314", "categories": ["astro-ph.HE", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2509.16314", "abs": "https://arxiv.org/abs/2509.16314", "authors": ["David Vartanyan", "Adam Burrows", "Lizzy Teryoshin", "Tianshu Wang", "Daniel Kasen", "Benny Tsang", "Matthew S. B. Coleman"], "title": "Simulated 3D $^{56}$Ni Distributions of Type IIp Supernovae", "comment": "submitted to ApJ", "summary": "We present the first three-dimensional study of the asymptotic ejecta\ndistributions for a suite of theoretical Type IIp supernovae originating from\nred supergiant progenitors. We simulate using the radiation-hydrodynamic code\nF{\\sc{ornax}} from core bounce through the first seconds of the neutrino-driven\nexplosion and then follow using a hydrodynamic variant of the code FLASH until\nshock breakout of the star and through to homologous expansion of the ejecta\ninto the circumstellar environment. Our studied progenitor models range from 9\nto 25 M$_{\\odot}$, with explosion energies spanning $\\sim$0.1$-$1 Bethe. The\nshock breakout times span the range $\\sim$1$-$4 days, with a breakout time\nspread by direction ranging from hours to over a day. We find that the dipole\norientation of the $^{56}$Ni ejecta is well-preserved from the first seconds\nout to shock breakout. The $^{56}$Ni ejecta penetrates through the initially\nouter oxygen shell, and its global structure is imprinted with small-scale\nclumping as the ejecta evolve through the stellar envelope. For the majority of\nour models, the neutron star kick is anti-aligned with the $^{56}$Ni ejecta.\nModels with strongly dipolar ejecta morphology and a massive hydrogen/helium\nenvelope with an inner boundary located deep see as much as $\\sim$70\\% of the\n$^{56}$Ni ejecta mixed into that outer envelope, reaching asymptotic velocities\nranging from $\\sim$350 to 3200 km s$^{-1}$. Supernovae arising from red\nsupergiant progenitors and exhibiting prominent nickel features generally\ndisplay significant $^{56}$Ni mixing into the stellar envelope."}
{"id": "2509.16302", "categories": ["astro-ph.IM", "astro-ph.CO"], "pdf": "https://arxiv.org/pdf/2509.16302", "abs": "https://arxiv.org/abs/2509.16302", "authors": ["Simon Biquard", "Josquin Errard", "Radek Stompor"], "title": "Recovering unbiased CMB polarization maps using modern ground-based experiments with minimal assumptions about atmospheric emission", "comment": "20 pages, 8 figures. Submitted to PRD", "summary": "We present a study of unbiased reconstruction of cosmic microwave background\n(CMB) polarization maps from data collected by modern ground-based\nobservatories. Atmospheric emission is a major source of correlated noise in\nsuch experiments, complicating the recovery of faint cosmological signals. We\nconsider estimators that require minimal assumptions about unpolarized\natmospheric emission properties, instead exploiting hardware solutions commonly\nimplemented in modern instruments, such as pairs of orthogonal antennas in each\nfocal plane pixel, and polarization signal modulation via a continuously\nrotating half-wave plate (HWP). We focus on two techniques: (i) statistical\ndown-weighting of low-frequency atmospheric signals, and (ii) pair-differencing\n(PD), which involves differencing signals collected by two detectors in the\nsame focal plane pixel. We compare their performance against the idealized case\nwhere the atmospheric signal is perfectly known and cleanly subtracted. We show\nthat PD can be derived from maximum likelihood principles under general\nassumptions about the atmospheric signal, optimizing map sensitivity. In the\nabsence of instrumental systematics but with reasonable detector noise\nvariations, PD yields polarized sky maps with noise levels only slightly worse\nthan the ideal case. While down-weighting could match this performance, it\nrequires highly accurate atmospheric models that are not readily available. PD\nperformance is affected by instrumental systematics, particularly those leaking\natmospheric signal to the difference time stream. However, effects like gain\nmismatch are efficiently mitigated by a rotating HWP, making PD a competitive,\nrobust, and efficient solution for CMB polarization mapmaking without\natmospheric modeling."}
{"id": "2509.16366", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.16366", "abs": "https://arxiv.org/abs/2509.16366", "authors": ["Kevin Munari", "Alessandro Costa", "Federico Incardona", "Emilio Mastriani", "Sebastiano Spinello", "Stefano Germani", "Pietro Bruno"], "title": "Enhancing CTAO Monitoring and Alarm Subsystems in Distributed Environments Using ServiMon", "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC\n  2025), 2025", "summary": "ServiMon is a scalable data collection and auditing pipeline designed for\nservice-oriented, cost-efficient quality control in distributed environments,\nincluding the CTAO monitoring, logging, and alarm subsystems. Developed within\na Docker-based architecture, it leverages cloud-native technologies and\ndistributed computing principles to enhance system observability and\nreliability. At its core, ServiMon integrates key technologies such as\nPrometheus, Grafana, Kafka, and Cassandra. Prometheus serves as the primary\nengine for real-time performance metric collection, enabling efficient\nmonitoring across multiple nodes. Grafana provides interactive,\nservice-oriented data visualization, facilitating system performance analysis.\nAdditionally, Kafka and Cassandra expose system metrics via the JMX Exporter,\noffering critical insights into infrastructure availability and performance.\nThis contribution exposes how ServiMon could provide an enhancement on\nscalability, security, and efficiency in a distributed computing environment,\nsuch as the CTAO monitoring, logging, and alarm subsystems. This integrated\napproach not only ensures robust real-time monitoring, but also optimizes\noperational costs. Furthermore, ServiMon's ability to generate large volumes of\ndiverse data over time provides a strong foundation for predictive maintenance.\nBy incorporating stochastic and approximate computing techniques, it enables\nproactive failure detection and system optimization, minimizing downtime and\nmaximizing telescope availability."}
{"id": "2509.16669", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.16669", "abs": "https://arxiv.org/abs/2509.16669", "authors": ["Ritabrata Sarkar"], "title": "Monitoring Gamma Ray Bursts with the Zirè instrument onboard the NUSES space mission", "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC\n  2025), 9 pages, 6 figures", "summary": "The Zir\\`e experiment onboard NUSES space mission has several science goals,\nincluding the measurements of charged particles and light nuclei from few up to\nhundreds of MeVs, for the study of low-energy cosmic rays, space weather\nphenomena, and possible magnetosphere-lithosphere-ionosphere coupling signals.\nFurthermore, the experiment intends to test new tools for the detection of\nphotons in the energy range of about 0.03-50 MeV, allowing the investigation of\ntransient phenomena like gamma-ray bursts (GRBs). A high-density segmented\ncalorimeter exploiting novel scintillator crystals and silicon photomultiplier\ntechnology for the readout system will serve this purpose along its main task\nof calorimetric energy measurement of the cosmic-ray charged particles. In this\nwork, we discuss the functionality of the calorimeter as a GRB monitor through\nthe calculation of its performance in terms of effective area, sensitivity, and\ntiming response for the transient outbursts."}
{"id": "2509.16374", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.16374", "abs": "https://arxiv.org/abs/2509.16374", "authors": ["O. S. Ould-Boukattine", "A. J. Cooper", "J. W. T. Hessels", "D. M. Hewitt", "S. K. Ocker", "A. Moroianu", "K. Nimmo", "M. P. Snelders", "I. Cognard", "T. J. Dijkema", "M. Fine", "M. P. Gawroński", "W. Herrmann", "J. Huang", "F. Kirsten", "Z. Pleunis", "W. Puchalska", "S. Ranguin", "T. Telkamp"], "title": "A HyperFlash and ÈCLAT view of the local environment and energetics of the repeating FRB 20240619D", "comment": "Submitted to MNRAS. Comments welcome", "summary": "Time-variable propagation effects provide a window into the local plasma\nenvironments of repeating fast radio burst (FRB) sources. Here we report\nhigh-cadence observations of FRB 20240619D, as part of the HyperFlash and\n\\'ECLAT programs. We observed for $500$h and detected $217$ bursts, including\n$10$ bursts with high fluence ($>25$ Jy ms) and implied energy. We track\nburst-to-burst variations in dispersion measure (DM) and rotation measure (RM),\nfrom which we constrain the parallel magnetic field strength in the source's\nlocal environment: $0.32\\pm0.19$ mG. Apparent DM variations between sub-bursts\nin a single bright event are interpreted as coming from plasma lensing or\nvariable emission height. We also identify two distinct scintillation screens\nalong the line of sight, one associated with the Milky Way and the other likely\nlocated in the FRB's host galaxy or local environment. Together, these\n(time-variable) propagation effects reveal that FRB 20240619D is embedded in a\ndense, turbulent and highly magnetised plasma. The source's environment is more\ndynamic than that measured for many other (repeating) FRB sources, but less\nextreme compared to several repeaters that are associated with a compact,\npersistent radio source. FRB 20240619D's cumulative burst fluence distribution\nshows a power-law break, with a flat tail at high energies. Along with previous\nstudies, this emphasises a common feature in the burst energy distribution of\nhyperactive repeaters. Using the break in the burst fluence distribution, we\nestimate a source redshift of $z=0.042$-$0.240$. We discuss FRB 20240619D's\nnature in the context of similar studies of other repeating FRBs."}
{"id": "2509.16798", "categories": ["astro-ph.IM", "astro-ph.EP"], "pdf": "https://arxiv.org/pdf/2509.16798", "abs": "https://arxiv.org/abs/2509.16798", "authors": ["Renyu Hu", "Michiel Min", "Max Millar-Blanchaer", "Jacob Lustig-Yaeger", "Tyler Robinson", "Jennifer Burt", "Athena Coustenis", "Mario Damiano", "Chuanfei Dong", "Courtney Dressing", "Luca Fossati", "Stephen Kane", "Soumil Kelkar", "Tim Lichtenberg", "Jean-Baptiste Ruffio", "Dibyendu Sur", "Armen Tokadjian", "Martin Turbet"], "title": "Identifying rocky planets and water worlds among sub-Neptune-sized exoplanets with the Habitable Worlds Observatory", "comment": "Habitable Worlds Observatory (HWO) Science Case Development Document\n  (SCDD), presented at the \"Towards the Habitable Worlds Observatory: Visionary\n  Science and Transformational Technology\" conference in July 2025, and to be\n  published in the conference proceedings", "summary": "Astronomers are debating whether the plentiful \"sub-Neptune\" exoplanets --\nworlds a bit larger than Earth but smaller than Neptune -- are predominantly\nrocky planets, water-rich \"ocean worlds,\" or gas-enshrouded mini-Neptunes. This\nquestion is crucial because such sub-Neptune-sized planets are among the most\ncommon in our galaxy, yet we have no analog in our own solar system, making\nthem a key to understanding planet formation and diversity. It also directly\nimpacts the search for habitable worlds: larger-than-Earth planets with solid\nsurfaces or oceans could support life, whereas gas-rich mini-Neptunes likely\ncannot. However, distinguishing these types using only a planet's mass and\nradius is very challenging, because different compositions can produce similar\ndensities, leaving a world's nature ambiguous with current data. The proposed\nHabitable Worlds Observatory (HWO), a future NASA flagship telescope, offers a\nsolution. HWO could directly image and spectroscopically analyze starlight\nreflected from 50~100 sub-Neptunes around nearby stars, aiming to reveal their\natmospheric compositions and potential surfaces. Using visible and\nnear-infrared spectroscopy along with sensitive polarimetry, HWO would detect\natmospheric gases (such as water vapor, methane, and carbon dioxide) and search\nfor telltale surface signatures, including rock absorption features and the\ncharacteristic reflectivity patterns of oceans. By analyzing these signals, we\ncould determine whether sub-Neptunes are large rocky planets or water worlds\nrather than gas-dominated mini-Neptunes. Crucially, expanding the search beyond\nEarth-sized planets to include these abundant sub-Neptunes may uncover entirely\nnew classes of potentially habitable worlds, directly advancing HWO's mission\nto identify and characterize planets that could support life."}
{"id": "2509.16414", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.16414", "abs": "https://arxiv.org/abs/2509.16414", "authors": ["Marco Stein Muzio"], "title": "First Array-Wide Search for Diffuse UHE Neutrinos with the Askaryan Radio Array", "comment": null, "summary": "The Askaryan Radio Array (ARA) is an ultrahigh energy (UHE) neutrino detector\nat the South Pole, designed to search for radio pulses emitted by\nneutrino-initiated particle showers in ice. ARA consists of an array of five\nautonomous stations with 2 km spacing. Each station consists of 16 radio\nantennas embedded ${\\sim}200$ m deep in the ice that are sensitive to either\nvertically- or horizontally-polarized signals. Radio arrays like ARA represent\na cost-efficient means of achieving the enormous detection $O(10~\\text{km}^3)$\nvolumes necessary for UHE neutrino detection. This contribution presents the\ncurrent status of the first-ever array-wide search for UHE neutrinos,\nleveraging ARA's unprecedented ${\\sim}28$ station-years of livetime. This\nsearch will have the best sensitivity of any neutrino detector above $3$ EeV,\nsufficient to probe the $220$ PeV flux inferred from KM3NeT's observation of\nKM3-230213A. Importantly, this study demonstrates the feasibility of array-wide\nneutrino searches, which are necessary for next-generation detectors, like\nRNO-G (35 stations planned) and IceCube-Gen2 Radio (361 stations proposed), to\nachieve their design sensitivity. We discuss the progress towards a fully\nanalyzed sample and improvements to ARA's detector characterization and\nanalysis sensitivity."}
{"id": "2509.17242", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.17242", "abs": "https://arxiv.org/abs/2509.17242", "authors": ["Mark Lai", "Vincent MacKay", "Dallas Wulf", "Peter Shmerko", "Leonid Belostotski"], "title": "0.3-to-1.5-GHz LNA with Wideband Noise and Power Matching for Radio Astronomy", "comment": null, "summary": "This paper presents a low-noise amplifier (LNA) that was developed for a new\nradio telescope comprised of 512 parabolic dish antennas. The LNA closely\ninterfaces to a custom-made antenna feed with an impedance co-designed to\nprovide noise matching over a 5:1 bandwidth. Additionally, a method of\nbroadband noise and power matching that allows the input impedance to be\ncontrolled independently from the optimum signal-source impedance to achieve\nminimum noise is also discussed. When measured in a 50-\\Omega system, the LNA\nexhibits a return loss (RL) of > 8 dB between 0.32 to 1.5 GHz, S21 of 32 dB \\pm\n1.2 dB, IP1dB > -37 dBm, and IIP3 > -20 dBm. Noise parameter measurements show\nTmin \\approx 13 \\pm 4K and noise temperatures T50{\\Omega} \\approx 18 \\pm 6K\nbetween 0.5 to 1.4 GHz."}
{"id": "2509.16425", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.16425", "abs": "https://arxiv.org/abs/2509.16425", "authors": ["Abigail Bishop", "Alan Salcedo Gomez", "Marco Stein Muzio"], "title": "High-Fidelity Simulations of the Full Askaryan Radio Array and its Sensitivity to Ultra-High Energy Neutrinos", "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC\n  2023). 8 pages, 5 figures", "summary": "The Askaryan Radio Array (ARA) is a five-station, in-ice radio detector\nlocated at the South Pole searching for particle cascades from cosmogenic and\nastrophysical neutrinos with $\\geq10^{17}$ eV of energy. Cascades in this\nenergy regime emit radio-wavelength Askaryan radiation that can be observed by\none or more ARA stations. With the recent KM3Net observation of an\napproximately $220$ PeV neutrino, there is renewed, urgent interest in further\nunlocking the ultra-high energy neutrino sky. We present updated calculations\nof ARA's array-wide effective volume, sensitivity, and expected event rates for\nultra-high energy neutrino-induced cascades. Notably, results now account for\nthe contributions of secondary particles from neutrino interactions (such as\nmuon tracks) and multi-station detections within a detailed detector simulation\nframework. Previous work has shown these secondary interactions and\nmulti-station coincidences compose 25\\% and 8\\% of the detector's effective\narea, respectively. We intend to extend these results towards a novel analysis\nthat estimates the degree to which secondary cascades and multi-station\nobservations are detectable in a real neutrino search. This will inform future\nUHE neutrino searches as it will characterize the feasibility of detecting such\nevents."}
{"id": "2509.17300", "categories": ["astro-ph.IM", "astro-ph.EP"], "pdf": "https://arxiv.org/pdf/2509.17300", "abs": "https://arxiv.org/abs/2509.17300", "authors": ["Manjunath Bestha", "Sivarani Thirupathi", "Athira Unni", "Parvathy M", "Devika Divakar"], "title": "Atmospheric Dispersion Measurement at Hanle Site", "comment": "Submitted to Springer Proceedings", "summary": "Atmospheric dispersion introduces wavelength-dependent effects that\nsignificantly impact ground-based observations, particularly in slit- and\nfibre-fed spectroscopic studies. These effects reduce the signal entering the\nspectrograph and introduce systematic errors in radial velocity measurements.\nTo address this challenge, atmospheric dispersion correctors are utilised.\nHowever, many existing designs of these correctors, which are based on\ntheoretical models, often lack practical validation and consistency. The\nforthcoming National Large Optical Telescope (NLOT) will be installed at Hanle,\na site known for its favourable astronomical sky conditions. Thus, the design\nof an effective dispersion corrector for the instruments on the NLOT,\nspecifically one that compensates for the measured dispersion, is crucial. For\nthe first time, we have directly measured atmospheric dispersion at the Hanle\nsite using the Himalayan Faint Object Spectrograph mounted on the Himalayan\nChandra Telescope. In this study, we present our methodology, the dispersion\nmeasurements obtained within the 400 to 700 nm wavelength range, and a\ncomparison with modelled dispersion values."}
{"id": "2509.16484", "categories": ["astro-ph.HE", "hep-ph"], "pdf": "https://arxiv.org/pdf/2509.16484", "abs": "https://arxiv.org/abs/2509.16484", "authors": ["L. F. Araujo", "G. Lugones", "J. A. S. Lima"], "title": "Dark interactions in neutron star interiors: the interplay of baryons, dark matter, and dark energy", "comment": null, "summary": "The impact of energy exchange among the relevant fluid components: baryonic\nmatter, fermionic dark matter (DM), and dark energy (DE) on the internal\nstructure of neutron stars is investigated. Using a representative DM mass\n$m_{\\chi} = 10$ GeV and a barotropic DE relation, we add source terms Qi to the\nTolman-Oppenheimer-Volkoff equations and examine three cases: (i)\nnoninteracting fluids (Model I), (ii) fully interacting baryon plus DM and DM\nwith DE fluids with optional DM self repulsion (Model II), and (iii) a unified\ndark sector coupled to baryons (Model III). Two effects dominate: softening by\nmassive, pressure-poor DM, and additional softening/ and binding from DE with\nnegative pressures. Model I isolates these baselines. In Model II, exchange\nterms self regulate, making the mass radius curves nearly independent of the\ncoupling parameter $\\alpha$ for nearly five orders of magnitude. Model III\nbreaks this $\\alpha$ degeneracy: a sizable vacuum fraction suppresses the\nbaryonic pressure gradient, reducing both the maximum mass and radii, whereas a\npure-DM core is less sensitive. We outline when dark interactions can leave\nobservable, macroscopic imprints."}
{"id": "2509.17369", "categories": ["astro-ph.IM", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2509.17369", "abs": "https://arxiv.org/abs/2509.17369", "authors": ["Guang-Xing Li", "Mengke Zhao"], "title": "Volume Density Mapper: 3D Density Reconstruction Algorithm for Molecular Clouds", "comment": "Code available at https://github.com/gxli/volume-density-mapper", "summary": "The interstellar medium (ISM) exhibits complex, multi-scale structures that\nare challenging to study due to their projection into two-dimensional (2D)\ncolumn density maps. We present the Volume Density Mapper, a novel algorithm\nbased on constrained diffusion to reconstruct three-dimensional (3D) density\ndistributions of molecular clouds from 2D observations. This method decomposes\nthe column density into multi-scale components, reconstructing a 3D density\nfield that preserves key physical properties such as mean density, maximum\ndensity, and standard deviation along the line of sight. Validated against\nnumerical simulations (FLASH and ENZO), the algorithm achieves high accuracy,\nwith mean density estimates within 0.1 dex and dispersions of 0.2 to 0.3 dex\nacross varied cloud structures. The reconstructed 3D density fields enable the\nderivation of critical parameters, including volume density, cloud thickness,\nand density probability distribution functions, offering insights into star\nformation and ISM evolution. The versatility of the method is demonstrated by\napplying diverse systems from galaxies (NGC 628) to protostellar disks. The\ncode is available at https://github.com/gxli/volume-density-mapper."}
{"id": "2509.16544", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.16544", "abs": "https://arxiv.org/abs/2509.16544", "authors": ["Chenlei Guo", "Erlin Qiao"], "title": "Light curves of time-dependent accretion disk in tidal disruption events", "comment": "18 pages, 9 figures. Submitted to ApJ", "summary": "Tidal disruption events (TDEs) are believed to be an ideal laboratory for\nstudying the evolution of accretion flow around a supermassive black hole (BH).\nIn general, the mass feeding rate to the BH is suggested to be super-Eddington\ninitially, and evolves to be sub-Eddington on timescale of years. In this\npaper, we carry out calculations of the time-dependent evolution of accretion\ndisk in the standard environment of TDE, i.e., injecting matter at the\ncircularization radius of the stellar debris in the form of $\\dot M_{\\rm\ninject} \\propto t^{-5/3}$. One of the main findings is that when $\\dot M_{\\rm\ninject}$ evolves to a value around the Eddington accretion rate, the radiation\npressure instability occurs. We test the influence of the model parameters on\nthe light curves, such as the BH mass $M_{\\rm BH}$, viscosity parameter\n$\\alpha$, and mass-injecting radius $R_{\\rm{out}}$, all of which are found to\naffect the light curves to some extent. In most cases, we find that the light\ncurves oscillate significantly due to the radiation pressure instability. As an\nexception, when $\\alpha$ is small or $R_{\\rm{out}}$ is large, we find that the\noscillations are completely suppressed. In this case, the light curve drops\nsteeply and then becomes flat in the late-time evolution, which is applied to\nexplaining the observed ultraviolet (UV) light curves of ASASSN-15oi and\nASASSN-14ae together with the assumption of a photosphere. Finally, we discuss\nthe potential applications of our time-dependent accretion disk model to\nexplaining multi-band light curves of TDEs in the future."}
{"id": "2509.17447", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.17447", "abs": "https://arxiv.org/abs/2509.17447", "authors": ["Stefano Rinaldi"], "title": "Expect the unexpected: augmented mixture models for black hole population studies", "comment": "11 pages, 7 figures. Comments welcome", "summary": "Black hole population studies are currently performed either using\nastrophysically motivated models (informed but rigid in their functional forms)\nor via non-parametric methods (flexible but not directly interpretable). In\nthis paper, we present a statistical framework to complement the predictive\npower of astrophysically motivated models with the flexibility of\nnon-parametric methods. Our method makes use of the Dirichlet distribution to\nrobustly infer the relative weights of different models as well as of the Gibbs\nsampling approach to efficiently explore the parameter space. After having\nvalidated our approach using simulated data, we apply this method to the BBH\nmergers observed during the first three Observing Runs of the LIGO-Virgo-KAGRA\ncollaboration using both phenomenological and astrophysical models as\nparametric models, finding results in agreement with the currently available\nliterature."}
{"id": "2509.16608", "categories": ["astro-ph.HE", "astro-ph.CO", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2509.16608", "abs": "https://arxiv.org/abs/2509.16608", "authors": ["Bei You", "Wei Yu", "Adam Ingram", "Barbara De Marco", "Jin-Lu Qu", "Zong-Hong Zhu", "Andrea Santangelo", "Sai-En Xu"], "title": "Reverberation lags viewed in hard X-rays from an accreting stellar-mass black hole", "comment": "28 pages, 11 figures", "summary": "Accreting black holes are thought to swallow matter in the form of a disk and\na hot cloud of plasma that glows brightly in X-rays, known as the corona. The\nX-ray emitting region is far too small to be directly imaged, but rapid\nvariability of the X-ray signal can be used to infer the geometry by measuring\ntime lags caused by material propagating towards the black hole and by coronal\nX-rays reflecting off the disk to imprint a reverberation lag. Reverberation\nlags can be recognized by characteristic spectral features, including an iron\nemission line at $\\sim 6.4$ keV and a broad Compton hump peaking at $\\sim 30$\nkeV. These reverberation features have both previously been detected for a few\nsupermassive black holes in active galactic nuclei (AGNs). However, it is much\nmore challenging to detect reverberation lags from stellar-mass black holes\nbecause they are more than a million times smaller. Previous reverberation lag\nmeasurements for stellar-mass black holes in X-ray binary systems have thus\nbeen limited to energies below 10 keV. Here we report on the first detection of\nthe Compton hump reverberation feature from an X-ray binary, achieved by\nmeasuring lags in the broad energy range of $\\sim 1-150$ keV. The accompanying\ndetection of an iron line feature confirms the scenario of X-ray reverberation\nand provides strong evidence that the accretion flows in AGNs and X-ray\nbinaries are governed by an ubiquitous process. Reverberation lags are\nprominent only in the most rapid variability, whereas lags in the slower\nvariability are commonly attributed to propagating mass accretion rate\nperturbations. Our lag measurements up to the highest energy to date reveal\nthat this lag in the slower variability evolves dramatically on timescales of\ndays."}
{"id": "2509.17618", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.17618", "abs": "https://arxiv.org/abs/2509.17618", "authors": ["Shideh Davarpanah for the NUSES Collaboration"], "title": "The Terzina Payload on NUSES: Silicon Photomultipliers Performance and Radiation Damage Mitigation in Low Earth Orbit", "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC\n  2025). 9 pages, 8 figures", "summary": "Silicon photomultipliers (SiPMs) are increasingly favored for detecting\nnear-UV, visible, and infrared light in space due to their high sensitivity to\nsingle photons and compact design. While SiPMs offer several advantages over\ntraditional photomultiplier tubes, their susceptibility to radiation and noise\nremains an issue. Our study intended to determine the optimal SiPM design for\nthe Terzina Cherenkov satellite in sun-synchronous low Earth orbit (LEO) at an\naltitude of 550 km. To this end, we characterised several NUV-HD-MT SiPM\nvariants, developed by Fondazione Bruno Kessler, and studied their responses to\nirradiation by exposing them to a 50 MeV proton beam and to electrons from the\n$\\beta$-emitting source strontium-90. Experimental results were cross-validated\nwith SPENVIS and Geant4 simulations. Based on our findings, we also propose an\nannealing strategy to mitigate radiation damage and ensure reliable performance\nin space-based applications."}
{"id": "2509.16796", "categories": ["astro-ph.HE", "astro-ph.GA", "gr-qc"], "pdf": "https://arxiv.org/pdf/2509.16796", "abs": "https://arxiv.org/abs/2509.16796", "authors": ["Raj Kishor Joshi", "Aryan Bhake", "Biswajit Banerjee", "Bhargav Vaidya", "Milton Ruiz", "Antonios Tsokaros", "Andrea Mignone", "Marica Branchesi", "Amit Shukla", "Miljenko Čemeljić"], "title": "Binary black holes in magnetized AGN disks", "comment": "Accepted for publication in A&A", "summary": "Stellar-mass binary black hole (BBH) mergers occurring within the disks of\nactive galactic nuclei (AGN) are promising sources for gravitational waves\ndetectable by the LIGO, Virgo, and KAGRA (LVK) interferometers. Some of these\nevents have also been potentially associated with transient electromagnetic\nflares, indicating that BBH mergers in dense environments may be promising\nsources of multi-messenger signals. To investigate the prospects for\nelectromagnetic emission from these systems, we study the dynamics of accretion\nflows onto BBHs embedded in AGN disks using numerical simulations. Although\nrecent studies have explored this scenario, they often employ simplified disk\nmodels that neglect magnetic fields. In this work, we examine how strong\nmagnetic fields influence and regulate the accretion onto such binary systems.\nIn this context, we conduct three-dimensional magnetohydrodynamical local\nshearing-box simulations of a binary black hole system embedded within a\nmagnetized disk of an AGN.\n  We observe that the dynamically important magnetic fields can drive the\nformation of well-collimated outflows capable of penetrating the vertical\nextent of the AGN disk. However, outflow generation is not ubiquitous and\nstrongly depends on the radial distance of the binary from the supermassive\nblack hole (SMBH). In particular, binaries placed at a larger distance from the\ncentral SMBH show relatively more transient accretion and the formation of\nstronger spiral shocks. Furthermore, accretion behavior onto the binary system\nvia individual circum-singular disks (CSDs) is also modulated by local AGN disk\nproperties. Our simulations highlight the importance of shear velocity in the\namplification of the toroidal magnetic field component, which plays a crucial\nrole in governing the outflow strength."}
{"id": "2509.17657", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.17657", "abs": "https://arxiv.org/abs/2509.17657", "authors": ["Ian Kemp", "Steven J Tingay", "Stuart Midgley", "Daniel Mitchell"], "title": "Experiences of Commercial Supercomputing in Radio Astronomy Data Processing", "comment": null, "summary": "The ongoing exponential growth of computational power, and the growth of the\ncommercial High Performance Computing (HPC) industry, has led to a point where\nten commercial systems currently exceed the performance of the highest-used HPC\nsystem in radio astronomy in Australia, and one of these exceeds the expected\nrequirements of the Square Kilometre Array (SKA) Science Data Processors.\n  In order to explore implications of this emerging change in the HPC landscape\nfor radio astronomy, we report results from a survey conducted via\nsemi-structured interviews with 14 Australian scientists and providers with\nexperience of commercial HPC in astronomy and similar data intensive fields. We\nsupplement these data with learnings from two earlier studies in which we\ninvestigated the application of commercial HPC to radio astronomy data\nprocessing, using cases with very different data and processing considerations.\n  We use the established qualitative research approach of thematic analysis to\nextract key messages from our interviews. We find that commercial HPC can\nprovide major advantages in accessibility and availability, and may contribute\nto increasing researchers' career productivity. Significant barriers exist,\nhowever, including the need for access to increased expertise in systems\nprogramming and parallelisation, and a need for recognition in research\nfunding. We comment on potential solutions to these issues."}
{"id": "2509.16847", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.16847", "abs": "https://arxiv.org/abs/2509.16847", "authors": ["Constanza Valdivieso", "Bárbara Gutierrez", "Nicolás Viaux M", "Sebastián Mendizabal", "Raquel Pezoa R", "Sebastián Tapia"], "title": "Refining the Greisen Profile for Low-Energy Cosmic Gamma-Rays: Quantifying Deviations Across Altitudes and Zenith Angles", "comment": null, "summary": "This study refines the Greisen formalism by comparing the classical Greisen\nprofile and a modified Greisen profile, which incorporates an empirical\ncorrection to the shower age parameter with zenith-angle dependence, aiming to\nbetter describe low-energy cascades against CORSIKA simulations of cosmic\ngamma-ray showers (20-800 GeV). Fittings across altitudes of 5000-5900 m and\nzenith angles from 0 to 40 degrees quantify deviations in particle numbers,\nshowing that the modified profile yields deviations below 4.7%, compared to up\nto 12.5% for the classical profile. These improvements address low-energy\nionization losses, atmospheric density variations, and zenith-angle effects,\nenhancing accuracy for high-altitude observatories like HAWC and the proposed\nCONDOR array. The modified profile offers a computationally efficient\nalternative, providing precise particle number predictions to advance gamma-ray\nastrophysics and cosmic-ray research."}
{"id": "2509.16414", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.16414", "abs": "https://arxiv.org/abs/2509.16414", "authors": ["Marco Stein Muzio"], "title": "First Array-Wide Search for Diffuse UHE Neutrinos with the Askaryan Radio Array", "comment": null, "summary": "The Askaryan Radio Array (ARA) is an ultrahigh energy (UHE) neutrino detector\nat the South Pole, designed to search for radio pulses emitted by\nneutrino-initiated particle showers in ice. ARA consists of an array of five\nautonomous stations with 2 km spacing. Each station consists of 16 radio\nantennas embedded ${\\sim}200$ m deep in the ice that are sensitive to either\nvertically- or horizontally-polarized signals. Radio arrays like ARA represent\na cost-efficient means of achieving the enormous detection $O(10~\\text{km}^3)$\nvolumes necessary for UHE neutrino detection. This contribution presents the\ncurrent status of the first-ever array-wide search for UHE neutrinos,\nleveraging ARA's unprecedented ${\\sim}28$ station-years of livetime. This\nsearch will have the best sensitivity of any neutrino detector above $3$ EeV,\nsufficient to probe the $220$ PeV flux inferred from KM3NeT's observation of\nKM3-230213A. Importantly, this study demonstrates the feasibility of array-wide\nneutrino searches, which are necessary for next-generation detectors, like\nRNO-G (35 stations planned) and IceCube-Gen2 Radio (361 stations proposed), to\nachieve their design sensitivity. We discuss the progress towards a fully\nanalyzed sample and improvements to ARA's detector characterization and\nanalysis sensitivity."}
{"id": "2509.16927", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2509.16927", "abs": "https://arxiv.org/abs/2509.16927", "authors": ["Junhao Deng", "Lizhi Liu", "Yifan Wang", "Yunguo Jiang"], "title": "A novel Reverberation mapping method for blazars", "comment": "8 pages, 5 figures, Submitted to ApJ", "summary": "The reverberation mapping (RM) is the most promising method to measure the\nmass of supermassive black hole in the center of active galaxy nuclei (AGNs).\nHowever, the dominant jet component hinders the application of RM method for\nblazars. In this work, we present a new algorithm to disentangle the\ncontributions of the accretion disk and relativistic jet in blazars by\nanalyzing the optical spectroscopic data. Applying this method to two\nflat-spectrum radio quasars, PKS 1510-089 and PKS 0736+017, we find that the\nH$\\gamma$ variability in PKS 1510-089 lags behind the disk by approximately 116\ndays, while the H$\\beta$ line exhibits a lag of about 52 days relative to the\ndisk in PKS 0736+017. Based on these measured time lags, we estimate that the\nblack hole masses are about $1.8 \\times 10^8\\ M_\\odot$ for PKS 1510-089 and\nabout $7.0 \\times 10^7\\ M_\\odot$ for PKS 0736+017, respectively. This method\npaves the way to apply the RM method for blazars, and improves the\nunderstanding of disk and jet activities."}
{"id": "2509.16425", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.16425", "abs": "https://arxiv.org/abs/2509.16425", "authors": ["Abigail Bishop", "Alan Salcedo Gomez", "Marco Stein Muzio"], "title": "High-Fidelity Simulations of the Full Askaryan Radio Array and its Sensitivity to Ultra-High Energy Neutrinos", "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC\n  2023). 8 pages, 5 figures", "summary": "The Askaryan Radio Array (ARA) is a five-station, in-ice radio detector\nlocated at the South Pole searching for particle cascades from cosmogenic and\nastrophysical neutrinos with $\\geq10^{17}$ eV of energy. Cascades in this\nenergy regime emit radio-wavelength Askaryan radiation that can be observed by\none or more ARA stations. With the recent KM3Net observation of an\napproximately $220$ PeV neutrino, there is renewed, urgent interest in further\nunlocking the ultra-high energy neutrino sky. We present updated calculations\nof ARA's array-wide effective volume, sensitivity, and expected event rates for\nultra-high energy neutrino-induced cascades. Notably, results now account for\nthe contributions of secondary particles from neutrino interactions (such as\nmuon tracks) and multi-station detections within a detailed detector simulation\nframework. Previous work has shown these secondary interactions and\nmulti-station coincidences compose 25\\% and 8\\% of the detector's effective\narea, respectively. We intend to extend these results towards a novel analysis\nthat estimates the degree to which secondary cascades and multi-station\nobservations are detectable in a real neutrino search. This will inform future\nUHE neutrino searches as it will characterize the feasibility of detecting such\nevents."}
{"id": "2509.16976", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.16976", "abs": "https://arxiv.org/abs/2509.16976", "authors": ["Athira M Bharathan", "C S Stalin", "Sunder Sahayanathan", "Blesson Mathew"], "title": "Clues on the X-ray emission mechanism of blazars PKS 2155$-$304 and 3C 454.3 through polarization studies", "comment": "Accepted for publication in JHEAP", "summary": "X-ray polarization measurable with the imaging X-ray Polarimetry Explorer\n(\\textit{IXPE}) could constrain the long-debated leptonic versus hadronic\norigin of the high-energy component in the broadband spectral energy\ndistribution (SED) of blazars. We report \\textit{IXPE} results and SED modeling\nof PKS 2155$-$304 and 3C 454.3, a high- and low-synchrotron-peaked blazar. For\nPKS 2155$-$304, model-independent analysis gives polarization angle $\\Psi_X$ =\n(130$\\pm$2.5) deg and polarization degree $\\Pi_X$ = (20.9$\\pm$1.8)\\% in the\n2$-$8 keV band, in agreement with spectro-polarimetric analysis. We found\n$\\Pi_X$ varies with time and shows indications of energy dependence, suggesting\nstratified emission regions. For 3C 454.3, no X-ray polarization is detected in\nthe June 2023 observation, analyzed here for the first time. The detection in\nPKS 2155$-$304 and non-detection in 3C 454.3 are consistent with X-ray emission\nfrom synchrotron and inverse Compton processes, respectively. Dividing the\ndataset into finer time bins allows a more granular view of polarization\nvariability. We modeled the broadband SEDs using quasi-simultaneous optical,\nUV, and X-ray data from {\\it Swift}, {\\it AstroSat}, and $\\gamma$-rays from\n{\\it Fermi}. In PKS 2155$-$304, X-rays lie in the high-energy tail of the\nsynchrotron component, while in 3C 454.3 they lie in the rising part of the\ninverse Compton component. Our SED modeling with X-ray polarization favors a\nleptonic scenario for PKS 2155$-$304. These results support a structured jet\nmodel where X-ray emission originates from a compact acceleration zone near the\nshock front, while lower-energy optical emission comes from a broader turbulent\nregion."}
{"id": "2509.17475", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.17475", "abs": "https://arxiv.org/abs/2509.17475", "authors": ["Léo Le Moigne", "Mathieu de Bony de Lavergne", "Armand Fiasson", "Edna Ruiz-Velasco", "David Sanchez", "Kenta Terauchi"], "title": "Methods for statistical detection of GRBs in the context of the LST-CTAO", "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC\n  2025), 2025", "summary": "Gamma-Ray Bursts (GRBs) afterglows are rapidly decaying signals that pose\nsignificant detection challenges, requiring improved methods to track their\ntemporal evolution. In this study, we systematically compare various techniques\nfor detecting GRB-like transient emissions at very high energies (VHE, >100\nGeV). Our analysis includes time-dependent extension of the standard method\n(i.e., Li & Ma 1983) and other previously developed methods in the literature,\nalongside a novel likelihood-based approach, which directly fits spectral and\ntemporal decay features to IACT data. Through dedicated observation\nsimulations, we evaluate the performance of these methods for the Large-Sized\nTelescope prototype (LST-1) of the Cherenkov Telescope Array Observatory\n(CTAO). We characterised the enhanced sensitivity found in some of these\nmethods compared to the standard significance estimation. For GRBs simulated\nwith very fast afterglow decay, an improvement of more than a factor of two is\nseen in detections for some of the methods presented here, compared to the\nstandard Li&Ma approach."}
{"id": "2509.16996", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.16996", "abs": "https://arxiv.org/abs/2509.16996", "authors": ["Jonathan Morag"], "title": "Radiation Mediated Shock and Planar Shock Breakout in the Presence of Atomic Transition Lines", "comment": "16 pages, 10 figures", "summary": "We numerically study fast Newtonian radiation mediated shocks (RMS - v/c~0.2)\nin two simplified problems in the context of supernova shock breakout; (1) An\nRMS traveling in a uniform medium, and (2) an RMS escaping a powerlaw density\nprofile in planar geometry (\\rho~x^n). Both problems were previously solved in\nthe literature assuming a fully ionized plasma medium emitting Bremstrahllung.\nIt was shown that at high shock velocities photons can deviate from local\nthermal equilibrium (LTE) and reach distributions peaked at many keV.\n  In this study we incorporate, for the first time, opacity from bound species\nof heavy elements (solar-like composition) into these two problems, at times\ndrastically augmenting the photon production due to bound-free and bound-bound\nradiative processes. We use a previously developed hydrodynamically coupled\nmulti-group radiative diffusion code, including inelastic Compton scattering\nand frequency-dependent opacity from the publicly available TOPS table. Adding\na more realistic opacity leads the radiation to maintain LTE at higher\nvelocities in comparison to the fully ionized problem.\n  In the planar SBO problem this opacity can reduce the emission temperature by\nhalf and even an order of magnitude. This result is important for the\nobservation of supernova shock breakout emission. The SED of SN envelope\nbreakout will very likely remain in LTE for explosions in red super giant stars\nwithout stellar wind (and part of blue super giant star explosions), making\nX-Ray observations less likely in these cases by orders of magnitude relative\nto previous predictions. We provide a semi-analytic description for the SED in\nthe case where LTE is maintained. A correct shock-breakout calculation requires\nopacity tables that include bound yet highly ionized species, ruling out the\nuse of certain line tables (such as the commonly used Kurucz table)."}
{"id": "2509.17575", "categories": ["astro-ph.HE", "astro-ph.IM", "hep-ex", "hep-ph"], "pdf": "https://arxiv.org/pdf/2509.17575", "abs": "https://arxiv.org/abs/2509.17575", "authors": ["Baobiao Yue", "Karl-Heinz Kampert", "Julian Rautenberg"], "title": "Ultra-high-energy neutrino detection with radio antennas in the ground-based observatory", "comment": "8 pages, 4 figures, ICRC proceedings", "summary": "Ultra-high-energy (UHE) neutrinos are unique cosmic messengers that can\ntraverse cosmological distances unattenuated, offering direct insight into the\nmost energetic processes in the universe. Radio detection promises significant\nadvantages for detecting highly inclined air showers induced by UHE neutrinos,\nincluding a larger exposure range compared to particle detectors, which is due\nto minimal atmospheric attenuation of radio signals combined with good\nreconstruction precision. Furthermore, this technique improves the air shower\nlongitudinal reconstruction, which can be used to identify neutrinos with their\nfirst interaction far below the top of the atmosphere. In this work, we present\na method for identifying UHE neutrinos using radio antennas deployed in\nground-based observatories. We introduce a reconstruction algorithm based on\nthe radio emission maximum ($X^{\\text{radio}}_{\\text{max}}$) and demonstrate\nits power in distinguishing deeply developing neutrino-induced showers from\nbackground cosmic rays. Using the Pierre Auger Observatory as a case study, we\nuse the simulations of $\\nu_e$-CC-induced air showers and evaluate the trigger\nefficiency, reconstruction performance, and resulting effective area. Our\nresults show that radio detection significantly enhances the sensitivity to\nvery inclined showers above 1~EeV, complementing traditional surface detectors.\nThis technique is highly scalable and applicable to future radio observatories\nsuch as GRAND. The proposed reconstruction and identification strategy provides\na pathway toward achieving the sensitivity needed to detect UHE neutrinos."}
{"id": "2509.17003", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.17003", "abs": "https://arxiv.org/abs/2509.17003", "authors": ["Jonathan Morag"], "title": "On Atomic Line Opacities for Modeling Astrophysical Radiative Transfer", "comment": "5 pages, 3 figures", "summary": "In astrophysics, line opacity is a primary source of uncertainty in\ntheoretical calculations of radiative transfer. Much of this uncertainty is\ndominated by the inability to resolve the width and separation in frequency of\nsharp atomic transition lines, leading to the common use of approximate\nfrequency-averaged treatments for the lines. In a previous paper, we calculated\nshock-cooling emission following explosions in core-collapse supernovae using a\nmult-group radiative transfer code, and compared the results to those of the\nsimilar and often used STELLA code from the literature. We found important\ndifferences in the spectral energy distribution (SED) resulting from different\nchoices of line opacity treatment. In our code, we used in the emissivity a\nfrequency-binned average of a high-resolution opacity, while in STELLA the\noften-used Eastman Pinto 1993 (EP93) prescription was employed. In this short\nletter we revisit this comparison, essentially reproducing STELLA bound-free\n(photoionization) and bound-bound (line transition) opacities. We show the\nimportance of introducing micro-plasma electron excitation level cutoffs in the\nequation of state (EOS). We also argue that EP93 is useful for estimating\nphoton mean free-path in the presence of a forest of lines, but that it can\nunderestimate photon production and reprocessing rates (emissivity) by orders\nof magnitude. To our knowledge, no fully-consistent coarse-frequency solution\ncurrently exists for line modeling in these systems. Finally, we describe new\nfeatures in our updated publicly available high-resolution frequency-dependent\nopacity table."}
{"id": "2509.17102", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.17102", "abs": "https://arxiv.org/abs/2509.17102", "authors": ["A. M. Mukhamedzhanov"], "title": "Bayesian Framework for the E1 and E2 Astrophysical Factors at 300 keV from Subthreshold and Ground-State Asymptotic Normalization Coefficients", "comment": "10 pages, five figures", "summary": "The $^{12}\\mathrm{C}(\\alpha,\\gamma)^{16}\\mathrm{O}$ reaction governs the\ncarbon-to-oxygen ratio set during helium burning, shaping white-dwarf structure\nand Type~Ia supernova yields. At the astrophysical energy $E \\approx\n300~\\mathrm{keV}$, the cross section is controlled by the subthreshold $1^{-}$\n(7.12~MeV) and $2^{+}$ (6.92~MeV) states, whose contributions depend on their\nasymptotic normalization coefficients (ANCs) $C_{1}$ and $C_{2}$, respectively.\nWe perform a Bayesian analysis of the $S_{E1}(300~\\mathrm{keV})$ and\n$S_{E2}(300~\\mathrm{keV})$ factors using calibrated $R$-matrix mappings and\nexperimental ANC constraints for the $1^{-}$, $2^{+}$, and $0^{+}$ ground\nstate. For $S_{E1}(300~\\mathrm{keV})$, flat prior on the $1^{-}$ ANC lead to\nbroad posterior with $68\\%$ credible interval spanning $ [71.4,\\,93.4]$~keV\\,b,\nwhile Gaussian priors concentrate weight near the reported ANC values and yield\nnarrower posteriors. For $S_{E2}(300~\\mathrm{keV})$, the analysis includes the\ninterference of the radiative transition through the subthreshold resonance\nwith the direct capture to the ground-state, which depends on the ground-state\nANC $C_{0}$, giving broad posterior with $68\\%$ credible interval spanning\n$[30.7,\\,50.5]$~keV\\,b. The Gaussian priors centered near anchor values. The\nresulting posteriors quantify both correlations and uncertainties: despite\nincorporating the published ANC constraints, the $68\\%$ intervals remain broad,\nshowing that present ANC determinations do not yet reduce the astrophysical\nuncertainty. Overall, the Bayesian framework provides statistically robust\nposteriors for $S_{E1}(300~\\mathrm{keV})$ and $S_{E2}(300~\\mathrm{keV})$,\nimproving the reliability of extrapolations for stellar modeling and\nnucleosynthesis."}
{"id": "2509.17104", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.17104", "abs": "https://arxiv.org/abs/2509.17104", "authors": ["Suman Dey", "Günter Sigl"], "title": "Impact of Plasma Instabilities and of the Intergalactic Magnetic Field on Blazar-Induced Electromagnetic Cascades", "comment": "8 pages, 3 figures", "summary": "Intergalactic weak magnetic fields can have non-negligible effects on the\nelectromagnetic cascades induced by blazar gamma-ray emission. Secondary\nelectrons and positrons are produced by primary gamma rays of energies ~TeV and\ncan be magnetically deflected out of the line of sight to the observer.\nHowever, these leptons can perturb the background intergalactic medium (IGM),\nresulting in the growth of plasma instabilities, which can also influence the\nelectromagnetic cascade. The resulting gamma-ray spectrum, observable in the\nGeV-TeV energy range, can bear imprints of these two competing phenomena:\ndeflection by the intergalactic magnetic field and plasma instability cooling.\nWe present the results of numerical simulations that incorporate the combined\nimpact of these two processes on the propagated gamma-ray spectrum of the\nblazar 1ES 0229+200."}
{"id": "2509.17150", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.17150", "abs": "https://arxiv.org/abs/2509.17150", "authors": ["Lilly Pyras", "Dennis Soldin", "Felix Riehn"], "title": "Probing hadronic interactions with high-energy and low-energy muons in extensive air showers", "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC2025)", "summary": "High-energy cosmic rays are observed indirectly by detecting the extensive\nair showers initiated in Earth's atmosphere. The interpretation of experimental\ndata relies on accurate modeling of the air shower development. Simulations\nbased on current hadronic interaction models show significant discrepancies\nwith measurements of the muon content in air showers, commonly referred to as\nthe Muon Puzzle, indicating severe shortcomings in the understanding of\nparticle physics. A hybrid detector design with a surface array and deep\nunderground detector, such as the IceCube Neutrino Observatory, allows\nsimultaneous measurements of muons at two vastly different energies: at GeV\nenergies and above a few 100GeV. We present phenomenological studies of\nlow-energy and high-energy muons in simulated air showers, and discuss how\nhybrid measurements can provide constraints on multi-particle production in\nhadronic interaction models."}
{"id": "2509.17211", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2509.17211", "abs": "https://arxiv.org/abs/2509.17211", "authors": ["Alessandra Azzollini", "Sara Buson", "Alexis Coleiro"], "title": "The changing look of the neutrino-emitter blazar candidate 5BZQ J1243+4043", "comment": "5 pages, 4 figures. Submitted", "summary": "Context. In recent years, changing-look blazars have put into question the\ntraditional BL Lacs-flat spectrum radio quasars empirical classification of\nblazars based on the intensity of optical spectral lines, as they appear to\ntransition between the two classes over time. Aims. We focus on the blazar 5BZQ\nJ1243+4043, recently proposed as a promising candidate for the emission of\nhigh-energy neutrinos observed by the IceCube Neutrino Observatory and reported\nas a changing look in the literature. We study the spectral properties of this\nblazar, inferring its radiation field and accretion regime properties among\ndifferent epochs. Methods. This study presents new optical spectroscopy\nobservations of 5BZQ J1243+4043 taken with the Gran Telescopio Canarias. We use\nthis new dataset and two optical spectra available from the literature to\ninvestigate the continuum and line emissions and pinpoint the physical\nproperties of the source. Results. The newly collected data for 5BZQ J1243+4043\nshows broad emission lines, consistent with the spectrum of the first epoch and\nthe redshift $z = 1.5181\\pm0.0002$ known from the literature. For the second\nepoch, the spectrum appears featureless, and we place limits on the emission\nlines and related physical properties. We observe spectral variability for both\nthe continuum and line emissions among the three spectra. Despite this, the\naccretion properties of the blazar remain, overall, unvaried, indicating that\nthe intrinsic physics remains the same across the three epochs. In the broader\nmulti-messenger context, this suggests that, despite the changing look in the\noptical band, the candidate neutrino-emitter blazar 5BZQ J1243+4043 remains\ncharacterized by the presence of intense external radiation fields and\nradiatively efficient accretion, typical of high-excitation radio galaxies,\nthat may foster neutrino production."}
{"id": "2509.17245", "categories": ["astro-ph.HE", "physics.plasm-ph"], "pdf": "https://arxiv.org/pdf/2509.17245", "abs": "https://arxiv.org/abs/2509.17245", "authors": ["Maxim Lyutikov"], "title": "Relativistically-strong electromagnetic waves in magnetized plasmas", "comment": null, "summary": "Using a two-fluid approach, we consider the properties of relativistically\nnonlinear (arbitrary $a_0$), circularly polarized electromagnetic waves\npropagating along magnetic field in electron-ion and pair plasmas. Dispersion\nrelations depend on how wave intensity scales with frequency, $a_0 (\\omega)$.\nFor superluminal branches, the nonlinear effects reduce the cut-off frequency,\nwhile the general form of the dispersion relations $\\omega(k)$ remains similar\nto the linear case. For subluminal waves, whistlers and Alfven, a new effect\nappears: dispersion curves effectively terminate at finite $\\omega^\\ast -\nk^\\ast$ due to current starvation. Qualitatively, subluminal modes with\nfluctuating electric field larger than the guide field, $E_w (\\omega) \\geq\nB_0$, cannot propagate."}
{"id": "2509.17273", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.17273", "abs": "https://arxiv.org/abs/2509.17273", "authors": ["J. C. Arteaga-Velázquez"], "title": "Probing the mass composition of TeV cosmic rays with HAWC", "comment": "9 pages, 12 figures, Presented at the 39th International Cosmic Ray\n  Conference (ICRC 2025)", "summary": "In this contribution, we have investigated the energy spectra of the\nelemental mass groups of cosmic rays for the Light (H+He), medium (C+O) and\nheavy (Ne-Fe) components using the High Altitude Water Cherenkov Gamma-Ray\nobservatory (HAWC). The study was carried out in the energy interval from $10$\nTeV to $1$ PeV using almost $5$ years of data on hadronic air showers. The\nenergy spectra were unfolded using the bidimensional distribution of the\nlateral shower age versus the reconstructed primary energy. We have employed\nthe QGSJET-II-04 high-energy hadronic interaction model for the current\nanalysis. The results show the presence of fine structure in the spectra of the\nlight, medium and heavy mass groups of cosmic rays."}
{"id": "2509.17285", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.17285", "abs": "https://arxiv.org/abs/2509.17285", "authors": ["J. C. Arteaga-Velázquez"], "title": "Recent measurements of the spectrum and composition of cosmic rays between 10 TeV and 1 EeV from EAS experiments", "comment": "15 pages, 6 figures, sent to the Proc. of the 28th European Cosmic\n  Ray Symposium (ECRS 2024)", "summary": "In the last two decades, different advances with extensive air shower (EAS)\nexperiments have allowed to unveil several details about the composition and\nenergy spectrum of galactic cosmic rays from some TeV up to several hundreds of\nPeV, which have led to improve our understanding of the physics of cosmic rays.\nEAS measurements above the knee, for instance, have helped to understand some\naspects about the acceleration and propagation mechanisms of the PeV component\nof cosmic rays and have shown possible hints about the transition from the\ngalactic to the extragalactic regime. Meanwhile, EAS data in the TeV energy\nrange have revealed unexpected features in the all-particle and elemental\nspectra, which may indicate the presence of previously unknown cosmic-ray\nphenomena. In this contribution, I will present a brief account on these EAS\nresults, with particular emphasis on the recent measurements of the\nall-particle energy spectrum and the elemental composition of cosmic rays from\n10 TeV up to 1 EeV. In addition, I will compare the latest results of EAS\nexperiments and direct detectors at energies just below the knee, where there\nexists an overlap between both detection techniques."}
{"id": "2509.17475", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.17475", "abs": "https://arxiv.org/abs/2509.17475", "authors": ["Léo Le Moigne", "Mathieu de Bony de Lavergne", "Armand Fiasson", "Edna Ruiz-Velasco", "David Sanchez", "Kenta Terauchi"], "title": "Methods for statistical detection of GRBs in the context of the LST-CTAO", "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC\n  2025), 2025", "summary": "Gamma-Ray Bursts (GRBs) afterglows are rapidly decaying signals that pose\nsignificant detection challenges, requiring improved methods to track their\ntemporal evolution. In this study, we systematically compare various techniques\nfor detecting GRB-like transient emissions at very high energies (VHE, >100\nGeV). Our analysis includes time-dependent extension of the standard method\n(i.e., Li & Ma 1983) and other previously developed methods in the literature,\nalongside a novel likelihood-based approach, which directly fits spectral and\ntemporal decay features to IACT data. Through dedicated observation\nsimulations, we evaluate the performance of these methods for the Large-Sized\nTelescope prototype (LST-1) of the Cherenkov Telescope Array Observatory\n(CTAO). We characterised the enhanced sensitivity found in some of these\nmethods compared to the standard significance estimation. For GRBs simulated\nwith very fast afterglow decay, an improvement of more than a factor of two is\nseen in detections for some of the methods presented here, compared to the\nstandard Li&Ma approach."}
{"id": "2509.17525", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.17525", "abs": "https://arxiv.org/abs/2509.17525", "authors": ["Matthew Burn", "Adelle J. Goodwin", "Gemma E. Anderson", "James C. A. Miller-Jones", "Yvette Cendes", "Collin T. Christy", "Wenbin Lu", "Sjoert van Velzen"], "title": "The 6 year radio lightcurve of the tidal disruption event AT2019azh", "comment": "17 pages, 7 figures, 4 tables. Accepted for publication in ApJ", "summary": "Analysis of radio emission from tidal disruption events allows for detailed\nconstraints on the properties of ejected outflows and the host environment\nsurrounding the black hole. However, the late-time radio behaviour of tidal\ndisruption events is not well-studied due to a lack of observations. In this\nwork we present long-term radio monitoring observations of the tidal disruption\nevent AT2019azh spanning 1167-2159 days post disruption. We fit a physically\nmotivated synchrotron model to the radio spectra at each epoch, and model the\ndecay of the light curve under the assumption that the outflow transitions into\nthe non-relativistic Sedov-Taylor regime at late times. Through this modelling\nwe obtain strong constraints on the density profile of the circumnuclear\nmedium, finding an unusually flat density profile proportional to\n$r^{0.24^{+0.11}_{-0.15}}$. Overall we find that unlike some tidal disruption\nevents, AT2019azh does not show late time re-brightening up to 6 years\npost-disruption. The Sedov-Taylor light curve decay model provides a good fit\nto the data, motivating the assumption that the outflow was produced by a\nsingle ejection of material close to the time of stellar disruption. From\nforward modelling the evolution of the radio light curve decay we predict that\nthe radio afterglow from AT2019azh should be detectable for decades at its\ncurrent rate of evolution."}
{"id": "2509.17575", "categories": ["astro-ph.HE", "astro-ph.IM", "hep-ex", "hep-ph"], "pdf": "https://arxiv.org/pdf/2509.17575", "abs": "https://arxiv.org/abs/2509.17575", "authors": ["Baobiao Yue", "Karl-Heinz Kampert", "Julian Rautenberg"], "title": "Ultra-high-energy neutrino detection with radio antennas in the ground-based observatory", "comment": "8 pages, 4 figures, ICRC proceedings", "summary": "Ultra-high-energy (UHE) neutrinos are unique cosmic messengers that can\ntraverse cosmological distances unattenuated, offering direct insight into the\nmost energetic processes in the universe. Radio detection promises significant\nadvantages for detecting highly inclined air showers induced by UHE neutrinos,\nincluding a larger exposure range compared to particle detectors, which is due\nto minimal atmospheric attenuation of radio signals combined with good\nreconstruction precision. Furthermore, this technique improves the air shower\nlongitudinal reconstruction, which can be used to identify neutrinos with their\nfirst interaction far below the top of the atmosphere. In this work, we present\na method for identifying UHE neutrinos using radio antennas deployed in\nground-based observatories. We introduce a reconstruction algorithm based on\nthe radio emission maximum ($X^{\\text{radio}}_{\\text{max}}$) and demonstrate\nits power in distinguishing deeply developing neutrino-induced showers from\nbackground cosmic rays. Using the Pierre Auger Observatory as a case study, we\nuse the simulations of $\\nu_e$-CC-induced air showers and evaluate the trigger\nefficiency, reconstruction performance, and resulting effective area. Our\nresults show that radio detection significantly enhances the sensitivity to\nvery inclined showers above 1~EeV, complementing traditional surface detectors.\nThis technique is highly scalable and applicable to future radio observatories\nsuch as GRAND. The proposed reconstruction and identification strategy provides\na pathway toward achieving the sensitivity needed to detect UHE neutrinos."}
{"id": "2509.17599", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.17599", "abs": "https://arxiv.org/abs/2509.17599", "authors": ["Atreya Acharyya", "Giacomo Cacciapaglia", "Manuel Meyer", "Francesco Sannino"], "title": "Unveiling the Quantum Nature of Black Holes: Towards a Proof of Hawking Radiation through Gamma-Ray Observations", "comment": "7 pages, 3 figures, Proceedings for the 39th International Cosmic Ray\n  Conference (ICRC2025) in Geneva, Switzerland", "summary": "Hawking's groundbreaking prediction that black holes emit thermal radiation\nand ultimately evaporate remains unverified due to the extreme faintness of\nthis radiation for stellar-mass or larger black holes. In this study, we\nexplore a novel observational strategy to search for Hawking radiation from\nasteroid-mass black hole morsels -- hypothetical small black holes that may\nform and be ejected during catastrophic events such as binary black hole\nmergers. These black hole morsels are expected to emit gamma rays in the\nGeV-TeV range on observable timescales. We analyze data from the Fermi Large\nArea Telescope coinciding with the well-localized binary black hole merger\nGW170814, searching for delayed gamma-ray signatures associated with morsel\nevaporation. While we find no evidence for such emission, we place exclusion\nlimits on morsel masses, ruling out the 4 x 10^8 kg scenario at the 95 percent\nconfidence level for a total emitted mass of one solar mass. We also outline\nfuture directions, including the incorporation of late-time evaporation spikes,\nsystematic application across the growing gravitational wave catalog, and the\nenhanced discovery potential of next-generation facilities such as the\nCherenkov Telescope Array Observatory."}
{"id": "2509.17606", "categories": ["astro-ph.HE", "gr-qc"], "pdf": "https://arxiv.org/pdf/2509.17606", "abs": "https://arxiv.org/abs/2509.17606", "authors": ["Luca Negri", "Anuradha Samajdar"], "title": "Neural likelihood estimators for flexible gravitational wave data analysis", "comment": null, "summary": "In this paper, we develop a Neural Likelihood Estimator and apply it to\nanalyse real gravitational-wave (GW) data for the first time. We assess the\nusability of neural likelihood for GW parameter estimation and report the\nparameter space where neural likelihood performs as a robust estimator to\noutput posterior probability distributions using modest computational\nresources. In addition, we demonstrate that the trained Neural likelihood can\nalso be used in further analysis, enabling us to obtain the evidence\ncorresponding to a hypothesis, making our method a complete tool for parameter\nestimation. Particularly, our method requires around 100 times fewer likelihood\nevaluations than standard Bayesian algorithms to infer properties of a GW\nsignal from a binary black hole system as observed by current generation\nground-based detectors. The fairly simple neural network architecture chosen\nmakes for cheap training, which allows our method to be used on-the-fly without\nthe need for special hardware and ensures our method is flexible to use any\nwaveform model, noise model, or prior. We show results from simulations as well\nas results from GW150914 as proof of the effectiveness of our algorithm."}
{"id": "2509.17655", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.17655", "abs": "https://arxiv.org/abs/2509.17655", "authors": ["Jordi Tuneu", "Eva Santos", "Peter Filip"], "title": "Unraveling the Unexpected Seasonal Variation of Multi-Muon Events at NO$ν$A", "comment": "8 pages, 3 figures, Accepted for publication in PoS (ICRC2025)", "summary": "The seasonal variation of single muons is a well-understood phenomenon,\nmainly driven by a positive correlation with temperature fluctuations in the\natmospheric profiles. However, the rate of multi-muon events recorded by\nvarious experiments has shown an intriguing opposite seasonal modulation that\nremains unexplained by previous research. For the first time, we quantitatively\ndescribe the phase and amplitudes of the seasonal variation for cosmic\nmulti-muon events detected by the NO$\\nu$A Near Detector. We can further\nexplain the amplitude dependence for multi-muon events across various\nmultiplicities. For our analysis, we use the general-purpose Monte Carlo code\nFLUKA-CERN 4.4.1, which provides a more realistic description of the detector,\natmospheric profiles, and muon propagation underground. Finally, we compare our\nresults with those obtained from the latest CORSIKA version 7.8010, utilizing\nthe most up-to-date high-energy hadronic interaction models EPOS LHC-R and\nQGSJETIII-01. Our findings provide a fresh perspective on seasonal muon flux\nmodulation and offer key constraints for cosmic-ray interaction models and\nunderground detector studies."}
{"id": "2509.17692", "categories": ["astro-ph.HE", "hep-ph"], "pdf": "https://arxiv.org/pdf/2509.17692", "abs": "https://arxiv.org/abs/2509.17692", "authors": ["A. Salces", "P. D. L. T. Luque", "M. A. Sánchez Conde"], "title": "Molecular clouds as a tool to constraint sub-GeV dark matter and primordial black holes", "comment": "23 pages, 10 figures. Master thesis in Universidad Aut\\'onoma de\n  Madrid, supervised by Pedro de la Torre Luque and Miguel \\'Angel S\\'anchez\n  Conde", "summary": "Despite decades of direct and indirect searches within the Weakly Interacting\nMassive Particle (WIMP) framework, no conclusive results have been found in the\nGeV--TeV range. This has motivated exploring alternatives, including new\nparticles and macroscopic objects. Two well-motivated scenarios are sub-GeV DM\nand Primordial Black Holes (PBHs). Molecular clouds (MCs), typically studied as\nstar-forming sites, can serve as astrophysical laboratories to probe these\ncandidates via their ionization rates. Observations show ionization levels\nexceeding expectations from known CR fluxes, pointing to an additional ionizing\ncomponent. Here, we consider electrons and positrons from annihilating and\ndecaying MeV DM particles, as well as Hawking radiation from evaporating PBHs,\nas possible contributors. We model transport driven by energy losses within the\nclouds. By comparing predicted ionization rates with observations, conservative\nconstraints are set on the thermally averaged cross section $\\langle\\sigma\nv\\rangle$, decay lifetime $\\tau$ and PBH abundances $f_{PBH}$. The analysis\nassumes all the observed ionization comes from DM and adopts a 95% confidence\nlevel. Results show that, even in the most conservative case of local MCs such\nas L1551, these constraints are very close to the most competitive bounds from\nX-ray observations, while inner-Galaxy clouds like DRAGON or G1.4--1.8+87\nprovide stronger limits, sometimes improving X-ray and cosmological\nconstraints. For sub-GeV DM, MCs exclude parameter space competitive with the\none tested by NuSTAR, INTEGRAL, or Voyager, especially below $\\sim$30 MeV. In\nthe PBH case, asteroid-mass black holes are restricted to a low fraction of DM,\nwith optimistic scenarios getting close to the strongest limits. This\ndemonstrates the potential of MCs as a novel probe in indirect DM searches."}
{"id": "2509.17751", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.17751", "abs": "https://arxiv.org/abs/2509.17751", "authors": ["Silvia Salvatore", "Björn Eichmann", "Giacomo Sommani", "Santiago del Palacio", "Patrik M. Veres", "Julia Becker Tjus"], "title": "Monte Carlo parameter study for Seyfert AGN-starburst composite galaxies NGC1068 and NGC7469", "comment": null, "summary": "Seyfert-starburst composite galaxies host two promising phenomena of\nnon-thermal high-energy radiation. In this regard the IceCube observation of\nhigh-energy neutrinos from the direction of the Seyfert-starburst composite\ngalaxy NGC 1068 is not surprising. More recently, another Seyfert-starburst\ncomposite galaxy, NGC 7469, has shown hints for neutrino emission at even\nhigher energies. Theoretical investigations could clarify that their so-called\nAGN corona is the most-likely origin of these neutrinos due to the need of\nbeing partially $\\gamma$-ray opaque. In this work, we present an updated\nversion of our Seyfert-starburst composite model from 2022, that accounts for a\nproper treatment of the stochastic acceleration processes in the AGN corona and\nthe secondary electrons and positrons from leptonic radiation processes.\nMoreover, we use a Markov Chain Monte Carlo (MCMC) approach to study the\nparameter space of these two potential high-energy neutrino sources under\nconsideration of the given prior knowledge. In the case of NGC 1068, we can\nsuccessfully explain its non-thermal observational features, where both its AGN\ncorona and starburst ring are needed to account for the observations at high-\nenergies. In the case of NGC 7469, the high-energy signatures can only be\nexplained assuming a small coronal radius and the including external\n$\\gamma\\gamma$-pair attenuation. In general, both sources exhibit a strong\ninfluence of the $\\gamma$-ray opaqueness on the results, highlighting the need\nfor an accurate treatment of the intrinsic coronal X-ray field and the spatial\nextent of the $\\gamma$-ray production site."}
{"id": "2509.16669", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.16669", "abs": "https://arxiv.org/abs/2509.16669", "authors": ["Ritabrata Sarkar"], "title": "Monitoring Gamma Ray Bursts with the Zirè instrument onboard the NUSES space mission", "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC\n  2025), 9 pages, 6 figures", "summary": "The Zir\\`e experiment onboard NUSES space mission has several science goals,\nincluding the measurements of charged particles and light nuclei from few up to\nhundreds of MeVs, for the study of low-energy cosmic rays, space weather\nphenomena, and possible magnetosphere-lithosphere-ionosphere coupling signals.\nFurthermore, the experiment intends to test new tools for the detection of\nphotons in the energy range of about 0.03-50 MeV, allowing the investigation of\ntransient phenomena like gamma-ray bursts (GRBs). A high-density segmented\ncalorimeter exploiting novel scintillator crystals and silicon photomultiplier\ntechnology for the readout system will serve this purpose along its main task\nof calorimetric energy measurement of the cosmic-ray charged particles. In this\nwork, we discuss the functionality of the calorimeter as a GRB monitor through\nthe calculation of its performance in terms of effective area, sensitivity, and\ntiming response for the transient outbursts."}
{"id": "2509.17618", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.17618", "abs": "https://arxiv.org/abs/2509.17618", "authors": ["Shideh Davarpanah for the NUSES Collaboration"], "title": "The Terzina Payload on NUSES: Silicon Photomultipliers Performance and Radiation Damage Mitigation in Low Earth Orbit", "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC\n  2025). 9 pages, 8 figures", "summary": "Silicon photomultipliers (SiPMs) are increasingly favored for detecting\nnear-UV, visible, and infrared light in space due to their high sensitivity to\nsingle photons and compact design. While SiPMs offer several advantages over\ntraditional photomultiplier tubes, their susceptibility to radiation and noise\nremains an issue. Our study intended to determine the optimal SiPM design for\nthe Terzina Cherenkov satellite in sun-synchronous low Earth orbit (LEO) at an\naltitude of 550 km. To this end, we characterised several NUV-HD-MT SiPM\nvariants, developed by Fondazione Bruno Kessler, and studied their responses to\nirradiation by exposing them to a 50 MeV proton beam and to electrons from the\n$\\beta$-emitting source strontium-90. Experimental results were cross-validated\nwith SPENVIS and Geant4 simulations. Based on our findings, we also propose an\nannealing strategy to mitigate radiation damage and ensure reliable performance\nin space-based applications."}
