{"id": "2512.20786", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.20786", "abs": "https://arxiv.org/abs/2512.20786", "authors": ["F. Yusef-Zadeh", "M. Wardle", "R. G. Arendt", "C. O. Heinke", "C. J. Chandler", "H. Bushouse", "G. A. Moellenbrock"], "title": "Simultaneous JWST, NuSTAR, and VLA Monitoring of Sgr A*: A Unified Picture of the Variable IR, X-ray and Radio Emission", "comment": "25 pages, 14 figures, submitted to ApJ", "summary": "Flux variability is a fundamental channel of information from Sgr A* because of its direct probe of processes occurring within an accretion disk under strong gravity. We present simultaneous IR, X-ray and radio observations of Sgr A* on 2024 Apr 05 using JWST, NuSTAR, and VLA. We report the detection of a strong X-ray flare with a luminosity of $\\sim5.2x10^{35}$ erg/s coincident with a bright near-IR flare, and a brightening in radio about an hour later. We investigate the candidate physical mechanisms for the X-ray flare emission and conclude that this can best be explained by inverse Compton scattering of near-IR flare radiation. We propose a dynamic scenario analogous to a coronal mass ejection in which a magnetic flux rope is ejected from Sgr A*'s inner accretion flow with a current sheet extending down from the rope to the bulk of the accretion flow. Reconnection within the sheet produces oppositely directed flows of accelerated particles moving upwards towards the rope and downwards towards the accretion flow. Infrared radiation from the approaching energetic electrons is enhanced by beaming and up-scattered by thermal electrons in the accretion flow to produce the strong X-ray flare. Meanwhile, the relativistic electrons moving in the opposite direction away from the disk experience weaker magnetic fields so radiate at longer wavelengths by feeding into the magnetic flux tube and adiabatically cooled during its subsequent expansion. This physical picture attempts to unify the origin of the variable emission from Sgr A* at IR, X-ray and radio/submm wavelengths."}
{"id": "2512.20867", "categories": ["astro-ph.HE", "nucl-th"], "pdf": "https://arxiv.org/pdf/2512.20867", "abs": "https://arxiv.org/abs/2512.20867", "authors": ["Hajime Sotani"], "title": "Universal relations between the quasinormal modes of neutron stars and magnetic tidal deformability", "comment": null, "summary": "Tidal deformabilities are one of the observable quantities characterizing neutron stars, which are strongly associated with the stellar compactness, the ratio of the stellar mass to the radius. In addition to the tidal deformability, the quasinormal modes excited in a neutron star are also an important property for extracting information about the neutron star interior, adopting gravitational wave asteroseismology. In this study, we especially focus on the magnetic tidal deformability, which acts on the gravitational waveform from a neutron star binary merger as a higher-order effect than the electric tidal deformability, and derive the universal relations expressing the quasinormal modes, such as the fundamental ($f$-), 1st pressure ($p_1$-), and 1st spacetime ($w_1$-) modes, as a function of the magnetic tidal deformability. The universal relations derived in this study exhibit accuracy more or less comparable to those of the electric tidal deformability."}
{"id": "2512.20890", "categories": ["astro-ph.HE", "gr-qc"], "pdf": "https://arxiv.org/pdf/2512.20890", "abs": "https://arxiv.org/abs/2512.20890", "authors": ["Qiyuan Yang", "Zhi-Qiang You", "Xilong Fan"], "title": "Considering lensing effect on gravitational wave signals from black holes in mass gap", "comment": "10 pages,6 figures. Comments are welcome", "summary": "The pair-instability supernova (PISN) mechanism predicts a mass gap in the black hole population, where no stellar-origin black holes are expected to form. However, the binary black hole merger events GW190521 and GW231123 appear unusual, as current analyses place their component masses within the PISN mass gap. In this work, we investigate the relationship between different lensing magnifications and the inferred source-frame black hole masses for these two events. If the gravitational wave source is lensed, neglecting lensing effect can bias the inferred luminosity distance and hence the redshift, leading to an underestimation of the luminosity distance and consequently an overestimation of the source-frame masses, potentially placing them in the mass-gap region. For the two events in mass gap, when adopting a lower bound of $60 M_{\\odot}$ for the mass gap, the minimum magnifications required to shift the inferred source-frame masses below this gap boundary are found to be $μ=12.2$ for GW190521 and $μ=320.1$ for GW231123, corresponding to lensing-corrected luminosity distances of $11155\\, \\mathrm{Mpc}$ and $15207\\, \\mathrm{Mpc}$, respectively. These results provide a quantitative reference for assessing the lensing hypothesis as a possible explanation for the existence of black holes in the PISN mass gap."}
{"id": "2512.20965", "categories": ["astro-ph.HE", "astro-ph.GA", "astro-ph.SR", "gr-qc"], "pdf": "https://arxiv.org/pdf/2512.20965", "abs": "https://arxiv.org/abs/2512.20965", "authors": ["Guo-Peng Li", "Xi-Long Fan"], "title": "GW241011 and GW241110: Hints of Hierarchical Mergers from the Merger Entropy Index", "comment": "Comments are welcome", "summary": "GW241011 and GW241110 both exhibit extremely asymmetric masses, high primary spins, and significant spin-orbit misalignment, which challenge the formation of first-generation binary black hole mergers formed from stellar collapse. This implies that these two gravitational wave events might originate from the hierarchical merger mechanism, with at least one of the black holes being the remnant of a previous merger. Here we investigate the origin of hierarchical mergers for GW241011 and GW241110 using the merger entropy index which measures the efficiency of entropy transfer for binary black hole mergers in general relativity. We find that GW241011 is consistent with hierarchical mergers in dense star clusters. The origin of GW241110 remains under debate due to its large distribution uncertainty, which leads to method-dependent inference and should be taken into account when interpreting this event in terms of hierarchical mergers."}
{"id": "2512.20999", "categories": ["astro-ph.IM", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2512.20999", "abs": "https://arxiv.org/abs/2512.20999", "authors": ["Verene Einwalter", "Eric J. Hooper", "Melissa E. Morris", "Sarah Bach", "Yjan A. Gordon"], "title": "DRAGNs in the Forest: Identifying Artifacts with Random Forest Models in the VLASS DRAGNs Catalog", "comment": "23 pages, 14 figures", "summary": "The Quick Look data products from the Very Large Array Sky Survey (VLASS) contain widespread imaging artifacts arising from the simplified imaging algorithm used in their production. The catalog of double radio sources associated with active galactic nuclei (DRAGNs) found in the VLASS first epoch Quick Look release using the DRAGNhunter algorithm suffers from contamination from these artifacts. These sources contain two or three individual components, each of which can be an artifact. We train random forest models to classify these DRAGNs based on the number of artifacts they contain, ranging from zero to three artifacts. We optimize our models and mitigate the class imbalance of our dataset with judicious training set selection, and the best of our models achieves a weighted F1 score of $97.01\\%^{+1.12\\%}_{-1.32\\%}$. Using our classifications, we produce a catalog of VLASS DRAGNs from which an estimated 99.3% complete catalog of 97.7% artifact-free sources can be extracted."}
{"id": "2512.20993", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2512.20993", "abs": "https://arxiv.org/abs/2512.20993", "authors": ["Kanta Fujiwara", "Yoshihiro Ueda", "Shoji Ogawa", "Yuya Nakatani", "Ryosuke Uematsu"], "title": "IMPACTX: An X-ray Spectral Model for Polar Dust and Clumpy Torus", "comment": null, "summary": "We construct a generic X-ray spectral model for the reflection component from the clumpy torus and dusty gas in the polar region (polar dusty gas) in an active galactic nucleus (AGN), designated as Inclusive spectral energy distribution Model of Polar dust And Clumpy Torus for X-ray (IMPACTX). To calculate the spectra, we utilize the Monte-Carlo based, 3-dimensional radiative transfer code SKIRT. The adopted geometry is the same as that of the IMPACT model (Ogawa et al. in prep.), consisting of a clumpy torus defined by Nenkova et al. (2008) and paraboloid-shell polar dusty gas launched at the inner radius of the torus. We discuss the dependence of the X-ray spectrum on geometrical parameters in comparison with the conventional torus-only model (XCLUMPY). As an example, we have simultaneously applied the IMPACTX and IMPACT models to the X-ray and infrared spectra of the nearby Seyfert 2 galaxy NGC 4388, and have found a solution that can well reproduce both spectra. This demonstrates the importance of using both X-ray and infrared data to constrain the nuclear structure of an AGN."}
{"id": "2512.21292", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2512.21292", "abs": "https://arxiv.org/abs/2512.21292", "authors": ["Joyful E. Mdhluli"], "title": "The Office of Astronomy for Development Impact Cycle", "comment": "8 pages, 1 figure", "summary": "The Office of Astronomy for Development (OAD) believes that in order for astronomy-for-development activities to be effective, a scientific approach is required. Evaluation is an essential component in identifying which projects work best, for whom and under what conditions. Evidence-informed project design and selection ensures that projects build on past lessons, thereby reducing the risk of negative unintended consequences and increasing the probabilities of positive cost-effective impact. The OAD has developed an Impact Cycle that aims to enhance project design, selection and delivery systems to support such continual improvement and potential expansion. By determining what works - and, importantly, what doesn't work - the OAD can build a library of evidence on best practice and ensure a positive feedback loop for future projects."}
{"id": "2512.21139", "categories": ["astro-ph.HE", "hep-ph"], "pdf": "https://arxiv.org/pdf/2512.21139", "abs": "https://arxiv.org/abs/2512.21139", "authors": ["Vaibhav Sharma", "Ranjeev Misra", "J S Yadav", "Akash Garg", "Pankaj Jain"], "title": "Evolution of the 2021 Outburst of GX 339-4 with AstroSat", "comment": "11 pages, 12 figures, 2 tables, Accepted for publication in MNRAS", "summary": "We present a comprehensive study of the 2021 outburst of GX 339-4 using AstroSat observations in the hard-intermediate (HIMS) and soft-intermediate states (SIMS). Spectral and timing analyses across these states suggest that during the SIMS, unabsorbed flux (0.1-3 keV), inner disc temperature, and \"apparent\" inner disc radius do not change, suggesting the stability of the disc. In the SIMS, the photon index decreases from 2.1 to 1.7, indicating spectral hardening. The power density spectra (PDS) suggest the presence of quasi-periodic oscillations (QPOs) in the HIMS and SIMS. The QPO frequency evolves from 0.1 Hz to 0.2 Hz in the HIMS, and further to 5.7 Hz in the SIMS. We also observe a decrease in QPO frequency from 5.7 Hz to 4.5 Hz during the SIMS. We discuss the evolution of the QPO, fractional root mean square (rms) amplitude, and time-lag spectra. We discover that variations in disc normalization, disc temperature, and coronal heating rate can reproduce the observed rms and lag spectra with a time delay between them."}
{"id": "2512.21216", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.21216", "abs": "https://arxiv.org/abs/2512.21216", "authors": ["Ishika Palit", "Miles Angelo Paloma Sodejana", "Hsiang-Yi Karen Yang"], "title": "Exploring the Role of Vector Potential and Plasma-$β$ in Jet Formation from Magnetized Accretion Flows", "comment": "11 pages, 9 figures", "summary": "In this work, we investigate how the choice of initial vector potential and plasma parameters influences the development of accretion columns and jet formation in magnetized accretion flows. Using general relativistic magnetohydrodynamic simulations, we explore two different configurations of the vector potential $A_φ$ and three plasma beta values $β$ = 50, 100, 500. We analyze how variations in the poloidal magnetic field strength and plasma magnetization affect magnetic flux accumulation near the black hole and the subsequent growth of the accretion column. Our results highlight the dependence of jet launching efficiency and accretion dynamics on the initial magnetic field topology and plasma beta, offering insight into the conditions that favor magnetically arrested disk or standard and normal evolution states."}
{"id": "2512.21230", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.21230", "abs": "https://arxiv.org/abs/2512.21230", "authors": ["Abdurakhmon Nosirov", "Jiachen Jiang", "Cosimo Bambi", "John A. Tomsick"], "title": "Assessing systematic uncertainties from spectral re-analysis of Cyg X-1 with different coronal geometries", "comment": null, "summary": "In this work, we carry out a new spectral reanalysis of NuSTAR and Suzaku observations of the disk reflection spectra in the stellar-mass black hole X-ray binary Cyg~X-1. We compare three types of models: a broken power-law disk emissivity profile with no assumption about the coronal shape used in the previous work of the same observations, a compact lamppost corona, and an extended disk-like corona motivated by recent X-ray polarization results. Our goal is to measure the systematic uncertainties caused by the assumed geometry, with a focus on key parameters such as the black hole spin and the inclination of the inner accretion disk. We find that the disk-like corona gives a fit that is statistically similar to the broken power-law and lamppost models, but it leads to more physically reasonable results, such as a lower inclination angle of about $30^{\\circ}$. By using a variable disk density model, we measure the disk density to be $n_{\\rm e}\\approx10^{20}$\\,cm$^{-3}$, which is similar to earlier results. While the extended corona model infers a wider allowed parameter space for black hole spin and the inner radius of the disk-shaped coronal region, this reflects the additional physical freedom of the model. Even so, the disk-like corona remains a strong and physically well-motivated candidate for explaining the X-ray emission from Cyg~X-1."}
{"id": "2512.21240", "categories": ["astro-ph.HE", "physics.plasm-ph"], "pdf": "https://arxiv.org/pdf/2512.21240", "abs": "https://arxiv.org/abs/2512.21240", "authors": ["Agniva Roychowdhury"], "title": "Minijets and Broken Stationarity in a Blazar : Novel Insights into the Origin of $γ$-ray Variability in CTA 102", "comment": "8 pages, 8 figures. Accepted for publication in The Astrophysical Journal", "summary": "High-energy blazar light curves, in X-rays and beyond, have historically preferred a log-normal flux distribution, signifying multiplicative processes either in the jet itself or due to connection(s) with accretion. Here we present 18 year archival Fermi-LAT light curves (0.1-100 GeV) of the flat spectrum radio quasar (FSRQ) CTA 102 from August 2008 to November 2025, which underwent a huge flare in 2017, with a $\\sim$ factor of 100 jump in $γ$-ray flux, along with similar flaring in X-rays. Our statistical analyses confirm that neither the pre nor the post-flare total GeV light curves follow a strictly log-normal distribution. Instead, we observe a statistically significant reduction in skewness from the pre to the post-flare light curves, which implies the blazar transitioned from an energetic state with frequent flaring to a more plateaued state with occasional flaring. We further find that this state transition can be explained through magnetic relaxation, where many reconnection events caused the 2017 flare, after which the magnetic field was ordered and its energy reached a minimum. To explain this further, we use a Monte Carlo simulation of a modified minijets-in-a-jet model where GeV flares are produced only when a maximum number of minijets move toward the broad line region and towards the line of sight, in the context of an external Compton model. The flux distributions (both observed and simulated) could be fit by a modified log-normal power-law distribution, implying our minijets model can reproduce the GeV flares in CTA 102 as well as their flux distributions."}
{"id": "2512.21256", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2512.21256", "abs": "https://arxiv.org/abs/2512.21256", "authors": ["Alaa Alburai", "Lluís Galbany", "Umut Burgaz", "Georgios Dimitriadis", "Joel Johansson", "Mat Smith", "Ramon Sanfeliu", "Sandra Guerra", "Tomás Müller-Bravo", "Ariel Goobar", "Suhail Dhawan", "Young-Lo Kim", "Jakob Nordin", "Alice Townsend", "Jesper Sollerman", "Madeleine Ginolin", "Mickael Rigault", "Jacco H. Terwel", "Roger Smith", "Avery Wold", "Tracy X. Chen", "Theophile Jegou du Laz"], "title": "ZTF SN Ia DR2 follow-up: Characterization of subluminous Type Ia supernovae in the ZTF DR2 full sample", "comment": null, "summary": "The Zwicky Transient Facility Data Release 2 (ZTF DR2) includes a total of 3,628 Type Ia supernovae (SNe~Ia), providing the largest and most complete sample of spectroscopically confirmed SNe~Ia at low redshift to date. In this paper, we present a photometric and spectroscopic analysis of 124 subluminous SNe~Ia, the largest sample of spectroscopically classified subluminous SNe~Ia observed with a single instrument, comprising 87 91bg-like, 12 86G-like, 18 04gs-like, and 7 02es-like events. We complement the published DR2 SALT2 light-curve parameters with new parameters obtained using template-based fits from SNooPy. Expansion velocities and pseudo-equivalent widths pEW of key spectral features are measured using Spextractor, and spectral averages are constructed for each subluminous subtype, binned by phase. We also analyze the host galaxy environments, both global and local, in terms of $g - z$ color, stellar mass, and directional light radius $d_{DLR}$. We find that all subluminous SNe~Ia (except the 02es-like subtype) are intrinsically red. This is evident by separating extrinsic from intrinsic color components. Since SALT2 is not trained on subluminous SNe~Ia, it compensates for their redder colors by inflating the $c$ parameter, thus extending the luminosity-width relation to negative values of x1. As expected, all subluminous SNe~Ia fall within the Cool region of the Branch et al. (2006) diagram, with the exception of 02es-like events, which show lower Si II 5972 pEW values. All subluminous subtypes tend to occur in more massive, redder host galaxies, and in the reddest local environments. Notably, 91bg- and 86G-like SNe~Ia explode at significantly larger normalized galactocentric distances. Finally, we identify the $pEW$ of the blended Ti II+Si II+Mg II absorption feature at 4300~A, along with s_BV, as robust and sufficient indicators for subclassifying subluminous SNe~Ia."}
