{"id": "2509.19424", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.19424", "abs": "https://arxiv.org/abs/2509.19424", "authors": ["Sophia C. Schnauck", "Swapnil Shankar", "Philipp Mösta", "Roland Haas", "Erik Schnetter"], "title": "Gravitational waves from magnetorotational core-collapse supernovae using 3D GRMHD simulations: effect of rotation and magnetic fields", "comment": null, "summary": "We investigate the gravitational wave emission for 10 supernova progenitors\nfrom magnetorotational core-collapse to the supernova explosion using fully\nthree-dimensional dynamical-spacetime general-relativistic magnetohydrodynamics\nsimulations with the GPU-accelerated code $\\texttt{GRaM-X}$. We consider 2\nprogenitors of zero-age-main-sequence mass $25M_\\odot$ and 8 with\nzero-age-main-sequence masses of $35M_\\odot$. For these models, we explore a\nrange of rotation rates between $0.0$ and $3.5 \\mathrm{rad}\\, \\mathrm{s}^{-1}$,\nalong with initial seed magnetic field of either $10^{12}\\mathrm{G}$ or\n$10^{13}\\mathrm{G}$. The analysis of the 10 models presented provides a\ncomprehensive and systematic initial investigation of the interplay between\nprogenitor rotation, magnetic field strength, and progenitor structure in\nshaping the explosion dynamics and gravitational wave (GW) emission. We find\nthat stronger seed magnetic fields ($10^{13}\\mathrm{G}$) suppress the GW strain\namplitude relative to models with weaker initial fields ($10^{12}\\mathrm{G}$).\nIncreasing the initial rotation rate results in a more dynamical explosion,\nyielding correspondingly stronger gravitational waves. In addition, the\nprogenitor mass/composition also exhibit a significant impact on the explosion\ndynamics and the morphology of the resulting waveforms. Finally, we find that\nall of our models lie above the detectability threshold for 3rd generation\ndetectors aLIGO, Einstein Telescope, and Cosmic explorer at a $10\\mathrm{kpc}$\ndistance and most would even still be detectable at $10\\mathrm{Mpc}$, opening\nthe possibility for observing gravitational wave emission for CCSNe beyond our\ngalaxy."}
{"id": "2509.19446", "categories": ["astro-ph.HE", "hep-ex", "quant-ph"], "pdf": "https://arxiv.org/pdf/2509.19446", "abs": "https://arxiv.org/abs/2509.19446", "authors": ["Rachael E. Stewart", "Hoa Dinh Thi", "George Younes", "Marcus E. Lower", "Matthew G. Baring", "Michela Negro", "Fernando Camilo", "Joel B. Coley", "Alice K. Harding", "Wynn C. G. Ho", "Chin-Ping Hu", "Philip Kaaret", "Paul Scholz", "Alex Van Kooten", "Zorawar Wadiasingh"], "title": "Vacuum birefringence in the polarized X-ray emission of a radio magnetar", "comment": "submitted; comments welcome", "summary": "The quantum electrodynamics (QED) theory predicts that the quantum vacuum\nbecomes birefringent in the presence of ultra-strong magnetic fields -- a\nfundamental effect yet to be directly observed. Magnetars, isolated neutron\nstars with surface fields exceeding $10^{14}$~G, provide unique astrophysical\nlaboratories to probe this elusive prediction. Here, we report phase- and\nenergy-resolved X-ray polarization measurements of the radio-emitting magnetar\n1E 1547.0-5408 obtained with the Imaging X-ray Polarimetry Explorer (IXPE), in\ncoordination with the Neutron Star Interior Composition Explorer (NICER) and\nParkes/Murriyang radio observations. We detect a high phase-averaged\npolarization degree of 65% at 2 keV, where the surface thermal emission is\ndominant, rising to nearly 80% at certain rotational phases, and remaining at\n$\\gtrsim40\\%$ throughout the radio beam crossing. We also observe a strong\ndecrease in polarization from 2~keV to 4~keV. Detailed atmospheric radiative\ntransfer modeling, coupled with geometrical constraints from radio\npolarization, demonstrate that the observed polarization behavior cannot be\nconsistently explained without invoking magnetospheric vacuum birefringence\n(VB) influences. These observational findings combined with the theoretical\nresults represent compelling evidence for naturally occurring quantum VB. This\nwork marks a significant advance toward confirming this hallmark prediction of\nQED and lays the foundation for future tests of strong-field quantum physics\nusing next-generation X-ray polarimeters."}
{"id": "2509.19449", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2509.19449", "abs": "https://arxiv.org/abs/2509.19449", "authors": ["Annie Heinrich", "Congyao Zhang", "Irina Zhuravleva", "Eugene Churazov", "Hannah McCall", "Reinout J. van Weeren", "William R. Forman"], "title": "A Yin-Yang Galaxy Cluster Merger in Abell 1914 Revealed by XRISM", "comment": "13 pages, 5 figures. Submitted to ApJL", "summary": "Hierarchical mergers of galaxy clusters play a key role in converting\ngravitational energy into thermal and kinetic energy in the local universe.\nUnderstanding this process requires the reconstruction of cluster merger\ngeometry, with careful consideration of projection effects. With its\nunprecedented spectral resolution, XRISM enables the disentanglement of merging\ncluster components along the line-of-sight via X-rays for the first time. In\nthis letter, we focus on the massive cluster A1914, a puzzling case wherein the\ngalaxy and dark matter distribution appear to be in tension with the X-ray\nmorphology. We present XRISM observations of A1914 focusing on the velocity\nstructure of the intracluster medium (ICM). The Resolve full-array spectrum\nrequires two merging components along the line-of-sight, with bulk velocities\noffset by $\\sim$1000 km/s and velocity dispersions of $\\sim$200 km/s. The\nsub-array maps of flux ratios, bulk velocity, and velocity dispersion show the\ntwo components are offset and overlapping in the plane of the sky, consistent\nwith a major (mass ratio $\\sim$3), near line-of-sight merger with a pericenter\ndistance of $\\sim$200 kpc. We conclude that the two subclusters create an\noverlapping spiral pattern, referred to as a ''yin-yang'' merger. This scenario\nis further supported by tailored hydrodynamical simulations of the A1914\nmerger, demonstrating that this type of merger can broadly reproduce the\nobserved X-ray morphology, gas temperature map, gas velocity maps, dark matter\ndistribution, and galaxy velocities. This work demonstrates the power of\nhigh-resolution X-ray spectroscopy, provided by XRISM, to resolve complex\ncluster merger geometries."}
{"id": "2509.19458", "categories": ["astro-ph.HE", "hep-th"], "pdf": "https://arxiv.org/pdf/2509.19458", "abs": "https://arxiv.org/abs/2509.19458", "authors": ["Athithya Aravinthan", "Julien Dörner", "Julia Becker Tjus", "Aritra Basu", "Dominik Bomans", "Samata Das", "Sam Taziaux", "Dominik Elsässer", "Riccardo Catena"], "title": "Modeling of Dark Matter Prompt and Secondary Signatures in Dwarf Galaxies", "comment": "9 pages, 3 figures, The Astroparticle Physics Conference ICRC 2025", "summary": "Dwarf Spheroidal (dSph) galaxies are very promising laboratories for the\nindirect search for dark matter (DM), due to their low astrophysical background\nin radio and gamma-ray frequencies. This is convenient when considering Weakly\nInteracting Dark Matter (WIMP) that can annihilate and produce radio continuum\nemission. Radio detections of dSph galaxies, however, prove to be difficult and\nmotivate the consideration of transient galaxies that have just recently become\nquiescent.\n  For the past several decades, the prompt emission from DM annihilation\nsignatures has been explored through modeling and the setting of limits. In\naddition to the prompt annihilation signatures from neutrinos, gamma-rays,\nelectrons, positrons, and antimatter, the secondary emission from charged\nannihilation products undergoing radiative loss processes also contributes to\nthe picture. For instance, synchrotron radiation and inverse Compton scattering\nof charged products such as electrons and positrons can provide a significant\nsignal. The quantitative modeling of this secondary emission with the\nastrophysical background is necessary to place stringent constraints on the\nnature of DM.\n  In this work, the multi-wavelength secondary spectrum of DM annihilation for\na dwarf galaxy is calculated using the open-source code CRPropa 3.2, which\nenables the self-consistent treatment of the astrophysical background and\nsecondary emissions. We present a systematic comparison of signatures from\nconventional astrophysical processes to those expected from DM annihilation.\nThe morphological differences between the two scenarios are investigated. Tests\nof the impact of different magnetic fields, DM masses, and DM profiles will be\nperformed in the next steps."}
{"id": "2509.19443", "categories": ["astro-ph.IM", "astro-ph.GA", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2509.19443", "abs": "https://arxiv.org/abs/2509.19443", "authors": ["J. E. Martínez Fernández", "S. Özdemir", "R. Smiljanic", "M. L. L. Dantas", "A. R. da Silva"], "title": "Playing CHESS with stars. I. Search for similar stars in large spectroscopic data sets", "comment": null, "summary": "Context: Massive amounts of spectroscopic data obtained by stellar surveys\nare feeding an ongoing revolution in our knowledge of stellar and Galactic\nastrophysics. Analysing these data sets to extract the best possible\nastrophysical parameters on short time scales represents a considerable\nchallenge. Aims: The differential analysis method is known to return the most\nprecise results in the spectroscopic analyses of F-, G-, and K-type stars.\nHowever, it can only be applied to stars with similar parameters. Our goal is\nto present a procedure that significantly simplifies the identification of\nspectra from stars with similar atmospheric parameters within extensive\nspectral datasets. This approach allows for the quick application of\ndifferential analyses in these samples, thus enhancing the precision of the\nresults. Methods: We used projection maps created by the t-SNE dimensionality\nreduction algorithm applied directly to the spectra using pixels as dimensions.\nFor testing the method, we used more than 7300 high-resolution UVES spectra of\nabout 3000 stars in the field-of-view towards open and globular clusters. As\nreference, we used 1244 spectra of 274 stars with well-determined and\nhigh-quality atmospheric parameters. Results: We calibrated a spectral\nsimilarity metric that can identify stars in a t-SNE projection map with\nparameters that differ by $\\pm$ 200 K, $\\pm$ 0.3 dex, and $\\pm$ 0.2 dex in\neffective temperatures, surface gravities, and metallicities, respectively. We\nachieved completeness between 74-98 % and typical purity between 39-54 % in\nthis selection. With this, we will drastically facilitate the detection of\nstars with similar spectra for a successful differential analysis. We used this\nmethod to evaluate the accuracy and precision of four atmospheric parameter\ncatalogues, identifying the regions of the parameter space where spectral\nanalysis methods needs improvement."}
{"id": "2509.19466", "categories": ["astro-ph.HE", "gr-qc"], "pdf": "https://arxiv.org/pdf/2509.19466", "abs": "https://arxiv.org/abs/2509.19466", "authors": ["Rodrigo Tenorio", "Alexandre Toubiana", "Tristan Bruel", "Davide Gerosa", "Jonathan R. Gair"], "title": "Where did heavy binaries go? Gravitational-wave populations using Delaunay triangulation with optimized complexity", "comment": "9 pages, 4 figures", "summary": "We investigate the joint mass-redshift evolution of the binary black hole\nmerger rate in the latest gravitational-wave detection catalog, GWTC-4.0. We\npresent and apply a novel non-parametric framework for modeling\nmulti-dimensional, correlated distributions based on Delaunay triangulation.\nCrucially, the complexity of the model -- namely, the number, positions, and\nweights of triangulation nodes -- is inferred directly from the data, resulting\nin a highly efficient approach that requires about one to two orders of\nmagnitude fewer parameters and significantly less calibration than current\nstate-of-the-art methods. We find no evidence for a peak at $M_{\\mathrm{tot}}\n\\sim 70\\,\\mathrm{M}_{\\odot}$ at low redshift ($z \\sim 0.2$), where it would\ncorrespond to the $m_1 \\sim 35\\,\\mathrm{M}_{\\odot}$ feature reported in\nredshift-independent mass spectrum analyses, and we infer an increased merger\nrate at high redshift $(z \\sim 1)$ around those masses, compatible with such a\npeak. We discuss the astrophysical implications of these results."}
{"id": "2509.19453", "categories": ["astro-ph.IM", "cs.LG"], "pdf": "https://arxiv.org/pdf/2509.19453", "abs": "https://arxiv.org/abs/2509.19453", "authors": ["UniverseTBD", ":", "Kshitij Duraphe", "Michael J. Smith", "Shashwat Sourav", "John F. Wu"], "title": "The Platonic Universe: Do Foundation Models See the Same Sky?", "comment": "9 pages, 3 tables, 1 figure. Accepted as a workshop paper to Machine\n  Learning and the Physical Sciences at NeurIPS 2025", "summary": "We test the Platonic Representation Hypothesis (PRH) in astronomy by\nmeasuring representational convergence across a range of foundation models\ntrained on different data types. Using spectroscopic and imaging observations\nfrom JWST, HSC, Legacy Survey, and DESI, we compare representations from vision\ntransformers, self-supervised models, and astronomy-specific architectures via\nmutual $k$-nearest neighbour analysis. We observe consistent scaling:\nrepresentational alignment generally increases with model capacity across our\ntested architectures, supporting convergence toward a shared representation of\ngalaxy astrophysics. Our results suggest that astronomical foundation models\ncan use pre-trained general-purpose architectures, allowing us to capitalise on\nthe broader machine learning community's already-spent computational\ninvestment."}
{"id": "2509.19546", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.19546", "abs": "https://arxiv.org/abs/2509.19546", "authors": ["Shahzada Akhter", "Sajad Boked", "Bari Maqbool", "Ranjeev Misra", "V. Jithesh"], "title": "Probing the Origin of X-ray Flares in the Low-Hard State of GRS 1915+105 Using AstroSat and NuSTAR", "comment": "Accepted for publication in The Astrophysical Journal (ApJ). 24\n  pages, 21 figures", "summary": "We performed a detailed time-resolved spectral study of GRS 1915+105 during\nits low-flux rebrightening phase using the broadband capabilities of AstroSat\nand NuSTAR in May-June 2019. The AstroSat light curves revealed erratic X-ray\nflares with count rates rising by a factor of $\\sim$5. Flares with simultaneous\nLAXPC and SXT coverage were segmented and fitted using two degenerate but\nphysically motivated spectral models: a reflection-dominated model (hereafter\nModel A) and an absorption-dominated model (hereafter Model B). In Model A, the\ninner disk radius $(R_{in})$ shows a broken power-law dependence on flux,\nindicating rapid inward motion of the disk at higher flux levels. In contrast,\nModel B shows variable column density in the range of $10^{23}$ to $10^{24}$\ncm$^{-2}$, displaying a strong anti-correlation with flux. Both models exhibit\nsignificant variation in the ionization parameter between low- and high-flux\nsegments. The total unabsorbed luminosity in the 0.7--30~keV energy range\nranged from $6.64 \\times 10^{36}$ to $6.33 \\times 10^{38}$~erg~s$^{-1}$. Across\nboth models, several spectral parameters exhibited step-function-like behavior\naround flux thresholds of $5$--$10 \\times 10^{-9}$ erg cm$^{-2}$ s$^{-1}$,\nindicating multiple spectral regimes. The disc flux contribution, more evident\nin Model B, increased with total flux, supporting an intrinsic origin for the\nvariability. These findings point to a complex interplay between intrinsic disk\nemission, structured winds, and variable local absorption in driving the flare\nactivity."}
{"id": "2509.19751", "categories": ["astro-ph.IM", "astro-ph.CO"], "pdf": "https://arxiv.org/pdf/2509.19751", "abs": "https://arxiv.org/abs/2509.19751", "authors": ["E. Jong", "C. Trott", "C. D. Nunhokee", "Q. Zheng"], "title": "Determining Ideal Fields for Epoch of Reionisation Science Using the 21 cm Line", "comment": null, "summary": "The upcoming Square Kilometre Array Low Frequency (SKA-Low) interferometer\nwill have the required sensitivity to detect the 21 cm line from neutral\nhydrogen during the Epoch of Reionisation (EoR). In preparation, we\ninvestigated the suitability of different fields for EoR science with the 21~cm\nline, using existing observations of candidate fields from the Murchison\nWidefield Array (MWA). Various image and calibration metrics were extracted\nfrom archival MWA observations centred on $z \\sim 6.8$. We explore the\nusefulness of these metrics and compare their behaviour between different\nfields of interest. In addition, a theoretical approach to quantifying the\nimpact of different fields on the power spectrum is also provided. Gain\nuncertainties were calculated based on the positions of the calibrators within\nthe beam. These uncertainties were then propagated into visibilities to produce\ncylindrical power spectra for various fields. Using these metrics in\ncombination with the power spectra, we confirm that EoR0 ($\\text{R.A.} =\n0^\\circ$, $\\text{Dec} = -27.0^\\circ$) is an ideal EoR field and discuss the\ninteresting behaviour of other fields."}
{"id": "2509.19799", "categories": ["astro-ph.HE", "gr-qc"], "pdf": "https://arxiv.org/pdf/2509.19799", "abs": "https://arxiv.org/abs/2509.19799", "authors": ["Luciano Combi", "Daniel M. Siegel", "Brian D. Metzger"], "title": "Jet-driven explosion of an accretion-induced white-dwarf collapse via a magnetorotational dynamo", "comment": "5+5 pages, 9 figures", "summary": "The accretion-induced collapse (AIC) of a rotating white dwarf (WD) offers a\npotential site of millisecond pulsars/magnetars, gamma-ray bursts, and\nr-process nucleosynthesis. We present three-dimensional general-relativistic\nmagneto-hydrodynamical simulations including neutrinos of magnetorotational\nAIC, assuming the WD is rapidly spinning with a weak magnetic field confined\nbelow its surface (likely a prerequisite for rapid rotation). Within\nmilliseconds after core bounce, the magnetic field is exponentially amplified\nnear the surface of the proto-neutron star (PNS). We witness the emergence of a\nsmall-scale turbulent and mean-field, large-scale MRI-driven dynamo in the\nneutrino-cooled centrifugally supported disk formed around the PNS, which\ngenerates bundles of large-scale toroidal field with alternating polarity. The\namplified field becomes buoyant and is advected above the PNS, generating a\nmagnetic tower that drives a mildly relativistic striped jet. The jet breaks\nout of the WD, clearing the way for a powerful magnetized neutron-rich wind\nfrom the disk. Although our simulation cannot follow the long-term\nKelvin-Helmholtz cooling phase of the PNS, the conditions are ripe for the\nformation of a GRB powered by magnetar spin-down. A similar dynamo may operate\nin magnetorotational core-collapse supernovae and neutron-star mergers."}
{"id": "2509.19758", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.19758", "abs": "https://arxiv.org/abs/2509.19758", "authors": ["Phanindra Kandula", "Lee Kelvin", "Erfan Nourbakhsh", "Daniel Polin", "Tom Prince", "Meredith Rawls", "Adam Snyder", "Brianna Smart", "Christopher Stubbs", "Anthony Tyson", "Zeljko Ivezic", "Craig Lage", "Clare Saunders"], "title": "Report on LEO satellite impacts on ground-based optical astronomy for the Rubin Observatory LSST", "comment": "33 pages, 17 figures", "summary": "In August 2025 a workshop was convened to bring together experts to better\nunderstand steps that can be taken to mitigate the impact of satellite\nconstellations on astronomical observations. At the time, just over 12,000\noperational satellites were in low-Earth orbit (LEO). Although reflected\nsunlight and emissions all across the electromagnetic spectrum from artificial\nsatellites impact scientific observations and the sky, the workshop focused on\nreflected sunlight in the wavelength range 330 nm to 1100 nm. This aligns with\nthe Vera C. Rubin Observatory Legacy Survey of Space and Time (LSST) planned\nimaging observations over the coming decade. Among other conclusions, we affirm\nprevious recommendations that tracked satellite apparent magnitudes should be\nno brighter than 7th AB mag. The workshop participants discussed over 30\npublications, reports, and presentations, and arrived at the Findings and\nRecommendations presented here. During the workshop, in addition to affirming\nmany existing recommendations and best practices, the group discovered new\nissues and devised possible mitigations. These were nearly equally divided\nbetween advice to satellite builders and operators and to the observational\nastronomy community. While the workshop prioritized considerations for LSST,\nour hope is that many of the Findings and Recommendations will also apply to\nother observatories and constellations, and that all satellite companies will\ncontinue to engage in dialog with sky observers across the globe."}
{"id": "2509.19934", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.19934", "abs": "https://arxiv.org/abs/2509.19934", "authors": ["Sanjit Debnath", "Indranil Chattopadhyay", "Raj Kishor Joshi", "Philippe Laurent", "Priyesh Kumar Tripathi", "M. Saleem Khan"], "title": "Dynamical properties of oscillating, viscous, transonic accretion disks around black holes", "comment": "Accepted for publication in ApJ, 15 pages, 9 figures", "summary": "We investigate the time evolution of sub-Keplerian transonic accretion flow\nonto a non-rotating black hole using axisymmetric viscous hydrodynamic\nsimulations. We simulate the accretion flow using boundary values from\nsemi-analytical analysis and set up three different models. Two of the models\ndo not predict accretion shocks from the semi-analytic analysis, while one of\nthem does. We also consider radiative cooling along with viscosity in the\nsimulation. Our two-dimensional simulation deviated from the one-dimensional\nsemi-analytical solution and admitted shocks in all three models. Viscous\ndissipation tends to push the shock front outward, and radiative cooling will\npush it in. Additionally, gravity is attractive. Depending on the competing\nstrengths of all three processes, it may trigger shock oscillation. Different\nrates of angular-momentum transport in various layers may trigger eddies, which\nwill enhance the shock oscillation. We show that any simple power law cannot\napproximate these solutions. We find that hot and higher angular-momentum flow\nrequires higher viscosity to produce oscillatory shocks. From the temporal\nvariation of the luminosity, shock oscillations generate QPOs in the range of\nsub-Hertz to a few Hertz frequencies if a ten solar mass black hole is assumed."}
{"id": "2509.19984", "categories": ["astro-ph.IM", "hep-ph"], "pdf": "https://arxiv.org/pdf/2509.19984", "abs": "https://arxiv.org/abs/2509.19984", "authors": ["Bjarni Pont"], "title": "First Data of the 3000 km$^2$ Radio Detector at the Pierre Auger Observatory", "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC\n  2025). 8 pages, 7 figures", "summary": "In this contribution, we present the status and first data from the Radio\nDetector (RD) at the Pierre Auger Observatory, consisting of $1660$ radio\nantennas deployed across the $3000$ km$^2$ surface detector array. These\nantennas measure the radio emission from extensive air showers in the $30-80$\nMHz band, enabling electromagnetic energy measurements for air showers with\nzenith angles above $65\\deg$. Combined with the muonic measurements from the\nwater-Cherenkov detectors (WCDs), this allows mass composition studies at the\nhighest energies. The large-scale deployment of the RD began in November 2023\nand was completed in November 2024. A full end-to-end calibration shows\nconsistency between Galactic and in-lab calibration to better than $5$\\% and\nincludes continuous monitoring for hardware failures, ensuring, for example,\nantenna alignment within $5\\deg$. We present the first data, demonstrating a\nstrong correlation between the electromagnetic energy measured by the RD and\nthe total shower energy measured by the WCD, confirming that the detector chain\n- including triggering, data readout, absolute calibration, and reconstruction\nis well understood. We highlight a particularly impressive $32$ EeV shower at a\nzenith angle of $85\\deg$, producing a $50$ km-long radio footprint, showcasing\nthe unique capabilities of this detector."}
{"id": "2509.19981", "categories": ["astro-ph.HE", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2509.19981", "abs": "https://arxiv.org/abs/2509.19981", "authors": ["Konstantin Postnov", "Ivan Shaposhnikov", "Anatol Cherepashchuk"], "title": "Empirical correlation between masses of black holes and Wolf-Rayet stars derived from their mass distributions in spectroscopic binaries", "comment": "5 pages, 1 figure. Accepted for publication in MNRAS Letters", "summary": "We present observationally determined mass distributions of Wolf-Rayet (WR)\nstars in WR+OB binaries and black holes (BH) in spectroscopic binaries. Both WR\nand BH mass probability distributions can be well approximated by unbiased\nlog-normal functions. Assuming that all WR stars with $M_\\mathrm{WR}\\gtrsim 6\nM_\\odot$ after core collapse are progenitors of the BHs, the similar shape of\ntheir mass distributions before and after collapse suggests a power-law\nrelation between them $M_{\\mathrm{BH}} \\simeq (0.39\\pm0.09)\n{M_{\\mathrm{WR}}}^{1.13\\pm0.09}$. Using the relation between masses of a WR\nstar and its CO-core, we obtain the empirical relation between the BH mass and\nCO-core of the collapsing WR star $M_\\mathrm{BH}\\sim 0.9 M_\\mathrm{CO}$, which\ncan be used in the population synthesis calculations."}
{"id": "2509.20285", "categories": ["astro-ph.IM", "astro-ph.CO"], "pdf": "https://arxiv.org/pdf/2509.20285", "abs": "https://arxiv.org/abs/2509.20285", "authors": ["Yonggil Jo", "Alessandro Fasano", "Eunil Won", "Makoto Hattori", "Shunsuke Honda", "Chiko Otani", "Junya Suzuki", "Mike Peel", "Kenichi Karatsu", "Ricardo Génova-Santos", "Miku Tsujii"], "title": "GroundBIRD Telescope: Systematics Modelization of MKID Arrays Response", "comment": "6 pages, 8 figures, proceeding paper to the 2025 LTD Conference", "summary": "Kinetic inductance detectors are widely used in millimeter- and\nsubmillimeter-wave astronomy, benefiting from their fast response and relative\nease of fabrication. The GroundBIRD telescope employs microwave kinetic\ninductance detectors at 145 and 220 GHz to observe the cosmic microwave\nbackground. As a ground-based telescope, it is subject to inherent\nenvironmental systematics, namely atmospheric emission and thermal fluctuations\nof the focal plane temperature. This study models resonance frequency shifts\ninduced by each source using calibrated on-site measurements of precipitable\nwater vapor and temperature. Comparison with observational data confirms the\nvalidity of the models and identifies atmospheric loading as the dominant\ncontributor to frequency variation under typical observation conditions."}
{"id": "2509.20131", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.20131", "abs": "https://arxiv.org/abs/2509.20131", "authors": ["J. Holder", "Qiqi Jiang"], "title": "A Search for High-Energy Emission from the Remnant of Supernova 1181", "comment": "Presented at the 39th International Cosmic Ray Conference, Geneva,\n  2025", "summary": "Over the previous millennium, only five Galactic supernovae were observed and\nrecorded by contemporary astronomers, and their current-day counterparts\nsubsequently identified. The remnants of four of these have all been very\ndeeply studied, and ultimately detected, by TeV instruments after exposures of\ntypically hundreds of hours. The measured TeV fluxes range from 1 Crab (by\ndefinition) down to 0.3% Crab. The location of the fifth supernova remnant tied\nto a historical record of its supernova (SN 1181) has never been studied at TeV\nenergies. The reason for this is simple - the associated remnant was only\nidentified as such in 2021. The remnant, Pa 30, is an unusual object whose\nproperties are best explained as resulting from a Type Iax supernova explosion.\nThese are a rare sub-type of Type Ia supernovae in which the merging white\ndwarfs are not fully destroyed by the supernova explosion, leading to a\ndouble-degenerate merger product colorfully described as a 'zombie star'. We\nwill present the results of a search for TeV gamma-ray emission from Pa 30 with\nVERITAS."}
{"id": "2509.20310", "categories": ["astro-ph.IM", "astro-ph.EP", "cs.LG"], "pdf": "https://arxiv.org/pdf/2509.20310", "abs": "https://arxiv.org/abs/2509.20310", "authors": ["Théo Bodrito", "Olivier Flasseur", "Julien Mairal", "Jean Ponce", "Maud Langlois", "Anne-Marie Lagrange"], "title": "Deep learning for exoplanet detection and characterization by direct imaging at high contrast", "comment": "SF2A 2025", "summary": "Exoplanet imaging is a major challenge in astrophysics due to the need for\nhigh angular resolution and high contrast. We present a multi-scale statistical\nmodel for the nuisance component corrupting multivariate image series at high\ncontrast. Integrated into a learnable architecture, it leverages the physics of\nthe problem and enables the fusion of multiple observations of the same star in\na way that is optimal in terms of detection signal-to-noise ratio. Applied to\ndata from the VLT/SPHERE instrument, the method significantly improves the\ndetection sensitivity and the accuracy of astrometric and photometric\nestimation."}
{"id": "2509.20143", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2509.20143", "abs": "https://arxiv.org/abs/2509.20143", "authors": ["Keqin Zhao", "Jelle S. Kaastra", "Liyi Gu"], "title": "Density constraint of the warm absorber in NGC 5548", "comment": null, "summary": "Context. Ionized outflows in active galactic nuclei (AGNs) are thought to\ninfluence the evolution of their host galaxies and super-massive black holes\n(SMBHs). Distance is important to understand the kinetic power of the outflows\nas a cosmic feedback channel. However, the distance of the outflows with\nrespect to the central engine is poorly constrained. The density of the\noutflows is an essential parameter for estimating the distance of the outflows.\nNGC 5548 exhibits a variety of spectroscopic features in its archival spectra,\nwhich can be used for density analysis. Aims. We aim to use the variability of\nthe absorption lines from the archival spectra to obtain a density constraint\nand then estimate the distance of the outflows. Methods. We used the archival\nobservations of NGC 5548 taken with Chandra in January 2002 to search for\nvariations of the absorption lines. Results. We found that the Mg XII\nLy${\\alpha}$ and the O VIII Ly${\\beta}$ absorption lines have significant\nvariation on the 144 ks time scale and the 162 ks time scale during the\ndifferent observation periods. Based on the variability timescales and the\nphysical properties of the variable components that dominated these two\nabsorption lines, we derive a lower limit on the density of the variable warm\nabsorber components in the range of $7.2-9.0{\\times}10^{11} m^{-3}$, and an\nupper limit on their distance from the central source in the range of 0.2-0.5\npc."}
{"id": "2509.20150", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.20150", "abs": "https://arxiv.org/abs/2509.20150", "authors": ["Alberto Bonollo", "Paolo Esposito", "Andrea Giuliani", "Patrizia Caraveo", "Giorgio Galanti", "Silvia Crestan", "Michela Rigoselli", "Sandro Mereghetti"], "title": "Morphology of Young Massive Stellar Clusters with Next-Generation IACTs", "comment": "29 pages, 9 figures, 6 tables. Accepted and to be published on\n  Journal of High Energy Astrophysics", "summary": "The term PeVatron designates astrophysical objects capable of accelerating\nparticles to PeV energies. Their nature and particle acceleration mechanisms\nare uncertain, but ultra-high-energy gamma rays are produced when particles\naccelerated by either leptonic or hadronic PeVatrons interact with the\nsurrounding medium or radiation fields. The atmospheric air shower observatory\nLHAASO detected photons with energies above 100 TeV from 43 sources in the\nGalactic Plane, proving the existence of PeVatrons within the Milky Way. In\nparticular, one of the detections was a 1.4 PeV photon in spatial\ncorrespondence with Cygnus OB2, providing a strong hint that young massive\nstellar clusters (YMSCs) can act as PeVatrons. The next-generation Cherenkov\ntelescopes will have unprecedented energy and angular resolution. Therefore,\nthey will be able to resolve spatially YMSCs better than LHAASO. We focused on\na sample of 5 YMSCs and their environments visible from either hemisphere with\nthe CTAO or ASTRI Mini-Array. We modeled the gamma-ray emission above 1 TeV. We\ndevised methods for classifying YMSCs that could be detected as unidentified\nextended TeV sources and estimated the observational time needed to distinguish\nthe morphology of different classes of sources. We study the morphology of the\nsources in our sample in order to identify the main features. We simulated\nobservations of all sources with the instrument response function (IRF) of CTAO\nor ASTRI Mini-Array. We compare their emission distribution to the one of the\nTeV halos observed by HAWC. We parametrize their radial profiles in order to\ndevelop methodologies to classify them and to distinguish YMSCs from TeV halos\nbased on their morphology. We expect some feature, such as the emission peak,\nto be key in differentiating between the two classes of objects. We then test\nthem on a sample of sources of the first LHAASO catalog."}
{"id": "2509.20180", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.20180", "abs": "https://arxiv.org/abs/2509.20180", "authors": ["Alberto Bonollo", "Paolo Esposito", "Andrea Giulisni", "Silvia Crestan", "Giorgio Galanti", "Sandro Mereghetti", "Michela Rigoselli"], "title": "Classification of Unidentified Extended LHAASO Sources based on their Gamma-Ray Morphology: Prospects for Future IACTs", "comment": "8 pages, 2 figures, 1 table. Presented at the 39th International\n  Cosmic Ray Conference (ICRC 2025), 2025", "summary": "While Supernova Remnants (SNRs) are widely considered the primary\naccelerators of cosmic rays (CRs) up to hundreds of TeV, they struggle to\naccount for the CR flux at PeV energies, suggesting the existence of additional\nPeVatrons. Observations from LHAASO (Large High Altitude Air Shower\nObservatory) have identified several PeVatron candidates, including some SNRs,\npulsar wind nebulae, TeV halos and young massive star clusters (YMSCs). These\nobjects accelerate particles that interact with the surrounding interstellar\nmedium and radiation fields, producing very-high-energy gamma rays (>100 TeV),\na key signature of both leptonic and hadronic PeVatrons. We simulate and model\nthe emission of TeV halos and YMSCs, adopting radial emission profiles derived\nfrom observational data. Given the current angular resolution of gamma-ray\ninstruments, these profiles often appear similar, making it challenging to\ndistinguish between source classes. We explore how next-generation Imaging\nAtmospheric Cherenkov Telescopes (IACTs), namely the CTAO (Cherenkov Telescope\nArray Observatory) and the ASTRI Mini-Array (Astrofisica con Specchi a\nTecnologia Replicante Italiana), can classify these sources based on their\nmorphology. We test our classification methods, derived from the profile\nfeatures of known sources, on simulated CTAO and ASTRI Mini-Array observations\nof unidentified extended sources from the first LHAASO catalog. We present the\nresults of our analysis to highlight the potential of future IACT observations\nin identifying the nature of extended gamma-ray sources, refining PeVatron\ncandidate classifications, and improving our understanding of cosmic-ray\naccelerators."}
