{"id": "2511.19467", "categories": ["astro-ph.IM", "astro-ph.EP", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2511.19467", "abs": "https://arxiv.org/abs/2511.19467", "authors": ["Toni Scarmato"], "title": "Measuring Cometary Nuclei Behind Bright Comae: PSF Delta Decomposition with Bicubic Resampling and an Application to Interstellar Comet 3I/ATLAS C/2025 N1", "comment": "4 pages, 4 figures", "summary": "Measuring cometary nuclei is notoriously difficult because they are usually unresolved and embedded within bright comae, which hampers direct size measurements even with space telescopes. We present a practical, instrumental method that, stabilises the inner core through bicubic resampling, performs forward point-spread function PSF+convolution, and separates the unresolved nucleus from the inner-coma profile via an explicit Dirac Delta function added to a Rho^-1 surface brightness law. The method yields the nucleus flux by fitting an azimuthal averaged profile with two amplitudes only PSF core and convolved coma, with transparent residual diagnostics. As a case study, we apply the workflow to the interstellar comet 3I/ATLAS alias C/2025 N1, incorporating Hubble Space Telescope constraints on the nucleus size. We find that radius solutions consistent with 0.16 <= Rn <= 2.8 km for Pv = 0.04 are naturally recovered, in line with the most recent HST upper limits. The approach is well-suited for survey pipelines Rubin LSST and targeted follow up."}
{"id": "2511.19505", "categories": ["astro-ph.IM", "astro-ph.EP", "eess.SY"], "pdf": "https://arxiv.org/pdf/2511.19505", "abs": "https://arxiv.org/abs/2511.19505", "authors": ["Jack Yarndley"], "title": "Sequential Convex Programming for Multimode Spacecraft Trajectory Optimization", "comment": "12 pages, 5 figures, presented at the ORSNZ Annual Conference 2025", "summary": "Spacecraft equipped with multiple propulsion modes or systems can offer enhanced performance and mission flexibility compared with traditional configurations. Despite these benefits, the trajectory optimization of spacecraft utilizing such configurations remains a complex challenge. This paper presents a sequential convex programming (SCP) approach for the optimal design of multi-mode and multi-propulsion spacecraft trajectories. The method extends the dynamical linearization within SCP using sparse automatic differentiation, enabling efficient inclusion of multiple propulsion modes or systems without complex manual reformulation while maintaining comparable computational efficiency. New constraint formulations are introduced to ensure selection of a single propulsion mode at each time step and limit the total number of modes used. The approach is demonstrated for (i) a low-thrust Earth-67P rendezvous using the SPT-140 thruster with 20 discrete modes, and (ii) an Earth-Mars transfer employing both a low-thrust engine and a solar sail. Results confirm that the proposed method can efficiently compute optimal trajectories for these scenarios."}
{"id": "2511.19594", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2511.19594", "abs": "https://arxiv.org/abs/2511.19594", "authors": ["Connor Stone", "Ronan Legin", "Alexandre Adam", "Nikolay Malkin", "Gabriel Missael Barco", "Laurence Perreaul-Levasseur", "Yashar Hezaveh"], "title": "Pixellated Posterior Sampling of Point Spread Functions in Astronomical Images", "comment": "17 pages, 10 figures", "summary": "We introduce a novel framework for upsampled Point Spread Function (PSF) modeling using pixel-level Bayesian inference. Accurate PSF characterization is critical for precision measurements in many fields including: weak lensing, astrometry, and photometry. Our method defines the posterior distribution of the pixelized PSF model through the combination of an analytic Gaussian likelihood and a highly expressive generative diffusion model prior, trained on a library of HST ePSF templates. Compared to traditional methods (parametric Moffat, ePSF template-based, and regularized likelihood), we demonstrate that our PSF models achieve orders of magnitude higher likelihood and residuals consistent with noise, all while remaining visually realistic. Further, the method applies even for faint and heavily masked point sources, merely producing a broader posterior. By recovering a realistic, pixel-level posterior distribution, our technique enables the first meaningful propagation of detailed PSF morphological uncertainty in downstream analysis. An implementation of our posterior sampling procedure is available on GitHub."}
{"id": "2511.19790", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2511.19790", "abs": "https://arxiv.org/abs/2511.19790", "authors": ["A. Sanny", "L. Labadie", "S. Gross", "K. Barjot", "R. Laugier", "G. Garreau", "M. -A. Martinod", "D. Defrère", "M. J. Withford"], "title": "Asgard/NOTT: L-band nulling interferometry at the VLTI -- III. The mid-infrared integrated optics beam combiner for NOTT", "comment": "Accepted for publication in A&A; 12 pages, 10 figures, 1 table, 2 appendices", "summary": "The NOTT visitor instrument at the VLTI will characterize hot exozodiacal dust and young Jupiter-like planets at the water snowline via L' band nulling interferometry. The beam combination will be achieved by a four-telescope integrated optics beam combiner (IOBC) that fulfills specific requirements. Our goal was to manufacture the mid-infrared IOBC for NOTT based on the double-Bracewell architecture and run a detailed laboratory characterization in the L' band. We focus on the achievable raw and self-calibrated nulling ratios. We use a double Michelson interferometer to produce four broadband coherent beams simulating the four telescopes of the VLTI and perform broadband nulling at room temperature. We analyze the modal, chromatic, and polarization behavior of the IOBC, and measure its total throughput. We were able to manufacture a single-mode four-telescope double-Bracewell IOBC in GLS mid-infrared transparent glass using Ultrafast Laser Inscription. We show that the directional couplers forming the four-telescope IOBC (4T-nuller) have an achromatic splitting ratio across the band 3.65-3.85 um with a 40/60 and 50/50 splitting for the side couplers and the central coupler, respectively. We report a total throughput of 37%, including the Fresnel losses that will be mitigated with anti-reflection coatings, and quantify differential birefringence. Operating at room temperature, with 200 nm bandwidth centered at 3.8 um and without polarization control, we measure an average raw null of 8.13+/-0.03x10-3 and a self-calibrated null of 1.14+/-0.01x10-3. Finally, we show that a theta^6 broad null can be experimentally reproduced in these conditions. This is, to our knowledge, the first measurement of a broadband L' deep null obtained with a four-telescope integrated optics beam combiner. The next step foresees testing the 4T-nuller in cryogenic conditions."}
{"id": "2511.19591", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.19591", "abs": "https://arxiv.org/abs/2511.19591", "authors": ["J. Kurpas", "A. M. Pires", "A. D. Schwope", "B. Li", "D. Yin", "F. Haberl", "M. Krumpe", "S. Sheth", "I. Traulsen", "Z. L. Zhang"], "title": "X-ray, optical, and radio follow-up of five thermally emitting isolated neutron star candidates", "comment": "12 pages, 5 figures, accepted for publication in A&A", "summary": "We report on follow-up observations with XMM-Newton, the FORS2 instrument at the ESO-VLT, and FAST, aiming to characterise the nature of five thermally emitting isolated neutron star (INS) candidates recently discovered from searches in the footprint of the Spectrum Roentgen Gamma (SRG)/eROSITA All-sky Survey. We find that the X-ray spectra are predominantly thermal and can be described by low-absorbed blackbody models with effective temperatures ranging from 50 to 210 eV. In two sources, the spectra also show narrow absorption features at $300 - 400$ eV. Additional non-thermal emission components are not detected in any of the five candidates. The soft X-ray emission, the absence of optical counterparts in four sources, and the consequent large X-ray-to-optical flux ratios $>3000 - 5400$ confirm their INS nature. For the remaining source, eRASSU J144516.0-374428, the available data do not allow a confident exclusion of an active galactic nucleus nature. However, if the source is Galactic, the small inferred X-ray emitting region is reminiscent of a heated pulsar polar cap, possibly pointing to a binary pulsar nature. X-ray timing searches do not detect significant modulations in all candidates, implying pulsed fraction upper limits of 13 - 19% ($0.001-13.5$ Hz). The absence of pulsations in the FAST observations targeting eRASSU J081952.1-131930 and eRASSU J084046.2-115222 excludes periodic magnetospheric emission at 1 - 1.5 GHz with an $8σ$ significance down to 4.08 $μ$Jy and 2.72 $μ$Jy, respectively. The long-term X-ray emission of all sources does not imply significant variability. Additional observations are warranted to establish exact neutron star types. At the same time, the confirmation of the predominantly thermal neutron star nature in four additional sources highlights the power of SRG/eROSITA to complement the Galactic INS population."}
{"id": "2511.19967", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2511.19967", "abs": "https://arxiv.org/abs/2511.19967", "authors": ["Tomokage Yoneyama", "Tsubasa Tamba", "Hirokazu Odaka", "Aya Bamba", "Hiroshi Murakami", "Koji Mori", "Yukikatsu Terada", "Masayoshi Nobukawa", "Tsunefumi mizuno"], "title": "Pile-up simulator for XRISM/Xtend onboard the X-ray Imaging and Spectroscopy Mission (XRISM)", "comment": "17 pages, 6 figures", "summary": "In X-ray astronomy, most observatories utilize multi-pixel photon-counting devices. When a photon counting device observes a bright source, we face an unavoidable problem called pile-up. Pile-up leads to mistakes in the observational properties of the source, mainly an apparent decrease in the X-ray flux. X-Ray Imaging and Spectroscopy Mission (XRISM) has two X-ray telescopes, one of which is Xtend, a CCD camera with a wide field-of-view (FOV) of 38 arcmin square. Xtend has three operating modes: full window mode with a frame exposure of ~4 s, 1/8 window mode with ~0.5s and reduced FOV, and 1/8 window mode with burst option, whose frame exposure is reduced to ~0.06 s. Observers need to select the operating mode according to their target fluxes. We develop the pile-up simulator for Xtend to provide a quantitative assessment of pile-up according to the fluxes, spectra, and shapes of X-ray sources. We derived the 10% pile-up limits for a point source of 7.8, 66.2, and 447.9 counts/s for full window, 1/8 window, and 1/8 window mode with burst option, respectively, by assuming the Crab spectrum. We present further simulations for a diffuse source and monochromatic spectra."}
{"id": "2511.19605", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.19605", "abs": "https://arxiv.org/abs/2511.19605", "authors": ["Chandan Kumar Das", "Bhargav Vaidya", "Amit Shukla", "Giancarlo Mattia", "Karl Mannheim"], "title": "Role of magnetic reconnection in blazar variability using numerical simulation", "comment": "Accepted for publication in ApJ", "summary": "Fast $γ$-ray variability in blazars remains a central puzzle in high-energy astrophysics, challenging standard shock acceleration models. Blazars, a subclass of active galactic nuclei (AGN) with jets pointed close to our line of sight, offer a unique view into jet dynamics. Blazar $γ$-ray light curves exhibit rapid, high-amplitude flares that point to promising alternative dissipation mechanisms such as magnetic reconnection. This study uses three-dimensional relativistic magnetohydrodynamic (RMHD) and resistive relativistic magnetohydrodynamic (ResRMHD) simulations with the PLUTO code to explore magnetic reconnection in turbulent, magnetized plasma columns. Focusing on current-driven kink instabilities, we identify the formation of current sheets due to magnetic reconnection, leading to plasmoid formation. We develop a novel technique combining hierarchical structure analysis and reconnection diagnostics to identify reconnecting current sheets. A statistical analysis of their geometry and orientation reveals a smaller subset that aligns closely with the jet axis, consistent with the jet-in-jet model. These structures can generate relativistically moving plasmoids with significant Doppler boosting, offering a plausible mechanism for the fast flares superimposed on slowly varying blazar light curves. These findings provide new insights into the plasma dynamics of relativistic jets and strengthen the case for magnetic reconnection as a key mechanism in blazar $γ$-ray variability."}
{"id": "2511.20135", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.20135", "abs": "https://arxiv.org/abs/2511.20135", "authors": ["Yuki Amano", "Leo Hirata", "Moto Togawa", "Hiromasa Suzuki", "Hiroyuki A. Sakaue", "Naoki Kimura", "Nobuyuki Nakamura", "Makoto Sawada", "Masaki Oura", "Jonas Danisch", "Joschka Goes", "Marc Botz", "José R. Crespo López-urrutia", "Hiroya Yamaguchi"], "title": "A laboratory plasma experiment for X-ray astronomy using a compact electron beam ion trap (EBIT)", "comment": "8pages, 4 figures, accepted for publication in Plasma and Fusion Research", "summary": "We present the basic performance and experimental results of an electron beam ion trap (JAXA-EBIT), newly introduced to the Japanese astronomical community. Accurate atomic data are indispensable for the reliable interpretation of high-resolution X-ray spectra of astrophysical plasmas. The JAXA-EBIT generates highly charged ions under well-controlled laboratory conditions, providing experimental benchmarks for atomic data. The JAXA-EBIT shows performance comparable to the Heidelberg compact EBIT through dielectronic recombination measurements of highly charged Ar ions. Furthermore, we conducted resonant photoexcitation spectroscopy of highly charged ions using the soft X-ray beamline BL17SU at the synchrotron radiation facility SPring-8. As a result, we successfully detected resonance transitions of He-like O$^{6+}$ and Ne-like Fe$^{16+}$. These results demonstrate the capability of the JAXA-EBIT for precise measurement of atomic data and show that it serves as a powerful tool for advancing astrophysical research."}
{"id": "2511.19660", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.19660", "abs": "https://arxiv.org/abs/2511.19660", "authors": ["Biswaraj Palit", "Abhijeet Borkar", "Agata Różańska", "Alex Markowitz", "Marzena Śniegowska", "Swayamtrupta Panda", "David Homan", "Krystian Iłkiewicz"], "title": "Optical and cm follow-ups of the Changing-Look event in Mkn 590", "comment": "6 pages, 3 figures; Proceedings of X-ray Quasi-Periodic Eruptions and Repeating Nuclear Transients, 16-19 June 2025, ESAC, Madrid. Submitted to Astronomische Nachrichten", "summary": "The Changing-Look active galactic nucleus Mkn 590 is currently in a rejuvenated state, exhibiting a contemporaneous flux rise across X-rays, UV, optical and cm wavelengths. In this study, we present three new optical spectra obtained with the Nordic Optical Telescope, alongside three 1.4 GHz continuum measurements from the Giant Meterwave Radio Telescope, acquired since Nov. 2024. We identified a clear increase in the broad hydrogen Balmer line emission in the most recent observational epochs. Additionally, the core radio flux densities appear to track the overall X-ray variability, suggesting a possible connection between the accretion flow and jet activity. Based on these data, we aim to explore the evolution of the circumnuclear gas in this source and potential links between accretion and ejection activity."}
{"id": "2511.20137", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2511.20137", "abs": "https://arxiv.org/abs/2511.20137", "authors": ["George Dan Chita"], "title": "Ionospheric VLF Radio Reflection Analysis System", "comment": null, "summary": "Historically, solar flare detection has been dependent on methods that require the presence of expensive satellites or other Earth based costly equipment. In this paper, we propose a cost effective, terrestrial alternative that enables reliable solar flare detection. We will discuss the design, practical implementation, and demonstration of a monitoring system for VLF (Very Low Frequency, 3 kHz to 30 kHz) radio signals transmitted by stations located thousands of kilometers away. This frequency range was selected because VLF radio waves are efficiently reflected by the lower ionospheric layers, and any changes in these layers lead to corresponding variations in the received signal. We have used a magnetic loop antenna for signal reception along with a low noise amplifier, analog-to-digital converter, and spectrum analyzer. Data was collected over the course of a few days, from a remote location with minimal electromagnetic interference. From the viewpoint of cost, simplicity and accessibility, this method far surpasses traditional methods of detecting solar flares, using satellites, telescopes, etc."}
{"id": "2511.19695", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.19695", "abs": "https://arxiv.org/abs/2511.19695", "authors": ["Josep Martí", "Pedro Luis Luque-Escamilla"], "title": "Alignment of radio jets in the microquasar V4641 Sagittarii with its high-energy structures", "comment": "6 pages, 3 figures. Accepted for publication as a Letter in Monthly Notices of the Royal Astronomical Society", "summary": "V4641 Sagittarii (V4641 Sgr) is a unique Galactic microquasar system featuring a stellar-mass black hole accreting matter from a massive companion. One of its intriguing features is the presence of relativistic radio jets almost perpendicular to the observed extended gamma-ray emission, implying significant propagation effects or interactions with the Galactic magnetic field. Here we report observational evidence that the radio jet and the very high-energy (VHE) and ultra high-energy (UHE) gamma-ray emission could be aligned along a common axis, indicating a co-spatial or co-directional origin. This alignment supports a model where synchrotron radio emission, VHE and UHE gamma rays are produced within a single, highly collimated relativistic outflow. Our findings favor scenarios of in-situ particle acceleration up to hundreds of TeV, challenge previous interpretations involving large-scale particle diffusion, and simplify the geometric modeling of the source. This case highlights the potential of V4641 Sgr as a PeVatron candidate within our Galaxy and provides a benchmark for understanding jet composition and magnetic structure in microquasars."}
{"id": "2511.20231", "categories": ["astro-ph.IM", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2511.20231", "abs": "https://arxiv.org/abs/2511.20231", "authors": ["Louisa A. Mason", "Michael A. Garrett", "Andrew P. V. Siemion"], "title": "Simulating the Stellar Bycatch: Constraining the Prevalence of Extraterrestrial Transmitters within Radio SETI Surveys", "comment": "8 pages, 7 figures", "summary": "Searches for radio technosignatures place constraints on the prevalence of extraterrestrial transmitters in our Galaxy and beyond. It is important to account for the complete stellar population captured within a radio telescope's field of view, or stellar 'bycatch'. In recent years, catalogues from ESA's Gaia mission have enabled SETI surveys to place tighter limits on extraterrestrial transmitter statistics. However, Gaia remains restricted by magnitude limits, astrometric uncertainty at large distances, and confusion in crowded regions. To address these limitations, we investigate the use of the Besançon Galactic Model to simulate the statistical underlying stellar population to derive more realistic constraints on the occurrence of extraterrestrial transmitters. We apply this method to Breakthrough Listen's Enriquez/Price survey, modelling 6,182,364 stellar objects within 1229 individual pointings and extending the search out to distances $\\leq 25$kpc. We place limits on the prevalence of high duty cycle transmitters within 2.5kpc, suggesting $\\leq (0.000995 \\pm 0.000002)\\%$ of stellar systems contain such a transmitter (for near-zero drift rates and EIRP$_{\\mathrm{min}} \\gtrsim 5 \\times 10^{16}$W). In support of broader adoption, we provide a simple calculator tool that enables other researchers to incorporate this approach into their own SETI analyses. Our results enable a more complete statistical estimation of the number and stellar type of systems probed, thereby strengthening constraints on technosignature prevalence and guiding the analysis of future SETI efforts. We also conclude that SETI surveys are, in fact, much less biased by anthropocentric assumptions than is often suggested."}
{"id": "2511.20112", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.20112", "abs": "https://arxiv.org/abs/2511.20112", "authors": ["Yuki Amano", "Yuken Ohshiro", "Hiromasa Suzuki", "Kotaro Fukushima", "Hiroya Yamaguchi"], "title": "Spatially Resolved Plasma Diagnostics of the Supernova Remnant DEM L71 using the Reflection Grating Spectrometer", "comment": "12 pages, 10 figures, 1 table, accepted for publication in PASJ", "summary": "We present a spatially resolved high-resolution X-ray spectroscopy of the supernova remnant DEM L71 using the Reflection Grating Spectrometer (RGS) aboard XMM-Newton. Because of the large dispersion angle of the RGS, we are able to resolve individual emission lines and examine their spatial distributions within this moderately extended remnant. We derive line fluxes across different regions of DEM L71 and perform quantitative plasma diagnostics. Our analysis reveals that some regions have high forbidden-to-resonance ratios of O\\emissiontype{VII} He$α$ lines, suggesting a non-negligible contribution from additional physical processes, such as charge exchange and/or resonance scattering. Our results demonstrate that the RGS has potential to serve as an outstanding X-ray imaging spectrometer for moderately diffuse objects."}
{"id": "2511.20386", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2511.20386", "abs": "https://arxiv.org/abs/2511.20386", "authors": ["Jiangpei Dou", "Bingli Niu", "Gang Zhao", "Xi Zhang", "Gang Wang", "Baoning Yuan", "Di Wang", "Xingguang Qian"], "title": "Performance Calibration of the Wavefront Sensor's EMCCD Detector for the Cool Planets Imaging Coronagraph Aboard CSST", "comment": "12pages, 11figures, 1table", "summary": "The wavefront sensor (WFS), equipped with an electron-multiplying charge-coupled device (EMCCD) detector, is a critical component of the Cool Planets Imaging Coronagraph (CPI-C) on the Chinese Space Station Telescope (CSST). Precise calibration of the WFS's EMCCD detector is essential to meet the stringent requirements for high-contrast exoplanet imaging. This study comprehensively characterizes key performance parameters of the detector to ensure its suitability for astronomical observations. Through a multi-stage screening protocol, we identified an EMCCD chip exhibiting high resolution and low noise. The electron-multiplying gain (EM Gain) of the EMCCD was analyzed to determine its impact on signal amplification and noise characteristics, identifying the optimal operational range. Additionally, noise properties such as readout noise were investigated. Experimental results demonstrate that the optimized detector meets CPI-C's initial application requirements, achieving high resolution and low noise. This study provides theoretical and experimental foundations for the use of EMCCD-based WFS in adaptive optics and astronomical observations, ensuring their reliability for advanced space-based imaging applications"}
{"id": "2511.20242", "categories": ["astro-ph.HE", "astro-ph.GA", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2511.20242", "abs": "https://arxiv.org/abs/2511.20242", "authors": ["Shi-Jie Gao", "Xiang-Dong Li", "Song Wang", "Kareem El-Badry", "De-Jiang Zhou", "Yi-Xuan Shao", "Zhen Yan", "Pei Wang", "Ping Zhou", "Jin-Lin Han"], "title": "Search for Radio Pulsations from Neutron Star Candidates in Detached Binaries", "comment": "Accepted for publication in ApJ", "summary": "Recent optical astrometric and spectroscopic surveys have identified numerous neutron star (NS) candidates in non-accreting detached binary systems, but their compact-object nature remains unconfirmed. In this work, we present targeted radio observations of 31 such candidates using the Five-hundred-meter Aperture Spherical radio Telescope (FAST), the Robert C. Byrd Green Bank Telescope, and the Shanghai TianMa Radio Telescope. Over a total of 46.65 hours of observing time, we detected neither periodic nor single-pulse radio emissions. These nondetections place stringent upper limits on the flux densities of any potential radio signals, reaching ~4 $μ$Jy for periodic emission and ~10 mJy for single pulses with FAST. Since our observations are highly sensitive and the flux density upper limits are well below the median fluxes of known Galactic pulsars, this suggests that geometric beaming is the most likely explanation for the non-detections if these objects are indeed pulsars. Alternatively, the NSs may be sufficiently old ($\\gtrsim$ 10 Gyr) and have become intrinsically radio-quiet. In this case, our findings highlight the inherent difficulty of confirming NSs in such old detached binary systems through radio pulsation searches."}
{"id": "2511.20524", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2511.20524", "abs": "https://arxiv.org/abs/2511.20524", "authors": ["Ana Paula Jeakel", "Gabriel Vieira dos Santos", "Valerio Marra", "Rodrigo von Marttens", "Siddhartha Gurung-López", "Raul Abramo", "Jailson Alcaniz", "Narciso Benitez", "Silvia Bonoli", "Javier Cenarro", "David Cristóbal-Hornillos", "Simone Daflon", "Renato Dupke", "Alessandro Ederoclite", "Rosa M. González Delgado", "Antonio Hernán-Caballero", "Carlos Hernández-Monteagudo", "Jifeng Liu", "Carlos López-Sanjuan", "Antonio Marín-Franch", "Claudia Mendes de Oliveira", "Mariano Moles", "Fernando Roig", "Laerte Sodré", "Keith Taylor", "Jesús Varela", "Héctor Vázquez Ramió", "José M. Vilchez", "Christopher Willmer", "Javier Zaragoza-Cardiel"], "title": "The miniJPAS and J-NEP surveys: Machine learning for star-galaxy separation", "comment": "28 pages; accepted for publication in Galaxies", "summary": "We present a supervised machine learning classification of sources from the Javalambre Physics of the Accelerating Universe Astrophysical Survey (J-PAS) Pathfinder datasets: miniJPAS and J-NEP. Leveraging crossmatches with spectroscopic and photometric catalogs, we construct a robust labeled dataset comprising 14594 sources classified into extended (galaxies) and point-like (stars and quasars) objects. We assess dataset representativeness using UMAP analysis, confirming broad and consistent coverage of feature space. An XGBoost classifier, with hyperparameters tuned using automated optimization, is trained using purely photometric data (60-band J-PAS magnitudes) and combined photometric and morphological features, with performance thoroughly evaluated via ROC and purity-completeness metrics. Incorporating morphology significantly improves classification, outperforming the baseline classifications available in the catalogs. Permutation importance analysis reveals morphological parameters, particularly concentration, normalized peak surface brightness, and PSF, alongside photometric features around 4000 and 6900 A, as crucial for accurate classifications. We release a value-added catalog with our models for star-galaxy classification, enhancing the utility of miniJPAS and J-NEP for subsequent cosmological and astrophysical analyses."}
{"id": "2511.20310", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.20310", "abs": "https://arxiv.org/abs/2511.20310", "authors": ["Pragyan Pratim Bordoloi", "Shubh Mittal", "Shabnam Iyyani"], "title": "From Empirical to Physical Model: Direct Fits of Optically Thin Inverse Compton Scattering to Prompt GRB Spectra", "comment": "10 Figures, 2 Tables, submitted", "summary": "Gamma-ray burst (GRB) prompt emission is commonly attributed to non-thermal radiation processes operating in the optically thin regions of a relativistic outflow. Among these, optically thin inverse-Compton (IC) scattering remains an important yet under-tested mechanism. From an initial set of 41 bursts selected using empirical Band-function criteria that highlight quasi-thermal low-energy slopes ($α> -0.5$) and constrained high-energy indices ($-1.7 > β> -3.3$), only four events satisfy these conditions consistently in both time-integrated and time-resolved spectra. The IC fits yield self-consistent constraints on the seed-photon field and the electron population at the dissipation site. For bulk Lorentz factors $Γ\\sim 170$-$550$, we infer seed thermal peaks of $\\sim 0.05$-$0.2$ keV and electron thermal energies of $\\sim 20$-$300$ keV in the co-moving frame. A fraction of only $0.1\\%$-$20\\%$ of electrons are accelerated into a non-thermal tail with an average index value of $δ\\sim 1.8$. The derived Comptonisation parameters indicate moderate $y$ values ($\\sim 1$-$3$), optical depths $τ\\sim 0.2$-$0.6$, and dissipation radii just above the photosphere, consistent with mildly relativistic ($γ_{\\min} \\sim 1.2$-$2.6$), photon-dominated, low-magnetic-field dissipation environments. Furthermore, the framework allows us to constrain even sub-dominant thermal components that lie below the detector's low-energy threshold. Taken together, our results show that optically thin IC scattering offers a physically consistent and observationally viable explanation for the prompt emission in a subset of bright GRBs, motivating the application of IC models in future GRB studies."}
{"id": "2511.20560", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2511.20560", "abs": "https://arxiv.org/abs/2511.20560", "authors": ["Aditya R. Sengupta", "Jordan Diaz", "Matthew DeMartino", "Rebecca Jensen-Clem", "Sylvain Cetre", "Elinor Gates", "Kevin Bundy", "Daren Dillon", "Philip Hinz", "Maïssa Salama", "Nour Skaf", "Olivier Guyon", "Tara Crowe", "Caleb Dobias", "Stephen S. Eikenberry", "Rodrigo Amezcua-Correa", "Stephanos Yerolatsitis"], "title": "On-sky demonstration of second-stage wavefront control with a photonic lantern", "comment": "Accepted to AJ", "summary": "Ground-based direct imaging of exoplanets at high contrast requires precise correction of atmospheric turbulence using adaptive optics (AO). The planet-to-star contrast ratio at small angular separations from the host star is often limited by non-common-path aberrations (NCPAs) seen only in the science plane. The photonic lantern (PL) can be used to sense aberrations at the final science imaging plane. This enables a two-stage wavefront control architecture, in which the first-stage wavefront sensor senses atmospheric turbulence and the PL senses NCPAs and other aberrations not seen by the first stage. We demonstrate closed-loop control of residual wavefront errors using a non-dispersed PL after first-stage AO correction on the Shane 3m telescope at Lick Observatory. Our results show that non-dispersed PLs can be used for second-stage wavefront sensing, enabling performance improvements via minimally invasive retrofits to existing AO systems."}
{"id": "2511.20336", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2511.20336", "abs": "https://arxiv.org/abs/2511.20336", "authors": ["N. Sahakyan", "D. Bégué", "P. Giommi", "H. Dereli-Bégué", "Asaf Pe'er"], "title": "Impact of Spectral Coverage on Parameter recovery in Blazar Modeling", "comment": "Accepted for publication in ApJ", "summary": "Understanding the impact of spectral coverage on parameter recovery is critical for accurate interpretation of blazar spectra. In this study, we examine how the data coverage influences the reliability of parameter estimation within the one-zone synchrotron self-Compton (SSC) framework. Using OJ 287, TXS 0506+056, and Mrk 421 as representative of the low-, intermediate- and high synchrotron peak classes (LSP, ISP and HSP), respectively, we generate synthetic SEDs based on their best-fit models and perform 1,000 fits for each of the 21 observational configurations per source type. Our analysis quantifies the coverage probability for all model parameters, such has the magnetic field strength and the electron luminosity, and reveals that different blazar subclasses exhibit distinct sensitivities to spectral gaps. For LSPs, a minimal dataset comprising optical/UV, X-ray, and GeV $γ$-ray bands is sufficient for robust parameter inference. In contrast, ISPs and HSPs require broader spectral coverage to constrain the physical parameters. For ISP, we find that reliable parameter recovery can be achieved with two different minimal band combinations: \\textit{(i)} X-ray, high energy $γ$-ray, and very high energy $γ$-ray data, or \\textit{(ii)} optical/UV, X-ray, and high energy $γ$-ray data. For HSPs, the minimal configuration enabling reliable parameter recovery includes the optical/UV, X-ray, and very high energy $γ$-ray bands. We discuss the role of very high energy $γ$-ray observations, showing that they significantly enhance parameter recovery for HSPs. Our results provide practical guidelines for designing optimized multi-wavelength observation campaigns and for assessing the robustness of SSC model inferences under incomplete spectral coverage."}
{"id": "2511.20434", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.20434", "abs": "https://arxiv.org/abs/2511.20434", "authors": ["Ai-Ling Zeng", "Wei Zhao", "Jun Yang", "Xu-Zhi Hu", "Furen Deng", "Yu Lei", "Xiaoyu Hong", "Xiang Liu", "Liang Chen", "Mai Liao", "Xiaolong Yang", "Hai-Tian Shang"], "title": "Jet reorientation revealed by intermittent jet activity in radio galaxy 0954+556", "comment": "15 pages, 10 figures", "summary": "Intermittent jet activity of AGNs is a common phenomenon, whereas significant jet reorientation during episodic jet activity in relatively young radio galaxies are rarely reported. The quasar 0954+556 at redshift of 0.903 is an intriguing source exhibiting an unusual radio jet structure with significantly different jet directions at kpc and pc scales. At kpc scales, images from the VLA exhibit a bright core, a linear jet extending 24 kpc to the northwest, and a discrete jet component 16 kpc to the northeast. At pc scales, images from the VLBA show a two-component structure with a projected separation of 360 pc in the north-south direction. The peculiar structure of 0954+556 might result from jet reorientation. Here, our aim was to investigate the possible mechanism via multiscale and multifrequency deep radio images. We performed VLA and VLBA observations of 0954+556. Together with some existing data in the NRAO data archive, we made multiple VLA images at 1.4-22 GHz and VLBA images at 1.7-43 GHz for various image analyses of the jet structure. We identified the location of the radio core at pc scales, detected the faint counter-jets at both pc and kpc scales for the first time, and revealed a diffuse emission region connecting pc and kpc scale forward jets. Our spectral index distribution and spectral aging analysis indicate that 0954+556 might undergo at least two episodes of jet activity during the current AGN phase. Moreover, pc scale polarization maps display a well-resolved spine-sheath polarization structure. It seems that the jet direction of 0954+556 changed significantly during intermittent jet activity. This may explain the different jet orientations and spectral ages observed from kpc to pc scales. The research provides a strong case that AGN jet direction might change rapidly on timescales of one million years."}
{"id": "2511.20452", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.20452", "abs": "https://arxiv.org/abs/2511.20452", "authors": ["Samy Kaci", "Gwenael Giacinti", "Dmitri Semikoz"], "title": "A Self-Consistent Model of the Ultra High-Energy Gamma-Ray Emission of Pulsar Wind Nebulae: Insights from LHAASO and ATNF Catalogs", "comment": "15 pages, 5 figures", "summary": "Pulsar wind nebulae (PWNe) are the dominant Ultra-high-energy (UHE) gamma-ray sources in the LHAASO catalog suggesting that they are the dominant leptonic PeVatrons in our Galaxy. Despite this, still very little is known about their UHE gamma-ray emission, their number in the Galaxy, or their contribution to the gamma-ray emission of our Galaxy. In this work, we propose a self-consistent data-driven model of the UHE gamma-ray emission of PWNe based on the ATNF and LHAASO catalogs. More specifically, we build a model of the UHE gamma-ray emission of PWNe that preserves the statistical relationships in the ATNF catalog and reproduces the number of PWNe detected in the LHAASO catalog. To cope with the limited data available in the LHAASO catalog when performing fits on gamma-ray data, we introduce the concept of censored regression that allows to also use the information provided by unresolved sources. Using our model, we find that reproducing the number of PWNe detected by LHAASO requires either fractions of misaligned pulsars smaller ($\\lesssim60\\%$) than usually found in the literature, or that some of the associations of PWNe to ATNF pulsars made by LHAASO may not be true. In both cases, we find that in order to reach self-consistency between radio and gamma-ray data, it is necessary that the majority of the unidentified sources in the LHAASO catalog are PWNe associated to an unseen pulsar. Moreover, using our model we also find that the contribution of unresolved PWNe to the total (diffuse) gamma-ray background measured by LHAASO in the $1-1000\\,\\rm{TeV}$ range is always smaller than $\\lesssim10\\%$ ($\\lesssim30\\%$). We conclude that PWNe mostly contribute to the source component of the UHE gamma-ray sky, while having almost no imprint on its diffuse component."}
{"id": "2511.20477", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.20477", "abs": "https://arxiv.org/abs/2511.20477", "authors": ["Adamu Issifu", "Andreas Konstantinou", "Franciele M. da Silva", "Tobias Frederico"], "title": "Rotational effects in quark stars: comparing different models", "comment": "11 pages, 6 figures, 2 tables", "summary": "We investigate the rotational properties of self-bound strange quark stars using two representative quark matter equations of state (EOS): the vector MIT bag model and the density-dependent quark mass (DDQM) model. Through general-relativistic calculations of uniformly rotating sequences, we analyze their mass--radius relations, moments of inertia, quadrupole moments, surface redshifts, Keplerian frequencies, and energy components. A central result of this work is the full decomposition of the stellar energy budget in rotating strange stars, separating gravitational, internal, rotational, and binding energy contributions. Rotation amplifies the intrinsic EOS differences: the MIT model supports more massive ($M_{\\max} \\gtrsim 3.3\\,M_\\odot$) compact stars with larger moments of inertia and greater resistance to deformation, while the DDQM model produces larger radii, less massive stars limited by mass-shedding at lower frequencies. Combined measurements of mass, radius, and frequency can thus break the EOS degeneracy; massive, rapidly rotating pulsars favors MIT-like EOS, whereas larger radii in canonical stars point to a DDQM-like model. These rotational observables, soon to be tightly constrained by NICER and next-generation gravitational-wave detectors, offer a means to test the existence and composition of self-bound quark matter in compact stars."}
{"id": "2511.20499", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.20499", "abs": "https://arxiv.org/abs/2511.20499", "authors": ["R. Iaria", "T. Di Salvo", "A. Anitra", "F. Barra", "A. Sanna", "C. Maraventano", "C. Miceli", "W. Leone", "L. Burderi"], "title": "A mysterious feature in the NICER spectrum of 4U 1820-30: A gravitationally redshifted absorption line?", "comment": "14 pages, 10 figures, accepted by ApJ", "summary": "A mysterious absorption feature at approximately 3.8 keV has been identified in the NICER spectrum of the low-mass X-ray binary system 4U 1820-30. We interpret this feature as a gravitationally redshifted iron absorption line. This interpretation is supported by the temporal proximity of the NICER observation to the detection of a carbon superburst by the X-ray monitor MAXI, suggesting that the presence of the line is associated with this rare and extreme event. From the inferred redshift of the absorption line, the compactness of the neutron star can be derived. Using a photoionization absorption model, we measure a gravitational redshift of about 1.72, which corresponds to a compactness R/M of 4.46 \\pm 0.13 km per solar mass, or 3.02 \\pm 0.09 in dimensionless units. This unique feature highlights the importance of further observations and detailed modelling, offering promising insights into the equation of state of matter under extreme density conditions."}
{"id": "2511.20589", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.20589", "abs": "https://arxiv.org/abs/2511.20589", "authors": ["J. A. J. Alford", "J. D. Gelfand", "M. Abdelmaguid", "P. Slane"], "title": "Evidence of an Energetic Magnetar Powering 1LHAASO J0500$+$4454", "comment": "16 pages, 6 figures, 2 tables. Accepted for publication in ApJ", "summary": "We investigate the origin of unidentified, extended TeV source 1LHAASO J0500$+$4454, considering three possible origins: cosmic rays interacting with a molecular cloud (MC), particles accelerated in a currently undetected supernova remnant (SNR), and an energetic outflow powered by a pulsar. Upper limits on the CO and X-ray emission from the $γ$-ray emitting region disfavor the MC and SNR scenarios, respectively. If a nebula of inverse Compton scattering $e^{\\pm}$ powers 1LHAASO J0500$+$4454, then SED modeling indicates that the current particle energy in the nebula is $\\sim 4 \\times 10^{48}$ erg. If the coincident magnetar SGR 0501$+$4516's rotational energy powered 1LHAASO J0500$+$4454, then a conservative energy budget calculation requires an initial magnetar spin period $P_{0} \\lesssim 5$ ms and a spin-down timescale $τ_{\\rm sd} \\lesssim 30$ yr, which has implications for the origins of magnetars."}
{"id": "2511.20135", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.20135", "abs": "https://arxiv.org/abs/2511.20135", "authors": ["Yuki Amano", "Leo Hirata", "Moto Togawa", "Hiromasa Suzuki", "Hiroyuki A. Sakaue", "Naoki Kimura", "Nobuyuki Nakamura", "Makoto Sawada", "Masaki Oura", "Jonas Danisch", "Joschka Goes", "Marc Botz", "José R. Crespo López-urrutia", "Hiroya Yamaguchi"], "title": "A laboratory plasma experiment for X-ray astronomy using a compact electron beam ion trap (EBIT)", "comment": "8pages, 4 figures, accepted for publication in Plasma and Fusion Research", "summary": "We present the basic performance and experimental results of an electron beam ion trap (JAXA-EBIT), newly introduced to the Japanese astronomical community. Accurate atomic data are indispensable for the reliable interpretation of high-resolution X-ray spectra of astrophysical plasmas. The JAXA-EBIT generates highly charged ions under well-controlled laboratory conditions, providing experimental benchmarks for atomic data. The JAXA-EBIT shows performance comparable to the Heidelberg compact EBIT through dielectronic recombination measurements of highly charged Ar ions. Furthermore, we conducted resonant photoexcitation spectroscopy of highly charged ions using the soft X-ray beamline BL17SU at the synchrotron radiation facility SPring-8. As a result, we successfully detected resonance transitions of He-like O$^{6+}$ and Ne-like Fe$^{16+}$. These results demonstrate the capability of the JAXA-EBIT for precise measurement of atomic data and show that it serves as a powerful tool for advancing astrophysical research."}
