{"id": "2510.06491", "categories": ["astro-ph.IM", "physics.ins-det"], "pdf": "https://arxiv.org/pdf/2510.06491", "abs": "https://arxiv.org/abs/2510.06491", "authors": ["Darshan A. Patel", "Yuhan Wang", "Cody J. Duell", "Jason E. Austermann", "James Beall", "James R. Burgoyne", "Scott Chapman", "Steve K. Choi", "Rodrigo G. Freundt", "Eliza Gazda", "Christopher Groppi", "Zachary B. Huber", "Johannes Hubmayr", "Ben Keller", "Lawerence T. Lin", "Philip Mauskopf", "Alicia Middleton", "Michael D. Niemack", "Cody Roberson", "Adrian K. Sinclair", "Ema Smith", "Jeff van Lanen", "Anna Vaskuri", "Benjamin J. Vaughan", "Eve M. Vavagiakis", "Michael Vissers", "Samantha Walker", "Jordan Wheeler", "Ruixuan", "Xie"], "title": "CCAT: Readout of over 10,000 280 GHz KIDs in Mod-Cam using RFSoC Electronics", "comment": "7 pages, 7 figures, submitted to Low Temperature Detectors 2025\n  conference proceedings", "summary": "Over the past decade, kinetic inductance detectors (KIDs) have emerged as a\nviable superconducting technology for astrophysics at millimeter and\nsubmillimeter wavelengths. KIDs spanning 210 - 850 GHz across seven instrument\nmodules will be deployed in the Prime-Cam instrument of CCAT Observatory's Fred\nYoung Submillimeter Telescope at an elevation of 5600 m on Cerro Chajnantor in\nChile's Atacama Desert. The natural frequency-division multiplexed readout of\nKIDs allows hundreds of detectors to be coupled to a single radio frequency\n(RF) transmission line, but requires sophisticated warm readout electronics.\nThe FPGA-based Xilinx ZCU111 radio frequency system on chip (RFSoC) offers a\npromising and flexible solution to the challenge of warm readout. CCAT uses\ncustom packaged RFSoCs to read out KIDs in the Prime-Cam instrument. Each RFSoC\ncan simultaneously read out four RF channels with up to 1,000 detectors\nspanning a 512 MHz bandwidth per channel using the current firmware. We use\nfive RFSoCs to read out the >10,000 KIDs in the broadband 280 GHz instrument\nmodule inside a testbed receiver. Here, we describe and demonstrate the readout\nsoftware and pipeline for the RFSoC system. We also present the preliminary\naveraged spectral responses of the 280 GHz instrument module using KIDs from\nthe TiN array and the first Al array as a demonstration of the end-to-end\nperformance of the readout and optical systems. These measurements demonstrate\nthe foundation that will enable us to simultaneously read out over 10,000 KIDs\nwith the RFSoC and represent a critical step toward reading out the ~100,000\nKIDs in Prime-Cam in its future full capacity configuration."}
{"id": "2510.06558", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2510.06558", "abs": "https://arxiv.org/abs/2510.06558", "authors": ["Jiacong Zhu", "Eloy de Lera Acedo", "Kaan Artuc", "Xuelei Chen"], "title": "RFSoC receiver calibration system for 21-cm global spectrum experiments from space: The CosmoCube case", "comment": "14 pages, 20 figures", "summary": "The CosmoCube project plans to deploy a global 21-cm spectrometer with 10-100\nMHz observation band in a lunar orbit. The farside part of such an orbit, i.e.\nthe part of orbit behind the Moon, offers an ideal site for accurately\nmeasuring the 21-cm signal from the Dark Ages, Cosmic Dawn and Epoch of\nReionization, as the effects of the Earth's ionosphere, artificial radio\nfrequency interference (RFI), and complex terrain and soil are all avoided.\nGiven the limitations of a satellite platform, we propose a receiver\ncalibration system design based on a Radio Frequency system-on-chip, consisting\nof a Vector Network Analyzer (VNA) sub-system, and a source switching\nsub-system. We introduce the measurement principle of the VNA, and discuss the\neffect of quantization error. The accuracy, stability and trajectory noise of\nthe VNA are tested in laboratory experiments. We also present the design of the\nsource-switching sub-system, generating mock datasets, showing that the\nimperfect return loss, insertion loss, and isolation of surface-mounted\nmicrowave switches have a minimal effect on the sky foreground fitting\nresiduals, which are within $\\pm10$ mK under optimal fitting condition. When\nall possible measurement errors in reflection coefficients and physical\ntemperatures are taken into account, the foreground fitting residuals for the\n50-90 MHz part of the spectrum remain around $\\pm20$ mK."}
{"id": "2510.06771", "categories": ["astro-ph.IM", "astro-ph.GA", "physics.ins-det"], "pdf": "https://arxiv.org/pdf/2510.06771", "abs": "https://arxiv.org/abs/2510.06771", "authors": ["Chris S. Benson", "Peter S. Barry", "Patrick Ashworth", "Harry Gordon-Moys", "Kirit S. Karkare", "Izaak Morris", "Gethin Robson"], "title": "Low-noise Fourier Transform Spectroscopy Enabled by Superconducting On-Chip Filterbank Spectrometers", "comment": null, "summary": "Historically employed spectroscopic architectures used for large field of\nview mapping spectroscopy in millimetere and sub-millimetre astronomy suffer\nfrom significant drawbacks. On-chip filterbank spectrometers are a promising\ntechnology in this respect; however, they must overcome an orders-of-magnitude\nincrease in detector counts, efficiency loss due to dielectric properties, and\nstringent fabrication tolerances that currently limit scaling to resolutions of\norder 1000 over a large array. We propose coupling a medium-resolution Fourier\ntransform spectrometer to a low-resolution filterbank spectrometer focal plane,\nwhich serves as a post-dispersion element. In this arrangement, medium\nresolution imaging spectroscopy is provided by the Fourier transform\nspectrometer, while the low resolution filterbank spectrometer serves to\ndecrease the photon noise inherent in typical broadband Fourier transform\nspectrometer measurements by over an order of magnitude. This is achieved while\nmaintaining the excellent imaging advantages of both architectures. We present\npredicted mapping speeds for a filterbank-dispersed Fourier transform\nspectrometer from a ground-based site and a balloon-borne platform. We also\ndemonstrate the potential that an instrument of this type has for an R~1000\nline intensity mapping experiment using the James Clerk Maxwell Telescope as an\nexample platform. We demonstrate that a filterbank-dispersed Fourier transform\nspectrometer would be capable of R~1000 measurements of CO power spectra with a\nsignal-to-noise ratio of 10--100 with surveys of $10^5$--$10^6$ spectrometer\nhours."}
{"id": "2510.06931", "categories": ["astro-ph.IM", "cs.LG"], "pdf": "https://arxiv.org/pdf/2510.06931", "abs": "https://arxiv.org/abs/2510.06931", "authors": ["Fiorenzo Stoppa", "Turan Bulmus", "Steven Bloemen", "Stephen J. Smartt", "Paul J. Groot", "Paul Vreeswijk", "Ken W. Smith"], "title": "Textual interpretation of transient image classifications from large language models", "comment": "Published in Nature Astronomy (2025). Publisher's Version of Record\n  (CC BY 4.0). DOI: 10.1038/s41550-025-02670-z", "summary": "Modern astronomical surveys deliver immense volumes of transient detections,\nyet distinguishing real astrophysical signals (for example, explosive events)\nfrom bogus imaging artefacts remains a challenge. Convolutional neural networks\nare effectively used for real versus bogus classification; however, their\nreliance on opaque latent representations hinders interpretability. Here we\nshow that large language models (LLMs) can approach the performance level of a\nconvolutional neural network on three optical transient survey datasets\n(Pan-STARRS, MeerLICHT and ATLAS) while simultaneously producing direct,\nhuman-readable descriptions for every candidate. Using only 15 examples and\nconcise instructions, Google's LLM, Gemini, achieves a 93% average accuracy\nacross datasets that span a range of resolution and pixel scales. We also show\nthat a second LLM can assess the coherence of the output of the first model,\nenabling iterative refinement by identifying problematic cases. This framework\nallows users to define the desired classification behaviour through natural\nlanguage and examples, bypassing traditional training pipelines. Furthermore,\nby generating textual descriptions of observed features, LLMs enable users to\nquery classifications as if navigating an annotated catalogue, rather than\ndeciphering abstract latent spaces. As next-generation telescopes and surveys\nfurther increase the amount of data available, LLM-based classification could\nhelp bridge the gap between automated detection and transparent, human-level\nunderstanding."}
{"id": "2510.06312", "categories": ["astro-ph.HE", "astro-ph.SR", "hep-ph"], "pdf": "https://arxiv.org/pdf/2510.06312", "abs": "https://arxiv.org/abs/2510.06312", "authors": ["Kai Bartnick", "Detlev Koester", "Rolf-Peter Kudritzki", "Konstantin Springmann", "Stefan Stelzl", "Andreas Weiler"], "title": "New ultralight scalar particles and the mass-radius relation of white dwarfs -- the important role of Sirius B", "comment": "submitted to MNRAS, 12 pages, 10 figures", "summary": "We present the equation of state for two classes of new ultralight particles,\na scalar field coupling to electrons and a light $\\mathbb{Z}_\\mathcal{N}$ QCD\naxion field coupling to nucleons. Both are potential candidates for dark\nmatter. Using the scalar modified equations of state, we calculate models for\nwhite dwarf stars and compare their radii and masses with observed mass-radius\ndata. The comparison results in stringent constraints on the masses of the\nparticles and the coupling parameters. For a wide range of particle masses and\ncoupling parameters, constraints from the white dwarf equation of state surpass\nexisting limits, outperforming also dedicated laboratory searches. The\nremarkable accuracy of modern white-dwarf mass-radius relation data,\nexemplified by Sirius B, now allows stringent tests of dense-matter physics and\nconstraints on new particle scenarios."}
{"id": "2510.06963", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2510.06963", "abs": "https://arxiv.org/abs/2510.06963", "authors": ["Riccardo Ferrazzoli", "Enrico Costa", "Sergio Fabiani", "Philip Kaaret", "Stephen L. O'Dell", "Brian D. Ramsey", "Paolo Soffitta", "Luca Baldini", "Ronaldo Bellazzini", "Alessandro Di Marco", "Fabio La Monaca", "Luca Latronico", "Alberto Manfreda", "Fabio Muleri", "John Rankin", "Carmelo Sgrò", "Stefano Silvestri", "Martin C. Weisskopf"], "title": "In-flight performance of the IXPE telescopes", "comment": "Accepted for publication on the Astrophysical Journal, 14 pages, 7\n  figures, 8 tables", "summary": "We present a comprehensive characterization of the on-orbit imaging\nperformance of the three telescopes on board the Imaging X-ray Polarimetry\nExplorer (IXPE). Each telescope comprises a Wolter-I mirror module assembly and\na Gas Pixel Detector focal-plane detector unit (DU). We analyze data from\npoint-like X-ray sources and fit a composite point spread function (PSF) model\nthat we compare with ground calibrations. We study the dependence of the PSF\nparameters and of the angular resolution, in terms of half-power diameter\n(HPD), on the time and source counting rate. We find no significant secular\nevolution of PSF parameters or HPD over 30 months on orbit, with average HPDs\nof $26.1 \\pm 0.5$ arcsec (Telescope 1), $32.1 \\pm 0.5$ arcsec (Telescope 2),\nand $30.9 \\pm 0.6$ arcsec (Telescope 3), and rate trends consistent with zero\nup to source counting rates of $\\sim60$ cts s$^{-1}$ in the 2-3 keV energy band\nfor all three telescopes. We set a 99% C.L. upper limit of 4.4% on the\noptics-induced polarization in the PSF halo, and find no measurable degradation\nof the polarization modulation factor in the wings versus the core due to\nmis-reconstructed photoelectron tracks. IXPE's imaging performance thus is\nconsistent with the $\\leq30$ arcsec observatory requirement with high\nstability, ensuring robust spatially resolved polarization measurements for the\nmission's projected lifetime through 2030."}
{"id": "2510.06352", "categories": ["astro-ph.HE", "astro-ph.CO"], "pdf": "https://arxiv.org/pdf/2510.06352", "abs": "https://arxiv.org/abs/2510.06352", "authors": ["Samsuzzaman Afroz", "Navdha", "Suvodip Mukherjee"], "title": "Are all Binary Black Holes Detected from LIGO-Virgo-KAGRA Follow the Universal Time-Delay Distributions? Likely Not", "comment": "9 pages, 5 figures", "summary": "The delay time distribution (DTD) of binary black hole (BBH) mergers encodes\nthe evolutionary link between the formation history and gravitational-wave (GW)\nemission. We present a non-parametric reconstruction of the mass-dependent DTD\nusing the BBHs from the GWTC-4 that avoids restrictive assumptions of only\npower-law forms. Our analysis reveals for the first time the signature for\nmass-dependent evolutionary pathways: lower-mass systems ($20$-$40\\,M_\\odot$)\nare consistent with a scale-invariant DTD, whereas higher-mass BBHs\n($40$-$100\\,M_\\odot$) provide the first direct tentative evidence of DTD that\ndeviate from simple power laws, with a pronounced preference for rapid mergers\naround $2-6$ Gyrs. These findings reveal the advantage of the non-parametric\ntechnique in reconstructing the mass-dependent DTD and discovering for the\nfirst-time the presence of a potential time-scale associated with high-mass GW\nevents."}
{"id": "2510.07198", "categories": ["astro-ph.IM", "astro-ph.CO"], "pdf": "https://arxiv.org/pdf/2510.07198", "abs": "https://arxiv.org/abs/2510.07198", "authors": ["Shijie Sun", "Jiaqin Xu", "Minquan Zhou", "Shenzhe Xu", "Fengquan Wu", "Haoran Zhang", "Juyong Zhang", "Bin Ma", "Zhaohui Shang", "Xuelei Chen"], "title": "Probing the cosmological 21~cm global signal from the Antarctic ice sheet", "comment": "19 pages, 17 figures", "summary": "The redshifted 21 cm line, arising from neutral hydrogen, offers a unique\nprobe into the intergalactic medium and the first stars and galaxies formed in\nthe early universe. However, detecting this signal is a challenging task\nbecause of artificial radio-frequency interference (RFI) and systematic errors\nsuch as ground effects. The interior of the Antarctic continent provides an\nexcellent location to make such observations, with minimal RFI and relatively\nstable foreground signals. Moreover, a flat plateau in central Antarctica, with\nan ice cap over 2000 m deep, will show less ground reflection of radio waves,\nreducing the signal complexity in the area around the probing antenna. It may\nbe advantageous to perform cosmological 21 cm experiments in Antarctica, and a\n21 cm Antarctic global spectrum experiment can potentially be deployed on the\nAntarctic ice cap. We have performed preliminary instrumental design, system\ncalibration, and implementation of such an instrument optimized for extreme\ncold and capable of long-term autonomous operation. This system shows the\nability to effectively detect the 21~cm signal, confirming Antarctica as an\nexcellent observational site for radio cosmology."}
{"id": "2510.06431", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.06431", "abs": "https://arxiv.org/abs/2510.06431", "authors": ["Naomi Tsuji", "Yoshiyuki Inoue", "Dmitry Khangulyan", "Kaya Mori", "Samar Safi-Harb", "Takaaki Tanaka", "Laura Olivera-Nieto", "Brydyn Mac Intyre", "Kazuho Kayama", "Takeshi Go Tsuru", "Hiroyuki Uchida", "Tatsuki Fujiwara", "Felix Aharonian"], "title": "The first proper motion measurement of the acceleration regions in the large-scale jets of SS 433 powering the W50 nebula", "comment": "14 pages, 5 figures, 3 tables. Accepted for publication in ApJ\n  Letters", "summary": "We report on new Chandra ACIS-I observations of the X-ray knots located in\nthe western and eastern lobes of W50 associated with the parsec-scale jets of\nthe Galactic microquasar SS 433. These knots are likely counterparts of the\nrecently detected very-high-energy ($E>100$ GeV) gamma-ray emission by HAWC and\nH.E.S.S. These findings, together with the ultra-high-energy signal recently\nreported by the LHAASO collaboration, have established the SS 433/W50 system as\na unique jet-driven PeVatron candidate. Combining new and archival Chandra\ndata, we perform the first proper motion search of the X-ray knot structures\nover a time interval spanning approximately 20 years. We found no statistically\nsignificant motion of these knots at the 3$\\sigma$ confidence level, and place\nan upper limit of $<$ 0.019-0.033$c$ (5,800-9,800 km s$^{-1}$) for the speed of\nthe innermost knots at an assumed distance $d=5.5$ kpc. Combined with the\nvelocities reported in the literature, the upstream speed in the shock rest\nframe would reach several 10$^4$ km s$^{-1}$, suggesting that highly efficient\nparticle acceleration, approaching the Bohm limit, is occurring. The absence of\nsignificant motion of the knots suggests the presence of a standing\nrecollimation shock, formed by the balance between the jet pressure and the\nexternal pressure. This interpretation is consistent with the expected\noccurrence of such shocks at 20-30 pc from SS 433, matching the location of the\nobserved knots."}
{"id": "2510.07215", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2510.07215", "abs": "https://arxiv.org/abs/2510.07215", "authors": ["Maojie Xu", "Argyro Sasli", "Alexandra Junell", "Felipe Fontinele Nunes", "Yu-Jing Qin", "Christoffer Fremling", "Sam Rose", "Theophile Jegou Du Laz", "Benny Border", "Antoine Le Calloch", "Sushant Sharma Chaudhary", "Hailey Markoff", "Avyukt Raghuvanshi", "Nabeel Rehemtulla", "Jesper Sollerman", "Yashvi Sharma", "Niharika Sravan", "Judy Adler", "Tracy X. Chen", "Richard Dekany", "Reed Riddle", "Mansi M. Kasliwal", "Matthew J. Graham", "Michael W. Coughlin"], "title": "AppleCiDEr II: SpectraNet -- A Deep Learning Network for Spectroscopic Data", "comment": "14 pages,9 figures", "summary": "Time-domain surveys such as the Zwicky Transient Facility (ZTF) have opened a\nnew frontier in the discovery and characterization of transients. While\nphotometric light curves provide broad temporal coverage, spectroscopic\nobservations remain crucial for physical interpretation and source\nclassification. However, existing spectral analysis methods -- often reliant on\ntemplate fitting or parametric models -- are limited in their ability to\ncapture the complex and evolving spectra characteristic of such sources, which\nare sometimes only available at low resolution. In this work, we introduce\nSpectraNet, a deep convolutional neural network designed to learn robust\nrepresentations of optical spectra from transients. Our model combines\nmulti-scale convolution kernels and multi-scale pooling to extract features\nfrom preprocessed spectra in a hierarchical and interpretable manner. We train\nand validate SpectraNet on low-resolution time-series spectra obtained from the\nSpectral Energy Distribution Machine (SEDM) and other instruments,\ndemonstrating state-of-the-art performance in classification. Furthermore, in\nredshift prediction tasks, SpectraNet achieves a root mean squared relative\nredshift error of 0.02, highlighting its effectiveness in precise regression\ntasks as well."}
{"id": "2510.06614", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.06614", "abs": "https://arxiv.org/abs/2510.06614", "authors": ["Malu Sudha", "Renee M. Ludlam", "Jeroen Homan", "Dacheng Lin", "Benjamin Coughenour", "Edward M. Cackett"], "title": "Dual perspectives on GX 17+2: a simultaneous NICER and NuSTAR study", "comment": "Accepted for publication in ApJ", "summary": "We performed the first simultaneous NICER & NuSTAR spectral and timing study\nof the Sco-like Z source GX 17+2. The source traced the full Z track during\nfour observations. We detect signatures of relativistic reflection in the\nbroadband spectra and report results using a reflection framework. The disk is\nrelatively close to the innermost stable circular orbit ($\\sim$ 1-4\nR$_{ISCO}$), which agrees with previous studies of GX 17+2, but the location of\nthe inner disk is farther out in the horizontal branch (HB) and moves inward\ntoward the flaring branch (FB). We find the FB to be the point of closest\napproach of the disk to the neutron star. We qualitatively conclude that the\nevolution of the source along the HID is that of a relatively truncated disk in\nthe HB ($\\sim$ 4 R$_{ISCO}$) that approaches the neutron star as it goes along\nthe HID towards the normal branch (NB), soft apex (SA), and finally the FB. We\nattribute the source evolution along the Z track to varying mass accretion rate\nand disk instabilities. Rms variability increases from the NB towards the SA\nand then drops to a constant along the FB indicating that the observed\nvariability likely originates from the disk/boundary layer rather than the\ncorona."}
{"id": "2510.06962", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2510.06962", "abs": "https://arxiv.org/abs/2510.06962", "authors": ["P. Giommi", "M. Doro", "M. Gouvêa", "L. Fronte", "F. Metruccio", "F. Arneodo", "U. Barres de Almeida", "S. Di Pippo", "T. Kerscher", "A. Macció", "B. Mazzon", "M. Morrone", "E. Prandini", "A. Rodríguez", "A. Ruina", "N. Sahakyan", "L. Silveri", "D. Tripathi"], "title": "1FLAT: a Firmamento-based catalog of AGN in Fermi-LAT high Galactic latitude γ-ray sources", "comment": "Accepted for publication in ApJS", "summary": "We present a systematic reassessment of 5,062 high-Galactic latitude\ngamma-ray sources from the Fermi-LAT 4FGL-DR4 catalog using Firmamento, a\nweb-based platform for multi-frequency source discovery and analysis. Our goal\nis to provide an independent evaluation of LAT gamma-ray source associations\nthrough alternative spectral and spatial methods that combine recent and legacy\nsurvey data, supplemented by human supervision of spectral energy distributions\n(SEDs), source morphology, flux variability, and template-based comparisons.\nFirmamento confirms the 4FGL-DR4 and 4LAC-DR3 counterparts or unassociated\nsources in 4,493 cases (88.8%), demonstrating the robustness of both\napproaches. Beyond this general agreement, we identify 421 new blazar\ncounterparts among previously unassociated sources, thereby reducing the\nfraction of unidentified extragalactic Fermi-LAT sources from 25% to 17%. In\naddition, in 64 cases we find alternative blazar associations, while in 49\ninstances we do not confirm the 4FGL-DR4 association. For all confirmed blazar\ncounterparts we provide homogeneous estimates of synchrotron peak frequency and\npeak flux using machine-learning and template-based methods; these agree with\n4LAC-DR3 values in most cases, though significant discrepancies appear for a\nfew dozen sources, often due to improved X-ray coverage. The primary outcome of\nthis work is the 1st Firmamento LAT AGN table (1FLAT), made publicly available\nthrough the Firmamento platform (https://firmamento.nyuad.nyu.edu), where all\nrelated multi-wavelength data and images are available. The project involved\nextensive manual validation and benefited from the active participation of\ngraduate and undergraduate students, highlighting the platform's value for both\nresearch and education."}
{"id": "2510.06741", "categories": ["astro-ph.HE", "astro-ph.SR", "hep-ph"], "pdf": "https://arxiv.org/pdf/2510.06741", "abs": "https://arxiv.org/abs/2510.06741", "authors": ["Zi-Yuan Wang", "Ying Qin", "Georges Meynet", "Qing-Zhong Liu", "Xin-Wen Shu", "Ya-Wen Xue", "Liang Yuan", "Jun-Qian Li", "Kun Jia", "Han-Feng Song"], "title": "Diagnosing the Properties and Evolutionary Fates of Black Hole and Wolf-Rayet X-ray Binaries as Potential Gravitational Wave Sources for the LIGO-Virgo-KAGRA Network", "comment": "16 pages, 19 figures, submitted on January 18 2025", "summary": "IC 10 X-1, NGC 300 X-1, and Cyg X-3 represent a unique class of X-ray\nbinaries consisting of a stellar-mass black hole (BH) accreting material from a\nWolf-Rayet (WR) star companion. These systems are particularly intriguing due\nto their short orbital periods (less than 1.5 d), making them promising\nprogenitors of gravitational wave (GW) sources detectable by the\nLIGO-Virgo-KAGRA (LVK) network. With a newly implemented prescription for\naccretion efficiency in the standard Bondi-Hoyle-Lyttleton (BHL) framework and\na corrected treatment of dynamical tides, we present for the \\textit{first}\ntime detailed binary evolution models to diagnose their properties at different\nevolutionary states and evaluate their fates as potential GW sources detectable\nby the LVK network. With additional constraints on the observed properties of\nIC 10 X-1 and NGC 300 X-1, we determine that the upper limit of the BH mass in\nthese systems (IC 10 X-1: $M_{\\rm BH} \\lesssim 25\\, M_\\odot$, NGC 300 X-1:\n$M_{\\rm BH} \\lesssim 15\\, M_\\odot$) is much lower than previously estimated.\nBoth systems are expected to form binary black holes (BBHs) that will merge\nwithin a Hubble time, unless the BH in NGC 300 X-1 has a mass of $9\\,M_\\odot$,\nthe lower limit estimated in a previous study based on the continuum-fitting\nmethod employing a relativistic slim-disc model. For Cyg X-3, we find that the\nupper limit on the BH spin magnitude cannot exceed 0.6. Interestingly, the WR\nstar in Cyg X-3 is likely to form a lower-mass gap BH, and the resulting binary\nBH system will merge within the Hubble time."}
{"id": "2510.06744", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.06744", "abs": "https://arxiv.org/abs/2510.06744", "authors": ["Mauri J. Valtonen", "Lankeswar Dey", "Staszek Zola", "Alok C. Gupta", "Shubham Kishore", "Achamveedu Gopakumar", "Paul J. Wiita", "Minfeng Gu", "Kari Nilsson", "Zhongli Zhang", "Rene Hudec", "Katsura Matsumoto", "Marek Drozdz", "Waldemar Ogloza", "Andrei V. Berdyugin", "Daniel E. Reichart", "Markus Mugrauer", "Tapio Pursimo", "Stefano Ciprini", "Tatsuya Nakaoka", "Makoto Uemura", "Ryo Imazawa", "Michal Zejmo", "Vladimir V. Kouprianov", "James W. Davidson, Jr.", "Alberto Sadun", "Jan Strobl", "Martin Jelinek", "Abhimanyu Susobhanan"], "title": "Identifying the secondary jet in the RadioAstron image of OJ~287", "comment": null, "summary": "The 136 year long optical light curve of OJ~287 is explained by a binary\nblack hole model where the secondary is in a 12 year orbit around the primary.\nImpacts of the secondary on the accretion disk of the primary generate a series\nof optical flares which follow a quasi-Keplerian relativistic mathematical\nmodel. The orientation of the binary in space is determined from the behavior\nof the primary jet. Here we ask how the jet of the secondary black hole\nprojects onto the sky plane. Assuming that the jet is initially perpendicular\nto the disk, and that it is ballistic, we follow its evolution after the\nLorentz transformation to the observer's frame. Since the orbital speed of the\nsecondary is of the order of one-tenth of the speed of light, the result is a\nchange in the jet direction by more than a radian during an orbital cycle. We\nmatch the theoretical jet line with the recent 12 $\\mu$as-resolution\nRadioAstron map of OJ~287, and determine the only free parameter of the\nproblem, the apparent speed of the jet relative to speed of light. It turns out\nthat the Doppler factor of the jet, $\\delta\\sim5$, is much lower than in the\nprimary jet. Besides following a unique shape of the jet path, the secondary\njet is also distinguished by a different spectral shape than in the primary\njet. The present result on the spectral shape agrees with the huge optical\nflare of 2021 November 12, also arising from the secondary jet."}
{"id": "2510.06786", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.06786", "abs": "https://arxiv.org/abs/2510.06786", "authors": ["Zhen Cao", "Felix Aharonian", "Yunxiang Bai", "Yiwei Bao", "Denis Bastieri", "Xiaojun Bi", "YuJiang Bi", "Mr Bian WenYi", "A. Butkevich", "Chengmiao Cai", "Wenyu Cao", "Zhe Cao", "Jin Chang", "Jinfan Chang", "Mr Aming Chen", "Ensheng Chen", "Mr Guo-Hai Chen", "Mr Huaxi Chen", "Liang Chen", "Long Chen", "Mingjun Chen", "Mali Chen", "Qihui Chen", "Shi Chen", "Suhong Chen", "Songzhan Chen", "Tianlu Chen", "Xiaobin Chen", "Xuejian Chen", "Yang Chen", "Ning Cheng", "Yaodong Cheng", "Ming Chung Chu", "Mingyang Cui", "Shuwang Cui", "Xiaohong Cui", "Yidong Cui", "Benzhong Dai", "Hongliang Dai", "Z. G. Dai", "Danzengluobu .", "Yangxuan Diao", "Xuqiang Dong", "Kaikai Duan", "Junhui Fan", "Yi-Zhong Fan", "Jun Fang", "Jianhua Fang", "Kun Fang", "Cunfeng Feng", "Hua Feng", "Li Feng", "Shaohui Feng", "Xiaoting Feng", "Yi Feng", "Youliang Feng", "Stefano Gabici", "Bo Gao", "Chuandong Gao", "Qi Gao", "Wei Gao", "Weikang Gao", "Maomao Ge", "Ting-Ting Ge", "Lisi Geng", "Gwenael Giacinti", "Guanghua Gong", "Quanbu Gou", "Minhao Gu", "Fulai Guo", "Jing Guo", "Xiaolei Guo", "Yiqing Guo", "Yingying Guo", "Yiang Han", "Otto A. Hannuksela", "Mariam Hasan", "Huihai He", "Hao-Ning He", "Jiayin He", "Xinyu He", "Yu He", "Sergio Hernández-Cadena", "Bowen Hou", "Chao Hou", "Xian Hou", "Hongbo Hu", "Shicong Hu", "Chen Huang", "Daihui Huang", "Jiajun Huang", "Tian-Qi Huang", "Wenjun Huang", "Xingtao Huang", "Xiaoyuan Huang", "Yong Huang", "Yi-Yun Huang", "Xiaolu Ji", "Huanyu Jia", "Kang Jia", "Houbing Jiang", "Kun Jiang", "Xiaowei Jiang", "Zejun Jiang", "Min Jin", "Samy Kaci", "Mingming Kang", "Ivan Karpikov", "Dmitry Khangulyan", "Denis Kuleshov", "Kirill Kurinov", "Bingbing Li", "Cheng Li", "Mr Cong Li", "Dan Li", "Fei Li", "Haibo Li", "Huicai Li", "Jian Li", "Jie Li", "Kai Li", "Long Li", "Rong-Lan Li", "Sidai Li", "Tianyang Li", "Wenlian Li", "Xiurong Li", "Xin Li", "Yizhuo Li", "Yuan Li", "Zhe Li", "Zhuo Li", "Enwei Liang", "Yunfeng Liang", "Su-Jie Lin", "Bing Liu", "Cheng Liu", "Dong Liu", "Dangbo Liu", "Hu Liu", "Haidong Liu", "Jia Liu", "Jiali Liu", "Jiren Liu", "Maoyuan Liu", "Ruo-Yu Liu", "Siming Liu", "Wei Liu", "Xi Liu", "Mr Yi Liu", "Yu Liu", "Yinong Liu", "Yu-Qing Lou", "Qing Luo", "Yu Luo", "Hongkui Lv", "Bo-Qiang Ma", "Lingling Ma", "Xinhua Ma", "Jirong Mao", "Zhen Min", "Warit Mitthumsiri", "Guobin Mou", "Huijun Mu", "Andrii Neronov", "Kenny Chun Yu Ng", "Mingyang Ni", "Lin Nie", "Mr Lejian Ou", "Petchara Pattarakijw anich", "Zhiyuan Pei", "Jincan Qi", "Mengyao Qi", "Jiajun Qin", "Ali Raza", "Chongyang Ren", "David Ruffolo", "Alejandro Sáiz", "Dmitri Semikoz", "Lang Shao", "Oleg Shchegolev", "Yunzhi Shen", "Xiangdong Sheng", "Zhaodong Shi", "Fuwen Shu", "Huichao Song", "Vladimir Stepanov Stepanov", "Yang Su", "Dongxu Sun", "Hao Sun", "Qinning Sun", "Xiaona Sun", "Zhibin Sun", "Mr Nabeel Tabasam", "Jumpei Takata", "P. H. T. Tam", "Honbin Tan", "Qingwen Tang", "Ruiyi Tang", "Zebo Tang", "Wenwu Tian", "Chaonan Tong", "Li-Hong Wan", "Chao Wang", "Guangwei Wang", "Hongguang Wang", "Jiancheng Wang", "Ke Wang", "Kai Wang", "Kai Wang", "Liping Wang", "Lingyu Wang", "Luyao Wang", "Ran Wang", "Wei Wang", "Xianggao Wang", "Xinjian Wang", "Xiang-Yu Wang", "Yang Wang", "Yudong Wang", "Zhonghai Wang", "Zhongxiang Wang", "Zheng Wang", "Daming Wei", "Jun-Jie Wei", "Yongjian Wei", "Tao Wen", "Shan-Shan Weng", "Chaoyong Wu", "Hanrong Wu", "Qingwen Wu", "Sha Wu", "Xue-Feng Wu", "Yusheng Wu", "Shaoqiang Xi", "Jie Xia", "Junji Xia", "Guangman Xiang", "Dixuan Xiao", "Gang Xiao", "Yuliang Xin", "Yi Xing", "Dingrong Xiong", "Zheng Xiong", "Donglian Xu", "Renfeng Xu", "Renxin Xu", "Weili Xu", "Liang Xue", "Dahai Yan", "Tian Yan", "Chaowen Yang", "Chuyuan Yang", "Fengfan Yang", "Lili Yang", "Mingjie Yang", "Ruizhi Yang", "Ms Wen-xin Yang", "Zihan Yang", "Zhiguo Yao", "Xuanang Ye", "Liqiao Yin", "Na Yin", "Xiaohao You", "Zhiyong You", "Qiang Yuan", "Hua Yue", "Houdun Zeng", "Tingxuan Zeng", "Wei Zeng", "Xiangtao Zeng", "Min Zha", "Binbin Zhang", "Bing Zhang", "Chao Zhang", "Feng Zhang", "Hongfei Zhang", "Haiming Zhang", "Hengying Zhang", "Jianli Zhang", "Li Zhang", "Pengfei Zhang", "Peipei Zhang", "Rui Zhang", "Shaoru Zhang", "Shoushan Zhang", "Weiyan Zhang", "Xiao Zhang", "Xiaopeng Zhang", "Yi Zhang", "Yong Zhang", "Zhipeng Zhang", "Jing Zhao", "Lei Zhao", "Lizhi Zhao", "Shiping Zhao", "Xiao-Hong Zhao", "Zihao Zhao", "Fu Zheng", "Wenjuan Zhong", "Bin Zhou", "Hao Zhou", "Jianeng Zhou", "Meng Zhou", "Ping Zhou", "Rong Zhou", "Xiaoxi Zhou", "Xunxiu Zhou", "Ben-Yang Zhu", "Chengguang Zhu", "Fengrong Zhu", "Hui Zhu", "Kejun Zhu", "Yuan-chuan Zou", "Xiong Zuo", "Oscar Macias"], "title": "A Giant Peanut-shaped Ultra-High-Energy Gamma-Ray Emitter Off the Galactic Plane", "comment": null, "summary": "Ultra-high-energy (UHE), exceeding 100 TeV (10^12 electronvolts),\n{\\gamma}-rays manifests extreme particle acceleration in astrophysical sources.\nRecent observations by {\\gamma}-ray telescopes, particularly by the Large High\nAltitude Air Shower Observatory (LHAASO), have revealed a few tens of UHE\nsources, indicating numerous Galactic sources capable of accelerating particles\nto PeV (10^15 electronvolts) energies. However, discerning the dominant\nacceleration mechanisms (leptonic versus hadronic), the relative contributions\nof specific source classes, and the role of particle transport in shaping their\nobserved emission are central goals of modern UHE astrophysics. Here we report\nthe discovery of a giant UHE {\\gamma}-ray emitter at -17.5{\\deg} off the\nGalactic plane - a region where UHE {\\gamma}-ray sources are rarely found. The\nemitter exhibits a distinctive asymmetric shape, resembling a giant \"Peanut\"\nspanning 0.45{\\deg} \\times 4.6{\\deg}, indicative of anisotropic particle\ndistribution over a large area. A highly aged millisecond pulsar (MSP)\nJ0218+4232 is the sole candidate accelerator positionally coincident with the\nPeanut region. Its association with UHE {\\gamma}-rays extending to 0.7 PeV, if\nconfirmed, would provide the first evidence of a millisecond pulsar powering\nPeV particles. Such a finding challenges prevailing models, which posit that\nmillisecond pulsars cannot sustain acceleration to PeV energies. The detection\nreveals fundamental gaps in understanding particle acceleration, cosmic-ray\ntransport, and interstellar magnetic field effects, potentially revealing new\nPeV accelerator (PeVatron) classes."}
{"id": "2510.06810", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.06810", "abs": "https://arxiv.org/abs/2510.06810", "authors": ["Yuwei Yu", "Jin Zhang"], "title": "Hard X-ray view of two $γ$-ray detected low-luminosity active galactic nuclei: NGC 315 and NGC 4261", "comment": "11 pages, 6 figures, 6 tables", "summary": "Aims. The accretion disk of low-luminosity active galactic nuclei (LLAGNs) is\na radiatively inefficient accretion flow (RIAF). Our goal is to find evidence\nof RIAF radiation from LLAGNs with jets and analyze their radiation properties,\nwhich also adds samples to future research on LLAGNs. Methods. Weconducted an\nanalysis of the X-ray data obtained from NuSTAR and XMM-Newton observations of\nNGC 315 and NGC 4261, encompassing both timing and spectral investigations. The\njoint X-ray spectra of the two LLAGNs were fitted using various functional\nforms and radiative models in XSPEC. Results. No significant variability on\ntimescales of days is observed for both NGC 315 and NGC 4261. The X-ray\ncontinuum emission of NGC 315 is suitable for cutoff power-law (PL) fitting,\nyielding a cutoff energy of Ecut = 18.45 keV, which is the lowest value found\nin LLAGNssofar. In contrast, the X-ray continuum of NGC 4261 is composed of two\nPL components, with no signs of a cutoff energy. A prominent neutral Fe\nK{\\alpha} line is observed in NGC 315, while an ionized Fe XXV line is seen in\nNGC 4261. The derived reflection fractions are R = 0.61 for NGC 315 and R =\n0.18 for NGC 4579. Neither NGC 315 nor NGC 4261 shows evidence of a Compton\nreflection bump. Conclusions. The X-ray spectral characteristics support the\nRIAF emission as the dominant origin of the X-rays in both sources, although an\nadditional soft PL component originating from the inner jet is observed in NGC\n4261. The higher reflection fraction compared to other LLAGNs, along with the\ndetection of a neutral Fe K{\\alpha} line, suggests the existence of a truncated\naccretion disk with a relatively small radius in NGC 315. Bremsstrahlung\nradiation appears to be the dominant cooling mechanism for the plasma in\nNGC315, while Comptonization within the RIAF is more likely responsible for the\nX-ray emission in NGC 4261."}
{"id": "2510.06920", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.06920", "abs": "https://arxiv.org/abs/2510.06920", "authors": ["V. Sguera", "L. Sidoli"], "title": "Recasting the nature of INTEGRAL hard X-ray transients previously classified as active galactic nuclei", "comment": "Accepted for publication in A&A. 15 pages", "summary": "We present new broad-band X-ray results aimed at the identification and\ncharacterization of four poorly studied hard X-ray transients discovered by\nINTEGRAL: IGR J16426+6536, IGR J09446-2636, IGR J21268+6203, and IGR\nJ02447+7046. The key properties and X-ray behavior of these sources have\nremained largely unknown until now. We investigated the temporal, spectral, and\nenergetic characteristics of their hard X-ray outbursts detected above 20 keV\nby INTEGRAL. In addition, we performed a systematic analysis of unpublished\narchival soft X-ray observations below 10 keV, enabling a full exploration of\ntheir large INTEGRAL error circles in search of the most likely soft X-ray\ncounterparts. Within their arcsecond-sized X-ray error circles, we identified\nsingle optical/near-infrared counterparts for each source. We analyzed their\nphotometric properties to constrain the nature of the systems. Our results show\nthat the X-ray properties of these four transients are inconsistent with the\npreviously proposed extragalactic AGN origin, and instead support a Galactic\nnature for all of them. Specifically, we propose a very faint X-ray transient\nclassification for IGR J16426+6536, a nearby flaring star for IGR J09446-2636\nand IGR J21268+6203, finally a gamma-ray binary nature for IGR J02447+7046."}
{"id": "2510.06962", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2510.06962", "abs": "https://arxiv.org/abs/2510.06962", "authors": ["P. Giommi", "M. Doro", "M. Gouvêa", "L. Fronte", "F. Metruccio", "F. Arneodo", "U. Barres de Almeida", "S. Di Pippo", "T. Kerscher", "A. Macció", "B. Mazzon", "M. Morrone", "E. Prandini", "A. Rodríguez", "A. Ruina", "N. Sahakyan", "L. Silveri", "D. Tripathi"], "title": "1FLAT: a Firmamento-based catalog of AGN in Fermi-LAT high Galactic latitude γ-ray sources", "comment": "Accepted for publication in ApJS", "summary": "We present a systematic reassessment of 5,062 high-Galactic latitude\ngamma-ray sources from the Fermi-LAT 4FGL-DR4 catalog using Firmamento, a\nweb-based platform for multi-frequency source discovery and analysis. Our goal\nis to provide an independent evaluation of LAT gamma-ray source associations\nthrough alternative spectral and spatial methods that combine recent and legacy\nsurvey data, supplemented by human supervision of spectral energy distributions\n(SEDs), source morphology, flux variability, and template-based comparisons.\nFirmamento confirms the 4FGL-DR4 and 4LAC-DR3 counterparts or unassociated\nsources in 4,493 cases (88.8%), demonstrating the robustness of both\napproaches. Beyond this general agreement, we identify 421 new blazar\ncounterparts among previously unassociated sources, thereby reducing the\nfraction of unidentified extragalactic Fermi-LAT sources from 25% to 17%. In\naddition, in 64 cases we find alternative blazar associations, while in 49\ninstances we do not confirm the 4FGL-DR4 association. For all confirmed blazar\ncounterparts we provide homogeneous estimates of synchrotron peak frequency and\npeak flux using machine-learning and template-based methods; these agree with\n4LAC-DR3 values in most cases, though significant discrepancies appear for a\nfew dozen sources, often due to improved X-ray coverage. The primary outcome of\nthis work is the 1st Firmamento LAT AGN table (1FLAT), made publicly available\nthrough the Firmamento platform (https://firmamento.nyuad.nyu.edu), where all\nrelated multi-wavelength data and images are available. The project involved\nextensive manual validation and benefited from the active participation of\ngraduate and undergraduate students, highlighting the platform's value for both\nresearch and education."}
{"id": "2510.07002", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.07002", "abs": "https://arxiv.org/abs/2510.07002", "authors": ["Yidan Wang", "Jing Han", "Pei Wang", "Di Li", "Hanting Chen", "Yuchuan Tian", "Erbil Gugercinoglu", "Jianing Tang", "Zihan Zhang", "Kaichao Wu", "Xiaoli Zhang", "Yuhao Zhu", "Jinhuang Cao", "Mingtai Chen", "Jiapei Feng", "Zhaoyu Huai", "Zitao Lin", "Jieming Luan", "Hongbin Wang", "Junjie Zhao", "Chaowei Tsai", "Weiwei Zhu", "Yongkun Zhang", "Yi Feng", "Aiyuan Yang", "Dengke Zhou", "Jianhua Fang", "Jiaying Xu", "Chenhui Niu", "Jiarui Niu", "Jumei Yao", "Chunfeng Zhang", "Rushuang Zhao", "Lei Zhang", "Junshuo Zhang", "Wanjin Lu", "Qingyue Qu"], "title": "Revealing the Temporally Stable Bimodal Energy Distribution of FRB 20121102A with a Tripled Burst Set from AI Detections", "comment": null, "summary": "Active repeating Fast Radio Bursts (FRBs), with their large number of bursts,\nburst energy distribution, and their potential energy evolution, offer critical\ninsights into the FRBs emission mechanisms. Traditional pipelines search for\nbursts through conducting dedispersion trials and looking for signals above\ncertain fluence thresholds, both of which could result in missing weak and\nnarrow-band bursts. In order to improve the completeness of the burst set, we\ndevelop an End-to-end DedispersE-agnostic Nonparametric AI model (EDEN), which\ndirectly detect bursts from dynamic spectrum and is the first detection\npipeline that operates without attempting dedispersion. We apply EDEN to\narchival FAST L-band observations during the extreme active phase of the\nrepeating source FRB 20121102A, resulting in the largest burst set for any FRB\nto date, which contains 5,927 individual bursts, tripling the original burst\nset. The much enhanced completeness enables a refined analysis of the temporal\nbehavior of energy distribution, revealing that the bimodal energy distribution\nremains stable over time. It is rather an intrinsic feature of the emission\nmechanisms than a consequence of co-evolving with burst rate."}
{"id": "2510.07026", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.07026", "abs": "https://arxiv.org/abs/2510.07026", "authors": ["Cedric Oña", "Sean Fortuna", "Ian Vega"], "title": "Prolonged fallback and late-time rebrightening episodes in stellar tidal disruptions as imprints of a galactic environment", "comment": "21 pages, 23 figures", "summary": "We extend the classical Keplerian framework of existing analytic TDE models\nby incorporating the gravitational potential of a spherically symmetric\ngalactic mass distribution. We then demonstrate that this broader structure\nimprints light curve features beyond the predictive scope of traditional\nmodels, such as phases of shallower-than-standard decay and late-time\nrebrightening episodes. Importantly, our framework predicts the occurrence of\nenvironment-induced rebrightenings but only on very long timescales, unless the\nhost environment is unrealistically ultra-compact. This means the early\nevolution of TDEs occurring in typical galaxies is essentially untouched by the\nhost potential, which explains why Keplerian models have been so successful in\ndescribing the first few years after disruption. To illustrate, we applied our\nmodel to the TDE candidate eRASSt J133157.9-324321 (J1331), the event with the\nlongest reported rebrightening interval, and find that even matching its\n${\\sim}$30-year rebrightening would demand an implausibly dense host. This\ndemonstrates the limits of environmental effects as an explanation for early\nrebrightenings reported in the literature. More broadly, our work shows that\nwhile the host galaxy leaves TDEs nearly Keplerian at early times, it actively\nshapes their long-term evolution and can drive departures from the canonical\n$t^{-5/3}$ decay law. These delayed signals give us a testable way to see how\nthe host galaxy shapes the event, and they may even offer clues about the\ngalaxy's underlying structure."}
{"id": "2510.07174", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.07174", "abs": "https://arxiv.org/abs/2510.07174", "authors": ["Han Wang", "Michael J. Williams", "Ian Harry", "Yi-Ming Hu"], "title": "Archival Inference for Eccentric Stellar-Mass Binary Black Holes in Space-Based Gravitational Wave Observations", "comment": "12 pages, 4 figures, comments welcome", "summary": "Space-based gravitational-wave observatories will detect the early inspiral\nof stellar-mass binary black holes and can track their eccentricity evolution.\nHowever, untargeted searches in the space band are computationally demanding\nand require relatively high detection thresholds (signal-to-noise ratio $\\sim\n15$). Information from ground-based detections can significantly shrink the\nparameter space for space-band analyses and thereby substantially reduce the\ndetection threshold. We present a Bayesian inference pipeline for\nground-triggered archival space-band analyses that includes eccentricity. Using\nground-informed priors, we demonstrate that with one year of LISA or TianQin\ndata a GW190521-like source with signal-to-noise ratio $\\sim 7$ can be\ndistinguished and tightly constrained. In this setup, space observations\nsharpened the redshifted chirp mass from $\\mathcal{O}(10^{-3})M_\\odot$ to\n$\\mathcal{O}(10^{-5})M_\\odot$, and constrain the eccentricity to\n$\\mathcal{O}(10^{-5})$ around the injected value $e_{0.01\\mathrm{Hz}}=0.1$.\nThese results demonstrate that inference of eccentric stellar-mass binary black\nholes in noisy space-band data is practically feasible, supports an expanded\nyield of multiband detections, and strengthens prospects for future\nastrophysical and gravitational tests."}
{"id": "2510.07220", "categories": ["astro-ph.HE", "astro-ph.CO"], "pdf": "https://arxiv.org/pdf/2510.07220", "abs": "https://arxiv.org/abs/2510.07220", "authors": ["Sarah M. Wagner", "Jeffrey D. Scargle", "Greg Madejski", "Andrea Gokus", "Krzysztof Nalewajko", "Patrick Günther", "Karl Mannheim"], "title": "High-energy variability of the gravitationally lensed blazar PKS 1830-211", "comment": null, "summary": "The production site and process responsible for the highly variable\nhigh-energy emission observed from blazar jets are still debated. Gravitational\nlenses can be used as microscopes to investigate the nature of such sources. We\nstudy the broad-band spectral properties and the high-energy variability of the\ngravitationally-lensed blazar PKS 1830-211, for which radio observations have\nrevealed two images, to put constraints on the jet physics and the existence of\na gravitationally-induced time delay and magnification ratio between the\nimages. We utilize Swift/XRT, Nustar, and Fermi-LAT observations from 2016 and\n2019 to compare periods of low activity and high activity in PKS 1830-211.\nShort-timescale variability is elucidated with an unbinned power spectrum\nanalysis of time-tagged NuSTAR photon data. To study the\ngravitationally-induced time delay in the gamma-ray light curve observed with\nFermi-LAT, we improve existing autocorrelation function based methods. Our\nmodified auto-correlation method yields a delay of t_0=21.1 +/- 0.1 d and\nmagnification factor a=0.13 +/- 0.01. These parameters remain time-invariant.\nIn data from 2016 and 2019, the X-ray spectra remain remarkably stable,\ncontrasting with extreme changes in gamma-rays. Both states can be fitted with\na single component from Comptonisation of infrared emission from the dusty\ntorus, with different gamma-ray states arising solely from a shift in the break\nof the electron energy distribution. The detection of a consistent lag\nthroughout the whole light curve suggests that they originate from a persistent\nlocation in the jet."}
{"id": "2510.07234", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.07234", "abs": "https://arxiv.org/abs/2510.07234", "authors": ["P. S. Satunin", "S. V. Troitsky"], "title": "Testing new-physics scenarios with the combined LHAASO and Carpet-3 fluence spectrum of GRB 221009A: axion-like particles and Lorentz-invariance violation", "comment": "6 pages, 3 figures, JETP Letters style", "summary": "From gamma-ray burst (GRB) 221009A, very high-energy photons were detected:\n>10 TeV with LHAASO and >100 TeV with Carpet-3. Such energetic photons are\nexpected to be absorbed via electron-positron pair production on their way to\nthe Earth. Their observation might be explained by new physics, including\nLorentz invariance violation (LIV) or photon mixing with axion-like particles\n(ALPs). Here, we construct a joint fluence spectrum by combining flux\nmeasurements from both experiments, and fit it under these hypotheses. LIV can\naccount for the Carpet-3 observation, providing a modest improvement over\nstandard physics in the overall fit. ALP mixing improves the description of\nboth LHAASO and Carpet-3 data, yielding a substantial enhancement in fit\nquality for a specific region of the ALP parameter space."}
{"id": "2510.07306", "categories": ["astro-ph.HE", "astro-ph.CO"], "pdf": "https://arxiv.org/pdf/2510.07306", "abs": "https://arxiv.org/abs/2510.07306", "authors": ["Dhruv S. Bal", "Aditya Narendra", "Maria Giovanna Dainotti", "Nikita S. Khatiya", "Aleksander L. Lenart", "Dieter H. Hartmann"], "title": "Probing evolution of Long GRB properties through their cosmic formation history aided by Machine Learning predicted redshifts", "comment": "17 pages, 8 figures (Figure 4: interactive plot), 1 table, submitted\n  to the Astrophysical Journal", "summary": "Gamma-ray Bursts (GRBs) are valuable probes of cosmic star formation reaching\nback into the epoch of reionization, and a large dataset with known redshifts\n($z$) is an important ingredient for these studies. Usually, $z$ is measured\nusing spectroscopy or photometry, but $\\sim80\\%$ of GRBs lack such data. Prompt\nand afterglow correlations can provide estimates in these cases, though they\nsuffer from systematic uncertainties due to assumed cosmologies and due to\ndetector threshold limits. We use a sample with $z$ estimated via machine\nlearning models, based on prompt and afterglow parameters, without relying on\ncosmological assumptions. We then use an augmented sample of GRBs with measured\nand predicted redshifts, forming a larger dataset. We find that the predicted\nredshifts are a crucial step forward in understanding the evolution of GRB\nproperties. We test three cases: no evolution, an evolution of the beaming\nfactor, and an evolution of all terms captured by an evolution factor\n$(1+z)^\\delta$. We find that these cases can explain the density rate in the\nredshift range between 1-2, but neither of the cases can explain the derived\nrate densities at smaller and higher redshifts, which may point towards an\nevolution term different than a simple power law. Another possibility is that\nthis mismatch is due to the non-homogeneity of the sample, e.g., a\nnon-collapsar origin of some long GRB within the sample."}
{"id": "2510.07311", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.07311", "abs": "https://arxiv.org/abs/2510.07311", "authors": ["Markus Ackermann", "Denys Malyshev", "Dmitry V. Malyshev"], "title": "Diffuse continuum emission and large extended sources at MeV energies", "comment": "27 pages, 5 figures, part of the \"Unveiling the MeV Universe in the\n  Multi-Messenger Era\" collection in Space Science Reviews", "summary": "Future gamma-ray survey instruments, such as newASTROGAM and AMEGO-X, will\nsignificantly improve previous and current all-sky surveys at MeV energies. In\nthis paper we discuss the continuum emission from the Milky Way, two prominent\nlarge extended sources, the Fermi bubbles and Loop I, and the extragalactic\ngamma-ray background. We highlight the importance of measurements in the MeV to\nGeV energy range for understanding CR production and propagation in the Galaxy,\nfor the determination of the nature of the Fermi bubbles and Loop I, and for\nexploring the origin of the extragalactic gamma-ray background."}
