{"id": "2509.08874", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2509.08874", "abs": "https://arxiv.org/abs/2509.08874", "authors": ["Anya E. Nugent", "V. Ashley Villar", "Alex Gagliano", "David O. Jones", "Asaf Horowicz", "Kaylee de Soto", "Bingjie Wang", "Ben Margalit"], "title": "Characterizing Supernovae Host Galaxies with FrankenBlast: A Scalable Tool for Transient Host Galaxy Association, Photometry, and Stellar Population Modeling", "comment": "36 pages, 14 figures, 2 tables, submitted to ApJ", "summary": "We present FrankenBlast, a customized and improved version of the Blast web\napplication. FrankenBlast associates transients to their host galaxies,\nperforms host photometry, and runs a innovative SED fitting code to constrain\nhost stellar population properties--all within minutes per object. We test\nFrankenBlast on 14,432 supernovae (SNe), ~half of which are\nspectroscopically-classified, and are able to constrain host properties for\n9262 events. When contrasting the host stellar masses ($M_*$), specific star\nformation rates (sSFR), and host dust extinction ($A_V$) between\nspectroscopically and photometrically-classified SNe Ia, Ib/c, II, and IIn, we\ndetermine that deviations in these distributions are primarily due to\nmisclassified events contaminating the photometrically-classified sample. We\nfurther show that the higher redshifts of the photometrically-classified sample\nalso force their $M_*$ and sSFR distributions to deviate from those of the\nspectroscopically-classified sample, as these properties are\nredshift-dependent. We compare host properties between\nspectroscopically-classified SN populations and determine if they primarily\ntrace $M_*$ or SFR. We find that all SN populations seem to both depend on\n$M_*$ and SFR, with SNe II and IIn somewhat more SFR-dependent than SNe Ia and\nIb/c, and SNe Ia more $M_*$-dependent than all other classes. We find the\ndifference in the SNe Ib/c and II hosts the most intriguing and speculate that\nSNe Ib/c must be more dependent on higher $M_*$ and more evolved environments\nfor the right conditions for progenitor formation. All data products and\nFrankenBlast are publicly available, along with a developing FrankenBlast\nversion intended for Rubin Observatory science products."}
{"id": "2509.08895", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2509.08895", "abs": "https://arxiv.org/abs/2509.08895", "authors": ["A. Floris", "I. Liodakis", "K. I. I. Koljonen", "E. Lindfors", "B. Agìs-Gonzalez", "A. Paggi", "D. Blinov", "K. Nilsson", "I. Agudo", "P. Charalampopoulos", "M. A. Dìaz Teodori", "J. Escudero Pedrosa", "J. Otero-Santos", "V. Piirola", "M. Newsome", "S. Van Velzen"], "title": "Polarimetric Diversity in Tidal Disruption Events: Comparative Study of Low-Polarised sources with AT2020mot", "comment": "13 pages, 2 figures, accepted for publication in A&A", "summary": "Tidal disruption events (TDEs) occur when a star is disrupted by the tidal\nforces of a supermassive black hole (SMBH), producing bright multi-wavelength\nflares. Among these events, AT2020mot has so far exhibited the highest recorded\noptical polarisation, with tidal shocks proposed as the primary source of its\npolarised emission. We present a comprehensive analysis of 13 TDEs with\navailable polarimetric observations, aiming to determine whether the unusually\nhigh polarisation of AT2020mot stems from unique physical processes or arises\nfrom mechanisms shared by other TDEs. We present new optical polarisation\nmeasurements of TDEs obtained from multiple ground-based telescopes, combining\nthem with optical, UV, and X-ray light curves from the Zwicky Transient\nFacility and the Swift observatory, respectively. We derive intrinsic TDE\nproperties, such as SMBH and stellar masses, using MOSFiT and TDEMass, and\ncompare them with the ones of the sample population. Our population study\nreveals that AT2020mot agrees with the broader TDE sample in most physical\nproperties, including blackbody temperature, luminosity, and rise timescales.\nHowever, its optical polarisation degree is exceptionally high compared to the\nlow or undetected polarisation observed in other events. Additionally,\nAT2020mot appears to have an elevated column density from our MOSFiT fits,\nsuggesting a more complex environment than is typically assumed. We conclude\nthat although AT2020mot fits well within the general TDE population in terms of\nglobal characteristics, its extraordinarily high polarisation and higher column\ndensity challenge current models based purely on shock or reprocessing\nmechanisms. More extensive, time-resolved polarimetric monitoring of newly\ndiscovered TDEs will be critical to determine whether AT2020mot represents an\noutlier or the extreme end of a continuum of TDE properties."}
{"id": "2509.08944", "categories": ["astro-ph.HE", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2509.08944", "abs": "https://arxiv.org/abs/2509.08944", "authors": ["Gloria Sala", "Frank Haberl", "Axel Schwope", "Dusán Tubín-Arenas", "Elif Şafak", "Chandreyee Maitra", "Jochen Greiner"], "title": "Old Galactic novae in the eROSITA All Sky Survey", "comment": "18 pages, accepted for publication in Astronomy and Astrophysics", "summary": "Nova explosions occur on accreting white dwarfs. A thermonuclear runaway in\nthe H-rich accreted envelope causes its ejection without destroying the white\ndwarf, and an increase in the luminosity by several magnitudes. Accretion is\nre-established some time after the explosion. The explosion of the nova itself\nis expected to affect the mass-transfer rate from the secondary and the\naccretion rate, but these effects have been little explored observationally.\nMost novae are observed only in outburst and the properties of the host systems\nare unknown. X-ray observations of novae happen mostly during outburst; only a\nfew have been the target of dedicated X-ray observations years or decades after\noutburst. However, the X-ray emission long after the outburst provides a\npowerful diagnostics of the accretion rate and the possible magnetic nature of\nthe white dwarf. We have explored the first two years of the SRG/eROSITA All\nSky Survey (eRASS) for X-ray sources correlated with Galactic historical novae.\nWe present the first population study of nova hosting systems in X-rays, focus\non the evolution of accretion rate as a function of the time since last\noutburst, and look for new candidates for magnetic systems. In total, 32 X-ray\ncounterparts of novae are found in the western Galactic hemisphere. Combined\nwith 53 nova detections published for the eastern hemisphere, the fraction of\nX-ray detected novae in quiescence is 18% of the Galactic novae. We have, for\nthe first time, enough statistics to observationally determine the evolution of\naccretion rate as a function of time since the last nova outburst for a time\nspan of 120 years. The results confirm that magnetic systems remain\nsystematically at higher fluxes and that accretion is enhanced during the first\nyears after the outburst, as predicted theoretically. We also identify new IP\ncandidates in AT Cnc and RR Cha."}
{"id": "2509.08951", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.08951", "abs": "https://arxiv.org/abs/2509.08951", "authors": ["F. J. Cowie", "R. P. Fender", "I. Heywood", "A. K. Hughes", "K. Savard", "P. A. Woudt", "F. Carotenuto", "A. J. Cooper", "J. van den Eijnden", "K. V. S. Gasealahwe", "S. E. Motta", "P. Saikia"], "title": "Relativistic precessing jets powered by an accreting neutron star", "comment": "Accepted for publication in MNRAS Letters", "summary": "Precessing relativistic jets launched by compact objects are rarely directly\nmeasured, and present an invaluable opportunity to better understand many\nfeatures of astrophysical jets. In this Letter we present MeerKAT radio\nobservations of the neutron star X-ray binary system (NSXB) Circinus X-1 (Cir\nX-1). We observe a curved S-shaped morphology on $\\sim 20''$\n$(\\sim1\\:\\text{pc})$ scales in the radio emission around Cir X-1. We identify\nflux density and position changes in the S-shaped emission on year timescales,\nrobustly showing its association with relativistic jets. The jets of Cir X-1\nare still propagating with mildly relativistic velocities $\\sim1\\:\\text{pc}$\nfrom the core, the first time such large scale jets have been seen from a NSXB.\nThe position angle of the jet axis is observed to vary on year timescales, over\nan extreme range of at least $110{\\deg}$. The morphology and position angle\nchanges of the jet are best explained by a smoothly changing launch direction,\nverifying suggestions from previous literature, and indicating that precession\nof the jets is occurring. Steady precession of the jet is one interpretation of\nthe data, and if occurring, we constrain the precession period and half-opening\nangle to $>10$ years and $>33{\\deg}$ respectively, indicating precession in a\ndifferent parameter space to similar known objects such as SS~433."}
{"id": "2509.08870", "categories": ["astro-ph.IM", "astro-ph.EP"], "pdf": "https://arxiv.org/pdf/2509.08870", "abs": "https://arxiv.org/abs/2509.08870", "authors": ["Tyler Baines", "Aarynn Carter", "Néstor Espinoza", "Kevin Volk", "Joseph Filippazzo", "Loic Albert"], "title": "Empirical Modeling of Zodiacal Backgrounds to Improve JWST NIRISS/SOSS Data Reduction", "comment": null, "summary": "Zodiacal light -- arising from both the thermal emission and scattered\nsunlight by interplanetary dust -- is the dominant component of the sky\nbackground in NIRISS Single Object Slitless Spectroscopy (SOSS) observations.\nThe GR700XD grism disperses the zodiacal background across multiple diffraction\norders, producing a characteristic two-dimensional, spectral order-dependent\nbackground pattern on the detector that reflects the combined contribution of\noverlapping orders. Observations reveal significant variability in background\nintensity driven by JWST's sky pointing and seasonal changes, underscoring the\nneed for precise background subtraction during SOSS data reduction. Current\nmethods rely on a generic background template derived during commissioning,\nscaled to match individual exposures. However, mis-scaled templates can leave\nbehind structured residuals that may compromise the precision of exoplanet\ntransit depth measurements. To improve background modeling, we conducted two\ncalibration programs (PID 4479 and 6658) using the FULL frame readout mode and\na 5-row by 2-column mosaic pattern to sample a range of sky positions. These\nobservations enable empirical reconstruction of the sky background and provide\ndetailed insights into its spatial and spectral characteristics. We present a\nlibrary of empirically derived background templates and evaluate their\nperformance, alongside the current template, by benchmarking against the PID\n2113 dataset, which includes contemporaneous background exposures. This work\nsupports aims to enhance background subtraction for SOSS time-series to achieve\nhigher-precision exoplanet spectroscopy with JWST."}
{"id": "2509.09028", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.09028", "abs": "https://arxiv.org/abs/2509.09028", "authors": ["Paolo Lipari", "Silvia Vernetto"], "title": "Cosmic Ray Spatial Distribution and the Galactic/Extragalactic Transition", "comment": "20 pagers, 9 figures", "summary": "Determining the spatial distribution of Galactic cosmic rays (CRs) is\nfundamental to understand how these particles propagate in interstellar space\nand to infer their source spectra. The most sensitive method of studying this\nproblem is observing the gamma--ray and neutrino diffuse fluxes produced in the\ninelastic interactions of CR protons and nuclei with interstellar gas that\nencode the energy and spatial distributions of the interacting particles. Most\ntheoretical models assume that the spatial and energy dependencies of the\nspectra of CR protons and nuclei are factorized, so that the CR energy spectra\nhave the same shape at all points of the Milky Way. However, on the base of the\nFermi--LAT observations, some authors have tentatively inferred that particles\nin the inner regions of the Milky Way have significantly harder spectra.\nRecently the ground--based telescopes Tibet--AS$\\gamma$, LHAASO and HAWC have\nextended the measurements of the diffuse gamma--ray flux to much higher\nenergies, and the IceCube neutrino telescope has obtained evidence for a $\\nu$\nflux from the Galactic disk. These new measurements allow for new tests of the\nfactorization hypothesis, and disfavor models in which the spectral shape of CR\nprotons and nuclei is harder in the inner part of the Galaxy. In fact, the\nLHAASO data above 30~TeV are in better agreement with the opposite hypothesis,\nthat cosmic rays is the inner Galaxy have softer spectra than those in the\nouter Galaxy. This result, that has currently only modest significance due to\nlarge statistical and systematic uncertainties, could be explained by assuming\nthat the CR confinement volume increases with energy. An alternative\nexplanation is that a significant fraction of cosmic rays in the multi--PeV\nenergy range is of extragalactic origin."}
{"id": "2509.08905", "categories": ["astro-ph.IM", "astro-ph.EP"], "pdf": "https://arxiv.org/pdf/2509.08905", "abs": "https://arxiv.org/abs/2509.08905", "authors": ["Thayne Currie", "Olivier Guyon", "Ruslan Belikov", "Dan Sirbu", "Mona El Morsy"], "title": "Demonstrating Improved Contrast on the Roman Coronagraph with Spatial Linear Dark Field Control", "comment": "7 pages, 2 figures, 3 tables; slightly reformatted and clarified\n  Roman Coronagraph White Paper", "summary": "The baseline contrast floor from the Roman Coronagraph's High-Order Wavefront\nSensing and Control strategy likely degrades over the course of time, requiring\nperiodic recalibration of the dark hole. Here, we propose to consider spatial\nlinear dark field control (sLDFC) on a one-sided deep-contrast region of the\nfocal plane as a potential test. Implementing sLDFC on CGI will likely require\nsome unique data acquisition strategies given the EMCCD's high flux sensitivity\nin long exposures/high gain: we outline three possible approaches. However, if\nsuccessful, sLDFC's advances are substantial: (1) enabling us to maintain a\nfainter, more temporally correlated dark hole which will improve CGI's contrast\nafter post-processing and (2) efficiently providing a reliable signal (bright\nfield) for accurate reconstruction of residual starlight in the dark field,\nfurther boosting CGI's detection limit for bright targets."}
{"id": "2509.09040", "categories": ["astro-ph.HE", "physics.plasm-ph"], "pdf": "https://arxiv.org/pdf/2509.09040", "abs": "https://arxiv.org/abs/2509.09040", "authors": ["Charles D. Arrowsmith", "Francesco Miniati", "Pablo J. Bilbao", "Pascal Simon", "Archie F. A. Bott", "Stephane Burger", "Hui Chen", "Filipe D. Cruz", "Tristan Davenne", "Anthony Dyson", "Ilias Efthymiopoulos", "Dustin H. Froula", "Alice Goillot", "Jon T. Gudmundsson", "Dan Haberberger", "Jack W. D. Halliday", "Tom Hodge", "Brian T. Huffman", "Sam Iaquinta", "Graham Marshall", "Brian Reville", "Subir Sarkar", "Alexander A. Schekochihin", "Luis O. Silva", "Raspberry Simpson", "Vasiliki Stergiou", "Raoul M. G. M. Trines", "Thibault Vieu", "Nikolaos Charitonidis", "Robert Bingham", "Gianluca Gregori"], "title": "Suppression of pair beam instabilities in a laboratory analogue of blazar pair cascades", "comment": null, "summary": "The generation of dense electron-positron pair beams in the laboratory can\nenable direct tests of theoretical models of $\\gamma$-ray bursts and active\ngalactic nuclei. We have successfully achieved this using ultra-relativistic\nprotons accelerated by the Super Proton Synchrotron at CERN. In the first\napplication of this experimental platform, the stability of the pair beam is\nstudied as it propagates through a metre-length plasma, analogous to TeV\n$\\gamma$-ray induced pair cascades in the intergalactic medium. It has been\nargued that pair beam instabilities disrupt the cascade, thus accounting for\nthe observed lack of reprocessed GeV emission from TeV blazars. If true this\nwould remove the need for a moderate strength intergalactic magnetic field to\nexplain the observations. We find that the pair beam instability is suppressed\nif the beam is not perfectly collimated or monochromatic, hence the lower limit\nto the intergalactic magnetic field inferred from $\\gamma$-ray observations of\nblazars is robust."}
{"id": "2509.08946", "categories": ["astro-ph.IM", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2509.08946", "abs": "https://arxiv.org/abs/2509.08946", "authors": ["D. Tarczay-Nehéz"], "title": "MESAlab: a Pipeline for Mapping the Blue Loop with MESA runs", "comment": "3 pages, submitted to JOSS --- This manuscript was generated using a\n  GitHub workflow and is intended solely for content verification. While its\n  formatting (e.g., bibliography style) may differ from the final manuscript\n  submitted to JOSS, the content is identical", "summary": "Modules for Experiments in Stellar Astrophysics (MESA; (Paxton2011, 2013,\n2015, 2018, 2019, Jermyn 2023) is a widely used open-source software for\nmodelling stellar evolution. In many studies, the computational grids covers\nthousands of models (e.g., Joyce et al 2024), which requires a tremendous\namount of time and computational effort to process.\n  To streamline data analysis, the mesalab package was developed. This\nPython-based pipeline is designed to simplify the post-processing of MESA\noutputs by automatically identifying various stellar evolutionary phases, with\na specific focus on the ``blue loop'' -- a blue-ward excursion in the\nHertzsprung-Russell Diagram (HRD) for intermediate-mass stars often associated\nwith peculiar pulsational phenomena like ``strange modes.''"}
{"id": "2509.09057", "categories": ["astro-ph.HE", "astro-ph.SR", "physics.plasm-ph"], "pdf": "https://arxiv.org/pdf/2509.09057", "abs": "https://arxiv.org/abs/2509.09057", "authors": ["Yici Zhong", "Elias R. Most"], "title": "Unraveling the emission mechanism powering long period radio transients from interacting white dwarf binaries via kinetic plasma simulations", "comment": "13 pages, 5 figures", "summary": "Recent observations of long period radio transients, such as GLEAM-X J0704-37\nand ILTJ1101 + 5521, have revealed a previously unrecognized population of\ngalactic radio transient sources associated with white dwarf - M dwarf\nbinaries. It is an open question how to produce coherent radio emission in\nthese systems, though a model driven by binary interaction seems likely given\nthe nature and correlation of the emission with the binaries' orbital period.\nUsing kinetic plasma simulations, we demonstrate that the relativistic electron\ncyclotron maser instability (ECMI) is a viable mechanism for generating radio\npulses in white dwarf - M dwarf systems, akin to planetary radio emission, such\nas that from the Jupiter-Io system. We quantify the relativistic ECMI in the\nnonlinear regime under conditions relevant for white dwarf radio emission for\nthe first time. Our simulations demonstrate that the ECMI can intrinsically\nproduce partially linearly polarized emission relevant to explaining the\nobserved emission spectrum of the two galactic sources, though the precise\ndetails will depend on the plasma composition. Our work paves the way for a\nsystematic and fully nonlinear computational modeling of radio emission from\ninteracting white dwarf sources."}
{"id": "2509.09328", "categories": ["astro-ph.IM", "astro-ph.HE", "hep-ph"], "pdf": "https://arxiv.org/pdf/2509.09328", "abs": "https://arxiv.org/abs/2509.09328", "authors": ["Steffen Hahn"], "title": "Reconstruction of the depth of the shower maximum of air showers with the SD-750 surface detector of the Pierre Auger Observatory using neural networks", "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC\n  2025). 8 pages, 4 figures", "summary": "The origin of ultra-high-energy cosmic rays (UHECRs) is one of the intriguing\nmysteries in astroparticle physics. In order to identify their sources, we need\nprecise knowledge of the mass composition of UHECRs. The direct detection of\nUHECRs is not feasible at energies above 0.1 PeV, necessitating the use of\nmass-sensitive observables of extended air showers induced by UHECRs\ninteracting with the atmosphere. One way to achieve high statistics for these\nmass-sensitive observables is to use ground-based detector arrays, such as the\nSurface Detector (SD) of the Pierre Auger Observatory. The SD consists of three\nsub-arrays of independent detector stations arranged in triangular grids with\ndifferent spacings. Recently, it has been shown that neural networks (NNs) can\nextract mass-sensitive observables from data taken by the SD-1500, the largest\nsub-detector of the SD. In this contribution, we demonstrate the feasibility of\nusing NNs to reconstruct a high-level shower observable, the depth of the\nshower maximum, from data simulated for and observed by the SD-750, the\nsecond-largest detector array nested within the SD-1500. A simulation study\nshows that the SD-750 NN exhibits behavior similar to that of an SD-1500 NN and\noutperforms the latter in the energy range [1, 10) EeV. Moreover, we show that,\nafter performing a correction and calibration procedure, the predictions of the\nSD-750 NN are consistent with the measurement of the depth of the shower\nmaximum obtained by the Fluorescence Detector of the Pierre Auger Observatory."}
{"id": "2509.09069", "categories": ["astro-ph.HE", "astro-ph.CO", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2509.09069", "abs": "https://arxiv.org/abs/2509.09069", "authors": ["Young-Lo Kim", "Chul Chung", "Yong -Cheol Kim"], "title": "Testing the effect of progenitor's metallicity on $^{56}$Ni mass and constraining the progenitor scenarios in Type Ia supernovae", "comment": "11 pages including 1 page of Appendix, 4 figures + 1 App figure, and\n  3 tables; A&A accepted (shortened the abstract to fit here)", "summary": "The analytical model found that the intrinsic variation in the initial\nmetallicity of the Type Ia supernova (SN Ia) progenitor stars\n($Z_{progenitor}$) translates into a 25% variation in the $^{56}$Ni mass\nsynthesized and, therefore, 0.2 mag difference in the observed peak luminosity\nof SNe Ia. Previous observational studies used the currently-observed global\ngas-phase metallicity of host galaxies, instead of $Z_{progenitor}$ used in the\nmodel, and showed a higher scatter in the $^{56}$Ni mass measurements compared\nto the model prediction. Here, we use $Z_{progenitor}$ of 34 normal SNe Ia and\nemploy recent SN Ia explosion models with various configurations to cover the\nobserved $^{56}$Ni mass range. Unlike previous studies, our sample covers the\n$Z_{progenitor}$ range, where most of the $Z_{progenitor}$ effect occurs.\nLinear regression returns a slope of 0.02+-0.03, which is the opposite trend to\nthe analytical model, but at at low statistical significance level. We find\nthat comparing our sample with SN Ia explosion models on the\n$Z_{progenitor}$--$^{56}$Ni mass diagram allows us to constrain the progenitor\nscenarios. We also explore other chemical composition indicators. For\n$(Fe/H)_{progenitor}$, our sample follows the trend predicted by the analytical\nmodels, but at a low significance level. Noticeably, $(\\alpha/Fe)_{progenitor}$\nshows the opposite trend and a clear gap. When we split the sample at\n$(\\alpha/Fe)_{progenitor}$ = 0.35 $(\\alpha/Fe)_{\\odot}$, we find a 3$\\sigma$\ndifference in the weighted-means of the $^{56}$Ni mass. Lastly, SNe Ia in\ndifferent $Z_{progenitor}$ groups show a difference of 0.14+-0.09 mag in the\nstandardized luminosity. The present work highlights a holistic approach (from\nthe progenitor star to the explosion with SN Ia and host galaxy observational\ndata) to understand the underlying physics of SNe Ia for more accurate and\nprecise cosmology."}
{"id": "2509.09386", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.09386", "abs": "https://arxiv.org/abs/2509.09386", "authors": ["Haruaki Hirose", "Masaya Hasegawa", "Daisuke Kaneko", "Taketo Nagasaki", "Ryota Takaku", "Tijmen de Haan", "Satoru Takakura", "Takuro Fujino"], "title": "Feedback-Controlled Beam Pattern Measurement Method Using a Power-Variable Calibration Source for Cosmic Microwave Background Telescopes", "comment": "18 pages, 9 figures", "summary": "We demonstrate a novel beam pattern measurement method for the side lobe\ncharacterization of cosmic microwave background telescopes. The method employs\na power-variable artificial microwave source under feedback control from the\ndetector under test on the telescope. It enables us to extend the dynamic range\nof the beam pattern measurement without introducing nonlinearity effects from\nthe detector. We conducted a laboratory-based proof-of-concept experiment,\nmeasuring the H-plane beam pattern of a horn antenna coupled to a diode\ndetector at 81 GHz. We achieved a dynamic range of 77.7 dB in the beam pattern\nmeasurement, with 60.3 dB attributed to the feedback control. In addition, we\nverified the measurement by comparing it with other reference measurements\nobtained using conventional methods. The method is also applicable to general\noptical measurements requiring a high dynamic range to detect subtle\nnonidealities in the characteristics of optical devices."}
{"id": "2509.09123", "categories": ["astro-ph.HE", "astro-ph.CO"], "pdf": "https://arxiv.org/pdf/2509.09123", "abs": "https://arxiv.org/abs/2509.09123", "authors": ["Samsuzzaman Afroz", "Suvodip Mukherjee"], "title": "Binary Black Hole Phase Space Discovers the Signature of Pair Instability Supernovae Mass Gap", "comment": "18 pages, 10 figures", "summary": "The rapidly expanding catalog of gravitational-wave detections provides a\npowerful probe of the formation history of compact binaries across cosmic time.\nIn this work, we extend the Binary Compact Object (BCO) phase-space framework\nto the full set of events in the GWTC-4 catalog to map the observed binary\nformation scenarios in a data-driven way. Applying this framework, we identify\ndistinct regions of phase-space associated with different channels and discover\nfor the first time a unique mass-cutoff scale in a data-driven way. The mapping\nof these on different formation channels reveals a population of\nfirst-generation (1G) black holes sharply truncated at approximately 45.5\n$M_\\odot$, consistent with the theoretically predicted pair-instability\nsupernova (PISN) mass gap. These findings demonstrate the capability of the BCO\nphase-space to disentangle overlapping formation pathways, establish robust\nconnections between gravitational-wave observations and binary evolution, and\nhighlight the potential of upcoming observing runs to reveal rare populations\nand exotic origins."}
{"id": "2509.09575", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.09575", "abs": "https://arxiv.org/abs/2509.09575", "authors": ["Alison Matus-Bello", "Silvia E. Restrepo", "Ricardo Bustos", "Yi Hu", "Fujia Du", "Jaime Cariñe", "Pablo García", "Rodrigo Reeves", "Zhaohui Shang"], "title": "Deep learning-based prediction of Precipitable Water Vapor in the Chajnantor area", "comment": "8 pages, 7 figures. Submitted to A&A", "summary": "Astronomical observations at millimeter and submillimeter wavelengths heavily\ndepend on the amount of Precipitable Water Vapor (PWV) in the atmosphere,\ndirectly affecting the sky transparency and degrading the quality of the\nsignals received by radio telescopes. Predictions of PWV at different\nforecasting horizons is crucial to support telescope operations, engineering\nplanning, and observational scheduling and efficiency of radio observatories\ninstalled in the Chajnantor area in northern Chile. We developed and validated\na Long Short-Term Memory (LSTM) deep learning-based model to predict PWV at\nforecasting horizons of 12, 24, 36, and 48 hours using historical data from two\n183 GHz radiometers and a weather station in the Chajnantor area. We find the\nLSTM method is able to predict PWV in the 12 and 24 hours forecasting horizons\nwith Mean Absolute Percentage Error (MAPE) of 22% compared to 36% of the\ntraditional Global Forecast System (GFS) method used by Atacama Pathfinder\nEXperiment (APEX) and the Root Mean Square Error (RMSE) in mm are reduced by\n50%. We present a first application of deep learning techniques for preliminary\npredictions of PWV in the Chajnantor area. The prediction performance shows\nsignificant improvements to traditional methods in 12 and 24 hours time\nwindows. We also propose upgrades to improve our method in short (< 1 hour) and\nlong (> 36 hours) forecasting timescales for future work."}
{"id": "2509.09133", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.09133", "abs": "https://arxiv.org/abs/2509.09133", "authors": ["Manish Kumar", "Rahul Sharma", "Biswajit Paul"], "title": "Reprocessing of X-rays emission in Ultra-Luminous X-ray sources", "comment": "Submitted to ApJ", "summary": "With the discovery of pulsations in some of the ultra-luminous X-ray sources\n(ULXs), it is quite clear that most of the ULXs harbor either a neutron star or\na stellar mass black hole as a compact object accreting at super-Eddington\nrates. In spite of having such a high accretion rate, the reprocessed emission\nin the ULX sources is quite meagre compared to that observed in Galactic X-ray\nbinaries, except for some absorption lines in the winds. In this work, we\ninvestigate the extent of reprocessed emission in ULXs using three diagnostics:\n(i) searches for Fe $\\rm K\\alpha$ lines in bright well-known ULXs and Ultra\nluminous X-ray Pulsars (ULXPs), (ii) evolution of hardness ratio around the\neclipse transitions in the eclipsing ULXs, and (iii) the flux ratio between\neclipse and out-of-eclipse (OOE) phases in eclipsing ULXs. We placed the most\nstringent constraints to date on the upper limits on EW of the iron line,\n11--20 eV. Furthermore, we have not observed any significant changes in the\nhardness ratio during the ingress or egress, while in Galactic eclipsing X-ray\nbinaries, an increase in the hardness ratio is observed during the transitions.\nFinally, the reprocessing efficiency (eclipse to OOE flux ratio) is found to be\nlarger in ULXs compared to Galactic eclipsing X-ray binaries. Based on these\nresults, we discuss the possibility of a metal-poor or highly ionized\nenvironment surrounding the ULXs, which suppresses reprocessed emission\nfeatures."}
{"id": "2509.09632", "categories": ["astro-ph.IM", "gr-qc"], "pdf": "https://arxiv.org/pdf/2509.09632", "abs": "https://arxiv.org/abs/2509.09632", "authors": ["Jun'ya Kume", "Koh Ueno", "Tatsuki Washimi", "Jun'ichi Yokoyama", "Takaaki Yokozawa", "Yousuke Itoh"], "title": "Nonlinear Independent Component Analysis Scheme and its application to gravitational wave data analysis", "comment": "22 pages, 6 figures", "summary": "Noise subtraction is a crucial process in gravitational wave (GW) data\nanalysis to improve the sensitivity of interferometric detectors. While linear\nnoise coupling has been extensively studied and successfully mitigated using\nmethods such as Wiener filtering, subtraction of non-linearly coupled and\nnon-stationary noise remains a significant challenge. In this work, we propose\na novel independent component analysis (ICA)-based framework designed to\naddress non-linear coupling in noise subtraction. Building upon previous\ndevelopments, we derive a method to estimate general quadratic noise coupling\nwhile maintaining computational transparency compared to machine learning\napproaches. The proposed method is tested with simulated data and real GW\nstrain data from KAGRA. Our results demonstrate the potential of this framework\nto effectively mitigate complex noise structures, providing a promising avenue\nfor improving the sensitivity of GW detectors."}
{"id": "2509.09161", "categories": ["astro-ph.HE", "gr-qc"], "pdf": "https://arxiv.org/pdf/2509.09161", "abs": "https://arxiv.org/abs/2509.09161", "authors": ["Chayan Chatterjee", "Kaylah McGowan", "Suyash Deshmukh", "Karan Jani"], "title": "Machine Learning Confirms GW231123 is a \"Lite\" Intermediate Mass Black Hole Merger", "comment": null, "summary": "The LIGO-Virgo-KAGRA Collaboration recently reported GW231123, a black hole\nmerger with total mass of around 190-265 solar mass. This event adds to the\ngrowing evidence of \"lite\" intermediate mass black hole (IMBH) discoveries of\npost-merger black holes >100 solar mass. GW231123 posed several data analysis\nchallenges owing to waveform-model systematics and presence of noise artifacts\ncalled glitches. We present the first comprehensive machine learning analysis\nto further validate this event, strengthen its astrophysical inference, and\ncharacterize instrumental noise in its vicinity. Our approach uses a\ncombination of tools tailored for specific analyses: GW-Whisper, an adaptation\nof OpenAI's audio transformer, ArchGEM, a Gaussian mixture model-based soft\nclustering and density approximation software and AWaRe, a convolutional\nautoencoder. We identify the data segment containing the merger with >70%\nconfidence in both detectors and verify its astrophysical origin. We then\ncharacterize the scattered light glitch around the event, providing the first\nphysically interpretable parameters for the glitch. We also reconstruct the\nreal waveforms from the data with slightly better agreement to model-agnostic\nreconstructions than to quasi-circular models, hinting at possible astrophysics\nbeyond current waveform families (such as non-circular orbits or environmental\nimprints). Finally, by demonstrating high-fidelity waveform reconstructions for\nsimulated mergers with total masses between 100-1000 solar mass, we show that\nour method can confidently probe the IMBH regime. Our integrated framework\noffers a powerful complementary tool to traditional pipelines for rapid, robust\nanalysis of massive, glitch-contaminated events."}
{"id": "2509.09654", "categories": ["astro-ph.IM", "astro-ph.EP"], "pdf": "https://arxiv.org/pdf/2509.09654", "abs": "https://arxiv.org/abs/2509.09654", "authors": ["Jian-Kang Li", "Zhen-Zhao Tao", "Pei Wang", "Tong-Jie Zhang"], "title": "Dual-Backend Multibeam Position Switching Targeted SETI Observations toward Nearby Active Planet-Hosting Systems with FAST", "comment": "22 pages, 13 figures, 4 tables, Submitted to AJ", "summary": "The Five-hundred-meter Aperture Spherical Telescope (FAST), the world's\nlargest single-dish radio telescope, lists the search for extraterrestrial\nintelligence (SETI) as one of its key scientific objectives. In this work, we\npresent a targeted SETI observation for 7 nearby active stars utilizing the\nFAST L-band multibeam receiver, employing a observational strategy that\ncombines position switching with multibeam tracking to balance on-source\nintegration time with the accuracy of the beam response. Using both pulsar and\nSETI backends, we perform a comprehensive search for narrowband drifting\nsignals with Doppler drift rates within $\\pm 4 \\ \\mathrm{Hz\\ s^{-1}}$ and\nchannel-width periodic signal with periods between 0.12 and 100 s and duty\ncycles between 10\\% and 50\\%. No credible radio technosignatures were detected\nfrom any of the target systems. Based on this null result, we place constraints\non the presence of transmitters at a 95\\% confidence level, ruling out\nnarrowband transmitters with with EIRP above $3.98\\times10^8 \\,\\mathrm{W}$ and\nperiodic transmitter with EIRP above $1.80\\times10^{10}\n\\,\\mathrm{W}$,respectively, within the observation band."}
{"id": "2509.09224", "categories": ["astro-ph.HE", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2509.09224", "abs": "https://arxiv.org/abs/2509.09224", "authors": ["Yuan-Pei Yang"], "title": "Magnetic White Dwarf -- M Dwarf Binaries in Pre-polar Phase as Special Population of Long-Period Radio Transients", "comment": "27 pages, 8 figures, and 1 table. Comments welcome!!", "summary": "Long-period radio transients (LPTs) are a new class of coherent radio sources\nwith periods ranging from minutes to hours. Recently, two LPT sources, ILT\nJ1101+5521 and GLEAM-X J0704-37, with periods of 2-3 hours has been confirmed\nto originate from white dwarf (WD) -- M dwarf (MD) binaries. In this work, we\npropose that at least some LPTs originate from the magnetic WD -- MD binaries\nin the pre-polar phase. The asynchronism between the WD's rotation and the\nbinary's orbital motion allows for the unipolar-inductor mechanism or\nmagnetosphere interaction to operate and accelerate radiating particles, with\nthe dominant process depending on the magnetic moment ratio of the two stars.\nUnder asynchronism condition, both the peak flux and the polarization of radio\npulses will be modulated by the beat period. The pre-polar phase characterized\nby an extremely low accretion rate provides the relatively clean magnetospheric\nenvironment necessary for a loss-cone-driven maser (LCDM) mechanism to operate,\nproducing the LPT emission. The observed pulse duty cycle of $10^{-3}-10^{-1}$\nis attributed to a beaming effect modulated by the binary's magnetic geometry.\nFurthermore, the magnetized environment of a WD--MD binary is conducive to\nFaraday conversion with weak coupling, which implies that the polarization\nstate of LPTs should vary significantly at different periods. Finally, we\npredict that LPTs from WD--MD binaries should exhibit a period distribution\nfollowing $f_P(P)dP \\propto P^{-(1.67-2.33)}dP$ and a luminosity function\ndescribed by $f_L(L)dL \\propto L^{-(1.80-2.67)}dL$, which can be tested by the\nfuture large sample."}
{"id": "2509.09288", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.09288", "abs": "https://arxiv.org/abs/2509.09288", "authors": ["Akhil Uniyal", "Indu K. Dihingia", "Yosuke Mizuno", "Włodek Kluźniak"], "title": "GRMHD Study of Accretion onto time-like Naked Singularities", "comment": "Accepted in ApJ", "summary": "Naked singularities (NkS) are solutions to the Einstein field equations that\nviolate the cosmic censorship conjecture. Recent studies indicate that these\nobjects may serve as compelling mimickers of black hole shadows. In this work,\nwe investigate the accretion dynamics of selected time-like naked singularities\nusing general relativistic magnetohydrodynamic (GRMHD) simulations. Our\nobjective is to determine whether naked singularities exhibit distinct\nsignatures compared to black holes. We find that, unlike black holes, naked\nsingularities exhibit a centrifugal barrier that prevents direct accretion of\nrotating matter onto the NkS. Despite reduced magnetization in the funnel\nregion, these objects are capable of generating jet powers comparable to those\nobserved in black holes. Additionally, we observe that accreting matter\nreleases gravitational energy as it is driven towards the NkS, powering the\nstrong outflow via local fluid pressure gradient or magnetic pressure forces."}
{"id": "2509.09348", "categories": ["astro-ph.HE", "gr-qc"], "pdf": "https://arxiv.org/pdf/2509.09348", "abs": "https://arxiv.org/abs/2509.09348", "authors": ["Alice Perego", "Astrid Lamberts", "Mathias Schultheis", "Nelson Christensen"], "title": "Towards systematic search for white dwarf binaries with multiband photometry", "comment": "4 pages, 3 figures", "summary": "Ultra-compact double white dwarfs (DWDs) represent key targets for\nmulti-messenger astrophysics, as they may be observed both through\ngravitational waves and the electromagnetic (EM) spectrum. The future Laser\nInterferometer Space Antenna (LISA) will detect thousands of these systems, and\nthey are predicted to be the most numerous science targets of the mission. We\ndevelop a strategy to identify LISA source candidates in multiband photometric\nsurveys. We constructed a synthetic EM catalogue of white dwarf (WD) detections\nbased on a population synthesis code combined with a semi-analytical model of\nthe Milky Way and a consistent cooling model for the evolution. We compared\nsources in the LISA band with other WD observations in magnitude-colour and\ncolour-colour plots. From a full sky survey with $u \\le$24.5, we find that\n57$\\%$ of the sources in the LISA band occupy a specific region in\ncolour-colour diagrams. Inside this area, we find that $\\sim 63\\%$ (6.5 $\\times\n10^4$) of EM observations are LISA candidates, $\\sim 31\\%$ ($ 3.2 \\times 10^4$)\nare DWDs slightly outside the LISA frequency range, and only a small\ncontamination comes from single WDs and wider binaries. We find that the colour\ndistributions of close DWDs represent a powerful tool to distinguish potential\nLISA sources from the broader WD population. This is an avenue to select\ncandidates for further follow-up and identification."}
{"id": "2509.09481", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.09481", "abs": "https://arxiv.org/abs/2509.09481", "authors": ["Debtroy Das", "Honghui Liu", "Zuobin Zhang", "Cosimo Bambi", "Jiachen Jiang", "Johannes Buchner", "Andrea Santangelo", "Menglei Zhou"], "title": "Spin Constraints on 4U 1630-47 via combined Continuum Fitting and Reflection methods: a comparative study using Frequentist and Bayesian statistics", "comment": "24 pages, 12 figures", "summary": "We present a comprehensive Bayesian spectral analysis of the black hole X-ray\nbinary 4U 1630-47 during its 2022 outburst, using simultaneous \\textit{NICER}\nand \\textit{NuSTAR} observations. Using the traditional frequentist approach,\nwe build our model combining reflection spectroscopy with continuum fitting\ntechniques and analyse the data. In the Bayesian framework, we jointly\nconstrain the black hole's spin, mass, inclination, and distance within a\nunified framework. Employing nested sampling, we capture parameter degeneracies\nand rigorously propagate both statistical and systematic uncertainties. Our\nresults yield robust and precise spin measurements from both approaches. Our\nBayesian analysis fetches spin $a_*= 0.93_{-0.04}^{+0.05}$, mass $M_{\\rm BH} =\n9.0_{-2.0}^{+2.0} \\, M_\\odot$, distance $d_{\\rm BH} = 10.5_{-1.2}^{+1.3}$~kpc,\nand inclination angle $i=53.8_{-1.3}^{+1.3}$~deg. It also demonstrates the\npower of Bayesian inference in fetching valuable insights into the complex\nphysics of black hole accretion and enabling high-confidence measurements of\nfundamental parameters."}
{"id": "2509.09590", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.09590", "abs": "https://arxiv.org/abs/2509.09590", "authors": ["M. Yu. Kuznetsov", "N. A. Petrov", "Y. S. Savchenko"], "title": "Ultra-high energy event KM3-230213A as a cosmogenic neutrino in light of minimal UHECR flux models", "comment": "10 pages, 5 figures", "summary": "Recently, the KM3NeT experiment reported the detection of a neutrino with\nexceptionally high energy E = 220 PeV, whose origin remains unclear. The\ncorresponding value of the neutrino flux is in tension with the results of\nother high-energy neutrino experiments. In this study, we discuss the\npossibility that this neutrino is cosmogenic, i. e., produced by ultra-high\nenergy cosmic rays (UHECR) during their propagation through the intergalactic\nmedium. We adopt the UHECR flux models derived by the Telescope Array\nexperiment, which features a predominantly light mass composition. We show that\nthe predictions of the cosmogenic neutrino flux in these models are consistent\nwith the measurements of the KM3NeT-only and with that of the \"global neutrino\nobservatory\" at approximately 2${\\sigma}$ level. Notably, this result is\nachieved in a minimal version of the UHECR flux models, that assume one source\npopulation with a standard cosmological evolution. We also estimate the\ncorresponding cosmogenic gamma-ray flux and show that it is consistent with\nFermi-LAT IGRB measurements and UHE gamma-ray limits; the improvement of the\nlatter can probe these predictions in future."}
{"id": "2509.09605", "categories": ["astro-ph.HE", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2509.09605", "abs": "https://arxiv.org/abs/2509.09605", "authors": ["Sergio Belmonte Diaz", "Tinn Thingmeearkom", "Adipol Phosrisom", "Rene Breton", "Marta Burgay", "Colin Clark", "Lars Nieder", "Martin Mayer", "Werner Becker", "Ewann Barr", "Sarah Buchner", "Kaustav Kashyap Das", "Vik Dhillon", "Oliver Dodge", "Elizabeth Ferrara", "Jean-Mathias Griessmeier", "Ramesh Karuppusamy", "Mark Kennedy", "Michael Kramer", "Prajwal Padmanabh", "John Paice", "Antonio Rodriguez", "Ben Stappers"], "title": "Multiwavelength observations of a new black-widow millisecond pulsar PSR J1544-2555", "comment": "Accepted for publication in Monthly Notices of the Royal Astronomical\n  Society. 16 pages. 11 figures", "summary": "We report the discovery of a new black-widow millisecond pulsar, PSR\nJ1544-2555, associated with the Fermi-LAT source 4FGL J1544.2-2554. Optical,\nradio, and gamma-ray observations confirmed its nature as a compact spider\nbinary system. Optical photometry from ULTRACAM revealed a \\(\\sim\\)2.7-hour\norbital period, guiding MeerKAT observations that detected \\(\\sim\\)2.4-ms radio\npulsations. Subsequent timing campaigns using the Murriyang Parkes Telescope,\nthe Effelsberg 100-m Radio Telescope, and the Nan\\c{c}ay Radio Telescope\nallowed us to obtain a preliminary timing solution, which enabled us to find\ngamma-ray pulsations. The final timing solution, spanning 16 years of Fermi-LAT\ngamma-ray data, also displays orbital period variations typical of spider\npulsars. X-ray observations from eROSITA indicate non-thermal emission, but the\nrelatively low count rate prohibits the search for X-ray pulsations. Optical\nlight curve modelling using Icarus suggests the asymmetry is best explained by\na spot model, where uneven heating creates localised temperature variations on\nthe companion. While the optical spectra we obtained are compatible with the\nphysical properties we infer for the companion star, they were not of\nsufficient signal-to-noise to allow for radial velocity measurements, thus\nlimiting constraints on the neutron star's mass. The observed bluer colour near\nthe light curve minimum suggests possible non-thermal emission from\nintra-binary shocks, supported by the presence of an X-ray source. This\ndiscovery exemplifies the proven capability of the Fermi-LAT catalogue in\nidentifying millisecond pulsar candidates and highlights the role of optical\nsurveys in detecting variable sources suitable for radio follow-up."}
{"id": "2509.09609", "categories": ["astro-ph.HE", "astro-ph.CO", "hep-ph"], "pdf": "https://arxiv.org/pdf/2509.09609", "abs": "https://arxiv.org/abs/2509.09609", "authors": ["Manuel Rocamora", "Pedro De La Torre Luque", "Miguel A. Sánchez-Conde"], "title": "Constraints on Ultra-heavy DM from TeV-PeV gamma-ray diffuse measurements", "comment": "10 pages main text, with 8 figures and appendix with 4 figures.\n  Comments are welcome!", "summary": "Recent experiments have measured the Galactic $\\gamma$-ray diffuse emission\nup to PeV energies, opening a window to study acceleration of Galactic cosmic\nrays and their propagation up to the cosmic-ray knee. Furthermore, these\nobservations provide a powerful tool to set strong constraints into very-heavy\ndark matter particles, with masses in the TeV-PeV range. In this paper, we\nexplore the potential of the newest observations of diffuse emissions at the\nGalactic plane from HAWC and LHAASO to probe this kind of dark matter over a\nwide mass range. Here, we model secondary emissions (inverse-Compton) from the\nelectrons and positrons produced in the annihilation/decay of dark matter, on\ntop of their prompt $\\gamma$-ray emission, including the effects of absorption\nof high-energy photons via pair production. Furthermore, we show that including\nthe astrophysical backgrounds (namely diffuse emission from cosmic-ray\ncollisions or emission from unresolved sources) can significantly improve these\nlimits. We find that the new measurements provided, specially by LHAASO with\nthe combination of the WCDA and KM2A detectors, allow us to set strong\nconstraints in decaying dark matter, being competitive and even improving the\nstrongest constraints at the moment. We also highlight that these regions lead\nto constraints that are less affected by uncertainties from the dark matter\ndistribution and discuss how CTA north and SWGO will be able to improve limits\nin this mass range."}
{"id": "2509.09647", "categories": ["astro-ph.HE", "gr-qc"], "pdf": "https://arxiv.org/pdf/2509.09647", "abs": "https://arxiv.org/abs/2509.09647", "authors": ["V. Gayathri", "Giuliano Iorio", "Hiromichi Tagawa", "Daniel Wysocki", "Jeremiah Anglin", "Imre Bartos", "Shubhagata Bhaumik", "Zolt'an Haiman", "Michela Mapelli", "R. O'Shaughnessy", "LingQin Xue"], "title": "Reconstructing the origin of black hole mergers using sparse astrophysical models", "comment": "9 pages, 8 figures", "summary": "The astrophysical origin of binary black hole mergers discovered by LIGO and\nVirgo remains uncertain. Efforts to reconstruct the processes that lead to\nmergers typically rely on either astrophysical models with fixed parameters, or\ncontinuous analytical models that can be fit to observations. Given the\ncomplexity of astrophysical formation mechanisms, these methods typically\ncannot fully take into account model uncertainties, nor can they fully capture\nthe underlying processes. Here, we present a merger population analysis that\ncan take a discrete set of simulated model distributions as its input to\ninterpret observations. The analysis can take into account multiple formation\nscenarios as fractional contributors to the total set of observations, and can\nnaturally account for model uncertainties. We apply this technique to\ninvestigate the origin of black hole mergers observed by LIGO Virgo.\nSpecifically, we consider a model of AGN assisted black hole merger\ndistributions, exploring a range of AGN parameters along with several {{SEVN}}\npopulation synthesis models that vary in common envelope efficiency parameter\n($\\alpha$) and metallicity ($Z$). We estimate the posterior distributions for\nAGN+SEVN models using $87$ BBH detections from the $O1--O3$ observation runs.\nThe inferred total merger rate is $46.2 {Gpc}^{-3} {yr}^{-1}$, with the AGN\nsub-population contributing $21.2{Gpc}^{-3}{yr}^{-1}$ and the SEVN\nsub-population contributing $25.0 {Gpc}^{-3} {yr}^{-1}$."}
{"id": "2509.09328", "categories": ["astro-ph.IM", "astro-ph.HE", "hep-ph"], "pdf": "https://arxiv.org/pdf/2509.09328", "abs": "https://arxiv.org/abs/2509.09328", "authors": ["Steffen Hahn"], "title": "Reconstruction of the depth of the shower maximum of air showers with the SD-750 surface detector of the Pierre Auger Observatory using neural networks", "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC\n  2025). 8 pages, 4 figures", "summary": "The origin of ultra-high-energy cosmic rays (UHECRs) is one of the intriguing\nmysteries in astroparticle physics. In order to identify their sources, we need\nprecise knowledge of the mass composition of UHECRs. The direct detection of\nUHECRs is not feasible at energies above 0.1 PeV, necessitating the use of\nmass-sensitive observables of extended air showers induced by UHECRs\ninteracting with the atmosphere. One way to achieve high statistics for these\nmass-sensitive observables is to use ground-based detector arrays, such as the\nSurface Detector (SD) of the Pierre Auger Observatory. The SD consists of three\nsub-arrays of independent detector stations arranged in triangular grids with\ndifferent spacings. Recently, it has been shown that neural networks (NNs) can\nextract mass-sensitive observables from data taken by the SD-1500, the largest\nsub-detector of the SD. In this contribution, we demonstrate the feasibility of\nusing NNs to reconstruct a high-level shower observable, the depth of the\nshower maximum, from data simulated for and observed by the SD-750, the\nsecond-largest detector array nested within the SD-1500. A simulation study\nshows that the SD-750 NN exhibits behavior similar to that of an SD-1500 NN and\noutperforms the latter in the energy range [1, 10) EeV. Moreover, we show that,\nafter performing a correction and calibration procedure, the predictions of the\nSD-750 NN are consistent with the measurement of the depth of the shower\nmaximum obtained by the Fluorescence Detector of the Pierre Auger Observatory."}
