{"id": "2512.17994", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.17994", "abs": "https://arxiv.org/abs/2512.17994", "authors": ["Yutaka Fujita", "Rohta Takahashi", "Norita Kawanaka"], "title": "Diffusive or Ballistic? Distributions and Spectra of PeV Cosmic Rays around Microquasars", "comment": "6 pages, 3 figures", "summary": "In the standard Galactic cosmic-ray (CR) paradigm, protons are accelerated up to ~1 PeV by Galactic sources. While supernova remnants (SNRs) have been traditionally considered as the primary accelerators, recent observations by LHAASO and HAWC have detected very-high-energy (VHE) gamma rays exceeding 100 TeV from several microquasars, suggesting that these X-ray binaries can accelerate CRs beyond 1 PeV. We investigate the escape process of CRs from microquasars, focusing on the energy-dependent transport mechanisms. High-energy CRs are likely to have long mean free paths and move ballistically on scales smaller than their mean free path, while lower-energy CRs undergo diffusive propagation. This transition results in a spectral break in the CR distribution around the microquasar. We calculate CR energy spectra within a 10-30 pc radius for various diffusion coefficients and timescales. Our model predicts a spectral break and hardening at E_p ~10-100 TeV when the standard diffusion coefficient for the interstellar space is assumed. However, current VHE gamma-ray observations do not show clear spectral breaks, suggesting that the diffusion coefficient may be significantly reduced near microquasars, possibly due to magnetic field amplification by CR-driven turbulence."}
{"id": "2512.17997", "categories": ["astro-ph.HE", "astro-ph.GA", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2512.17997", "abs": "https://arxiv.org/abs/2512.17997", "authors": ["Matteo Cantiello", "Jake B. Hassan", "Rosalba Perna", "Philip J. Armitage", "Mitchell C. Begelman", "Yan-Fei Jiang", "Taeho Ryu", "Richard H. D. Townsend"], "title": "Pulsational Instability of Quasi-Stars: Interpreting the Variability of Little Red Dots", "comment": "11 pages, 6 figures, submitted to ApJL", "summary": "The JWST discovery of \"Little Red Dots\" (LRDs) has revealed a population of compact, red sources at $z \\sim 5-10$ that likely host supermassive black holes (SMBHs). Recent observations of the gravitationally lensed LRD R2211-RX1 reveal century-scale photometric variability and a hysteresis loop in the luminosity-temperature plane, strongly suggesting that the optical emission originates from a pulsating, stellar-like photosphere rather than an accretion disk. This supports the \"quasi-star\" hypothesis, where a rapidly growing black hole seed is embedded within a massive, radiation-pressure supported envelope. In this work, we investigate the stability of these envelopes using the stellar evolution code MESA coupled with the non-adiabatic oscillation code GYRE. We identify a theoretical \"Quasi-Star Instability Strip\" with a blue edge at $T_{\\mathrm{eff}} \\approx 5000-5200$ K. Models hotter than this threshold are stable, consistent with the non-variable LRD R2211-RX2 ($T_{\\mathrm{eff}} \\approx 5000$ K), while cooler models are unstable to radial pulsations driven by the $κ$-mechanism in helium and hydrogen ionization zones. For quasi-star masses in the range $M_\\star \\sim 10^4-10^5 M_\\odot$, we find that the unstable fundamental radial modes ($\\ell =0$, n$_{\\rm p}=1$) have periods in the range $\\sim 20-180$ years. The first overtone ($\\ell =0$, n$_{\\rm p}=2$) is also unstable or marginally stable in some of our models, with typical pulsation timescales $\\sim 10-30$ years. These oscillations match the co-moving frame variability timescale of RX1. We argue that these violent pulsations likely drive enhanced mass loss analogous to super-AGB winds, which could affect the duration of the quasi-star phase and regulate the final mass of the seeded black hole."}
{"id": "2512.18044", "categories": ["astro-ph.HE", "hep-ph", "nucl-th"], "pdf": "https://arxiv.org/pdf/2512.18044", "abs": "https://arxiv.org/abs/2512.18044", "authors": ["Tyler Gorda", "Oleg Komoltsev", "Aleksi Kurkela", "Eirik Sunde"], "title": "Constrained Brownian-bridge prior for neutron-star equation-of-state inference", "comment": "17 pages, 9 figures", "summary": "We set forth a new method for generating model-agnostic, nonparametric priors for neutron star equation-of-state inference that are stable, causal and thermodynamically consistent by construction. This generalizes Gaussian processes to include global thermodynamic constraints, specifically allowing the inclusion of any number of training points in the form $(μ, n, p)$ while retaining thermodynamic consistency between them. The method is based on constructing constrained Brownian bridges, whose correlation properties can be tuned at will allowing flexibility between a conservative prior and a theory-informed prior. The method does not require any shooting to obey multiple constraints and provides an efficient and informed way to include both chiral effective field theory and perturbative quantum chromodynamics constraints within the same framework."}
{"id": "2512.18323", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.18323", "abs": "https://arxiv.org/abs/2512.18323", "authors": ["V. I. Berezhiani", "N. L. Shatashvili", "A. G. Tevzadze"], "title": "On Lorentz Variability of Magnetically Dominated Relativistic Outflows", "comment": "4 pages, 1 figure", "summary": "In this Letter, we show that magnetized relativistic outflows can exhibit a relativistic effect in which Lorentz transformation maps magnetic field topology into apparent temporal variability in the observer's frame. Using a force-free Beltrami configurations as representative equilibria of magnetically dominated outflows, we demonstrate that Lorentz mapping of stationary helical magnetic field produces quasi-periodic modulation of observable electromagnetic signatures, without invoking intrinsic plasma variability. This effect may be described as an aberration of force-free magnetic fields under Lorentz transformation. The characteristic frequency of the time variability is determined by the helical wave-number of the magnetic field, the viewing angle, and the bulk Lorentz factor of the jet outflow, and scales linearly with $Γ$. This establishes a purely kinematic relativistic origin of variability and introduces the concept of magnetic Lorentz seismology: the inference of magnetic field structure in relativistic outflows directly from observed temporal variability."}
{"id": "2512.17975", "categories": ["astro-ph.IM", "astro-ph.HE", "gr-qc"], "pdf": "https://arxiv.org/pdf/2512.17975", "abs": "https://arxiv.org/abs/2512.17975", "authors": ["Matthew VanDyke", "Kexuan Wu", "Sukanta Bose"], "title": "CoBiTS: Single-detector discrimination of binary black hole signals from glitches using deep learning", "comment": "22 pages, 13 figures", "summary": "We develop a Conformer neural network, called Conformer Binary neTwork Search, or CoBiTS, for distinguishing binary black hole (BBH) gravitational wave (GW) signals from non-Gaussian and non-stationary noise artifacts in the data from current generation LIGO-Virgo-KAGRA detectors. A large subset of these transient noise artifacts, termed as ``glitches'' for short, trigger BBH search templates. Some of them go on to produce detection candidates and require human vetting, supported by data quality tools, to be correctly identified and vetoed. In its current version, CoBiTS takes as inputs single-detector strain timeseries snippets, claimed by other search pipelines to be containing GW candidates, and outputs the significance of each snippet to contain a BBH signal and a glitch. CoBiTS is shown to be particularly effective in discriminating high-mass BBH signals from blips and scattered light glitches, even when a signal is near concurrent or overlapping with a glitch. The performance of CoBiTS gains from employing Conformer, which is a specialized model that combines convolutional layers and Transformer architecture for sequence modeling tasks. Conformer is especially good at leveraging the strengths of both convolutional layers -- for local feature extraction -- and self-attention layers -- for capturing long-range dependencies."}
{"id": "2512.18401", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.18401", "abs": "https://arxiv.org/abs/2512.18401", "authors": ["The LHAASO collabration"], "title": "Energy-Dependent Shifts of Medium-Scale Anisotropies in Very-High-Energy Cosmic Rays Observed by LHAASO-KM2A", "comment": null, "summary": "Small deviations from isotropy in the arrival directions of Galactic cosmic rays serve as a unique probe of the local magnetic environment. In this Letter, we report observations of medium-scale anisotropies (MSA) at energies above 10 TeV using the LHAASO-KM2A array. Our analysis identifies four regions of excess and four regions of deficit, each spanning angular scales of approximately ten degrees. Crucially, we detect significant energy-dependent shifts in the centroids of two excess regions: Region B and the newly identified Region $\\mathrm{\\widetilde{D}}$. We also characterize the energy evolution of the fractional relative intensity across both excess and deficit regions. These findings imply that the observed anisotropies are shaped by the specific realization of the local turbulent magnetic field within the cosmic ray scattering length. Such energy-dependent behaviors impose strict constraints on local turbulence models and cosmic ray propagation theories."}
{"id": "2512.17976", "categories": ["astro-ph.IM", "astro-ph.EP", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2512.17976", "abs": "https://arxiv.org/abs/2512.17976", "authors": ["Akke Corporaal", "Toon De Prins", "Léa Planquart", "Kateryna Andrych", "Narsireddy Anugu", "Devika Kamath", "Jens Kammerer", "Stefan Kraus", "Fonteini Lykou", "Alexis Matter", "Claudia Paladini", "Marie M. Rodríguez S.", "Hans Van Winckel"], "title": "Bridging stellar evolution and planet formation: from birth, to survivors of the fittest, to the second generation of planets", "comment": "Science white paper submitted in the context of ESO's Expanding Horizons call", "summary": "Stars and planets form, live, and evolve in unison. Throughout the life of a star, dusty circumstellar discs and stellar outflows influence the further evolution of both the star(s) and their orbiting planet(s). Planet-forming discs, winds of red giant branch (RGB) or asymptotic giant branch (AGB) stars, and post-RGB/post-AGB discs are examples of such host environments where dust physics plays a key role. The physical processes that occur during each of these stages establishes how the Solar System as well as exoplanetary systems were formed, are evolving, and will eventually die. This White Paper aims to bridge the fields of stellar evolution and planet formation by peering into the dust kinematics and macrostructure formation, and its effect on planet-host interaction, in dusty environments from stellar birth to death. Near-future advancements in the 2030s will enable the detection, orbital monitoring and atmospheric/mineralogical characterisation of close-in (proto)planets across diverse stages of stellar evolution. To take full advantage of these developments by the 2040s, we should develop the capabilities required to image the varied dusty environments in which planets are entrained over their lifetime. This will enable extensive testing of current theoretical understandings - from the micro-scales of dust assembly to the deeply interlinked macro-scales of planet-host interactions - across diverse settings often too small, distant, and faint to be resolved in the next decade, simultaneously providing valuable constraints on the two-way interplay of dusty host environments and planetary formation/evolution."}
{"id": "2512.18543", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.18543", "abs": "https://arxiv.org/abs/2512.18543", "authors": ["Nikita Kosogorov", "Gregg Hallinan", "Casey Law", "Jack Hickish", "Jayce Dowell", "Kunal P. Mooley", "Marin M. Anderson", "Judd D. Bowman", "Ruby Byrne", "Morgan Catha", "Bin Chen", "Xingyao Chen", "Sherry Chhabra", "Larry D'Addario", "Ivey Davis", "Katherine Elder", "Dale Gary", "Charlie Harnach", "Greg Hellbourg", "Rick Hobbs", "David Hodge", "Mark Hodges", "Yuping Huang", "Andrea Isella", "Daniel C. Jacobs", "Ghislain Kemby", "John T. Klinefelter", "Matthew Kolopanis", "James Lamb", "Nivedita Mahesh", "Surajit Mondal", "Brian O'Donnell", "Kathryn Plant", "Corey Posner", "Travis Powell", "Vinand Prayag", "Andres Rizo", "Andrew Romero-Wolf", "Jun Shi", "Greg Taylor", "Jordan Trim", "Mike Virgin", "Akshatha Vydula", "Sandy Weinreb", "Scott White", "David Woody", "Sijie Yu", "Thomas Zentmeyer", "Peijin Zhang"], "title": "Searches for Prompt Low-Frequency Radio Counterparts to Gravitational Wave Event S250206dm with the OVRO-LWA Time Machine", "comment": "Accepted for publication in The Astrophysical Journal (ApJ). 19 pages, 6 figures", "summary": "We report on a search for prompt, low-frequency radio emission from the gravitational-wave (GW) merger S250206dm using the Owens Valley Radio Observatory Long Wavelength Array (OVRO-LWA). Early alerts favored a neutron-star-containing merger, making this a compelling target. Motivated by theoretical predictions of coherent radio bursts from mergers involving a neutron star, we utilized the OVRO-LWA Time Machine system to analyze voltage data recorded around the time of the event. The Time Machine is a two-stage voltage buffer and processing pipeline that continuously buffers raw data from all antennas across the array's nearly full-hemisphere instantaneous field of view, enabling retrospective beamforming, dedispersion, and fast-transient candidate identification. For this event, we analyzed a 30-minute interval beginning 3.5 minutes after the merger, which included two minutes of pre-alert data recovered by the ring buffer. We searched the 50% localization probability region with millisecond time resolution in the 69-86 MHz frequency band. No radio counterpart was detected above a 7-sigma fluence detection threshold of ~150 Jy ms. Using Bayesian analysis, we place a 95% confidence upper limit on the source luminosity of L95 = 4 x 10^41 erg s^-1. These constraints start to probe the bright end of the coherent-emission parameter space predicted by jet-ISM shock processes, magnetar and blitzar-like mechanisms, and recent simulation-based scenarios for neutron-star-containing mergers. This study presents the first sensitive, large-area, millisecond-timescale search for prompt low-frequency radio emission from a GW merger with the OVRO-LWA, establishing a framework in which about ten additional events will yield stringent population-level constraints."}
{"id": "2512.18015", "categories": ["astro-ph.IM", "physics.soc-ph"], "pdf": "https://arxiv.org/pdf/2512.18015", "abs": "https://arxiv.org/abs/2512.18015", "authors": ["Joyful E. Mdhluli"], "title": "Monitoring and Evaluating Astronomy-for-Development Initiatives", "comment": "8 pages, 1 figure", "summary": "This paper serves as a practical guide for individuals and organisations seeking to design, implement, and evaluate astronomy-for-development initiatives, as well as those preparing proposals for the International Astronomical Union's Office of Astronomy for Development (IAU OAD) annual Call for Proposals. The paper aims to outline how systematic evidence collection can strengthen project design, enhance accountability, and increase the likelihood of measurable impact. It explains the distinction between monitoring and evaluation, provides guidance on when and how evaluation should be undertaken, and summarises key evaluation types - process, feasibility, impact, outcome, economic, and summative, relevant to astronomy-based interventions. In addition to conceptual discussion, the paper presents a set of practical steps, reflective questions, and examples to help project teams develop a clear theory of change, define appropriate indicators, and anticipate risks and unintended consequences. By contextualising M&E within the broader goals of the OAD and the Sustainable Development Goals (SDGs), this work aims to empower practitioners to create evidence-informed, community-driven, and sustainable astronomy-for-development projects that deliver both local and global benefit."}
{"id": "2512.18786", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.18786", "abs": "https://arxiv.org/abs/2512.18786", "authors": ["M. Kachelriess", "E. Lammert"], "title": "Addendum to \"Cygnus~X-3 as a semi-hidden PeVatron'' discussing the LHAASO 2025 data", "comment": "3p addendum to arXiv:2503.11448 [astro-ph.HE]", "summary": "In a recent work, we have argued that the high-mass X-ray binary Cygnus~X-3 can accelerate cosmic rays (CR) beyond PeV energies. Meanwhile, the LHAASO collaboration published the measurement of an orbitally modulated photon flux from Cygnus~X-3 extending up to 4 PeV. These observations point towards CR acceleration in the jet, and secondary production in CRs scattering on gas from the wind and on stellar UV photons from the companion star. The latter channel leads naturally to a contribution to the photon flux peaking around PeV energies which is orbitally modulated."}
{"id": "2512.18039", "categories": ["astro-ph.IM", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2512.18039", "abs": "https://arxiv.org/abs/2512.18039", "authors": ["J. de la Cruz Rodríguez", "G. B. Scharmer", "P. Sütterlin", "J. Leenaarts", "M. G. Löfdahl", "D. Kiselman", "T. Hillberg", "O. Andriienko"], "title": "Characterization of telecentric dual-etalon Fabry-Pérot systems from observational data. Properties of the CRISP2 instrument at the Swedish 1-m Solar Telescope", "comment": "submitted to A&A", "summary": "Imaging Fabry-Pérot Interferometer (FPI) observations are commonly used in solar physics to infer physical parameters in the photosphere and chromosphere through modeling of the observations. Such techniques require detailed knowledge of the spectral instrumental profile in order to produce accurate results. We present a method to characterize the spatial variation of parameters of dual-etalon FPI instruments mounted in telecentric configuration: spatially-resolved cavity separation and reflectivities of both etalons, and the prefilter variation across the field-of-view. We aim at characterizing the field-of-view dependence of the parameters of the new CRISP2 FPI. We have implemented a forward model of the FPI instrumental degradation combined with a template average quiet-Sun spectra at disk center in order to model two sets of observational data. Our method does not require any change in the optical setup or the utilization of external sources of illumination. We assess the validity of several functional forms in the calculation of the FPI transmission profiles. Our results show that (generally) the inclusion of the secondary transmission peaks at 1 times the Free Spectral Range and a detailed estimate of the prefilter curve is necessary to obtain accurate values of both etalon reflectivities. For narrow prefilters (relative to the FSR), the former requirement can be relaxed. Our results show that the cavity separation of CRISP2 is very flat, showing an RMS variation below 1.9 nm over the entire field-of-view for both etalons. Reflectivity RMS variations are 0.4% and 0.3% for the primary and secondary etalons at 617.3 nm. We have assessed data and modeling requirements in order to derive accurate FPI parameters and minimize errors in the determination of etalon reflectivities."}
{"id": "2512.18794", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.18794", "abs": "https://arxiv.org/abs/2512.18794", "authors": ["Andrea Gokus", "Rebecca Phillipson"], "title": "Recurrence plot analysis of blazar gamma-ray light curves: Exploiting the time-domain capabilities of Fermi-LAT", "comment": "Proceedings of the 8th Heidelberg International Symposium on High-Energy Gamma-ray Astronomy, in review with \"Memorie della Società Astronomica Italiana\" (MemSAIt)", "summary": "Variability studies of jetted AGN, in particular blazars, have been used to gain a better understanding of the particle acceleration mechanisms in jets. However, statistical methods used for the characterization of variability often rely on stationary time series data, which is not fulfilled for most blazar light curves. We introduce the recurrence plot method for long-term $γ$-ray light curves sampled by Fermi-LAT and present our results for the BL Lac object Mkn 421 and the FSRQ PKS 1424-41. Using surrogates to determine the significance of our findings, we conclude that Mkn 421 exhibits more determinism than PKS 1424-41, and that both sources potentially show nonlinearity. However, the latter has to be tested against more advanced surrogates that are able to replicate the nonstationarity of the original light curves. In future work, we will extend our recurrence analysis to a sample of $\\sim50$ $γ$-ray bright sources to probe the jet dynamics of different blazar classes."}
{"id": "2512.18047", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2512.18047", "abs": "https://arxiv.org/abs/2512.18047", "authors": ["Annagrazia Puglisi", "Amelia Bayo", "Laurane Freour", "Daniela Iglesias", "Akhil Krishna", "Fatemeh Zahra Majidi", "Umberto Rescigno", "Sabine Thater", "Laurence Tresse", "Tanya Urrutia"], "title": "Designing the Community Infrastructure for ESO's Next Transformational Facility. Equitable Governance and Sustainable Teams for 2040s Astronomy", "comment": "Submitted to the ESO Expanding Horizons initiative and posted on arXiv to encourage community discussion. Comments are welcome via email; voluntary endorsement of the general principles may be expressed via this google form: https://docs.google.com/forms/d/e/1FAIpQLSc6B-7kSdwb7v4eyi5zRAVbgUZ3Y43dpPrTCNfPHff6Hm4PWg/viewform", "summary": "The scientific ambitions of the 2040s will require large, interdisciplinary teams operating across continents, institutions, and increasingly heterogeneous political and funding landscapes. While significant effort is devoted to advancing the technical capabilities of future astronomical facilities, frameworks for coordinating and sustaining the associated community systems are often developed in parallel rather than embedded as coherent, long-term structures at the scale needed to fully realise this ambition. In this white paper, submitted as part of the ESO Expanding Horizons initiative, we draw on experience from established observatories and emerging collaborations to identify key community-level challenges. We argue that a central and transversal scientific challenge for the 2040s is to operate a flagship observatory in which access to telescope time, data, leadership, training, and career development is equitable across institutions, member states, and beyond. We propose that access and participation be treated as integral design parameters, embedded from the conceptual stage and sustained throughout the facility lifecycle, in order to ensure long-term scientific excellence, sustainability, and societal return."}
{"id": "2512.18839", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.18839", "abs": "https://arxiv.org/abs/2512.18839", "authors": ["Emmi Meyer-Hofmeister", "Yilong Wang", "B. F. Liu"], "title": "Accretion geometry in neutron star low-mass X-ray binaries during the hard spectral state", "comment": "8 pages, 5 figures; Accepted for publication in MNRAS", "summary": "We investigate the accretion geometry in neutron star low-mass X-ray binaries (LMXBs) in the hard spectral state. It is commonly accepted that, for low mass transfer rates, an advection-dominated accretion flow (ADAF) is present in the inner region. But the observed relativistically broadened emission lines in the reflection spectra clearly indicate the existence of discs near the innermost stable circular orbit $(R_{\\rm{ISCO}})$. We investigate the interaction between the coronal flow and the disc in neutron star LMXBs, and find that gas condensation from the dominant, coronal accretion flow to an inner disc is enhanced as compared to that in black hole LMXBs as a consequence of irradiation of the corona by the neutron star surface. Computations show that for low mass transfer rates ($\\sim 0.005-0.02$ Eddington rate) a persistent weak disc can coexist with a coronal flow in the innermost region, where a pure ADAF would have been expected. The inner disc extends outwards from $R_{\\rm{ISCO}}$ to $\\sim 10 R_{\\rm{ISCO}}$ for Eddington ratios ($L/L_{\\rm{Edd}}$) as low as $\\sim 0.002$, covers a larger region for higher Eddington ratios, and eventually connects to the outer disc at $L/L_{\\rm{Edd}} \\sim 0.02$, thereby transiting to a soft state. We demonstrate that the observationally inferred region of the broad iron lines in the hard-state sources generally lies within the extension of the inner discs predicted by the condensation model. Disappearance of the broad iron lines is predicted at very low luminosities, either caused by very low accretion rates or disc truncation by strong magnetic fields."}
{"id": "2512.18101", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2512.18101", "abs": "https://arxiv.org/abs/2512.18101", "authors": ["Richard A. Shaw", "Jenny L. Novacescu", "Sarah Weissman", "Travis A. Berger", "Clara E. Brasseur", "Jeff Chamblee", "Brian Cherinka", "Zachary R. Claytor", "Theresa Dower", "Chinwe Edeani", "Scott W. Fleming", "Jonathan R. Hargis", "Julie Imig", "Tim Januario", "Karen Levay", "Tim Kimball", "Jenn Kotler", "Hannah M. Lewis", "Steve Lubow", "Adrian Lucy", "Brian McLean", "Sunita G. Malla", "Jacob Matuskey", "Sophie J. Miller", "Susan E. Mullally", "Claire E. Murray", "J. E. G. Peek", "Carlita Phillip", "Marc Rafelski", "David R. Rodriguez", "Gregory F. Snyder", "Achu J. Usha", "Richard L. White", "Jinmi Yoon"], "title": "The Impact of the MAST Data Archive", "comment": "26 pages, 14 figures, 5 tables. To be published in PASP", "summary": "The Barbara A. Mikulski Archive for Space Telescopes (MAST) hosts science-ready data products from over twenty NASA missions, plus community-contributed data collections, and other select surveys. The data support forefront research in the ultraviolet, optical, and near-infrared wavelength bands. We have constructed bibliographies for each mission from publications in nearly 40 professional journals, and have identified more than 37,000 refereed articles where investigators made a science usage of data hosted in MAST. The publication rate over the last 50 years shows that most MAST missions have had very high productivity during their in-service lifetimes, and have remained so for years or decades afterward. Annual citations to these publications, a measure of impact on research, are robust for most missions, with citations that grow over more than a decade. Most of the citations come from about 10% of articles within each mission.\n  We examined the bibliographies of the active missions HST and JWST in greater detail. For HST the rate of archival publications exceeded those authored by the original observing teams within a decade of launch, and is now more than 3 times higher. Early indications hint that JWST archival articles could dominate the publication rate even sooner. The production of articles resulting from any given observing program can extend for decades. Programs with small and very large allocations of observing time tend to be particularly productive per unit of observing time. For HST in general, a first publication appears within 1.5 yr for 50% of observing programs, and within 3.8 yr for 80% of programs. We discuss various external factors that affect publication metrics, their strengths and limitations for measuring scientific impact, and the challenges of making meaningful comparisons of publication metrics across missions."}
{"id": "2512.19056", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.19056", "abs": "https://arxiv.org/abs/2512.19056", "authors": ["Shunshun Cao", "Yanjun Guo", "Jinchen Jiang", "Kejia Lee", "Weiyang Wang", "Renxin Xu"], "title": "On the Diversity of Pulsar's Frequency-Dependent Circular Polarization", "comment": "16 pages, 9 figures, submitted to ApJL", "summary": "The nature of coherent radio emission is still challenging even after more than half a century of pulsar discovery, but it is generally a consensus that single-pulse observations are essential for probing the magnetospheric dynamics, especially with the largest single-dish telescope FAST (Five-hundred-meter Aperture Spherical radio Telescope). The frequency-dependent circular polarization of single pulses, with high signal-to-noise ratios, is recorded by the FAST, which shows great diversity, and we are trying an effort to understand such circular polarization based on the wave mode coupling in the limiting polarization region, and consequently to constrain the dynamical parameters. By quantitatively comparing models with data using Bayesian analysis, it is found that the plasma multiplicity is approximately between $10^0$ and $10^{2}$, while the Lorentz factor of the particles between $10^{0.5}$ and $10^{2}$. This study presents a systematic framework for integrating pulsar emission theories with observational data."}
{"id": "2512.18157", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2512.18157", "abs": "https://arxiv.org/abs/2512.18157", "authors": ["Massimo Della Valle", "Maria Teresa Botticella", "Enrico Cappellaro", "Roberto Ragazzoni", "Matteo Aliverti", "Carmelo Arcidiacono", "Lorenzo Amati", "Andrea Baruffolo", "Maria Grazia Bernardini", "Giovanni Boato", "Fabrizio Bocchino", "Francesco Borsa", "Mohamed Yahia Bournane", "Enzo Brocato", "Giovanni Bruno", "Paolo D'Avanzo", "Nancy Elias-Rosa", "Silvio Di Rosa", "Diego Farias", "Jacopo Farinato", "Davide Greggio", "Adriano Ingallinera", "Luca Izzo", "Marco Limongi", "Demetrio Magrin", "Marco Marongiu", "Andrea Melandri", "Giusi Micela", "Matteo Murgia", "Valerio Nascimbeni", "Salvatore Orlando", "Antonino Petralia", "Vincenzo Petrecca", "Maura Pilia", "Silvia Piranomonte", "Andrea Possenti", "Kalyan Radhakrishnan", "Oleksandra Rebrysh", "Simone Riggi", "Irene Salmaso", "Giovanni Scandariato", "Corrado Trigilio", "Simone Zaggia"], "title": "Continuous Wide-Field Optical Monitoring for Very Early-Phase Transient Discovery", "comment": "Submitted in response to the call for White Papers for the definition of the ESO next transformational facility. https://next.eso.org/. 6 pages", "summary": "The study of transient phenomena in a multimessenger context is expected to remain a major pillar of astrophysical discovery in the decades ahead. Supernovae, Kilonovae, Black-Hole formation, Novae, GRBs, and tidal disruption events are prime examples, as their earliest phases link electromagnetic radiation to gravitational waves, neutrinos, and high-energy emission. Yet, the physics connecting these messengers unfolds within minutes to hours, while traditional surveys revisit the same region of the sky on the scale of days/weeks, missing when the event begins. Current survey facilities excel at answering what happened and how often, but essentially fail in addressing how it happened and how it couples to gravitational waves, neutrinos, or high-energy emission. Continuous wide-area optical monitoring, as proposed here, removes this limitation. The traditional approach, where a GW or neutrino alert triggers electromagnetic follow-up, is now complemented, and sometimes reversed: early electromagnetic discoveries can prompt searches for weaker gravitational waves or neutrino signals that would otherwise be missed. In the Einstein Telescope era, wide-field optical monitoring will allow us to find the optical counterparts of gravitational-wave events and understand their physics. At the same time, a telescope capable of continuous monitoring provides immediate scientific value for planetary defense, space-debris tracking, stellar variability, exoplanets transit monitoring, accretion-driven activity, and when we step into a new observational territory, the true discoveries are often the ones we did not expect. In this vision, continuous time-domain astronomy does not replace classical surveys: it completes them by supplying the missing temporal dimension. Follow-up observations remain essential, but they now begin at the physical onset of the event rather than after its evolution is underway."}
{"id": "2512.19101", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.19101", "abs": "https://arxiv.org/abs/2512.19101", "authors": ["Ryota Hatami", "Nozomu Tominaga", "Takashi Yoshida", "Hideyuki Umeda", "Tomoya Takiwaki"], "title": "Physical Conditions for Synthesis of Sc, Ti, and V in Neutrino-driven Supernovae", "comment": "10 pages, 4 figures, Accepted for publication in ApJ", "summary": "We present the results of simulations of nucleosynthesis in a core-collapse supernova (CCSN) including the neutrino process. Using the Si layer of $13M_\\odot$ zero-metal progenitor as the initial composition, we calculate the nucleosynthesis by adopting the temperature, density, neutrino flux, and duration of nucleosynthesis as arbitrary parameters and compare the results with the observed abundances ratio of Sc, Ti, and V in very metal-poor (VMP) stars taken from the Stellar Abundances for Galactic Archaeology (SAGA) database. As a result, for the first time, we identify the quantitative requirements on local physical conditions. To reproduce the abundances ratios in the VMP stars, the explosive nucleosynthesis should take place under the neutrino exposure, which is time integration of neutrino flux, of $σ_ν\\sim 10^{35}\\,\\mathrm{erg~cm^{-2}}$ and temperature of $2.0\\,\\mathrm{GK}\\leq T \\leq 3.2\\,\\mathrm{GK}$. The dependence on the density and each value of the neutrino flux and the duration of nucleosynthesis is weak. We also discuss whether the quantitative requirements are realized during the explosion. Although the requirements are difficult to be realized in the one-dimensional simulations, the non-monotonic thermal evolution shown in recent three-dimensional simulations may satisfy them. Because the evolution is likely caused by turbulent motion stemming from the initial asphericity of the progenitor, it is important to calculate the long-term three-dimensional supernova explosion of multi-dimensional metal-free progenitor models and follow the nucleosynthesis self-consistently."}
{"id": "2512.18205", "categories": ["astro-ph.IM", "astro-ph.EP", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2512.18205", "abs": "https://arxiv.org/abs/2512.18205", "authors": ["Amna Ejaz", "Sarah Dodson-Robinson", "Charlotte Haley"], "title": "Red noise-based false alarm thresholds for astrophysical periodograms via Whittle's approximation to the likelihood", "comment": null, "summary": "Astronomers who search for periodic signals using Lomb-Scargle periodograms rely on false alarm level (FAL) estimates to identify statistically significant peaks. Although FALs are often calculated from white noise models, many astronomical time series suffer from red noise. Prewhitening is a statistical technique in which a continuum model is subtracted from log power spectrum estimate, after which the observer can proceed with a white-noise treatment. Here we present a prewhitening-based method of calculating frequency-dependent FALs. We fit power laws and autoregressive models of order 1 to each Lomb-Scargle periodogram by minimizing the Whittle approximation to the negative log-likelihood (NLL), then calculate FALs based on the best-fit model power spectrum. Our technique is a novel extension of the Whittle NLL to datasets with uneven time sampling. We demonstrate FAL calculations using observations of $α$~Cen~B, GJ~581, HD 192310, synthetic data from the radial velocity (RV) Fitting Challenge, and {\\it Kepler} observations of a differential rotator. The {\\it Kepler} data analysis shows that only true rotation signals are detected by red-noise FALs, while white-noise FALs suggest all spurious peaks in the low-frequency range are significant. A high-frequency sinusoid injected into $α$~Cen~B $\\log R^{\\prime}_{HK}$ observations exceeds the 1\\% red-noise FAL despite having only 8.9\\% of the power of the dominant rotation signal. In a periodogram of HD 192310 RVs, peaks associated with differential rotation and planets are detected against the 5\\% red-noise FAL without iterative model fitting or subtraction. Software for calculating red noise-based FALs is available on GitHub."}
{"id": "2512.19193", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.19193", "abs": "https://arxiv.org/abs/2512.19193", "authors": ["Fabrizio Tavecchio", "Dawoon E. Kim", "Gabriel Emery", "Ioannis Liodakis", "Iván Agudo", "Paolo Coppi", "Giampiero Tagliaferri", "Laura Di Gesu", "Tullia Sbarrato", "Lucia Ballo", "Alberto Sciaccaluga", "Steven R. Ehlert", "Giacomo Bonnoli", "Francisco José Aceituno", "Carolina Casadio", "Víctor Casanova", "Immacolata Donnarumma", "Juan Escudero", "Daniel Morcuende", "Jorge Otero-Santos", "Alfredo Sota", "Vilppu Piirola", "Pouya M. Kouch", "Elina Lindfors", "Kari Nilsson", "Ioannis Myserlis", "Mark Gurwell", "Garrett Keating", "Ramprasad Rao", "Emmanouil Angelakis", "Alexander Kraus", "Ryo Imazawa", "Mahito Sasada", "Yasushi Fukazawa", "Koji S. Kawabata", "Makoto Uemura", "Tsunefumi Mizuno", "Tatsuya Nakaoka", "Sumie Tochihara", "Takahiro Akai", "Hiroshi Akitaya", "Rumen Bachev", "Anton Strigachev", "Petra Benke", "Lena Debbrecht", "Julia Eich", "Florian Eppel", "Andrea Gokus", "Steven Hämmerich", "Jonas Heßdörfer", "Matthias Kadler", "Sanghyun Kim", "Dana Kirchner", "Georgios Filippos Paraschos", "Florian Rösch", "Wladislaw Schulga"], "title": "The IXPE and multifrequency polarimetric view of the extreme blazars 1ES 1101-232 and RGB J0710+591", "comment": "11 pages, submitted to A&A", "summary": "Multiwavelength polarimetry is a powerful tool to probe magnetic field and flow geometries in the relativistic jets of blazars. In this respect, particularly interesting are the sources whose synchrotron emission covers a broad range of frequencies, from radio to X-rays, such as the BL Lac objects of the HSP type. Previous measurements including radio, optical and X-ray data show a clear trend, with the degree of polarization increasing with frequency. Here we report radio, optical and X-ray observations ($Swift$, $Nustar$ and $IXPE$) of 1ES 1101-232 and RGB J0710+591, two blazars belonging to the puzzling subclass of extreme BL Lacs (EHBL). For 1ES 1101-232 we found a strong frequency-dependency of the degree of polarization (with a ratio $Π_X/Π_O\\simeq 5.2$). For RGB J0710+591, IXPE derived a 1$σ$ upper limit $Π_X<11.6\\%$, comparable with the measured optical degree of polarization (average $Π_O\\sim 12\\%$). We discuss the results in the framework of current interpretations and, in particular, we report an improved version of the stratified shock model that is able to reproduce the observed data of both sources."}
{"id": "2512.18260", "categories": ["astro-ph.IM", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2512.18260", "abs": "https://arxiv.org/abs/2512.18260", "authors": ["Crescenzo Tortora", "Daniela Carollo", "Leslie Hunt", "Francine Marleau", "Rossella Ragusa", "Teymoor Saifollahi", "Fernando Buitrago", "Michele Cantiello", "Christopher Conselice", "Francesco De Paolis", "Sven De Rijcke", "Pierre-Alain Duc", "Anna Gallazzi", "Pavel E. Mancera Piña", "Anna Ferre Mateu", "Garreth Martin", "Mar Mezcua", "Nicola R. Napolitano", "Lucia Pozzetti", "Justin Read", "Marina Rejkuba", "Joanna Sakowska", "Paolo Salucci", "Elham Saremi", "Diana Scognamiglio", "Francesco Shankar", "Marilena Spavone", "the Euclid Local Universe SWG"], "title": "Unlocking the physics of dwarf galaxies in the 2040s: The case for a next-generation wide-field spectroscopic facility with fibres and IFUs", "comment": "This contribution was submitted as a White Paper for the ESO Expanding Horizon initiative. You can read the call here: https://next.eso.org/call-for-white-papers/", "summary": "Dwarf galaxies ($M_{\\star} \\lesssim 10^{9} M_{\\odot}$) are the most numerous galaxies in the Universe and critical probes of dark matter, baryonic feedback, and galaxy formation. Despite significant progress from wide-field imaging surveys, the majority of dwarf candidates beyond the Local Group will lack spectroscopic follow-up, leaving fundamental questions about their internal kinematics, stellar populations, chemical enrichment, and dark matter content unresolved. Existing and planned facilities cannot efficiently provide the necessary spectroscopy for low-surface-brightness dwarfs over wide areas. We advocate for a dedicated large-aperture ($\\geq 20$ m), wide-field, highly multiplexed spectroscopic facility with deployable or monolithic IFUs, capable of high signal-to-noise observations down to $I_{\\rm E} \\gtrsim 22-23$ mag. Such a facility would enable transformative studies of dark matter cores, baryonic feedback, tidal interactions, environmental effects, and stellar populations, extending the spectroscopic exploration of low-mass galaxies to $z \\sim 1.5$, and providing decisive tests of $Λ$CDM and alternative dark matter models. Beyond dwarfs, this capability would impact galaxy evolution, strong and weak lensing studies, and cosmology, ensuring that imaging data from the 2030s and 2040s can be fully exploited."}
{"id": "2512.19204", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.19204", "abs": "https://arxiv.org/abs/2512.19204", "authors": ["Can Güngör"], "title": "Outburst Characteristics of Transient Low Mass X-ray Binary 4U 1608-52", "comment": "Accepted for publication in Turk J Phys. 11 Pages, 3 Figures", "summary": "We present a deep study of the long-term X-ray light curve of 4U 1608-52 by investigating the fast rising exponential decay (FRED) outbursts, low intensity state (LIS) and quiescent intervals. By calibrating the onset times of the outbursts, we identify three distinct classes for the FRED-type events: (i) the long-high outbursts, exceeding ~50 d in duration with peak count rates above ~40 cnt/s; (ii) the short-medium outbursts, with durations of ~20 d and peak count rates of ~30-50 cnt/s; and (iii) the short-low outbursts, also lasting ~20 d but reaching only ~20-30 cnt/s at peak. We, furthermore, examine the relation between pre-outburst duration and the peak & integrated count rates of the upcoming outburst. We show that outbursts following longer quiescent periods tend to be more energetic."}
{"id": "2512.18290", "categories": ["astro-ph.IM", "gr-qc", "physics.data-an", "physics.ins-det"], "pdf": "https://arxiv.org/pdf/2512.18290", "abs": "https://arxiv.org/abs/2512.18290", "authors": ["Ruiting Mao", "Jeong Eun Lee", "Matthew C. Edwards"], "title": "Robust and scalable simulation-based inference for gravitational wave signals with gaps", "comment": "28 pages, 13 figures", "summary": "The Laser Interferometer Space Antenna (LISA) data stream will inevitably contain gaps due to maintenance and environmental disturbances, introducing nonstationarities and spectral leakage that compromise standard frequency-domain likelihood evaluations. We present a scalable Simulation-Based Inference (SBI) framework capable of robust parameter estimation directly from gapped time-series data. We employ Flow Matching Posterior Estimation (FMPE) conditioned on a learned summary of the data, optimized through an end-to-end training strategy. To address the computational challenges of long-duration signals, we propose a dual-pathway summarizer architecture: a 1D Convolutional Neural Network (CNN) operating on the time domain for high precision, and a novel wavelet-based 2D CNN utilizing asymmetric, dilated kernels to achieve scalability for datasets spanning months. We demonstrate the efficacy of this framework on simulated Galactic Binary-like signals, showing that our joint training approach yields tighter, unbiased posteriors compared to two-stage reconstruction pipelines. Furthermore, we provide the first systematic comparison showing that FMPE offers superior stability and coverage calibration over conventional Normalizing Flows in the presence of severe data artifacts."}
{"id": "2512.19218", "categories": ["astro-ph.HE", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2512.19218", "abs": "https://arxiv.org/abs/2512.19218", "authors": ["Songpeng Pei", "Xiaowan Zhang", "Renzhi Su", "Yongzhi Cai", "Ziwei Ou", "Qiang Li", "Xiaoqin Ren", "Taozhi Yang", "Mingyue Li"], "title": "Multi-wavelength study of the pre-eruption dip in the recurrent nova T Coronae Borealis preceding imminent nova eruption", "comment": "12 pages, 4 figures. Accepted by Astronomy and Astrophysics", "summary": "We present a multi-wavelength study of the symbiotic recurrent nova (RN) T Coronae Borealis (T CrB) using Swift Burst Alert Telescope (BAT) / X-Ray Telescope (XRT) / UltraViolet Optical Telescope (UVOT) and American Association of Variable Stars Observers (AAVSO) observations from 2005 to 2025. Our analysis spans quiescent, high, and pre-eruption dip states. We find that brightening amplitudes increase toward shorter wavelengths in both optical and UV bands, while the UV and X-ray fluxes are generally anti-correlated throughout all phases. During the 2023-2024 pre-eruption dip, soft and hard X-rays increased as optical and ultraviolet (UV) brightness declined, consistent with a transition from an optically thick to thin boundary layer driven by a reduction in the accretion rate. We also report, for the first time, a second, lower-amplitude dip occurring between September 2024 and February 2025 following the primary 2023-2024 pre-eruption dip. The observed variability supports an accretion-variation scenario as a unifying explanation for both the high and dip states, and may signal an imminent nova eruption."}
{"id": "2512.18369", "categories": ["astro-ph.IM", "astro-ph.CO", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2512.18369", "abs": "https://arxiv.org/abs/2512.18369", "authors": ["Nicola Borghi", "Michele Moresco", "Richard I. Anderson", "Carmelita Carbone", "Andrea Cimatti", "Stephanie Escoffier", "Carlo Giocoli", "Sean MacBride", "Fatemeh Zahra Majidi", "Dinko Milaković", "Lauro Moscardini", "Lucia Pozzetti", "Margherita Talia", "Elena Tomasetti"], "title": "Standard Sirens in 2040s: Probing the Cosmic Expansion History with Gravitational Waves and Spectroscopic Galaxy Surveys", "comment": "White Paper submitted to \"ESO Expanding Horizons: Transforming Astronomy in the 2040s\"", "summary": "Gravitational waves (GWs) from compact binary coalescences have matured into a robust cosmological probe, providing self-calibrated luminosity distance measurements independent of any cosmic distance ladder, hence the term \"standard sirens\". The binary neutron star merger GW170817 delivered the first such measurement of the Hubble constant, demonstrating that GWs offer a path to precision cosmology with systematics orthogonal to standard cosmological probes. To convert GW distances into cosmological parameters, redshift information is essential. To maximize the scientific potential, the redshift must be obtained from individual galaxies, either by identifying electromagnetic counterparts of GW events (bright sirens) or by statistically associating potential hosts within the GW localization volume (dark sirens). The precision of these redshifts sets the achievable accuracy. Forecasts show that photometric uncertainties degrade cosmological constraints by up to an order of magnitude compared to spectroscopic ones. Wide-field, high-multiplex spectroscopic facilities will therefore be an essential infrastructure for GW cosmology in the 2040s."}
{"id": "2512.19235", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.19235", "abs": "https://arxiv.org/abs/2512.19235", "authors": ["Shidong Wang", "Hui Liu", "Ru-Shuang Zhao", "Baoqiang Lao", "Yong-Kun Zhang", "Y. F. Xiao", "Pei Wang", "Di Li", "R. W. Tian", "Z. F. Tu", "Q. Zhou", "Z. J. Zhang", "Qijun Zhi", "Shijun Dang", "Kun Yang"], "title": "Identifying Quasi-Periodic Micropulses in Pulsars with FAST Using Convolutional Neural Networks", "comment": null, "summary": "Quasi-periodic MicroPulses (QMP) are quasi-periodic microstructural features manifested in individual pulsar radio pulses, the study of which is crucial for understanding pulsar radiation mechanisms. Manual identification of QMP in large-scale pulsar single-pulse datasets remains highly inefficient. To address this, we propose a Dual-Stage Residual Network (DSR) that achieves automated QMP detection in FAST observational data through joint analysis of single-pulse profiles and their Amplitude Distribution Profiles (ADP), defined as the power spectra of the autocorrelation function derivatives of the microstructure residuals. The model was trained on PSR B1933+16 data from 2019 (10,486 single pulses) and evaluated on manually annotated PSR B1933+16 data from 2020 (9,657 single pulses). DSR achieved 96.10\\% recall and 95.85\\% precision on the test set. This approach provides an automated pipeline for large-scale, reproducible QMP identification and establishes the foundation for in-depth investigation of their physical mechanisms."}
{"id": "2512.18883", "categories": ["astro-ph.IM", "cs.DC"], "pdf": "https://arxiv.org/pdf/2512.18883", "abs": "https://arxiv.org/abs/2512.18883", "authors": ["Nitin Shukla", "Alessandro Romeo", "Caterina Caravita", "Lubomir Riha", "Ondrej Vysocky", "Petr Strakos", "Milan Jaros", "João Barbosa", "Radim Vavrik", "Andrea Mignone", "Marco Rossazza", "Stefano Truzzi", "Vittoria Berta", "Iacopo Colonnelli", "Doriana Medić", "Elisabetta Boella", "Daniele Gregori", "Eva Sciacca", "Luca Tornatore", "Giuliano Taffoni", "Pranab J. Deka", "Fabio Bacchini", "Rostislav-Paul Wilhelm", "Georgios Doulis", "Khalil Pierre", "Luciano Rezzolla", "Tine Colman", "Benoît Commerçon", "Othman Bouizi", "Matthieu Kuhn", "Erwan Raffin", "Marc Sergent", "Robert Wissing", "Guillermo Marin", "Klaus Dolag", "Geray S. Karademir", "Gino Perna", "Marisa Zanotti", "Sebastian Trujillo-Gomez"], "title": "EuroHPC SPACE CoE: Redesigning Scalable Parallel Astrophysical Codes for Exascale", "comment": "7 pages, 7 figures", "summary": "High Performance Computing (HPC) based simulations are crucial in Astrophysics and Cosmology (A&C), helping scientists investigate and understand complex astrophysical phenomena. Taking advantage of exascale computing capabilities is essential for these efforts. However, the unprecedented architectural complexity of exascale systems impacts legacy codes. The SPACE Centre of Excellence (CoE) aims to re-engineer key astrophysical codes to tackle new computational challenges by adopting innovative programming paradigms and software (SW) solutions. SPACE brings together scientists, code developers, HPC experts, hardware (HW) manufacturers, and SW developers. This collaboration enhances exascale A&C applications, promoting the use of exascale and post-exascale computing capabilities. Additionally, SPACE addresses high-performance data analysis for the massive data outputs from exascale simulations and modern observations, using machine learning (ML) and visualisation tools. The project facilitates application deployment across platforms by focusing on code repositories and data sharing, integrating European astrophysical communities around exascale computing with standardised SW and data protocols."}
{"id": "2512.19259", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.19259", "abs": "https://arxiv.org/abs/2512.19259", "authors": ["Francesco Schiavone", "Leonardo Di Venere", "Francesco Giordano"], "title": "Sensitivity of CTAO to axion-like particles from blazars: a machine learning approach", "comment": null, "summary": "Blazars are a class of active galactic nuclei, supermassive black holes located at the centres of distant galaxies characterised by strong emission across the entire electromagnetic spectrum, from radio waves to gamma rays. Their relativistic jets, closely aligned to the line of sight from Earth, are a rich and complex environment, characterised by the presence of strong magnetic fields over parsec-scale lengths. Owing to their cosmological distance from Earth, these sources serve as ideal targets to probe non-standard gamma-ray propagation. In particular, axion-like particles (ALPs) could be detected through their coupling to photons, which enables ALP-photon conversions in external magnetic fields, leading to distinct signatures in the blazars' gamma-ray spectra. In this work, we explore a novel approach to constrain the ALP parameter space using gamma-ray observations, based on the use of machine-learning classifiers. We apply this technique to simulated observations of two bright blazars -- Mrk 501 and PKS 2155$-$304 -- with the Cherenkov Telescope Array Observatory (CTAO), a next-generation gamma-ray facility well suited to probe such features, thanks to its improved energy resolution and point-source sensitivity with respect to present ground-based gamma-ray telescopes. The obtained $2σ$ exclusion regions on the ALP parameter space are consistent with those found by applying a standard likelihood-ratio test, and suggest that the CTAO sensitivity to ALPs could be extended beyond existing constraints over a wide mass range."}
{"id": "2512.18903", "categories": ["astro-ph.IM", "astro-ph.EP", "physics.pop-ph"], "pdf": "https://arxiv.org/pdf/2512.18903", "abs": "https://arxiv.org/abs/2512.18903", "authors": ["Valenitn D. Ivanov"], "title": "Optical SETI at ESO in the 2040s", "comment": "This is an extended version of a white paper submitted in response to the ESO Expanding Horizons initiative; 5 pages", "summary": "The searches for other life and for intelligence are fundamental problems that science faces today. Most searches so far have been focused on radio, but optical laser communication is an alternative, well suited for a ground-based observatory. A project to search for artificial laser communications with the current and future extreme multiplexity spectroscopic facilities that ESO may develop by the 2040s is outlined. The monochromatic light is a clearly identifiable technosignature. The enormous corollary outreach potential of this initiative is underlined."}
{"id": "2512.19298", "categories": ["astro-ph.HE", "astro-ph.SR", "hep-ph"], "pdf": "https://arxiv.org/pdf/2512.19298", "abs": "https://arxiv.org/abs/2512.19298", "authors": ["Saurabh Mittal", "Thomas Siegert", "Francesca Calore", "Pierluca Carenza", "Laura Eisenberger", "Maurizio Giannotti", "Alessandro Lella", "Alessandro Mirizzi", "Dimitris Tsatsis", "Hiroki Yoneda"], "title": "Search for Axion-Like Particles from Nearby Pre-Supernova Stars", "comment": null, "summary": "Axion-like particles (ALPs) are hypothetical pseudoscalar bosons that arise in many extensions of the Standard Model and are well-motivated dark matter candidates. Nearby massive stars in the late stages of stellar evolution provide a promising environment for enhanced ALP production due to their high core temperatures and densities. We search for a combined signal of ALP-induced hard X-ray and soft $γ$-ray emission from 18 nearby pre-supernova stars using the full public 22-year INTEGRAL/SPI dataset, construct individual stellar spectra and link them in a coherent analysis. A maximum-likelihood approach is used to extract fluxes in the 20--2000 keV energy range. Stellar evolution models are employed to obtain the expected spectral shapes of ALP production processes peaking between 50--500 keV, depending on stellar mass and evolutionary stage. We construct a joint likelihood that incorporates uncertainties in stellar parameters to derive combined constraints on the coupling constants $g_{aγ}$ and $g_{ae}$ as a function of the ALP mass $m_a$. The hard X-ray and soft $γ$-ray fluxes of all selected stars are consistent with zero within uncertainties. We provide upper limits on the continuum emission and on the 511 keV and 1809 keV line fluxes. The combined upper limit on $g_{aγ} \\times g_{ae}$ is $(0.008 - 2) x 10^{-24}$ GeV$^{-1}$ (95% C.I.) while the ALP-photon coupling is constrained to $g_{aγ} = (0.13 - 1.26) x 10^{-11}$ GeV$^{-1}$ (95% C.I.) for $m_a\\leqq10^{-11}$ eV, depending on the time to core collapse and magnetic field assumptions. Conservative limits of $(0.27 - 1.25) x 10^{-24}$ GeV$^{-1}$ (95% C.I.) are obtained assuming all but one star are in the early He-burning phase. These results rank among the strongest limits on ALP couplings to date and demonstrate the importance of soft $γ$-ray observations for probing ALPs and massive star evolution."}
{"id": "2512.19102", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2512.19102", "abs": "https://arxiv.org/abs/2512.19102", "authors": ["Hironobu Nakata", "Shunsuke Adachi", "Kyohei Yamada", "Michael Randall", "Yutaro Kasai", "Kam Arnold", "Bryce Bixler", "Yuji Chinone", "Kevin T. Crowley", "Nadia Dachlythra", "Samuel Day-Weiss", "Nicholas Galitzki", "Serena Giardiello", "Bradley R. Johnson", "Brian Keating", "Brian J. Koopman", "Akito Kusaka", "Jack Lashner", "Federico Nati", "Lyman Page", "Daichi Sasaki", "Yoshinori Sueno", "Junya Suzuki", "Osamu Tajima", "Tran Tsan"], "title": "The Simons Observatory: Detector Polarization Angle Calibration using Sparse Wire Grid with Initial Data Sets of the Small Aperture Telescope", "comment": "9 pages, 9 figures", "summary": "Improved measurements of $B$-modes in the cosmic microwave background can be obtained through accurate calibration of the orientation of detector antennas as projected onto the sky. Miscalibration of the detector polarization angle leads to a leakage of $E$-modes into $B$-modes, which can bias the detection of the latter. To achieve a $σ(r)$ of 0.003, the Simons Observatory Small Aperture Telescopes are required to calibrate the global polarization angle on the sky with an accuracy ${\\lesssim}0.1^\\circ$. We demonstrate a fully remote-controllable calibration system using a ``sparse wire grid,\" which injects a rotatable linear polarized signal across the telescope's focal plane. This calibration system is installed and operational on a Small Aperture Telescope at its observing site at the Parque Astronómico in the Atacama desert in Chile. We developed a pipeline for the detector polarization angle calibration, and demonstrate it using initial data for 93~GHz and 145~GHz frequency bands. The observed distribution of detector polarization angles is in agreement with the instrument design. Statistical uncertainties for the relatively calibrated polarization angles are $0.02^\\circ$ and $0.03^\\circ$ at 93~GHz and 145~GHz, respectively. Systematic uncertainty was evaluated to be $0.08^\\circ$ at the hardware development and fabrication stage. Their sum in quadrature is less than $0.1^\\circ$."}
{"id": "2512.19301", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.19301", "abs": "https://arxiv.org/abs/2512.19301", "authors": ["P. A. Duverne", "W. K. Mouici", "A. Coleiro", "J. -G. Ducoin", "M. W. Coughlin"], "title": "Optical Follow-Up Strategies for the Next Neutrino-Detected Galactic Core-Collapse Supernova", "comment": "15 page, 10 figures", "summary": "Core-collapse supernovae (CCSNe) are expected to produce intense bursts of neutrinos preceding the emergence of their electromagnetic (EM) counterparts. The prompt detection of such neutrino signals offers a unique opportunity to trigger early follow-up observations in the EM domain. We aim to assess the feasibility and efficiency of an optical-NIR follow-up strategy for CCSNe discovered via neutrino bursts, by modelling the spatial distribution of events and simulating realistic observational campaigns taking into account the size of the localization error box generated by triangulating the neutrino burst. We modelled the Galactic distribution of CCSNe, including the effects of interstellar extinction, and considered three main progenitor types: Wolf-Rayet stars, red and blue supergiants. We included the shock breakout in the EM signatures that could be detected following the neutrino burst. A population of CCSNe was generated and detected by different networks of neutrino observatories, including IceCube, KM3NeT, Super-Kamiokande, Hyper-Kamiokande, and JUNO. The resulting skymaps were used as input for GWEMOPT to produce optimized follow-up plans with two optical facilities: LSST and the TAROT robotic telescopes. Both LSST and TAROT exhibit comparable detection efficiencies for the simulated CCSN population. However, the TAROT network achieves similar success rates while requiring fewer pointings to cover the CCSN skymap. Our simulations demonstrate that neutrino follow-up campaigns can effectively CCSN optical counterparts using both large and small facilities. Depending on the neutrino network, the median number of pointings for the two tested optical facilities is of the order of 20 to 100 to find the EM emission. The number of images is larger for LSST than for TAROT by a factor of 2 to 4."}
{"id": "2512.19249", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.19249", "abs": "https://arxiv.org/abs/2512.19249", "authors": ["Yao Chen", "Rui Luo", "Chen Wang", "Yong-Kun Zhang", "Shiqian Zhao", "Chengbing Lyu", "ZePeng Zheng", "Hai Lei", "DeJiang Zhou", "Chenhui Niu", "JinLin Han", "George Hobbs", "Di Li", "Chengwei Liang", "Siyi Tan", "Ting Tian"], "title": "Towards DM-free search for Fast Radio Bursts with Machine Learning -- I. An implementation on multibeam data", "comment": "AAS journal submitted. Comments welcome", "summary": "Searching for fleeting radio transients like fast radio bursts (FRBs) with wide-field radio telescopes has become a common challenge in data-intensive science. Conventional algorithms normally cost enormous time to seek candidates by finding the correct dispersion measures, of which the process is so-called dedispersion. Here we present a novel scheme to identify FRB signals from raw data without dedispersion using Machine Learning (ML). Under the data environment for multibeam receivers, we train the EfficientNet model and achieve both exceeding 92% accuracy and precision in FRB recognition. We find that the searching efficiency can be significantly enhanced without the procedure of dedispersion compared with conventional softwares like TransientX and presto. Specifically, the impact of radio frequency interference (RFI) for single-beam and multibeam data has been investigated, and we find ML can naturally mitigate RFI under the multibeam environment. Finally, we validate the trained model on actual data from the current FRB surveys carried out by the Five-hundred-meter Aperture Spherical radio Telescope, which provides considerable potential for real implementation in the future."}
{"id": "2512.19386", "categories": ["astro-ph.HE", "physics.data-an"], "pdf": "https://arxiv.org/pdf/2512.19386", "abs": "https://arxiv.org/abs/2512.19386", "authors": ["Laura Cotter", "Antonio Martin Carrillo", "Joseph Fisher", "Gabriel Finneran", "Gregory Corcoran", "Jennifer Lebron"], "title": "Machine learning for the early classification of broad-lined Ic supernovae", "comment": "There are 10 pages and 8 figures (2 individual figures and 3 where there are 2 subfigures)", "summary": "Science is currently at an age where there is more data than we know how to deal with. Machine learning (ML) is an emerging tool that is useful in drawing valuable science out of incomprehensibly large datasets, identifying complex trends in data that are otherwise overlooked. Moreover, ML can potentially enhance the quality and quantity of scientific data as it is collected. This paper explores how a new ML method can improve the rate of classification of rare Ic-BL supernovae (SNe). New parameters called magnitude rates were introduced to train ML models to identify SNe Ic-BL in large datasets. The same methodology was applied to a population of SN Ia transients to see if the methodology could be reproducible with another SN class. Three magnitudes, three time differences, two magnitude rates and the second derivative of these rates were calculated using the first three available photometric data points in a single filter. Initial investigations show that the Random Forest algorithm provides a strong foundation for the early classifications SNe Ic-BL and SNe Ia. Testing this model again on an unseen dataset shows that the model can identify upward of 13% of the total true SN Ic-BL population, significantly improving upon current methods. By implementing a dedicated observation campaign using this model, the number of SN Ic-BL classified and the quality of early-time data collected each year will see considerable growth in the near future."}
{"id": "2512.19262", "categories": ["astro-ph.IM", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2512.19262", "abs": "https://arxiv.org/abs/2512.19262", "authors": ["Kaustav Bhattacharjee", "Himanshu Grover", "P. Arumugam"], "title": "Observations of the 21 cm HI Line from the Milky Way galaxy using Pyramidal Horn Radio Telescope", "comment": null, "summary": "We present the design, implementation, and operation of a pyramidal horn radio telescope built for detecting the Galactic 21 cm neutral hydrogen line emission. The system employs an SDR-based pipeline to obtain drift-scan observations, which were calibrated and processed to generate HI sky maps, a Galactic rotation curve and spiral arm features. This demonstrates that this low-cost system is effective both for educational purposes and scientific exploration of Galactic structure at radio frequencies."}
{"id": "2512.19403", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.19403", "abs": "https://arxiv.org/abs/2512.19403", "authors": ["Xiao-Bin Chen", "Ruo-Yu Liu", "Xiang-Yu Wang"], "title": "Diagnosing the AGN population origin of TeV neutrinos with their spatial correlation", "comment": null, "summary": "The recent IceCube detection of TeV neutrinos from some nearby Seyfert galaxy (e.g., NGC~1068) suggests that active galactic nuclei (AGN) could make a significant contribution to the diffuse flux of astrophysical neutrinos. The absence of TeV gamma-rays from NGC~1068 indicates neutrino production in compact gamma-ray-opaque region. The vicinity of the supermassive black hole, such as disk-corona, is an ideal region, where the high radiation density leads to efficient neutrino production as well as the gamma-ray attenuation. Disk-corona models predict that the neutrino emission from AGNs correlates with X-ray emission, which traces the coronal activity. In this paper, we assess whether the X-ray AGN population origin for TeV neutrinos can be tested by using the spatial correlation between the neutrino population and X-ray AGN population with future neutrino telescopes. By performing simulations, we find that, the AGN origin of the neutrino background above 100\\,TeV can be tested at a confidence level of $\\sim2.4σ$ with five-year observations of IceCube-Gen2, which has an angular resolution of $\\sim0.2$ degree. With better angular resolution and sensitivity in the energy range of above $300$\\,TeV, a 30-${\\rm km^3}$ underwater neutrino telescope, such as High-energy Underwater Neutrino Telescope (HUNT), is expected to reach a significance of $\\sim8.6σ$ in testing the association after five years of exposure."}
{"id": "2512.19444", "categories": ["astro-ph.IM", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2512.19444", "abs": "https://arxiv.org/abs/2512.19444", "authors": ["Borja Anguiano", "David Valls-Gabaud", "Andrés del Pino", "Guillaume F. Thomas", "Alberto M. Martínez-García", "Ivan Minchev", "Patricia Sanchez-Blazquez", "Danny Horta"], "title": "GALATEA: The 15-m Galactic Archaeology Spectroscopic Surveyor", "comment": "White Paper submitted to the ESO Expanding Horizons Call 2025", "summary": "\\textsc{GALATEA} (the \\emph{Galactic Archaeology and Local-group Astrophysics Telescope for Extended Areas}) is a concept for a dedicated 15-m, wide-field, 10,000-fibre spectroscopic survey facility in the northern hemisphere, optimized for degree-scale, multi-object spectroscopy. With a $\\sim 1~\\mathrm{deg}^2$ corrected field-of-view and both medium- ($R \\simeq 5{,}000$--$10{,}000$) and high-resolution ($R \\simeq 20{,}000$--$25{,}000$) modes, \\textsc{GALATEA} would open a new regime in Galactic and Local Group astronomy: deep, chemically detailed spectroscopy of vast samples of individual stars in the outer disc, warp, flare, halo substructures, M31, M33 and their dwarf satellites, far beyond the reach of current surveys. By delivering precise radial velocities and detailed chemical abundances for stars with exquisite astrometry and photometry from \\emph{Gaia} and its proposed near-infrared successor \\emph{GaiaNIR}, \\textsc{GALATEA} will complete and fully exploit the 6D phase-space and chemodynamical information for these populations. Compared to existing northern multi-object spectroscopic facilities (BOSS, APOGEE, DESI, LAMOST, WEAVE, PFS), \\textsc{GALATEA} delivers an order-of-magnitude jump in survey power ($\\propto D^{2} \\times N_{\\mathrm{fibres}}$) by combining a 15-m aperture, $\\sim 1~\\mathrm{deg}^2$ field, and 10{,}000 fibres in a single dedicated facility. It is also strongly complementary to 30--40\\,m ELTs: GALATEA provides the wide-field, high-multiplex discovery and chemodynamical mapping, while ELTs deliver deep, high-resolution follow-up of the faintest or most complex targets."}
{"id": "2512.19448", "categories": ["astro-ph.HE", "gr-qc"], "pdf": "https://arxiv.org/pdf/2512.19448", "abs": "https://arxiv.org/abs/2512.19448", "authors": ["Erdem Sucu", "Izzet Sakallı", "Orhan Donmez", "G. Mustafa"], "title": "Confining nonlinear electrodynamics black holes: from thermodynamic phases to high-frequency phenomena with accretion process", "comment": "27 pages, 14 figures", "summary": "We investigate a static, spherically symmetric black hole solution arising from Einstein gravity coupled to a confining nonlinear electrodynamics model that reproduces Maxwell theory in the strong-field regime while introducing confinement-like corrections at large distances. The resulting metric function is asymptotically Schwarzschild but carries a characteristic Q^3/(9ξ^2 r^4) correction, where $Q$ is the magnetic charge and $ξ$ is the nonlinear electrodynamics parameter, with the conventional Reissner-Nordström term Q^2/r^2 absent. We analyze the horizon structure and construct three-dimensional embedding diagrams to visualize spatial geometry. Using the Gauss-Bonnet theorem, we compute the weak-field deflection angle in vacuum, cold plasma, and axion-plasmon media, finding that the nonlinear electromagnetic corrections reduce the total bending compared to Schwarzschild at fixed Arnowitt-Deser-Misner mass. The gravitational redshift, Joule-Thomson expansion coefficient, and heat capacity are derived, revealing phase transitions and inversion curves that depend on the model parameters. We obtain closed-form expressions for the photon sphere radius, Lyapunov exponent, and shadow size, demonstrating their sensitivity to Q and $ξ$ along observable Intensities. Fully relativistic hydrodynamical simulations of Bondi-Hoyle-Lyttleton accretion show that the confining geometry produces a $\\sim 40\\%$ enhancement in mass accretion rate relative to Schwarzschild and generates quasi-periodic oscillations with stable 3:2 and 2:1 frequency ratios matching observations from black hole X-ray binaries. These results establish the confining nonlinear electrodynamics black hole as a testable model that can reproduce high-frequency quasi-periodic oscillation pairs without invoking black hole spin."}
{"id": "2512.19477", "categories": ["astro-ph.HE", "hep-ph", "nucl-th"], "pdf": "https://arxiv.org/pdf/2512.19477", "abs": "https://arxiv.org/abs/2512.19477", "authors": ["Sofia Blomqvist", "Christian Ecker", "Tyler Gorda", "Aleksi Vuorinen"], "title": "Strong model-agnostic constraints for twin-star solutions", "comment": "9 pages, 3 figures, 2 appendices", "summary": "We perform a model-agnostic Bayesian analysis of the neutron-star-matter equation of state (EoS), using known ab-initio constraints and astrophysical observations to limit its behavior at intermediate densities. Permitting explicit first-order phase transitions allows us to systematically search for twin-star solutions, i.e. the existence of stars degenerate in mass but differing in radius. We find that current observational constraints exclude all but two classes of twin stars. The first is characterized by a first-order transition occurring at a very low density, where the material properties of the system either stay largely intact or move away from the conformal limit. In the second, more interesting class, the discontinuity in the mass-radius curve emerges after a rapid crossover transition at a significantly higher density, with the speed of sound exhibiting two sharp peaks at distinct densities. Since neither class shows clear conformalization upon entering the second branch, the standard twin-star scenario linking the mass-radius discontinuity to deconfinement can be firmly ruled out, while even the remaining solutions -- disfavored by per-mille Bayes factors and in tension with theoretical bounds -- are likely to be excluded in the future."}
{"id": "2512.17975", "categories": ["astro-ph.IM", "astro-ph.HE", "gr-qc"], "pdf": "https://arxiv.org/pdf/2512.17975", "abs": "https://arxiv.org/abs/2512.17975", "authors": ["Matthew VanDyke", "Kexuan Wu", "Sukanta Bose"], "title": "CoBiTS: Single-detector discrimination of binary black hole signals from glitches using deep learning", "comment": "22 pages, 13 figures", "summary": "We develop a Conformer neural network, called Conformer Binary neTwork Search, or CoBiTS, for distinguishing binary black hole (BBH) gravitational wave (GW) signals from non-Gaussian and non-stationary noise artifacts in the data from current generation LIGO-Virgo-KAGRA detectors. A large subset of these transient noise artifacts, termed as ``glitches'' for short, trigger BBH search templates. Some of them go on to produce detection candidates and require human vetting, supported by data quality tools, to be correctly identified and vetoed. In its current version, CoBiTS takes as inputs single-detector strain timeseries snippets, claimed by other search pipelines to be containing GW candidates, and outputs the significance of each snippet to contain a BBH signal and a glitch. CoBiTS is shown to be particularly effective in discriminating high-mass BBH signals from blips and scattered light glitches, even when a signal is near concurrent or overlapping with a glitch. The performance of CoBiTS gains from employing Conformer, which is a specialized model that combines convolutional layers and Transformer architecture for sequence modeling tasks. Conformer is especially good at leveraging the strengths of both convolutional layers -- for local feature extraction -- and self-attention layers -- for capturing long-range dependencies."}
{"id": "2512.19249", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.19249", "abs": "https://arxiv.org/abs/2512.19249", "authors": ["Yao Chen", "Rui Luo", "Chen Wang", "Yong-Kun Zhang", "Shiqian Zhao", "Chengbing Lyu", "ZePeng Zheng", "Hai Lei", "DeJiang Zhou", "Chenhui Niu", "JinLin Han", "George Hobbs", "Di Li", "Chengwei Liang", "Siyi Tan", "Ting Tian"], "title": "Towards DM-free search for Fast Radio Bursts with Machine Learning -- I. An implementation on multibeam data", "comment": "AAS journal submitted. Comments welcome", "summary": "Searching for fleeting radio transients like fast radio bursts (FRBs) with wide-field radio telescopes has become a common challenge in data-intensive science. Conventional algorithms normally cost enormous time to seek candidates by finding the correct dispersion measures, of which the process is so-called dedispersion. Here we present a novel scheme to identify FRB signals from raw data without dedispersion using Machine Learning (ML). Under the data environment for multibeam receivers, we train the EfficientNet model and achieve both exceeding 92% accuracy and precision in FRB recognition. We find that the searching efficiency can be significantly enhanced without the procedure of dedispersion compared with conventional softwares like TransientX and presto. Specifically, the impact of radio frequency interference (RFI) for single-beam and multibeam data has been investigated, and we find ML can naturally mitigate RFI under the multibeam environment. Finally, we validate the trained model on actual data from the current FRB surveys carried out by the Five-hundred-meter Aperture Spherical radio Telescope, which provides considerable potential for real implementation in the future."}
