{"id": "2509.04531", "categories": ["astro-ph.IM", "astro-ph.EP"], "pdf": "https://arxiv.org/pdf/2509.04531", "abs": "https://arxiv.org/abs/2509.04531", "authors": ["Simone R. Hagey", "Aaron Boley"], "title": "OrbDot: A Python package for studying the secular evolution of exoplanet orbits", "comment": "5 pages, accepted to JOSS, examples and documentation are hosted on\n  https://orbdot.readthedocs.io", "summary": "OrbDot is a Python package for studying the secular (long-term) evolution of\nexoplanet orbits from observational data. It employs nested sampling algorithms\nto fit evolutionary models to any combination of transit and eclipse mid-times,\nradial velocities, and transit durations. Beyond model fitting, OrbDot offers\ntools for interpreting results, generating reports on model comparisons,\nderived tidal decay parameters, predicted precession rates, implications for\nplanetary companions, and more."}
{"id": "2509.04538", "categories": ["astro-ph.IM", "astro-ph.CO"], "pdf": "https://arxiv.org/pdf/2509.04538", "abs": "https://arxiv.org/abs/2509.04538", "authors": ["Ao Liu", "Tonghua Liu", "Dejiang Li", "Cuihong Wen", "Jieci Wang", "Kai Liao", "Jiaxing Cui", "Huan Zhou"], "title": "Identifying Microlensing by Compact Dark Matter through Diffraction Patterns in Gravitational Waves with Machine Learning", "comment": "12 pages, 5 figures, comments are welcome", "summary": "Gravitational wave lensing, particularly microlensing by compact dark matter\n(DM), offers a unique avenue to probe the nature of dark matter. However,\nconventional detection methods are often computationally expensive,\ninefficient, and sensitive to waveform systematics. In this work, we introduce\nthe Wavelet Convolution Detector (WCD), a deep learning framework specifically\ndesigned to identify wave-optics diffraction patterns imprinted in\ngravitationally lensed signals. The WCD integrates multi-scale wavelet analysis\nwithin residual convolutional blocks to efficiently extract time-frequency\ninterference structures, and is trained on a realistically generated dataset\nincorporating compact DM mass functions and astrophysical lensing\nprobabilities. This work is the first machine learning-based approach capable\nof identifying such wave-optics signatures in lensed gravitational waves.\nTested on simulated binary black hole events, the model achieves 92.2\\%\naccuracy (AUC=0.965), with performance rising to AUC$\\sim$0.99 at high SNR.\nCrucially, it maintains high discriminative power across a wide range of lens\nmasses without retraining, demonstrating particular strength in the\nlow-impact-parameter and high-lens-mass regimes where wave-optics effects are\nmost pronounced. Compared to Bayesian inference, the WCD provides\norders-of-magnitude faster inference, making it a scalable and efficient tool\nfor discovering compact DM through lensed gravitational waves in the era of\nthird-generation detectors."}
{"id": "2509.04678", "categories": ["astro-ph.IM", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2509.04678", "abs": "https://arxiv.org/abs/2509.04678", "authors": ["Jacopo Fritz", "Maarten Baes", "Diego Alejandro Vasquez Torres", "Karla Alejandra Cutiva Alvarez", "Angelos Nersesian", "Viviana Casasola", "Eric F. Jiménez-Andrade", "Simone Bianchi", "Luca Cortese", "Ilse De Looze", "Frédéric Galliano", "Suzanne Madden", "Matthew W. L. Smith", "Manolis Xilouris"], "title": "PRIMA survey of the Virgo cluster", "comment": "Published in the JATIS special issue focused on the PRobe Infrared\n  Mission for Astrophysics (PRIMA) probe mission concept. The issue is edited\n  by Matt Griffin and Naseem Rangwala (JATIS VOL. 11 | NO. 3 | July 2025). 34\n  pages, 4 figures", "summary": "Clusters of galaxies are unique laboratories for investigating the dependence\nof galaxy evolution on their environment. The Herschel Virgo Cluster Survey\n(HeViCS) mapped the central 84 square degrees region of the Virgo Cluster in\nfive bands between 100 and 500 micron, which resulted in the first detailed\nview of cold dust in cluster galaxies. Major limitations of the HeViCS survey\nwere the lack of data, or its limited availability, in the 20 to 80 micron\nrange, and the quite low sensitivity of the Photodetector Array Camera and\nSpectrometer instrument, resulting in poor constraints on the warmer dust\ncomponent. The PRIMAger instrument onboard PRIMA offers the capability to map a\nlarge portion of the Virgo Cluster -- including regions beyond its virial\nradius -- in hyperspectral and polarimetric bands from 25 to 265 micron,\nenabling a direct comparison with the area previously covered by HeViCS. By\ncombining PRIMA and Herschel data with existing multi-wavelength photometry, it\nbecomes possible to explore the connection between stellar and dust properties\nin a complete sample of cluster galaxies, to investigate environmental effects\non the warm dust component within the Virgo Cluster, to map the magnetic field\nstructure of the cold interstellar medium (ISM), to search for dust emission\nfrom the intra-cluster medium, and to study the ISM in background galaxies\nprojected behind the cluster."}
{"id": "2509.04929", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.04929", "abs": "https://arxiv.org/abs/2509.04929", "authors": ["A. Lundgren", "A. Beelen", "G. Lagache", "F. -X. Desert", "A. Fasano", "J. Macias-Perez", "A. Monfardini", "P. Ade", "M. Aravena", "E. Barria", "A. Benoit", "M. Bethermin", "J. Bounmy", "O. Bourrion", "G. Bres", "C. De Breuck", "M. Calvo", "A. Catalano", "C. Dubois", "C. A Duran", "T. Fenouillet", "J. Garcia", "G. Garde", "J. Goupy", "C. Hoarau", "W. Hu", "J. -C. Lambert", "F. Levy-Bertrand", "J. Marpaud", "R. Parra", "G. Pisano", "N. Ponthieu", "L. Prieur", "D. Quinatoa", "S. Roni", "S. Roudier", "D. Tourres", "C. Tucker", "M. Van Cuyck"], "title": "CONCERTO: forward modeling of interferograms for calibration", "comment": null, "summary": "The CarbON [CII] line in post-rEionisation and ReionisaTiOn epoch (CONCERTO)\ninstrument is a low-resolution mapping Fourier-transform spectrometer, based on\nlumped-element kinetic inductance detector (LEKID) technology, operating at\n130- 310 GHz. It was installed on the 12-meter APEX telescope in Chile in April\n2021 and operated until December 2022. CONCERTO's main science goal is to\nconstrain the [CII] line fluctuations at high redshift. To reach that goal\nCONCERTO observed 1.4 deg2 in the COSMOS field. To ensure accurate calibration\nof the data, we have developed a forward model capable of simulating both the\nspectral response and the corresponding interferograms for each scan of\nobservation in the COSMOS field. We present the modeling approach that enables\nus to reproduce the expected instrument outputs under controlled input\nconditions and provides a framework for the different calibration steps,\nincluding the absolute brightness calibration of the spectra. We constructed a\ndedicated analysis pipeline to characterize the raw interferometric data\n(interferograms) obtained under a broad range of atmospheric conditions at\nAPEX. Using the forward model, we measured the interferogram alignment with the\noptical path difference (zero path difference, ZPD) and the relative response\nof each KID (flatfield). Together, these elements enable a robust\ncharacterization of the instrument's spectral brightness calibration."}
{"id": "2509.04551", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.04551", "abs": "https://arxiv.org/abs/2509.04551", "authors": ["Ore Gottlieb"], "title": "The Landscape of Collapsar Outflows: Structure, Signatures and Origins of Einstein Probe Relativistic Supernova Transients", "comment": null, "summary": "The Einstein Probe is revolutionizing time-domain astrophysics through the\ndiscovery of new classes of X-ray transients associated with Type Ic-Broad Line\nsupernovae. These events commonly exhibit bright early-time optical\ncounterparts, and sudden afterglow rebrightening within the first week -\nfeatures that existing models fail to explain. In particular, structured jet\nand cocoon scenarios are inconsistent with the observed sharp rebrightening and\nmulti-day optical emission, while the refreshed shock model is ruled out due to\nits inconsistency with collapsar hydrodynamics. Drawing on 3D\ngeneral-relativistic magnetohydrodynamic simulations, we present the\nmulti-scale angular and radial structure characterizing collapsar outflows. The\nresulting morphology features episodic, wobbling jets with a \"top-hat\"\ngeometry, embedded within a smoother global cocoon and disk ejecta angular\nstructure. The wobbling jets give rise to variations in radiative efficiency\nthat can account for the observed alternation between X-ray-dominated and\n$\\gamma$-ray-dominated jet emission. The top-hat structure of individual\nwobbling jet episodes naturally explains the sudden rebrightening observed when\nthe emission from the top-hat jet cores enters the observer's line of sight.\nThe radial structure is consistent with that inferred from observations of\nstripped-envelope supernovae. It comprises a mildly relativistic cocoon\n($0.3\\lesssim\\beta\\Gamma\\lesssim3$) that may power an early ($\\sim1\\,{\\rm\nday}$) rapidly decaying emission, followed by slower, black hole accretion\ndisk-driven outflows ($\\beta\\lesssim0.3$), which dominate the slowly evolving\noptical emission at $t\\gtrsim1\\,{\\rm day}$. This novel multi-component outflow\nstructure provides a unified explanation for the multiband light curves\nobserved in Einstein Probe transients and is likely a common feature of Type\nIc-Broad Line supernovae more broadly."}
{"id": "2509.04975", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.04975", "abs": "https://arxiv.org/abs/2509.04975", "authors": ["Pim van Dillen"], "title": "Results and plans to apply interferometry to air shower observations at the Pierre Auger Observatory", "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC\n  2025). 8 pages, 5 figures", "summary": "By analysing the radio emissions from air showers using interferometry, we\ncan estimate their properties. In this contribution, we apply interferometry to\nreconstruct air-shower parameters based on measurements taken with the Auger\nEngineering Radio Array (AERA) at the Pierre Auger Observatory. This\nreconstruction method is achievable at AERA through precise clock\nsynchronisation with a beacon and an accurate survey of the station locations.\nInterferometry has been applied to several thousand inclined air-shower\nobservations for the first time, which allows for tests on the performance of\nair-shower geometry reconstruction, recovery of the radio signal from\nlow-energy air showers, and methods to study the polarisation of the\nradio-emission mechanisms. Additionally, in this contribution, we will also\nprovide an overview of efforts to enable interferometry for the recently\ninstalled radio detectors that are part of the AugerPrime upgrade."}
{"id": "2509.04572", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.04572", "abs": "https://arxiv.org/abs/2509.04572", "authors": ["Paul C. W. Lai", "Kaye J. Li", "Y. X. Jane Yap", "Kinwah Wu", "Albert K. H. Kong"], "title": "Spectropolarimetry of synchrotron radiation from relativistic electrons with anisotropic pitch-angle and various energy distributions", "comment": "15 pages, published on MNRAS", "summary": "For synchrotron radiation from relativistic electrons having a power-law\nenergy distribution with a power-law index $p$ in an optically thin medium with\na locally uniform magnetic field, it is generally adopted that the spectral\nindex $\\alpha = (p-1)/2$ and the degree of linear polarisation $\\Pi_{\\rm L,pl}\n= (p +1)/(p+7/3)$, and hence that $\\Pi_{\\rm L,pl} = (\\alpha +1)/(\\alpha+5/3)$.\nThese ($\\alpha$, $\\Pi_{\\rm L,pl}$; $p$) relations are derived assuming that the\nelectrons have an isotropic momentum distribution and a power-law energy\ndistribution, and they have been used, almost universally, in the\ninterpretation of polarimetry observations. In this study, we assess the\nvalidity of the ($\\alpha$, $\\Pi_{\\rm L,pl}$; $p$) relations in different\nscenarios, such as anisotropic electron momenta and non-power-law distributions\nof electron energy. We calculate the synchrotron radiation and polarisation\nspectra for power-law, kappa and log-parabola electron-energy distributions,\nwith isotropic and two anisotropic (beamed and loss cone) electron-momentum\ndistributions. Our calculations show that when the electron momenta are\nisotropic, the usual ($\\alpha$, $\\Pi_{\\rm L,pl}$; $p$) relations are generally\napplicable. However, if the electrons are anisotropic, the usual ($\\alpha$,\n$\\Pi_{\\rm L,pl}$; $p$) relations could break down. Applying the usual\n($\\alpha$, $\\Pi_{\\rm L,pl}$; $p$) relations indiscriminately without caution on\nanisotropy in the electron momentum distribution, would lead to incorrect\ninterpretations of polarimetry data."}
{"id": "2509.05057", "categories": ["astro-ph.IM", "astro-ph.EP", "astro-ph.GA", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2509.05057", "abs": "https://arxiv.org/abs/2509.05057", "authors": ["Richard Massey", "Jacob A. Kegerreis", "Juan Paolo Lorenzo Gerardo Barrios", "James W. Nightingale", "Richard G. Hayes", "David Lagattuta", "Zane D. Lentz", "Gavin Leroy", "Jesper Skottfelt", "Maximilian von Wietersheim-Kramsta"], "title": "Radiation damage to the Hubble Space Telescope during two Solar cycles, and correction of Charge Transfer Inefficiency", "comment": "17 pages, 8 figures. ArCTIc code available from\n  https://github.com/jkeger/arctic", "summary": "From 2002 to 2025, the Hubble Space Telescope's Advanced Camera for Surveys\nhas suffered in the harsh radiation environment above the protection of the\nEarth's atmosphere. We track the degradation of its image quality, as Solar\nprotons and galactic cosmic rays have damaged its photosensitive charge-coupled\ndevice (CCD) imaging sensors. The damage is consistent with defects in the\nsilicon lattice that have all annealed into one of three configurations. The\nrate of damage in low Earth orbit is modulated by $18.5^{+4.5}_{-0.5}$ per cent\nduring an 11 year Solar cycle, peaking $430^{+11}_{-5}$ days after Solar\nminimum as recorded in the number of sunspots. We also present the open-source\nAlgorithm for Charge Transfer Inefficiency correction (ArCTIc) v7. This models\nthe (instantaneous or gradual) capture of photoelectrons into lattice defects,\nand their release after (a discrete set or continuum of) characteristic time\ndelays, which creates spurious trailing in an image. Calibrated using the\ntrailing of hot pixels, and applied during post-processing of astronomical\nimages, ArCTIc can correct 99.5% of Charge Transfer Inefficiency trailing\naveraged over the camera's lifetime, and 99.9% of trailing in the\nworst-affected recent data."}
{"id": "2509.04574", "categories": ["astro-ph.HE", "gr-qc"], "pdf": "https://arxiv.org/pdf/2509.04574", "abs": "https://arxiv.org/abs/2509.04574", "authors": ["Thomas W. Baumgarte", "Stuart L. Shapiro"], "title": "Can \"premature collapse\" form black holes in the upper and lower mass gaps?", "comment": "7 pages", "summary": "Observations of gravitational waves from binary black hole mergers, including\nthe recent signals GW231123 and GW230529, have revealed multiple progenitor\nblack holes in the so-called upper and lower mass gaps, respectively. It is\ngenerally assumed that massive stars cannot form black holes in the upper mass\ngap because pair instabilities in the late stage of stellar evolution disrupt\nthe stars, whereas the lower mass gap refers to the gap between the maximum\nallowed neutron star mass and the smallest black hole mass expected to form in\nsupernova explosions. Here we explore a \"premature collapse\" scenario in which\nupper mass gap stars collapse and form black holes before they reach the late\nstage of stellar evolution. The mechanism for triggering a premature collapse\nis the capture of a smaller black hole, possibly primordial in nature. A\nsimilar capture scenario can occur to produce black holes in the lower mass\ngap. At least for massive stars, typical stellar rotation rates would likely\nresult in rapidly rotating black holes in such a scenario, naturally explaining\nthe rapid spins inferred from GW231123. Even though our estimates hinge on\nseveral parameters with rather large uncertainties, they suggest that, at least\nin galactic disks, the likelihood of such a capture is small for stars in the\nupper mass gap, but may lead to a significant population of black holes in the\nlower mass gap and, in fact, even below the lower mass gap."}
{"id": "2509.05147", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.05147", "abs": "https://arxiv.org/abs/2509.05147", "authors": ["George Filippatos"], "title": "EUSO-SPB2 Cosmic Ray Searches and Observations", "comment": null, "summary": "The Extreme Universe Space Observatory on a Super Pressure Balloon 2\n(EUSO-SPB2) flew in May of 2023, marking an important step towards the\nobservation of ultra-high-energy cosmic rays (UHECR) and neutrino-induced\nshowers from space. The ultimate goal of this endeavor is to complement\nground-based detectors and achieve unprecedented exposure and nearly uniform\nfull-sky coverage at the highest energies, thereby enabling charged particle\nastronomy and enriching the multi-messenger approach to high-energy\nastrophysics and astroparticle physics. As a pathfinder to the POEMMA mission\n(Probe Of Extreme Multi-Messenger Astrophysics), EUSO-SPB2 flew two distinct\ncameras at the focus of two Schmidt telescopes, one made of multi-anode\nphotomultiplier tubes (MAPMTs), looking towards the nadir for fluorescence\nlight detection, the other made of Silicon photomultipliers (SiPMs), looking\ntowards the limb of the Earth for direct Cherenkov light detection. The flight\nwas terminated prematurely due to a failure in the balloon, and thus no showers\nwere detected in the fluorescence mode. However, several lower-energy (PeV\nscale) cosmic-ray events were observed in the Cherenkov channel. The data\ncollected by both telescopes also confirmed the pertinence and maturity of the\ntechnology. We will report on the mission's cosmic ray results, and lessons\nlearned for future balloon and satellite missions, notably the POEMMA Balloon\nwith Radio (PBR), currently under development."}
{"id": "2509.04577", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.04577", "abs": "https://arxiv.org/abs/2509.04577", "authors": ["N. Marchili", "S. Righini", "M. Giroletti", "C. M. Raiteri", "R. P. Giri", "M. I. Carnerero", "M. Villata", "U. Bach", "P. Cassaro", "E. Liuzzo", "C. S. Buemi", "P. Leto", "C. Trigilio", "G. Umana", "M. Bonato", "B. Patricelli", "A. Stamerra"], "title": "Twenty years of blazar monitoring with the INAF radio telescopes", "comment": "17 pages, 6 figures, 5 tables. Accepted for publication in Astronomy\n  & Astrophysics", "summary": "The extreme variability of blazars, in both timescale and amplitude, is\ngenerally explained as the effect of a relativistic jet closely aligned to the\nobserver's line-of-sight. Due to causality arguments, variability\ncharacteristics translate into spatial information about the emitting region of\nblazars. Since radiation at different wavelengths is emitted in different parts\nof the jet, multi-frequency observations provide us with a virtual view of the\nstructure of the jet on different scales. Radio--gamma-ray correlations,\nmoreover, are essential to reveal where and how the high-energy radiation is\nproduced. We present here the observations collected within the blazar radio\nmonitoring program that we are running at the Medicina and Noto telescopes. It\naims at investigating how the variability characteristics and spectral energy\ndistribution of blazars evolve in time. Since 2004, observation have been\nperformed at 5, 8, 24, and 43 GHz on 47 targets, with monthly cadence; the\nmonitoring program is still active at frequencies of 8 and 24 GHz. The database\nwe built in more than twenty years of activity comprises to date about 21000\nflux density measurements. Some basic analysis tools have been applied to the\ndata to characterise the detected variability and offer a first glance at the\nwealth of information that such a program can provide about blazars."}
{"id": "2509.04637", "categories": ["astro-ph.HE", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2509.04637", "abs": "https://arxiv.org/abs/2509.04637", "authors": ["Fabio Antonini", "Isobel Romero-Shaw", "Thomas Callister", "Fani Dosopoulou", "Debatri Chattopadhyay", "Mark Gieles", "Michela Mapelli"], "title": "Gravitational waves reveal the pair-instability mass gap and constrain nuclear burning in massive stars", "comment": "Comments are welcome", "summary": "Stellar evolution theory predicts that electron--positron pair production in\nthe cores of massive stars triggers unstable thermonuclear explosions that\nprevent the direct formation of black holes above about $50\\,M_\\odot$, creating\na ``pair-instability gap''. Yet black holes have been detected above this mass\nwith gravitational waves; such objects might be explained with uncertainties in\nthe physics of massive stars and stellar collapse or with hierarchical mergers\nof black holes in stellar clusters. Hierarchical mergers are associated with\nlarge spins as predicted by general relativity, and isotropic spin\norientations. Here we present strong evidence for the pair-instability mass gap\nin the LIGO--Virgo--KAGRA fourth transient catalog, with a lower edge at\n$45.3^{+6.5}_{-4.8}\\,M_\\odot$. We also obtain a measurement of the\n${}^{12}\\mathrm{C}(\\alpha,\\gamma){}^{16}\\mathrm{O}$ reaction rate, yielding an\n$S$-factor of $242.5^{+310.4}_{-101.5}\\,\\mathrm{keV\\,b}$, a parameter critical\nfor modeling helium burning and stellar evolution. The new data reveal two\npopulations: a low-spin group with no black holes above the gap, consistent\nwith direct stellar collapse, and a high-spin, isotropic group that extends\nacross the full mass range and occupies the gap, consistent with hierarchical\nmergers. These findings confirm the role of pair-instability in shaping the\nblack hole spectrum, establish a new link between gravitational-wave astronomy\nand nuclear astrophysics, and highlight hierarchical mergers and star cluster\ndynamics as key channels in the growth of black holes."}
{"id": "2509.04706", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.04706", "abs": "https://arxiv.org/abs/2509.04706", "authors": ["Christian Adamcewicz", "Nir Guttman", "Paul D. Lasky", "Eric Thrane"], "title": "Do both black holes spin in merging binaries? Evidence from GWTC-4 and astrophysical implications", "comment": "20 pages, 10 figures", "summary": "Angular momentum transport in high-mass stars is commonly modeled by\nextrapolating the behavior of better-observed low-mass stars. According to the\nconventional picture, the cores of most black hole progenitors lose almost all\nof their angular momentum when their outer layers are ejected before core\ncollapse. Accordingly, most black holes are expected to be born with\ndimensionless spin magnitudes of $\\chi \\lesssim 0.01$, even if some black holes\nare born with non-negligible spin due to tidal interactions in a progenitor\nbinary. One might therefore expect to find a large fraction of $\\chi \\lesssim\n0.01$ black holes in merging binary black hole (BBH) systems. We find that the\nconventional picture of angular momentum transport is in tension with data from\nLIGO--Virgo--KAGRA's fourth gravitational-wave transient catalog. We find no\nsupport for a sub-population of BBH systems with $\\chi \\lesssim 0.01$. Neither\ndo we find support for a sub-population with only one spinning black hole as\nexpected for tidal spin-up scenarios. Instead, we find evidence for two\nsubpopulations in which both black holes have non-negligible spin.\nApproximately 84% of BBH systems contain two black holes with modest spins\n$\\chi \\approx 0.1$ and approximately 16% contain two black holes with large\nspins $\\chi \\approx 0.8$. These estimates come from our best-fit model, which\nis favored with natural log Bayes factors $\\ln B \\gtrsim 3$ over models that\nrequire a sub-population of $\\chi \\lesssim 0.01$ black holes, and models that\ndo not contain multiple spin sub-populations. These results are difficult to\nreconcile with our current understanding of angular momentum transport."}
{"id": "2509.04707", "categories": ["astro-ph.HE", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2509.04707", "abs": "https://arxiv.org/abs/2509.04707", "authors": ["Gabriel Teixeira", "Charlie D. Kilpatrick", "Clécio R. Bom", "André Santos", "Phelipe Darc", "Katie Auchettl", "Álvaro Álvarez-Candal", "Ryan J. Foley", "Pedro K. Humire", "Anthony L. Piro", "Cesar Rojas-Bravo", "Claudia Mendes de Oliveira", "Antonio Kanaan", "Tiago Ribeiro", "William Schoenell"], "title": "SN 2022acko and the Properties of its Red Supergiant Progenitor: Direct Detection, Light Curves, and Nebular Spectroscopy", "comment": null, "summary": "We present ultraviolet, optical, and infrared observations of the Type II-P\nsupernova SN 2022acko in NGC 1300, located at a distance of 19.0 +/- 2.9 Mpc.\nOur dataset spans 1-350 days post-explosion in photometry, complemented by\nlate-time optical spectroscopy covering 200-600 days, and includes deep\npre-explosion imaging. We use this extensive multiwavelength dataset for both\ndirect and indirect constraints on the progenitor system. Using the early-time\nphotometry and shock-cooling models, we infer that SN 2022acko likely\noriginated from a red supergiant with a radius of R ~ 580 solar radii and an\ninitial mass of M ~ 9-10 solar masses. From the radioactive decay tail, we\ninfer a synthesized Ni56 mass of 0.014 +/- 0.004 solar masses. We further model\nnebular-phase spectra using radiative transfer models and nucleosynthesis\nyields for core-collapse supernovae, which suggest a progenitor initial mass in\nthe range of 10-15 solar masses. Meanwhile, blackbody fitting of the detected\npre-explosion counterpart in the F814W and F160W bands indicates a red\nsupergiant with a lower initial mass of approximately 7.5 solar masses. The\nlight curve exhibits a 116 days plateau, indicative of a massive hydrogen-rich\nenvelope, inconsistent with the pre-explosion analysis. We investigated the\ndiscrepancy between direct and indirect progenitor mass estimates, focusing on\nthe roles of binary interaction, early-time modeling limitations, and\nsystematic uncertainties in spectral calibration. Our results indicate that the\ntension among mass estimates likely arises from modeling limitations and flux\ncalibration uncertainties rather than from insufficient data, highlighting the\nneed for more physically realistic models and a deeper understanding of\nsystematic effects."}
{"id": "2509.04723", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.04723", "abs": "https://arxiv.org/abs/2509.04723", "authors": ["Noam Soker"], "title": "Attributing the supernova remnant RCW 89 to the jittering jets explosion mechanism", "comment": "It will be submitted in two days to allow for comments (including\n  missing references)", "summary": "I examine recent radio observations of the supernova remnant (SNR) RCW 89 and\nidentify a point-symmetric morphology composed of two main symmetry axes. I\nattribute this morphology to a jet-driven explosion in the framework of the\njittering jets explosion mechanism (JJEM). To reach this conclusion, I argue\nthat the MSH 15-52 nebula associated with the pulsar PSR B1509-58, the X-ray\nhand-like-shaped nebula, and RCW 89 are two separate core-collapse supernova\n(CCSN) remnants that interact with each other. Namely, the nebula SNR\nG320.4-1.2 contains two CCSN remnants. In essence, I utilize the recent\nsuccesses of the JJEM to account for the morphologies of point-symmetric CCSN\nremnants, thereby explaining the morphology of RCW 89 and identifying it as a\nseparate CCSN remnant. I suggest a process by which somewhat more energetic\npairs of jets in the JJEM have a positive feedback on the accreted gas onto the\nnewly born neutron star, thereby prolonging the life of the jets and explaining\nthe occurrence of two or three energetic pairs of jets in some CCSNe. This\nstudy adds RCW 89 to the growing list of point-symmetric CCSN remnants. The\nJJEM naturally explains these morphologies as shaped by misaligned pairs of\njets that exploded these CCSNe."}
{"id": "2509.04831", "categories": ["astro-ph.HE", "nucl-th"], "pdf": "https://arxiv.org/pdf/2509.04831", "abs": "https://arxiv.org/abs/2509.04831", "authors": ["H. C. Das"], "title": "Influence of Dark Matter on Hybrid and Twin Stars", "comment": "6 pages, 7 figures", "summary": "We investigate the impact of dark matter (DM) on both hybrid and twin stars\nwithin a two-fluid framework, where DM and normal matter interact only through\ngravity. A self-interacting fermionic DM model is considered, while for\nnucleonic and quark matter we employ the relativistic mean-field model and the\nconstant sound-speed parametrization, respectively. Our results show that DM\nsignificantly influences the formation of hybrid and twin stars, depending on\nthe transition pressure and the discontinuity in energy density at a fixed\nsound speed. The presence of DM reduces the number of twin or hybrid stars\ncompared to the case without DM, and this effect directly depends on the DM\nmass and fraction. We further find that the formation of DM-core or DM-halo\nconfigurations is mainly governed by DM parameters, whereas the realization of\ntwin or hybrid star scenarios is primarily controlled by quark parameters.\nUsing the $2M_\\odot$ constraint, we demonstrate that the parameter space for\ntwin stars can be further restricted in both DM-core and DM-halo scenarios."}
{"id": "2509.05113", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.05113", "abs": "https://arxiv.org/abs/2509.05113", "authors": ["Pierpaolo Savina"], "title": "Latest results from the searches for ultra-high-energy photons at the Pierre Auger Observatory", "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC\n  2025), 12 pages, 7 figures", "summary": "The Pierre Auger Observatory is the largest air-shower detector in the world,\noffering unparalleled exposure to photons with energies above $5 \\times\n10^{16}$ eV. Since the start of data collection almost two decades ago,\nnumerous searches for photons have been conducted using the detection systems\nof the Observatory. These searches have led to the most stringent upper limits\non the diffuse photon flux. These limits place severe constraints on current\nmodels regarding the origin of ultra-high-energy cosmic rays and emphasize the\nsignificant capabilities of the Pierre Auger Observatory in the context of\nmultimessenger astronomy at the highest energies. This contribution provides an\noverview of the ongoing efforts to search for high-energy photons in the data\nfrom the Pierre Auger Observatory. The latest results from searches for the\ndiffuse photon flux will be presented, along with follow-up investigations for\nphotons associated with transient events, such as gravitational wave\ndetections. Furthermore, future prospects will be discussed in light of the\nongoing AugerPrime detector upgrade, which will enhance the sensitivity of the\nObservatory to photons up to the highest energies."}
{"id": "2509.05174", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.05174", "abs": "https://arxiv.org/abs/2509.05174", "authors": ["Alexandra M. Moroianu", "Shivani Bhandari", "Maria R. Drout", "Jason W. T. Hessels", "Danté M. Hewitt", "Franz Kirsten", "Benito Marcote", "Ziggy Pleunis", "Mark P. Snelders", "Navin Sridhar", "Uwe Bach", "Emmanuel K. Bempong-Manful", "Vladislavs Bezrukovs", "Richard Blaauw", "Justin D. Bray", "Salvatore Buttaccio", "Shami Chatterjee", "Alessandro Corongiu", "Roman Feiler", "Bryan M. Gaensler", "Marcin P. Gawroński", "Marcello Giroletti", "Adaeze L. Ibik", "Ramesh Karuppusamy", "Mattias Lazda", "Calvin Leung", "Michael Lindqvist", "Kiyoshi W. Masui", "Daniele Michilli", "Kenzie Nimmo", "Omar S. Ould-Boukattine", "Ayush Pandhi", "Zsolt Paragi", "Aaron B. Pearlman", "Weronika Puchalska", "Paul Scholz", "Kaitlyn Shin", "Jurjen J. Sluman", "Matteo Trudu", "David Williams-Baldwin", "Jun Yang"], "title": "A milliarcsecond localization associates FRB 20190417A with a compact, luminous persistent radio source and an extreme magneto-ionic environment", "comment": "Submitted to ApJL. Comments welcome", "summary": "We report the milliarcsecond localization of a high (1379 pc/cc) dispersion\nmeasure (DM) repeating fast radio burst, FRB 20190417A. Combining European VLBI\nNetwork detections of five repeat bursts, we confirm the FRB's host to be a\nlow-metallicity, star-forming dwarf galaxy at z = 0.12817, analogous to the\nhosts of FRBs 20121102A, 20190520B and 20240114A. We also show that FRB\n20190417A is spatially coincident with a compact, luminous persistent radio\nsource (PRS). Visibility-domain model fitting constrains the transverse\nphysical size of the PRS to < 23.1 pc and yields an integrated flux density of\n191(39) microJy at 1.4 GHz. Though we do not find significant evidence for DM\nevolution, FRB 20190417A exhibits a time-variable rotation measure (RM) ranging\nbetween +3958(11) and +5061(24) rad/m2 over three years. We find no evidence\nfor intervening galaxy clusters in the FRB's line-of-sight and place a\nconservative lower limit on the rest-frame host DM contribution of 1212.0 pc/cc\n(90% confidence) -- the largest known for any FRB so far. This system\nstrengthens the emerging picture of a rare subclass of repeating FRBs with\nlarge and variable RMs, above-average host DMs, and luminous PRS counterparts\nin metal-poor dwarf galaxies. We explore the role of these systems in the\nbroader FRB population, either as the youngest or most extreme FRB sources, or\nas a distinct engine for FRB emission."}
{"id": "2509.05240", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.05240", "abs": "https://arxiv.org/abs/2509.05240", "authors": ["Michela Negro", "Haocheng Zhang", "Niccolò Di Lalla", "Slavko Bogdanov", "Zorawar Wadiasingh", "Noel Klingler", "Jeremy Hare"], "title": "Testing Magnetic Field Configurations in Spider Pulsar PSR J1723-2837 with IXPE", "comment": null, "summary": "We present the first X-ray polarimetry observations of a redback millisecond\npulsar binary, \\src, with the Imaging X-ray Polarimetry Explorer (IXPE).\nRedbacks are compact binaries in which a rotation-powered millisecond pulsar\ninteracts with a non-degenerate companion via an intrabinary shock, forming\nideal laboratories for probing pulsar winds and relativistic shock physics,\nwhere ordered magnetic fields and particle acceleration shape the observed\nradiation. We conduct a spectro-polarimetric analysis combining IXPE data with\narchival Chandra, XMM-Newton, NuSTAR, and Swift observations. We explore two\nlimiting magnetic field configurations, parallel and perpendicular to the bulk\nflow, and simulate their expected polarization signatures using the {\\tt 3DPol}\nradiative transport code. To account for the rapid rotation of the polarization\nangle predicted by these models, we implement a phase-dependent Stokes\nalignment procedure that preserves the polarization degree while correcting for\nphase-rotating PA. We also devise a new maximum-likelihood fitting strategy to\ndetermine the phase-dependence of the polarization angle by minimizing the\npolarization degree uncertainty. This technique shows a hint the binary may be\nrotating clockwise relative to the celestial north pole. We find no significant\ndetection of polarization in the IXPE data, with PD<51% at 99% confidence\nlevel. Our results excludes the high-polarization degree scenario predicted by\nthe perpendicular field model during the brightest orbital phase bin.\nSimulations show that doubling the current exposure would make the parallel\nconfiguration detectable. The new PA rotation technique is also applicable to\nIXPE data of many sources whose intrinsic PA variation is apriori not known but\nis strictly periodic."}
{"id": "2509.04975", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.04975", "abs": "https://arxiv.org/abs/2509.04975", "authors": ["Pim van Dillen"], "title": "Results and plans to apply interferometry to air shower observations at the Pierre Auger Observatory", "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC\n  2025). 8 pages, 5 figures", "summary": "By analysing the radio emissions from air showers using interferometry, we\ncan estimate their properties. In this contribution, we apply interferometry to\nreconstruct air-shower parameters based on measurements taken with the Auger\nEngineering Radio Array (AERA) at the Pierre Auger Observatory. This\nreconstruction method is achievable at AERA through precise clock\nsynchronisation with a beacon and an accurate survey of the station locations.\nInterferometry has been applied to several thousand inclined air-shower\nobservations for the first time, which allows for tests on the performance of\nair-shower geometry reconstruction, recovery of the radio signal from\nlow-energy air showers, and methods to study the polarisation of the\nradio-emission mechanisms. Additionally, in this contribution, we will also\nprovide an overview of efforts to enable interferometry for the recently\ninstalled radio detectors that are part of the AugerPrime upgrade."}
