{"id": "2510.03653", "categories": ["astro-ph.IM", "physics.ins-det"], "pdf": "https://arxiv.org/pdf/2510.03653", "abs": "https://arxiv.org/abs/2510.03653", "authors": ["Benjamin J. Vaughan", "Yuhan Wang", "Cody J. Duell", "Jason Austermann", "James R. Burgoyne", "Scott Chapman", "Steve K. Choi", "Abigail T. Crites", "Eliza Gazda", "Ben Keller", "Michael D. Niemack", "Darshan A. Patel", "Anna Vaskuri", "Eve M. Vavagiakis", "Michael Vissers", "Samantha Walker", "Jordan Wheeler", "Ruixuan", "Xie"], "title": "CCAT: Magnetic Sensitivity Measurements of Kinetic Inductance Detectors", "comment": null, "summary": "The CCAT Observatory is a ground-based submillimeter to millimeter experiment\nlocated on Cerro Chajnantor in the Atacama Desert, at an altitude of 5,600\nmeters. CCAT features the 6-meter Fred Young Submillimeter Telescope (FYST),\nwhich will cover frequency bands from 210 GHz to 850 GHz using its\nfirst-generation science instrument, Prime-Cam. The detectors used in Prime-Cam\nare feedhorn-coupled, lumped-element superconducting microwave kinetic\ninductance detectors (KIDs). The telescope will perform wide-area surveys at\nspeeds on the order of degrees per second. During telescope operation, the KIDs\nare exposed to changes in the magnetic field caused by the telescope's movement\nthrough Earth's magnetic field and internal sources within the telescope. We\npresent and compare measurements of the magnetic sensitivity of three different\nCCAT KID designs at 100 mK. The measurements are conducted in a dilution\nrefrigerator (DR) with a set of room temperature Helmholtz coils positioned\naround the DR. We discuss the implications of these results for CCAT field\noperations."}
{"id": "2510.04659", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2510.04659", "abs": "https://arxiv.org/abs/2510.04659", "authors": ["S. Piscitelli", "G. Ponti", "M. Civitani", "D. Spiga"], "title": "Introducing The SHell misAlignment Detection for straylight Estimation (SHADE) algorithm: the case of XMM-Newton", "comment": null, "summary": "When performing X-ray observations with a Wolter-I telescope, the presence of\nbright off-axis sources can introduce unfocused rays, known as straylight,\nwhich contaminate the detector and compromise the scientific analysis. Among\nthe different components of straylight, single reflections off the hyperboloid\nsection of the mirror shells often produce arc-like patterns on the detector.\nThese arcs depend not only on the off-axis angle of the source but also on the\ngeometrical alignment of the individual shells. In this paper, we introduce the\nSHell misAlignment Detection for straylight Estimation (SHADE) algorithm, a\nnovel and flexible tool designed to infer the misalignment parameters of\nindividual shells, reproduce the geometry of straylight arcs and predict its\npattern on the detector. SHADE allows us to model each shell displacement with\ntwo parameters: $(\\gamma,\\xi)$ that represents the tilt amplitude and\ndirection. While the algorithm is general and applicable to any Wolter-like\ntelescope, we demonstrate its effectiveness using a set of XMM-Newton\nobservations of the low-mass X-ray binary GX5-1. As a proof of concept, we\nrecover the best-fit misalignment parameters for a selected shell, obtaining\n$\\gamma = 21.9''^{+10.3}_{-9.02}$ and $\\xi = 5.88^{+1.02}_{-0.97}$ rad. SHADE\nrepresents a new approach to diagnosing mirror misalignments from straylight\npatterns and can support both pre and post-launch calibration efforts and\nfuture telescope designs."}
{"id": "2510.04665", "categories": ["astro-ph.IM", "cs.DC"], "pdf": "https://arxiv.org/pdf/2510.04665", "abs": "https://arxiv.org/abs/2510.04665", "authors": ["Eva Sciacca", "Nicola Tuccari", "Umer Arshad", "Fabio Pitari", "Giuseppa Muscianisi", "Emiliano Tramontana"], "title": "Interactive High-Performance Visualization for Astronomy and Cosmology", "comment": null, "summary": "The exponential growth of data in Astrophysics and Cosmology demands scalable\ncomputational tools and intuitive interfaces for analysis and visualization. In\nthis work, we present an innovative integration of the VisIVO scientific\nvisualization framework with the InterActive Computing (IAC) service at Cineca,\nenabling interactive, high-performance visual workflows directly within HPC\nenvironments. Through seamless integration into Jupyter-based science gateways,\nusers can now access GPU-enabled compute nodes to perform complex 3D\nvisualizations using VisIVO via custom Python wrappers and preconfigured\ninteractive notebooks. We demonstrate how this infrastructure simplifies access\nto advanced HPC resources, enhances reproducibility, and accelerates\nexploratory workflows in astronomical research. Our approach has been validated\nthrough a set of representative use cases involving large-scale simulations\nfrom the GADGET code, highlighting the effectiveness of this system in\nvisualizing the large-scale structure of the Universe. This work exemplifies\nhow science gateways can bridge domain-specific tools and advanced\ninfrastructures, fostering user-centric, scalable, and reproducible research\nenvironments."}
{"id": "2510.04718", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2510.04718", "abs": "https://arxiv.org/abs/2510.04718", "authors": ["R. Nicolaas", "S. Caron", "F. Stoppa", "S. Bhattacharyya", "R. Ruiz de Austri", "P. J. Groot", "A. J. Levan"], "title": "BGRem: A background noise remover for astronomical images based on a diffusion model", "comment": null, "summary": "Context: Astronomical imaging aims to maximize signal capture while\nminimizing noise. Enhancing the signal-to-noise ratio directly on detectors is\ndifficult and expensive, leading to extensive research in advanced\npost-processing techniques.\n  Aims: Removing background noise from images is a valuable pre-processing step\ncatalog-building tasks. We introduce BGRem, a machine learning (ML) based tool\nto remove background noise from astronomical images.\n  Methods: BGRem uses a diffusion-based model with an attention U-Net as\nbackbone, trained on simulated images for optical and gamma ({\\gamma})-ray data\nfrom the MeerLICHT and Fermi-LAT telescopes. In a supervised manner, BGRem\nlearns to denoise astronomical images over several diffusion steps.\n  Results: BGRem performance was compared with a widely used tool for\ncataloging astronomical sources, SourceExtractor (SExtractor). It was shown\nthat the amount of true positive sources using SExtractor increased by about 7%\nfor MeerLICHT data when BGRem was used as a pre-processing step. We also show\nthe generalizability of BGRem by testing it with optical images from different\ntelescopes and also on simulated {\\gamma}-ray data representative of the\nFermi-LAT telescope. We show that in both cases, BGRem improves the source\ndetection efficiency.\n  Conclusions: BGRem can improve the accuracy in source detection of\ntraditional pixel-based methods by removing complex background noise. Using\nzero-shot approach, BGRem can generalize well to a wide range of optical\nimages. The successful application of BGRem to simulated {\\gamma}-ray images,\nalongside optical data, demonstrates its adaptability to distinct noise\ncharacteristics and observational domains. This cross-wavelength performance\nhighlights its potential as a general-purpose background removal framework for\nmulti-wavelength astronomical surveys."}
{"id": "2510.03396", "categories": ["astro-ph.HE", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2510.03396", "abs": "https://arxiv.org/abs/2510.03396", "authors": ["Hila Glanz", "Hagai B. Perets", "Aakash Bhat"], "title": "Faint supernovae and hyper-runaway white-dwarfs from single He-detonation in double HeCO-white-dwarf mergers", "comment": "8 pages, 4 figures, 2 tables. Comments welcome!", "summary": "We present three-dimensional hydrodynamical simulations of mergers between\nlow-mass hybrid HeCO white dwarfs (WDs), offering new insights into the\ndiversity of thermonuclear transients. Unlike previously studied mergers\ninvolving higher-mass HeCO WDs and CO WDs, where helium detonation often\ntriggers core ignition, our simulations reveal incomplete helium shell\ndetonations in comparable-mass, lower-mass WD pairs. The result is a faint,\nrapidly evolving transient driven by the ejection of intermediate-mass elements\nand radioactive isotopes such as $^{48}$Cr and $^{52}$Fe, without significant\n$^{56}$Ni production. These transients may be detectable in upcoming wide-field\nsurveys and could account for a subset of faint thermonuclear supernovae.\nLong-term evolution of the merger remnant shows that high-velocity PG-1159-type\nstars might be formed through this scenario, similar to normal CO-CO white\ndwarf mergers. This work expands our understanding of white dwarf mergers and\ntheir implications for nucleosynthesis and stellar evolution."}
{"id": "2510.04957", "categories": ["astro-ph.IM", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2510.04957", "abs": "https://arxiv.org/abs/2510.04957", "authors": ["Rongrong Liu", "Eric W. Peng", "Kaixiang Wang", "Laura Ferrarese", "Patrick Côté"], "title": "Galaxy Model Subtraction with a Convolutional Denoising Autoencoder", "comment": null, "summary": "Galaxy model subtraction removes the smooth light of nearby galaxies so that\nfainter sources (e.g., stars, star clusters, background galaxies) can be\nidentified and measured. Traditional approaches (isophotal or parametric\nfitting) are semi-automated and can be challenging for large data sets. We\nbuild a convolutional denoising autoencoder (DAE) for galaxy model subtraction:\nimages are compressed to a latent representation and reconstructed to yield the\nsmooth galaxy, suppressing other objects. The DAE is trained on\nGALFIT-generated model galaxies injected into real sky backgrounds and tested\non real images from the Next Generation Virgo Cluster Survey (NGVS). To\nquantify performance, we conduct an injection-recovery experiment on residual\nimages by adding mock globular clusters (GCs) with known fluxes and positions.\nOur tests confirm a higher recovery rate of mock GCs near galaxy centers for\ncomplex morphologies, while matching ellipse fitting for smooth ellipticals.\nOverall, the DAE achieves subtraction equivalent to isophotal ellipse fitting\nfor regular ellipticals and superior results for galaxies with high\nellipticities or spiral features. Photometry of small-scale sources on DAE\nresiduals is consistent with that on ellipse-subtracted residuals. Once\ntrained, the DAE processes an image cutout in $\\lesssim 0.1$ s, enabling fast,\nfully automatic analysis of large data sets. We make our code available for\ndownload and use."}
{"id": "2510.03402", "categories": ["astro-ph.HE", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2510.03402", "abs": "https://arxiv.org/abs/2510.03402", "authors": ["A. A. Chrimes", "P. G. Jonker", "A. J. Levan", "A. Mummery"], "title": "Luminous Fast Blue Optical Transients as very massive star core-collapse events", "comment": "8 pages, 6 figures, 1 table. Submitted to A&A, comments welcome", "summary": "Luminous Fast Blue Optical Transients (LFBOTs) are rare extragalactic events\nof unknown origin. Tidal disruptions of white dwarfs by intermediate mass black\nholes, mergers of black holes and Wolf-Rayet stars, and failed supernovae are\namong the suggestions. In this paper, we explore the viability of very massive\nstar core-collapse events as the origin of LFBOTs. The appeal of such a model\nis that the formation of massive black holes via core collapse may yield\nobservational signatures that can match the disparate lines of evidence that\npoint towards both core-collapse and tidal disruption origins for LFBOTs. We\nexplore the formation rate of massive black holes in population synthesis\nmodels, and compare the metallicities of their progenitors with the observed\nmetallicities of LFBOT host galaxies. We further examine the composition, mass\nloss rates and fallback masses of these stars, placing them in the context of\nLFBOT observations. The formation rate of black holes with mass greater than\n~30-40Msol is similar to the observed LFBOT rate. The stars producing these\nblack holes are biased to low metallicity (Z<0.3Zsol), are H and He-poor and\nhave dense circumstellar media. However, some LFBOTs have host galaxies with\nhigher metallicities than predicted, and others have denser environments\n(plausibly due to late mass loss not captured in the models). We find that\nlong-lived emission from an accretion disc (as implicated in the prototypical\nLFBOT AT2018cow) can plausibly be produced in these events. We conclude that\n(very) massive star core-collapse is a plausible explanation for LFBOTs. The\npreferred progenitors for LFBOTs in this scenario overlap with those predicted\nto produce super-kilonovae. We therefore suggest that LFBOTs are promising\ntargets to search for super-kilonovae, and that they may contribute\nnon-negligibly to the r-process enrichment of galaxies."}
{"id": "2510.05002", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2510.05002", "abs": "https://arxiv.org/abs/2510.05002", "authors": ["John Rankin", "Sergio Campana", "Giovanni Pareschi", "Daniele Spiga", "Stefano Basso", "Marta Maria Civitani", "Paolo Conconi", "Vincenzo Cotroneo"], "title": "Study of Lobster and Kirkpatrick-Baez Designs for a Small Mission dedicated to Gravitational Wave Transient Localization", "comment": null, "summary": "The localization of X-ray counterparts to gravitational wave events requires\na telescope with accurate localization capability in a field of view comparable\nto the region constrained by the gravitational wave detectors. In the context\nof a small, dedicated, mission, we investigate which optical design could\nsatisfy this capability. We compare the possible optical designs that have been\nproposed for X-rays: the Lobster Eye design (both in the Angel and Schmidt\nvariant) - inspired by the eyes of crustaceans - consisting of many small\ncapillaries where grazing incidence reflection occurs, the Kirkpatrick-Baez\ndesign, where double reflection occurs on two orthogonal parabolic mirrors, and\nthe standard Wolter-I design. We find that the first two designs, compared to\nthe latter, can achieve a significantly larger field of view, and have a good\nlocalization capability if the focal length is longer than existing Lobster Eye\ndesigns. The Kirkpatrick-Baez design presents the best angular resolution, but\nthe best overall field of view is obtained with a Lobster system: we present a\nsmall optical module able to achieve an effective area $>$100 cm$^2$ at 1 keV\nin a field of view of 10 deg$^2$."}
{"id": "2510.03409", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.03409", "abs": "https://arxiv.org/abs/2510.03409", "authors": ["A. Viitanen", "G. Mountrichas", "H. Stiele", "F. J. Carrera", "A. Ruiz", "J. Ballet", "A. Akylas", "A. Corral", "M. Freyberg", "A. Georgakakis", "I. Georgantopoulos", "S. Mateos", "C. Motch", "A. Nebot", "H. Tranin", "N. Webb"], "title": "Harnessing the XMM-Newton data: X-ray spectral modelling of 4XMM-DR11 detections and 4XMM-DR11s sources", "comment": "22 pages 14 figures, accepted for publication in Astronomy &\n  Astrophysics", "summary": "The XMM-Newton X-ray observatory has played a prominent role in astrophysics,\nconducting precise and thorough observations of the X-ray sky for the past two\ndecades. The most recent iteration of the 4XMM catalogue and one of its latest\ndata releases DR11 mark significant improvements over previous XMM-Newton\ncatalogues, serving as a cornerstone for comprehending the diverse inhabitants\nof the X-ray sky. We employ detections and spectra extracted from the 4XMM-DR11\ncatalogue, subjecting them to fitting procedures using simple models. Our study\noperates within the framework of the XMM2ATHENA project, which focuses on\ndeveloping state-of-the-art methods that exploit existing XMM-Newton data. We\nintroduce and publicly release four catalogues containing measurements derived\nfrom X-ray spectral modelling of sources. The first catalogue encompasses\noutcomes obtained by fitting an absorbed power law model to all the extracted\nspectra for individual detections within the 4XMM-DR11 dataset. The second\ncatalogue presents results obtained by fitting both an absorbed power law and\nan absorbed blackbody model to all unique physical sources listed in the\n4XMM-DR11s catalogue, which documents source detection results from overlapping\nXMM-Newton observations. For the third catalogue we use the five band count\nrates derived from the pipe line detection of X-ray sources to mimic low\nresolution spectra to get a rough estimate of the spectral shape (absorbed\npower-law) of all 4XMM-DR11 detections. In the fourth catalogue, we conduct\nspectral analyses for the subset of identified sources with extracted spectra,\nemploying various models based on their classification into categories such as\nAGN, stars, X-ray binaries, and cataclysmic variables. The scientific potential\nof these catalogues is highlighted by discussing the capabilities of optical\nand mid-infrared colours for selecting absorbed AGN. (abridged)"}
{"id": "2510.05016", "categories": ["astro-ph.IM", "cs.AI", "cs.CL"], "pdf": "https://arxiv.org/pdf/2510.05016", "abs": "https://arxiv.org/abs/2510.05016", "authors": ["Lucas Carrit Delgado Pinheiro", "Ziru Chen", "Bruno Caixeta Piazza", "Ness Shroff", "Yingbin Liang", "Yuan-Sen Ting", "Huan Sun"], "title": "Large Language Models Achieve Gold Medal Performance at International Astronomy & Astrophysics Olympiad", "comment": "18 pages, 6 figures, to be submitted, comments are welcome", "summary": "While task-specific demonstrations show early success in applying large\nlanguage models (LLMs) to automate some astronomical research tasks, they only\nprovide incomplete views of all necessary capabilities in solving astronomy\nproblems, calling for more thorough understanding of LLMs' strengths and\nlimitations. So far, existing benchmarks and evaluations focus on simple\nquestion-answering that primarily tests astronomical knowledge and fails to\nevaluate the complex reasoning required for real-world research in the\ndiscipline. Here, we address this gap by systematically benchmarking five\nstate-of-the-art LLMs on the International Olympiad on Astronomy and\nAstrophysics (IOAA) exams, which are designed to examine deep conceptual\nunderstanding, multi-step derivations, and multimodal analysis. With average\nscores of 85.6% and 84.2%, Gemini 2.5 Pro and GPT-5 (the two top-performing\nmodels) not only achieve gold medal level performance but also rank in the top\ntwo among ~200-300 participants in all four IOAA theory exams evaluated\n(2022-2025). In comparison, results on the data analysis exams show more\ndivergence. GPT-5 still excels in the exams with an 88.5% average score,\nranking top 10 among the participants in the four most recent IOAAs, while\nother models' performances drop to 48-76%. Furthermore, our in-depth error\nanalysis underscores conceptual reasoning, geometric reasoning, and spatial\nvisualization (52-79% accuracy) as consistent weaknesses among all LLMs. Hence,\nalthough LLMs approach peak human performance in theory exams, critical gaps\nmust be addressed before they can serve as autonomous research agents in\nastronomy."}
{"id": "2510.03410", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.03410", "abs": "https://arxiv.org/abs/2510.03410", "authors": ["D. Urošević", "B. Vukotić", "M. Anđelić", "N. Mladenović"], "title": "Updated Radio Sigma-D Relation and Distances to the Shell-Like Galactic Supernova Remnants -- IV", "comment": "14 pages, 1 figure", "summary": "We present a new selected sample of 69 Galactic supernova remnants (SNRs) for\ncalibration of radio $\\Sigma-D$ relation at 1 GHz. Calibrators with the most\nreliable distances were selected through an extensive literature search. The\ncalibration is performed using kernel smoothing of the selected sample of\ncalibrators in $\\Sigma-D$ plane and an orthogonal offsets fitting procedure. We\nuse the obtained calibration to derive the distances to 164 Galactic SNRs and\n27 new detected SNRs/SNR candidates with none or poor distance estimates. The\nanalysis given in this paper confirms the expected predictions from our\nprevious papers that the kernel smoothing method is more reliable for SNR\ndistance calibration than the orthogonal offset fitting method, except for the\ndistance determinations of the very low brightness SNRs."}
{"id": "2510.04857", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2510.04857", "abs": "https://arxiv.org/abs/2510.04857", "authors": ["Katharina Egg", "Alison M. W. Mitchell"], "title": "Joint eROSITA and H.E.S.S. analysis of MSH 15-52 using Gammapy", "comment": "8 pages, 4 figures, 3 tables. Proceedings of the 39th International\n  Cosmic Ray Conference (ICRC 2025)", "summary": "Pulsar wind nebulae (PWNe) are prominent sources in the very-high energy\n(VHE) gamma-ray sky, constituting the most numerous identified source class in\nthe H.E.S.S. Galactic Plane Survey (HGPS). They are comprised of energetic\nparticles originating from the pulsar and expanding into the surrounding\nmedium. As such, PWNe are of very high scientific interest as PeVatron\ncandidates, objects that could potentially accelerate particles up to PeV\nenergies. Additionally other aspects of their acceleration mechanism are being\nactively investigated, such as the open question of whether they accelerate not\nonly leptonic but also hadronic particles, and the details of their morphology\nand particle transport mechanism. As PWNe emit photons over a broad range of\nthe electromagnetic spectrum, multiwavelength (MWL) studies are crucial for the\ninvestigation and study of their emission.\n  In this vein we present a joint eROSITA X-ray and H.E.S.S. gamma-ray study of\nthe PWN MSH 15-52. We showcase our custom code for integrating the EDR and DR1\neROSITA data into the Gammapy framework, a python package optimised for the\nanalysis of gamma-ray data. We present the first 3D (spatial and spectral) fit\nto eROSITA data by using Gammapy. We furthermore combine these data with the\npublic H.E.S.S. gamma-ray observations of MSH 15-52, resulting in a joint\nphysical fit of the underlying particle population, and a subsequent discussion\nof the physical implications of our results. Finally we give an outlook towards\nfuture efforts in MWL studies of PWNe and the broader context of MWL data\nanalysis with Gammapy."}
{"id": "2510.03428", "categories": ["astro-ph.HE", "hep-ph"], "pdf": "https://arxiv.org/pdf/2510.03428", "abs": "https://arxiv.org/abs/2510.03428", "authors": ["Diksha Garg", "Laksha Pradip Das", "Mary Hall Reno"], "title": "Atmospheric pion, kaon, and muon fluxes for sub-orbital experiments", "comment": "17 pages, 8 figures, 2 tables", "summary": "Cosmic rays interacting with the Earth's atmosphere generate extensive air\nshowers, which produce Cherenkov, fluorescence and radio emissions. These\nemissions are key signatures for detection by ground-based, sub-orbital, and\nsatellite-based telescopes aiming to study high energy cosmic ray and neutrino\nevents. However, detectors operating at ground and balloon altitudes are also\nexposed to a background of atmospheric charged particles, primarily pions,\nkaons, and muons, that can mimic or obscure the signals from astrophysical\nsources. In this work, we use coupled cascade equations to calculate the\natmospheric pion, kaon and muon fluxes reaching detectors at various altitudes.\nOur analysis focuses on energies above 10 GeV, where the influence of the\nEarth's magnetic field on particle trajectories is minimal. We provide angular\nand energy-resolved flux estimates and discuss their relevance as background\nfor extensive air shower detection. Our results are potentially relevant for\ninterpreting data from current and future balloon-borne experiments such as\nEUSO-SPB2 and for refining trigger and veto strategies in Cherenkov and\nfluorescence telescopes."}
{"id": "2510.03602", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.03602", "abs": "https://arxiv.org/abs/2510.03602", "authors": ["Gargi Sen", "Debaprasad Maity", "Santabrata Das"], "title": "GRMHD modelling of accretion flow around Sagittarius A$^*$ constrained by EHT measurements", "comment": "11 pages, 2 figures, accepted for publication in PRD", "summary": "We study low angular momentum, advective accretion flows around a Kerr black\nhole within the framework of general relativistic magnetohydrodynamics (GRMHD)\nin the steady state. By solving the full set of GRMHD equations, we aim to\nprovide a comprehensive understanding of the behavior of magnetized plasma in\nthe strong gravity regime near a rotating black hole. The accretion solutions\nare obtained for a set of input parameters, namely energy (${\\cal E}$), angular\nmomentum (${\\cal L}$), magnetic flux ($\\Phi$), and isorotation parameter ($I$).\nBy systematically varying these parameters, we generate a family of global\nGRMHD accretion solutions that characterize the physical environment around the\nblack hole. Using this approach, we investigate whether the inferred magnetic\nfield strengths reported by the Event Horizon Telescope (EHT) for Sagittarius\nA$^*$ at various radii can be reproduced. We find that, for a broad range of\nparameter values, our model successfully recovers the EHT inferred magnetic\nfield strengths with an accuracy of approximately $10\\%$, offering a\nself-consistent framework for interpreting near-horizon accretion physics."}
{"id": "2510.03702", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.03702", "abs": "https://arxiv.org/abs/2510.03702", "authors": ["The CTAO-LST Project", ":", "K. Abe", "S. Abe", "A. Abhishek", "F. Acero", "A. Aguasca-Cabot", "I. Agudo", "C. Alispach", "D. Ambrosino", "F. Ambrosino", "L. A. Antonelli", "C. Aramo", "A. Arbet-Engels", "C. Arcaro", "T. T. H. Arnesen", "K. Asano", "P. Aubert", "A. Baktash", "M. Balbo", "A. Bamba", "A. Baquero Larriva", "U. Barres de Almeida", "J. A. Barrio", "L. Barrios Jiménez", "I. Batkovic", "J. Baxter", "J. Becerra González", "E. Bernardini", "J. Bernete", "A. Berti", "I. Bezshyiko", "C. Bigongiari", "E. Bissaldi", "O. Blanch", "G. Bonnoli", "P. Bordas", "G. Borkowski", "G. Brunelli", "A. Bulgarelli", "M. Bunse", "I. Burelli", "L. Burmistrov", "M. Cardillo", "S. Caroff", "A. Carosi", "R. Carraro", "M. S. Carrasco", "F. Cassol", "D. Cerasole", "G. Ceribella", "A. Cerviño Cortínez", "Y. Chai", "K. Cheng", "A. Chiavassa", "M. Chikawa", "G. Chon", "L. Chytk", "G. M. Cicciari", "A. Cifuentes", "J. L. Contreras", "J. Cortina", "H. Costantini", "M. Dalchenko", "P. Da Vela", "F. Dazzi", "A. De Angelis", "M. de Bony de Lavergne", "R. Del Burgo", "C. Delgado", "J. Delgado Mengual", "M. Dellaiera", "D. della Volpe", "B. De Lotto", "L. Del Peral", "R. de Menezes", "G. De Palma", "C. Díaz", "G. Di Marco", "A. Di Piano", "F. Di Pierr", "R. Di Tria", "L. Di Venere", "R. M. Dominik", "D. Dominis Prester", "A. Donini", "D. Dorner", "M. Doro", "L. Eisenberger", "D. Elsässer", "G. Emery", "J. Escudero", "V. Fallah Ramazani", "F. Ferrarotto", "A. Fiasson", "L. Foffano", "F. Frías García-Lago", "S. Fröse", "Y. Fukazawa", "S. Gallozzi", "R. Garcia López", "S. Garcia Soto", "C. Gasbarra", "D. Gasparrini", "D. Geyer", "J. Giesbrecht Paiva", "N. Giglietto", "F. Giordano", "N. Godinovic", "T. Gradetzke", "R. Grau", "D. Green", "J. Green", "S. Gunji", "P. Günther", "J. Hackfeld", "D. Hadasch", "A. Hahn", "M. Hashizume", "T. Hassan", "K. Hayashi", "L. Heckmann", "M. Heller", "J. Herrera Llorente", "K. Hirotani", "D. Hoffmann", "D. Horns", "J. Houles", "M. Hrabovsky", "D. Hrupec", "D. Hui", "M. Iarlori", "R. Imazawa", "T. Inada", "Y. Inome", "S. Inoue", "K. Ioka", "M. Iori", "T. Itokawa", "A. Iuliano", "J. Jahanvi", "I. Jimenez Martinez", "J. Jimenez Quiles", "I. Jorge Rodrigo", "J. Jurysek", "M. Kagaya", "O. Kalashev", "V. Karas", "H. Katagiri", "D. Kerszberg", "T. Kiyomoto", "Y. Kobayashi", "K. Kohri", "A. Kong", "P. Kornecki", "H. Kubo", "J. Kushida", "B. Lacave", "M. Lainez", "G. Lamanna", "A. Lamastra", "L. Lemoigne", "M. Linhoff", "S. Lombardi", "F. Longo", "R. López-Coto", "M. López-Moya", "A. López-Oramas", "S. Loporchio", "A. Lorini", "J. Lozano Bahilo", "F. Lucarelli", "H. Luciani", "P. L. Luque-Escamilla", "P. Majumdar", "M. Makariev", "M. Mallamaci", "D. Mandat", "M. Manganaro", "D. K. Maniadakis", "G. Manicò", "K. Mannheim", "S. Marchesi", "F. Marini", "M. Mariotti", "P. Marquez", "G. Marsella", "J. Martí", "O. Martinez", "G. Martínez", "M. Martínez", "A. Mas-Aguilar", "M. Massa", "G. Maurin", "D. Mazin", "J. Méndez-Gallego", "S. Menon", "E. Mestre Guillen", "D. Miceli", "T. Miener", "J. M. Miranda", "R. Mirzoyan", "M. Mizote", "T. Mizuno", "M. Molero Gonzalez", "E. Molina", "T. Montaruli", "A. Moralejo", "D. Morcuende", "A. Moreno Ramos", "A. Morselli", "V. Moya", "H. Muraishi", "S. Nagataki", "T. Nakamori", "A. Neronov", "D. Nieto Castaño", "M. Nievas Rosillo", "L. Nikolic", "K. Nishijima", "K. Noda", "D. Nosek", "V. Novotny", "S. Nozaki", "M. Ohishi", "Y. Ohtani", "T. Oka", "A. Okumura", "R. Orito", "L. Orsini", "J. Otero-Santos", "P. Ottanelli", "M. Palatiello", "G. Panebianco", "D. Paneque", "F. R. Pantaleo", "R. Paoletti", "J. M. Paredes", "M. Pech", "M. Pecimotika", "M. Peresano", "F. Pfeifle", "E. Pietropaolo", "M. Pihet", "G. Pirola", "C. Plard", "F. Podobnik", "M. Polo", "E. Prandini", "C. Priyadarshi", "M. Prouza", "S. Rainò", "R. Rando", "W. Rhode", "M. Ribó", "V. Rizi", "G. Rodriguez Fernandez", "M. D. Rodríguez Frías", "P. Romano", "A. Roy", "A. Ruina", "E. Ruiz-Velasco", "T. Saito", "S. Sakurai", "D. A. Sanchez", "H. Sano", "T. Šarić", "Y. Sato", "F. G. Saturni", "V. Savchenko", "F. Schiavone", "B. Schleicher", "F. Schmuckermaier", "J. L. Schubert", "F. Schussler", "T. Schweizer", "M. Seglar Arroyo", "T. Siegert", "G. Silvestri", "A. Simongini", "J. Sitarek", "V. Sliusar", "A. Stamerra", "J. Strišković", "M. Strzys", "Y. Suda", "A. Sunny", "H. Tajima", "M. Takahashi", "J. Takata", "R. Takeishi", "P. H. T. Tam", "S. J. Tanaka", "D. Tateishi", "T. Tavernier", "P. Temnikov", "Y. Terada", "K. Terauchi", "T. Terzic", "M. Teshima", "M. Tluczykont", "F. Tokanai", "T. Tomura", "D. F. Torres", "F. Tramonti", "P. Travnicek", "G. Tripodo", "A. Tutone", "M. Vacula", "J. van Scherpenberg", "M. Vázquez Acosta", "S. Ventura", "S. Vercellone", "G. Verna", "I. Viale", "A. Vigliano", "C. F. Vigorito", "E. Visentin", "V. Vitale", "V. Voitsekhovskyi", "G. Voutsinas", "I. Vovk", "T. Vuillaume", "R. Walter", "L. Wan", "M. Will", "J. Wójtowicz", "T. Yamamoto", "R. Yamazaki", "Y. Yao", "P. K. H. Yeung", "T. Yoshida", "T. Yoshikoshi", "W. Zhang"], "title": "VHE $γ$-ray observations of bright BL Lacs with the Large-Sized Telescope prototype (LST-1) of the CTAO", "comment": "18 pages, 18 figures. Accepted for publication in Monthly Notices of\n  the Royal Astronomical Society", "summary": "Cherenkov Telescope Array Observatory (CTAO) is the next-generation\nground-based gamma-ray observatory operating in the energy range from 20 GeV up\nto 300 TeV, with two sites in La Palma (Spain) and Paranal (Chile). It will\nconsist of telescopes of three sizes, covering different parts of the large\nenergy range. We report on the performance of Large-Sized Telescope prototype\n(LST-1) in the detection and characterization of extragalactic gamma-ray\nsources, with a focus on the reconstructed gamma-ray spectra and variability of\nclassical bright BL Lacertae objects, which were observed during the early\ncommissioning phase of the instrument. LST-1 data from known bright gamma-ray\nblazars - Markarian 421, Markarian 501, 1ES 1959+650, 1ES 0647+250, and PG\n1553+113 - were collected between July 10, 2020, and May 23, 2022, covering a\nzenith angle range of 4 deg to 57 deg. The reconstructed light curves were\nanalyzed using a Bayesian block algorithm to distinguish the different activity\nphases of each blazar. Simultaneous Fermi-LAT data were utilized to reconstruct\nthe broadband $\\gamma$-ray spectra for the sources during each activity phase.\nHigh-level reconstructed data in a format compatible with gammapy are provided\ntogether with measured light curves and spectral energy distributions (SEDs)\nfor several bright blazars and an interpretation of the observed variability in\nlong and short timescales. Simulations of historical flares are generated to\nevaluate the sensitivity of LST-1. This work represents the first milestone in\nmonitoring bright BL Lacertae objects with a CTAO telescope."}
{"id": "2510.04210", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.04210", "abs": "https://arxiv.org/abs/2510.04210", "authors": ["Yuan Tan", "Youjun Lu", "Kunyu Song"], "title": "Limiting the Yukawa Gravity through the Black Hole Shadows of Sgr A* and M87*", "comment": "39 pages, 8 figures, published in Physics of the Dark Universe", "summary": "Recently, the \\textit{EHT} collaboration unveiled the shadow images of the\nsupermassive black hole (SMBH) M87* and Sgr A*, with angular radii of\n$42\\pm3$\\,$\\mu$as and $48.7\\pm7.0$\\,$\\mu$as, respectively. These observations\nare consistent with the shadow of a Kerr black hole in general relativity (GR).\nObservations of the shadow of SMBHs can be used to test modified gravity\ntheories, including Yukawa gravity, in extremely strong fields. In this paper,\nwe illustrate the shadows of Yukawa black holes, showing that their sizes are\nsignificantly influenced by the Yukawa parameters $\\lambda$ and $\\kappa$. Using\nthe EHT observations of M87* and Sgr A*, we obtain constraints on the Yukawa\nparameters. For Sgr A*, Keck and VLTI provide different priors on its\ngravitational radius. The Sgr A* shadow yields $\\kappa=-0.04^{+0.09}_{-0.10}$\nfor $\\lambda>1$\\,AU with the Keck prior, while $\\kappa=-0.08^{+0.09}_{-0.06}$\nwith the VLTI prior. As $\\lambda$ decreases, the constraints weaken, reaching\n$-0.37<\\kappa <0.17$ (Keck prior) and $-0.47<\\kappa<0.04$ (VLTI prior) at\n$\\lambda=0.1$\\,AU. For M87*, with a mass significantly larger than Sgr A*, this\nsystem can only put constraints on $\\kappa$ at larger $\\lambda$. For\n$\\lambda>1.5\\times10^4$\\,AU, the \\textit{EHT} observation of M87* yields\n$\\kappa=-0.01^{+0.17}_{-0.17}$. No significant deviation from GR is detected in\nour analysis. Additionally, we explore potential constraints using the\nnext-generation VLBI, like \\textit{ngEHT} and the Black Hole Explorer (BHEX),\nwhich promise the detection of the second ring of photons. The improved angular\nresolution and the measurements of the second ring could substantially refine\nconstraints on the Yukawa parameters, enhancing our ability to test deviations\nfrom GR in the strong-field regime."}
{"id": "2510.04414", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.04414", "abs": "https://arxiv.org/abs/2510.04414", "authors": ["Alisha Chromey"], "title": "Latest view of CTA 1 with VERITAS", "comment": "Conference proceeding for a poster at the 39th International Cosmic\n  Ray Conference, ICRC code PoS(ICRC2025)610, 6 pages, including collaboration\n  authorship, two figures, results are preliminary", "summary": "CTA 1 is a shell-type supernova remnant (SNR) with a central pulsar wind\nnebula (PWN), visible at very-high-energy (VHE) from 50 GeV to 100 TeV from a\nmoderately extended emission region. While general consensus concludes the VHE\nemission originates from relativistic leptons accelerated by the PWN and\nundergoing inverse Compton scattering, questions remain about electron escape\nand propagation, as well as the evolutionary stage of this particular PWN. CTA\n1 is on the cusp of middle age (~13 kyr) and spatially resolvable at energies\nvisible to imaging atmospheric Cherenkov telescopes (IACTs), such as the Very\nEnergetic Radiation Imaging Telescope Array System (VERITAS) (PSF < 0.1 deg).\nTherefore, this remnant is an excellent candidate to study lepton propagation\nand escape between different PWN evolutionary stages. Since the initial VERITAS\npublication on CTA 1 in 2013, VERITAS has performed new observations, adding to\na total exposure of about 120 hours. We have analyzed the entire VERITAS CTA 1\ndataset to date and report results."}
{"id": "2510.04537", "categories": ["astro-ph.HE", "gr-qc"], "pdf": "https://arxiv.org/pdf/2510.04537", "abs": "https://arxiv.org/abs/2510.04537", "authors": ["Sharon Mary Tomson", "Boris Goncharov", "Rutger van Haasteren"], "title": "Finding Supermassive Black Hole Binary Mergers in Pulsar Timing Array Data", "comment": "21 pages, 12 figures", "summary": "Galaxy observations suggest there is about one merger of supermassive black\nhole binaries (SMBHB) throughout the observable universe in a year. Here, we\nintroduce the methodology to search for gravitational waves from these events\nwith Pulsar Timing Arrays (PTAs).\n  Modelling the inspiral, the merger, the ringdown, and the gravitational wave\nmemory components of the signal in simulated data, we demonstrate a proof of\nprinciple for detection and parameter estimation. We study a few representative\nSMBHB mergers with chirp masses spanning $10^{8} - 10^{10}~M_\\odot$ at\ndistances from a few Mpc to 100~Mpc to asses their detectability in PTA\nobservations. Assuming the fixed binary inclination angle of $90^{\\circ}$\ncorresponding to the maximum displacement memory signal, these signals appear\ndistinct for a PTA with 25 pulsars timed for 13 years with 100 ns precision.\n  We demonstrate the capabilities of PTAs to constrain chirp masses and\ndistances of detected merging binaries, as well as to place limits. The sky\nposition uncertainties of the order of $1^{\\circ}$, which we find in this\noptimistic example, could potentially enable electromagnetic follow-up and\nmulti-messenger observations of SMBHB mergers. Finally, we show that the\nmeasurement uncertainties on the parameters of simulated merging binaries\ndepend weakly on the presence of the gravitational wave background with\nHellings-Downs correlations in our simulated data."}
{"id": "2510.04570", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.04570", "abs": "https://arxiv.org/abs/2510.04570", "authors": ["B. Longo", "M. Perucho", "V. Bosch-Ramon", "J. M. Martí", "G. Fichet de Clairfontaine"], "title": "Relativistic hydrodynamics simulations of supernova explosions within extragalactic jets", "comment": "Accepted for publication in A&A", "summary": "Jets in active galactic nuclei have to cross significant distances within\ntheir host galaxies, meeting large numbers of stars of different masses and\nevolution stages in their paths. Given enough time, supernova explosions within\nthe jet will eventually happen, and may have a strong impact on its dynamics,\npotentially triggering powerful non-thermal activity. We carried out a detailed\nnumerical study to explore the dynamics of the interaction between the ejecta\nof a supernova explosion and a relativistic extragalactic jet. By means of\nrelativistic hydrodynamics simulations using the code RATPENAT, we simulated\nthe jet-ejecta interaction in two different geometries or scenarios: a\ntwo-dimensional, axisymmetric simulation, and a three-dimensional one, which\nincludes the orbital velocity of the exploding star. Although initially filling\na region much smaller than the jet radius, the ejecta expands and eventually\ncovers most of the jet cross section. The expansion is enhanced as more energy\nfrom the jet is converted into kinetic and internal energy of the ejecta, which\nalso favors the ejecta disruption, all this occurring on timescales ~ 10^4 yr.\nAlthough a complete numerical convergence of the results is unattainable given\nthe subsonic, turbulent nature of the interaction region, the simulations are\nconsistent in their description of the gross morphological and dynamical\nproperties of the interaction process. At the end of the simulations, the\nsupernova ejecta has already partially mixed with the relativistic jet. The\nresults also suggest that the jet-ejecta interaction may be a non-negligible\nnon-thermal emitter. Moreover, due to efficient mixing, the interaction region\ncan be a potential source of ultra-high-energy cosmic rays of heavy\ncomposition."}
{"id": "2510.04635", "categories": ["astro-ph.HE", "hep-ph"], "pdf": "https://arxiv.org/pdf/2510.04635", "abs": "https://arxiv.org/abs/2510.04635", "authors": ["Antonio Capanema", "Pasquale Blasi", "Emanuele Sobacchi"], "title": "The Role of Acoustic Instability in Cosmic-Ray Self-Confinement", "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC\n  2025). 8 pages, 5 figures", "summary": "Over the past decades, there has been growing observational and theoretical\nevidence that cosmic-ray-induced instabilities play an important role in both\nacceleration and transport of cosmic rays (CRs). For instance, the efficient\nacceleration of charged particles at supernova remnant shocks requires rapidly\ngrowing instabilities, so much so that none of the proposed processes seem\nsufficient to warrant acceleration to PeV energies. In this work, we\ninvestigate whether an acoustic instability triggered by the presence of a CR\npressure gradient can lead to significant self-confinement of charged particles\nin the vicinity of shocks. We validate the expected growth rates and obtain the\nscale and energy of magnetic field perturbations induced by such system using\nmagnetohydrodynamical simulations. Our results suggest a strong suppression of\nthe diffusion coefficient for particles with Larmor radius around a thousandth\nof the precursor scale length."}
{"id": "2510.04639", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.04639", "abs": "https://arxiv.org/abs/2510.04639", "authors": ["F. Iraci", "A. Chalumeau", "C. Tiburzi", "J. P. W. Verbiest", "A. Possenti", "S. C. Susarla", "M. A. Krishnakumar", "G. M. Shaifullah", "J. Antoniadis", "M. Bagchi", "C. Bassa", "R. N. Caballero", "B. Cecconi", "S. Chen", "S. Chowdhury", "B. Ciardi", "I. Cognard", "S. Corbel", "S. Desai", "D. Deb", "J. Girard", "A. Golden", "J-M. Grießmeier", "L. Guillemot", "M. Hoeft", "H. Hu", "F. Jankowski", "G. Janssen", "B. C. Joshi", "S. Kala", "E. Keane", "K. Nobelson", "A. Konovalenko", "I. Kravtsov", "M. Kramer", "K. Liu", "A. Parthasarathy", "P. Rana", "D. Schwarz", "J. Singha", "A. Srivastava", "K. Takahashi", "P. Tarafdar", "G. Theureau", "O. Ulyanov", "C. Vocks", "J. Wang", "V. Zakharenko", "P. Zarka"], "title": "Combining the second data release of the European Pulsar Timing Array with low-frequency pulsar data", "comment": null, "summary": "Low-frequency radio data improve the sensitivity of pulsar timing arrays\n(PTAs) to propagation effects such as dispersion measure (DM) variations,\nenabling better noise characterization essential for detecting the stochastic\ngravitational wave background (GWB). We combined LOFAR (100-200 MHz) and\nNenuFAR (30-90 MHz) observations with the recent European and Indian PTA\nrelease (DR2new+) into a new dataset, DR2low, spanning ~11 years for 12\npulsars. DR2low allows updated noise models, increasing PTA sensitivity to the\nGWB. Using Libstempo and Enterprise, we applied standard noise models including\nred noise (RN) and time-variable DM (DMv) as power laws, and performed Bayesian\nmodel selection over RN, DMv, and an additional chromatic noise term (CN4).\nCompared to DR2new+, DR2low improves DM constraints and separates DM and RN\ncontributions. We found that the RN is required in the final model for 10 out\nof 12 pulsars, compared to only 5 in the DR2new+ dataset. The improved\nsensitivity to plasma effects provided by DR2low also favors the identification\nof significant CN4 in eight pulsars, while none showed such evidence in\nDR2new+. The analysis also reveals unmodelled solar wind effects, particularly\nnear solar conjunction, with residual delays absorbed into the DM component,\nhighlighting the importance of accurately modelling the solar wind in PTA\ndatasets."}
{"id": "2510.04790", "categories": ["astro-ph.HE", "gr-qc"], "pdf": "https://arxiv.org/pdf/2510.04790", "abs": "https://arxiv.org/abs/2510.04790", "authors": ["Fangyi Fitz Hu", "Ilya Mandel", "Rebecca Nealon", "Daniel J. Price"], "title": "Converged simulations of the nozzle shock in tidal disruption events", "comment": "11 pages, 5 figures, submitted to ApJL", "summary": "When debris from a star that experienced a tidal disruption events (TDE)\nafter passing too close to a massive black hole returns to pericenter on the\nsecond passage, it is compressed, leading to the formation of nozzle shocks (in\nthe orbital plane) and pancake shocks (perpendicular to the orbital plane).\nResolving these shocks is a long-standing problem in the hydrodynamic\nsimulations of parabolic TDEs. Excessive numerical energy dissipation or\nheating unrealistically expands the stream. In this Letter, we apply adaptive\nparticle refinement to our 3D general relativistic smoothed particle\nsimulations to locally increase the resolution near the pericenter. We achieve\nresolutions equivalent to $6.55\\times10^{11}$ particles, allowing us to\nconverge on the true energy dissipation. We conclude that only $4\\times10^{-5}$\nof the orbital energy is dissipated in nozzle shocks for a Sun-like star\ntidally disrupted by a $10^6$ solar-mass black hole, therefore the nozzle\nshocks are unlikely to be important in the evolution of TDEs."}
{"id": "2510.04803", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.04803", "abs": "https://arxiv.org/abs/2510.04803", "authors": ["Lisa Nikolić", "Gaia Verna", "Marina Manganaro", "Giacomo Bonnoli", "Ivan Agudo", "Giuseppe Silvestri", "Davide Cerasole", "Francesco Schiavone", "Franjo Podobnik", "Jorge Otero-Santos"], "title": "Recent observations of PKS 2155-304 with MAGIC and LST-1 in a multi-wavelength context", "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC\n  2025), 2025", "summary": "PKS 2155-304 is a well-known high-frequency peaked BL Lac (HBL) at redshift\nz=0.116, which has been extensively studied across the electromagnetic spectrum\ndue to its rapid and large-amplitude variability. Several violent outbursts in\nX-rays and $\\gamma$-rays have been observed in the past, with intra-night\nvariability in very-high-energy $\\gamma$-rays (VHE; E > 100 GeV) detected down\nto the minute timescale. The alternation of quiescent and enhanced states,\nobserved with a tentative quasi-periodicity of 1.74 $\\pm$ 0.13 years in\nhigh-energy (HE; 100 MeV < E < 100 GeV) $\\gamma$-rays, makes this source a key\ntarget also for ground-based $\\gamma$-ray instruments and in particular for the\nImaging Atmospheric Cherenkov Telescopes. Its brightness, proximity, and\nwell-determined redshift make this $\\gamma$-ray source a prime target for\nfundamental physics studies, including tests of Lorentz Invariance Violation\n(LIV), searches for axion-like particles (ALPs), and constraints on the\ndistribution of the extragalactic background light (EBL). In the last two\nyears, PKS 2155-304 has been independently monitored by the Major Atmospheric\nGamma-ray Imaging Cherenkov (MAGIC) telescopes and the first Large-Sized\nTelescope (LST-1) of the Cherenkov Telescope Array Observatory (CTAO) located\nat the Roque de Los Muchachos Observatory (La Palma, Spain). The observations\nwere carried out at large zenith angles (LZA; ZA > 55{\\deg}), and the VHE data\nhave been complemented with simultaneous observations in HE $\\gamma$-rays\n(Fermi-LAT), X-rays (Swift-XRT) and optical wavelengths (ASAS-SN)."}
{"id": "2510.04857", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2510.04857", "abs": "https://arxiv.org/abs/2510.04857", "authors": ["Katharina Egg", "Alison M. W. Mitchell"], "title": "Joint eROSITA and H.E.S.S. analysis of MSH 15-52 using Gammapy", "comment": "8 pages, 4 figures, 3 tables. Proceedings of the 39th International\n  Cosmic Ray Conference (ICRC 2025)", "summary": "Pulsar wind nebulae (PWNe) are prominent sources in the very-high energy\n(VHE) gamma-ray sky, constituting the most numerous identified source class in\nthe H.E.S.S. Galactic Plane Survey (HGPS). They are comprised of energetic\nparticles originating from the pulsar and expanding into the surrounding\nmedium. As such, PWNe are of very high scientific interest as PeVatron\ncandidates, objects that could potentially accelerate particles up to PeV\nenergies. Additionally other aspects of their acceleration mechanism are being\nactively investigated, such as the open question of whether they accelerate not\nonly leptonic but also hadronic particles, and the details of their morphology\nand particle transport mechanism. As PWNe emit photons over a broad range of\nthe electromagnetic spectrum, multiwavelength (MWL) studies are crucial for the\ninvestigation and study of their emission.\n  In this vein we present a joint eROSITA X-ray and H.E.S.S. gamma-ray study of\nthe PWN MSH 15-52. We showcase our custom code for integrating the EDR and DR1\neROSITA data into the Gammapy framework, a python package optimised for the\nanalysis of gamma-ray data. We present the first 3D (spatial and spectral) fit\nto eROSITA data by using Gammapy. We furthermore combine these data with the\npublic H.E.S.S. gamma-ray observations of MSH 15-52, resulting in a joint\nphysical fit of the underlying particle population, and a subsequent discussion\nof the physical implications of our results. Finally we give an outlook towards\nfuture efforts in MWL studies of PWNe and the broader context of MWL data\nanalysis with Gammapy."}
{"id": "2510.04949", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.04949", "abs": "https://arxiv.org/abs/2510.04949", "authors": ["E. E. Nokhrina", "I. N. Pashchenko", "V. A. Frolova", "R. V. Todorov"], "title": "Jet MHD analytical model - framework for radiative transfer", "comment": "15 pages, 10 figures, accepted for publication by MNRAS", "summary": "We developed the full magnetohydrodynamical analytical jet model that allows\naccurate reproducing of a transversal and longitudinal structure for a highly\ncollimated relativistic jets. This model can be used as a setup for convenient\nsolution of radiative transfer equations and modelling the total intensity and\npolarization maps. We show that the analytical fits are in excellent agreement\nwith the numerical solutions of full magnetohydrodynamical equations. Our\napproach allows setting easily different models for an emitting plasma number\ndensity. For example, we show that the equipartition number density ranges from\nseveral to tens of percent of a total number density. We show that the\nDoppler-corrected emissivity distribution behave in such a way that we may\nexpect a limb brightened intensity pattern on a sub-parsec scale and a\nspine-brightened structure downstream. We reproduce the broken power-law\ndependence of a jet pressure at its boundary from the jet radius. The\ncorresponding power exponents are in agreement with the parabola-to-cone\ntransition observed directly in nearby sources."}
{"id": "2510.04977", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.04977", "abs": "https://arxiv.org/abs/2510.04977", "authors": ["Abhishek Abhishek", "Shotaro Abe", "Tomohiro Inada", "Sofia Ventura", "Michele Doro", "Masahiro Teshima", "Gaia Verna"], "title": "Line emission search from DM annihilation in the Galactic Center with LST-1", "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC\n  2025), 2025", "summary": "Dark Matter remains a great mystery in modern physics. Among various\ncandidates, the weakly interacting massive particles (WIMPs) scenario stands\nout and is under extensive study. The detection of the hypothetical gamma-ray\nemission from WIMP annihilation could act as a direct probe of\nelectroweak-scale interactions, complementing DM collider searches and other\ndirect DM detection techniques. At very high energies (VHE), WIMP\nself-annihilation is expected to produce gamma rays together with other\nStandard Model particles. The galactic center (GC), due to its relative\nproximity to the Earth and its high expected DM density, is a prime target for\nmonoenergetic line searches. IACTs have placed strong constraints on the DM\nproperties at the GC, with the MAGIC providing the most stringent limits from\n20 TeV to 100 TeV, exploiting large zenith angle (LZA) observations. However,\nthe limited field of view (FoV) of the MAGIC telescopes (< 3.5{\\deg} )\nprevented a detailed study of the extended region around the GC in which an\nenhanced DM density is expected. The LST-1 of the CTAO, located at the Roque de\nLos Muchachos Observatory (La Palma, Spain), close to the MAGIC site, has been\nobserving the GC since 2021. With its wide FoV of 4.5{\\deg}, LST-1 could\ncontribute significantly to the WIMPs search at the GC. The observations are\nperformed at LZA (ZA > 58{\\deg}), which, while required due to the source's low\naltitude, also optimizes the detection of gamma rays up to 100 TeV and beyond.\nWe present a study of the systematic uncertainties in WIMP line emission\nsearches with LST-1. Our work examines the instrument response functions for\nLZA observations, background rejection in monoscopic mode, and includes updated\nresults from simulations, highlighting new methods for spectral line searches."}
