{"id": "2511.17701", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.17701", "abs": "https://arxiv.org/abs/2511.17701", "authors": ["Alisa Galishnikova", "Hayk Hakobyan", "Alexander Philippov", "Benjamin Crinquand"], "title": "$\\mathtt{Entity}$ -- Hardware-agnostic Particle-in-Cell Code for Plasma Astrophysics. II: General Relativistic Module", "comment": "22 pages, 5 figures, 1 table", "summary": "Black hole environments often host plasmas that are fully collisionless or contain intrinsically collisionless regions, including relativistic jets and coronae where particle energization is ubiquitous. Capturing the physics of these systems requires numerical methods capable of modeling relativistic, magnetized, collisionless plasmas in strong gravitational fields. In this work, we introduce the general-relativistic module for the Entity -- the first open-source, coordinate-agnostic performance-portable particle-in-cell code. The code enables fast axisymmetric simulations of collisionless plasmas around black holes on any modern high-performance computing architecture (both GPUs and CPUs)."}
{"id": "2511.17710", "categories": ["astro-ph.HE", "physics.plasm-ph"], "pdf": "https://arxiv.org/pdf/2511.17710", "abs": "https://arxiv.org/abs/2511.17710", "authors": ["Hayk Hakobyan", "Ludwig M. Böss", "Yangyang Cai", "Alexander Chernoglazov", "Alisa Galishnikova", "Evgeny A. Gorbunov", "Jens F. Mahlmann", "Alexander Philippov", "Siddhant Solanki", "Arno Vanthieghem", "Muni Zhou"], "title": "Entity -- Hardware-agnostic Particle-in-Cell Code for Plasma Astrophysics. I: Curvilinear Special Relativistic Module", "comment": "30 pages, 12 figures", "summary": "Entity is a new-generation, fully open-source particle-in-cell (PIC) code developed to overcome key limitations in astrophysical plasma modeling, particularly the extreme separation of scales and the performance challenges associated with evolving, GPU-centric computing infrastructures. It achieves hardware-agnostic performance portability across various GPU and CPU architectures using the Kokkos library. Crucially, Entity maintains a high standard for usability, clarity, and customizability, offering a robust and easy-to-use framework for developing new algorithms and grid geometries, which allows extensive control without requiring edits to the core source code. This paper details the core general-coordinate special-relativistic module. Entity is the first PIC code designed to solve the Vlasov-Maxwell system in general coordinates, enabling a coordinate-agnostic framework that provides the foundational structure for straightforward extension to arbitrary coordinate geometries. The core methodology achieves numerical stability by solving particle equations of motion in the global orthonormal Cartesian basis, despite using generalized coordinates like Cartesian, axisymmetric spherical, and quasi-spherical grids. Charge conservation is ensured via a specialized current deposition technique using conformal currents. The code exhibits robust scalability and performance portability on major GPU platforms (AMD MI250X, NVIDIA A100, and Intel Max Series), with the 3D particle pusher and the current deposition operating efficiently at about 2 nanoseconds per particle per timestep. Functionality is validated through a comprehensive suite of standard Cartesian plasma tests and the accurate modeling of relativistic magnetospheres in curvilinear axisymmetric geometries."}
{"id": "2511.17763", "categories": ["astro-ph.HE", "astro-ph.GA", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2511.17763", "abs": "https://arxiv.org/abs/2511.17763", "authors": ["P. Frank Winkler", "Joseph Putko", "William P. Blair"], "title": "The Optical Evolution of the Tycho Supernova Remnant over Three Decades", "comment": "To be published in The Astrophysical Journal", "summary": "We report a series of images of the Tycho supernova remnant at eight epochs extending over thirty years: 1986-2016. In addition to our Hα images, we have obtained matched continuum images which we subtract to reveal faint emission, including a far more extensive network of optical knots and filaments than reported previously. The deepest images also show an extremely faint, fairly diffuse arc of emission surrounding much of the circumference of Tycho to the southeast and south, coinciding with the rim of the radio/X-ray shell. We have measured proper motions for 46 filaments, including many fainter ones near the Tycho outer rim. Our measurements are generally consistent with previous ones by Kamper and vandenBergh (1978), but ours have far greater precision. Most optical filaments at the shell rim have expansion indices reasonably consistent with the Sedov value (0.40), while the interior filaments have somewhat smaller values, as expected. From the combination of proper motions of filaments at the shell rim and shock velocity at the same positions, one should be able to calculate the distance to Tycho by simple geometry. Determination of the shock velocity from broad Balmer-line profiles is subject to model uncertainties, but the availability of dozens of such filaments with a range of conditions offers the possibility to substantially improve the distance determination for Tycho."}
{"id": "2511.17800", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.17800", "abs": "https://arxiv.org/abs/2511.17800", "authors": ["Ren Deng", "Kaya Mori", "Eric Miao", "Gabriel Bridges", "Charles J. Hailey", "David A. H. Buckley", "Gavin Ramsay", "Dan Jarvis"], "title": "Broadband X-ray observations of the periodic optical source ZTF J185139.81+171430.3 and its identification as a massive intermediate polar", "comment": "13 pages, 9 figures, submitted to ApJ", "summary": "We present X-ray observations of the periodic optical source ZTF J185139.81+171430.3 (hereafter ZTF J1851) by the XMM, NICER and NuSTAR telescopes. The source was initially speculated to be a white dwarf (WD) pulsar system due to its short period ($P\\sim12$ min) and highly-modulated optical lightcurves. Our observations revealed a variable X-ray counterpart extending up to 40 keV with an X-ray luminosity of $L_X \\sim 3\\times10^{33}$ erg s$^{-1}$ (0.3--40 keV). Utilizing timing data from XMM and NICER, we detected a periodic signal at $P_{\\rm spin}=12.2640(7)\\pm0.0583$ min with $>6σ$ significance. The pulsed profile displays $\\sim 25\\%$ and $\\sim10\\%$ modulation in the 0.3--2 and 2--10 keV bands, respectively. Broadband X-ray spectra are best characterized by an absorbed optically-thin thermal plasma model with $kT \\approx 25$ keV and a Fe K-$α$ fluorescent line at 6.4 keV. The bright and hard X-ray emission rules out the possibility of a WD pulsar or ultra-compact X-ray binary. The high plasma temperature and Fe emission lines suggest that ZTF J1851 is an intermediate polar spinning at 12.264 min. We employed an X-ray spectral model composed of the accretion column emission and X-ray reflection to fit the broadband X-ray spectra. Assuming spin equilibrium between the WD and the inner accretion disk, we derived a WD mass range of $M_{\\rm WD}=(1.07\\rm{-}1.32)M_{\\odot}$ exceeding the mean WD mass of IPs ($\\langle M_{\\rm WD} \\rangle = 0.8 M_\\odot)$. Our findings illustrate that follow-up broadband X-ray observations could provide unique diagnostics to elucidate the nature of periodic optical sources anticipated to be detected in the upcoming Rubin all-sky optical surveys."}
{"id": "2511.17706", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.17706", "abs": "https://arxiv.org/abs/2511.17706", "authors": ["Paul Tiede", "William Moses", "Valentin Churavy", "Michael D. Johnson", "Dominic Pesce", "Lindy Blackburn", "Peter Galison"], "title": "Hierarchical Interferometric Bayesian Imaging", "comment": "submitted to ApJ", "summary": "Very long baseline interferometry (VLBI) achieves the highest angular resolution in astronomy. VLBI measures corrupted Fourier components, known as visibilities. Reconstructing on-sky images from these visibilities is a challenging inverse problem, particularly for sparse arrays such as the Event Horizon Telescope (EHT) and the Very Long Baseline Array (VLBA), where incomplete sampling and severe calibration errors introduce significant uncertainty in the image. To help guide convergence and control the uncertainty in image reconstructions, regularization on the space of images is utilized, such as enforcing smoothness or similarity to a fiducial image. Coupled with this regularization is the introduction of a new set of parameters that modulate its strength. We present a hierarchical Bayesian imaging approach (Hierarchical Interferometric Bayesian Imaging, HIBI) that enables the quantification of uncertainty for al parameters. Incorporating instrumental effects within HIBI is straightforward, allowing for simultaneous imaging and calibration of data. To showcase HIBI's effectiveness and flexibility, we build a simple imaging model based on Markov random fields and demonstrate how different physical components can be included, e.g., black hole shadow size, and their uncertainties can be inferred. For example, while the original EHT publications were unable to constrain the ring width of M87*, HIBI measures a width of $9.3\\pm 1.3\\,μ{\\rm as}$. We apply HIBI to image and calibrate EHT synthetic data, real EHT observations of M87*, and multifrequency observations of \\oj287. Across these tests, HIBI accurately recovers a wide variety of image structures and quantifies their uncertainties. HIBI is publicly available in the Comrade.jl VLBI software repository."}
{"id": "2511.17900", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.17900", "abs": "https://arxiv.org/abs/2511.17900", "authors": ["Mengqing Zhang", "Shengbin Pei", "Shan Chang", "Pengfei Zhang"], "title": "Revisiting $γ$-Ray Orbital Modulation in the Redback Millisecond Pulsar PSR J2039-5617", "comment": "9 pages, 6 figures, accepted by ApJ", "summary": "PSR J2039-5617 is a redback millisecond pulsar binary system consisting of a compact star with a mass of 1.1-1.6 $M_\\odot$ and a low-mass companion of 0.15-0.22 $M_\\odot$. For this binary, we performed a timing analysis using 16 years of data from the Fermi Large Area Telescope, covering the period from 2008 August to 2024 October. Our analysis detected an orbital modulation with a period of 0.2279781 days at a significance level of $\\sim4σ$, which is in good agreement with previous findings. However, unlike previous reports, we identified a transition in the orbital modulation around 2021 August, after which the orbital signal disappeared. We speculate that the system may be undergoing a transition from a rotation-powered to an accretion-powered state at this epoch. Additionally, we conducted the phase-resolved and spectral analyses, and in the phase-resolved results, we observed an anti-correlation between its $γ$-ray and X-ray emissions, which consistent with the predictions of high-energy radiation models for such systems. We provide some predictive discussions based on the results of $γ$-ray data analysis, and future Fermi-LAT observations will determine whether these predictions hold true."}
{"id": "2511.17797", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.17797", "abs": "https://arxiv.org/abs/2511.17797", "authors": ["L. J. M. Houben", "H. Falcke", "L. G. Spitler", "E. D. Barr", "M. Berezina", "D. J. Champion", "R. Karuppusamy", "M. Kramer"], "title": "The Northern High Time Resolution Universe pulsar survey -- II. Single-pulse search set-up and simulations", "comment": "21 pages, 15 figures, 5 tables", "summary": "The High Time Resolution Universe (HTRU) survey is an all-sky survey looking for pulsars and other radio transients. A new single-pulse (SP) search pipeline is presented, tailored to the northern part of the HTRU survey collected with the 100m Effelsberg Radio Telescope. In a selection of this data, synthetic SPs are injected with frequency-time structures resembling those of the detected Fast Radio Burst (FRB) population and processed by the pipeline to characterize its performance. Therefore, several new software toolkits have been developed (FRBfaker and RFIbye) to enable the injection of SPs with complex frequency-time structures and cope with the Radio Frequency Interference (RFI) in the survey's data. The operation of these toolkits is described alongside the overall functionality of the SP pipeline. Qualification of the pipeline confirmed that it is ready to process all the HTRU-North data. Additionally, the survey's sensitivity to SPs, the impact of RFI thereon, the performance of the deep-learning classifier FETCH, and some insights that may be used to improve the pipeline's performance in the future are determined. Within the small data sample analysed, 21 known pulsars and a RRAT are detected. In addition, eight faint SP trains that might originate from yet undiscovered neutron stars and 141 isolated SP candidates were discovered."}
{"id": "2511.18122", "categories": ["astro-ph.HE", "astro-ph.CO", "hep-ph"], "pdf": "https://arxiv.org/pdf/2511.18122", "abs": "https://arxiv.org/abs/2511.18122", "authors": ["Kanji Mori", "Tomoya Takiwaki", "Kazunori Kohri"], "title": "Verifying the failing supernova constraint on dark photons with two-dimensional hydrodynamic simulations", "comment": "7 pages, 6 figures, submitted to PRD", "summary": "Recent studies on the dark photon (DP) production in collapsing stars argue that the cooling effect induced by DPs can hinder supernova explosions and lead to a ``failing supernova\" constraint on the photon-DP mixing parameter $ε$. In order to verify the idea, we perform two-dimensional neutrino-radiation hydrodynamic simulations coupled with the DP production with the mass of 0.3 MeV. We find that the shock revival does not happen until the end of the simulations when $ε\\gtrsim3\\times10^{-9}$. The photon-DP mixing parameter above this value can be excluded by the failing supernova argument. Interestingly, our constraint is close to the one reported by the previous studies which adopted the post-processing framework. This result motivates one to investigate a wider parameter range of DPs with self-consistent simulations and evaluate uncertainties in the constraint."}
{"id": "2511.18477", "categories": ["astro-ph.IM", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2511.18477", "abs": "https://arxiv.org/abs/2511.18477", "authors": ["Jing Rou Puah", "Sasa Arsovski"], "title": "A Deep Multimodal Multi--Head Neural Network for Joint Estimation of Stellar Age, Lifetime, and Evolutionary Stage", "comment": "8 pages, 5 figures", "summary": "Accurate estimation of stellar parameters -- stellar age, lifetime, and evolutionary stage -- remains a fundamental challenge in astrophysics. We introduce a hybrid deep learning architecture combining multimodal spectroscopic and photometric data from SDSS DR17. The model comprises a Multi-Layer Perceptron for numerical features and a CNN with a Vision Transformer for spectra, with three output heads for age, lifetime, and evolutionary stage prediction. Training labels are derived from MIST v1.2 isochrones, with evolutionary stage binned into five classes (Hot, Medium, Cool, Subgiant, Red Giant). We conduct multi-phase evaluation: Phase I explores model architectures and data balancing strategies, Phase II tunes architectural complexity, and Phase III optimizes the multi-task loss composition. The final model achieves a balance between precision (Age RMSE 0.093 in $\\log(\\mathrm{yrs})$) and physical realism. Monte Carlo Dropout confirms well-calibrated uncertainties, enabling meaningful astrophysical interpretation and establishing a new benchmark for multimodal stellar parameter estimation."}
{"id": "2511.18144", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.18144", "abs": "https://arxiv.org/abs/2511.18144", "authors": ["Sovan Boxi", "Saikat Das", "Nayantara Gupta"], "title": "Cosmogenic Origin of KM3-230213A: Delayed Gamma-Ray Emission from A Cosmic-Ray Transient", "comment": "8 pages, 7 figures", "summary": "The highest-energy cosmic neutrino detected by the ARCA detector of KM3NeT has reignited the quest to pinpoint the sources of ultrahigh-energy cosmic rays (UHECRs; $E\\gtrsim 0.1$ EeV). By uncovering the associated multimessenger signals, we investigate the origin of the 220 PeV $ν_μ$ event KM3-230213A from a transient source that accelerated cosmic rays to $\\sim 10$ EeV. UHECR protons that escape the source interact with the cosmic background radiation, producing a PeV-EeV cosmogenic neutrino spectrum. The secondary $e^\\pm$ and $γ$-rays initiate an electromagnetic cascade, resulting in a cosmogenic $γ$-ray spectrum that peaks at a delayed time due to deflection of charged particles in the extragalactic magnetic field (EGMF). Our results shed light on the nature of the UHECR source for the $ν_μ$ event and provide crucial insights into the detection of multi-TeV $γ$-rays of cosmogenic origin from similar past cosmological transients. Using the $γ$-ray sensitivity of currently operating and next-generation imaging atmospheric Cherenkov telescopes, the flux and time-delay distribution can constrain the source distance. We further show that the detection of such a $γ$-ray signal above the background depends on the EGMF strength. Together with the non-detection of coincident spatial or temporal photon counterparts at the current epoch, this detection is the first compelling candidate for a sub-EeV cosmogenic neutrino."}
{"id": "2511.18494", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2511.18494", "abs": "https://arxiv.org/abs/2511.18494", "authors": ["Furen Deng", "Yidong Xu", "Fengquan Wu", "Yanping Cong", "Bin Yue", "Xuelei Chen"], "title": "Synthesis imaging with a lunar orbit array: I. global sky map and its systematics", "comment": "22 pages, 20 figures", "summary": "Ground-based radio astronomical observation at frequencies below 30 MHz is hampered by the Ionosphere and radio frequency interference (RFI). The Discovering Sky at the Longest wavelength (DSL) mission, also known as the Hongmeng mission, employs a linear array of satellites on a circular orbit around the Moon to make interferometric observations in this band. Though vastly different from the usual ground-based arrays, the interferometric visibility data collected by such an array is linearly related to the sky map, and the reconstruction is in principle an inversion problem of linear mapping. In this paper, we investigate a number of issues in the algorithm of global map reconstruction, focusing on the impact of sub-pixel noise induced by the finite pixelization of the sky, and errors due to regularization. We find that in the reconstruction process, if one builds up the beam matrix, which relates the sky pixels to the visibilities, by naively evaluating its elements at each of the pixel centers, then the sub-pixel noise can give rise to a significant aliasing effect. However, this effect can be effectively mitigated by a simple pixel-averaging method. Based on evaluation of the image quality using the correlation coefficient between the input and reconstructed map, and the signal-to-noise ratio, we discuss the selection strategy of the regularization parameter, and show that the sky can be well reconstructed with a reasonable choice of the regularization parameter."}
{"id": "2511.18348", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2511.18348", "abs": "https://arxiv.org/abs/2511.18348", "authors": ["Qingzheng Gao", "Xiao-Jin Liu", "Zhi-Qiang You", "Zheng Li", "Xingjiang Zhu"], "title": "A Bayesian statistical analysis of 897 pulsar flux density spectra", "comment": "12 pages, 8 figures, 7 tables", "summary": "We present a comprehensive re-evaluation of pulsar radio spectra using the largest curated dataset of calibrated flux densities to date, comprising 897 pulsars, and employing a robust Bayesian framework for model comparison alongside frequentist methods. Contrary to the established consensus that pulsar spectra are predominantly simple power laws, our analysis reveals that complex spectral shapes with curvature or breaks are in fact the norm. The broken power law emerges as the most common spectral shape, accounting for 60\\% of pulsars, while the simple power law describes only 13.5\\%, with 68.8\\% of pulsars decisively favoring curved or broken models. We further identify 74 confident gigahertz-peaked spectrum pulsars, and demonstrate that millisecond pulsars frequently exhibit spectral curvature. A key finding is that the previously reported dominance of the simple power law was largely a statistical artifact of the frequentist method used in earlier work. These findings substantially revise the prevailing view of pulsar spectra and establish a critical, model-classified foundation for future theoretical work."}
{"id": "2511.18784", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2511.18784", "abs": "https://arxiv.org/abs/2511.18784", "authors": ["Xinghang Yu", "Ce Yu", "Zeguang Shao", "Bin Yang"], "title": "TDLight: A Framework for Incremental Light Curve Management and Smart Classification", "comment": "8 pages, 6 figures", "summary": "With the exponential growth of time-domain surveys, the volume of light curves has increased rapidly. However, many survey projects, such as Gaia, still rely on offline batch-processing workflows in which data are calibrated, merged, and released only after an observing phase is completed. This latency delays scientific analysis and causes many high-value transient events to be buried in archival data, missing the window for timely follow-up. While existing alert brokers handle heterogeneous data streams, it remains difficult to deploy a unified framework that combines high-performance incremental storage with real-time classification on local infrastructure. To address this challenge, we propose TDLight, a scalable system that adapts the time-series database TDengine (a high-performance IoT database) for astronomical data using a one-table-per-source schema. This architecture supports high-throughput ingestion, achieving 954,000 rows s^-1 for archived data and 541,000 rows s^-1 for incremental streams, while Hierarchical Equal Area isoLatitude Pixelization (HEALPix) indexing enables efficient cone-search queries. Building on this storage layer, we integrate the pre-trained hierarchical Random Forest classifier from the LEAVES framework to construct an incremental classification pipeline. Using the LEAVES dataset, we simulate data accumulation and evaluate a trigger-based strategy that performs early classification at specific observational milestones. In addition, by monitoring the evolution of classification probabilities, the system identifies \"high-value candidates\" -- sources that show high early confidence but later undergo significant label shifts. TDLight is released as an open-source Dockerized environment, providing a deployable infrastructure for next-generation time-domain surveys."}
{"id": "2511.18371", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.18371", "abs": "https://arxiv.org/abs/2511.18371", "authors": ["Wen-Jun Tan", "Chen-Wei Wang", "Shao-Lin Xiong", "Shi-Jie Zheng", "Jiang He", "Xiao-Yun Zhao", "Yue Huang", "Shu-Xu Yi", "Bing Li", "He Gao", "Bo-bing Wu", "Bing Zhang", "Frederic Daigne", "Maria-Grazia Bernardini", "Bin-Bin Zhang", "Stephane Basa", "Bertrand Cordier", "Jin-Song Deng", "Yong-Wei Dong", "Damien Dornic", "Olivier Godet", "Xu-Hui Han", "Mao-Hai Huang", "Cyril Lachaud", "Hua-Li Li", "Pierre Maggi", "Frederic Piron", "Yu-Lei Qiu", "Stephane Schanne", "Li-Ming Song", "Damien Turpin", "Susanna Vergani", "Jing Wang", "Ping Wang", "Jian-Yan Wei", "Chao Wu", "Li-Ping Xin", "Yang Xu", "Li Zhang", "Shuang-Nan Zhang"], "title": "GRB 240715A: Revealing Novel Intrinsic Mechanism by Different Individual Pulse", "comment": "21 pages, 4 figures, accepted by The Astrophysical Journal Letters", "summary": "The Space-based multiband astronomical Variable Objects Monitor (SVOM), detected its first short gamma-ray burst, GRB 240715A, in-flight, which was jointly observed by Fermi. Based on observational data of SVOM/GRM and Fermi/GBM, we perform a comprehensive temporal and spectral analysis for individual pulse in the prompt emission of this burst, and novel characteristics are revealed. Firstly, opposite evolutions of spectral lag are found in the first and third pulse of this burst. Second, the large negative lag of the first pulse is an outlier in short GRB sample, especially when the pulse duration is considered. Spectral analysis shows that the negative lag of the first pulse is caused by the evolution of spectrum index, and is irrelevant to Epeak, which is inconsistent with the previous study. The intrinsic mechanism is probably attributed to electron cooling in the decaying magnetic field, which leads to the continuous hardening of the spectrum index and results in negative lag. Furthermore, spectral analysis also shows that the third pulse is more likely to be described by a quasi-thermal spectrum, indicating the existence of photospheric emission. It is difficult to explain how the synchrotron radiation appears before photospheric emission in a single GRB and some assumptions are discussed."}
{"id": "2511.19014", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.19014", "abs": "https://arxiv.org/abs/2511.19014", "authors": ["Sergio Belmonte Diaz", "Rene P. Breton", "Zafiirah Hosenie", "Ben W. Stappers"], "title": "Enhancing Fast Radio Transient Detection with Mask R-CNN Image Segmentation", "comment": "Manuscript submitted to Royal Astronomical Society Techniques and Instruments. 14 pages. 11 figures", "summary": "Traditionally, fast radio transient searches are conducted on dedispersed time series using thresholding techniques based on the statistical properties of the data. However, peaks in dedispersed time series do not directly provide information on the nature of the source. In the DM-time domain, the S/N variation of real, dispersed astrophysical signals forms a characteristic bow tie shape, whereas radio frequency interference (RFI) can take multiple different forms. We have developed a method that bypasses the thresholding step of traditional single-pulse searches in favour of a direct DM-time domain image analysis. The backbone of our pipeline is a Mask R-CNN, a deep learning model designed for object detection, enabling it to identify the bow tie signature and distinguish real sources from RFI. Previous deep learning models often include a snippet of the DM-time domain in their input. We have trained the model on simulated bursts injected on top of real MeerKAT noise observations. We tested the model on MeerKAT follow-up observations of the repeater FRB20240114A and we were able to recover all bursts with a signal-to-noise above the traditional threshold, while detecting two bursts that were fainter. Our new approach considerably reduces the number of candidates above a nominal threshold while being capable of running in real time for typical surveys. We also propose a modified version of the traditional dedispersion plan optimised for this method."}
{"id": "2511.18410", "categories": ["astro-ph.HE", "astro-ph.GA", "gr-qc"], "pdf": "https://arxiv.org/pdf/2511.18410", "abs": "https://arxiv.org/abs/2511.18410", "authors": ["Mikiya M. Takahashi", "Tomohisa Kawashima", "Ken Ohsuga"], "title": "Black Hole Spin Estimation with Time-variable Image of M87 During the Flaring State", "comment": "12 pages, 12 figures, accepted by PASJ", "summary": "By investigating the time-variable 230 GHz images using ray-tracing general relativistic radiative transfer calculation, we propose a novel method for estimating the spin parameter of the supermassive black hole at the M87 center by utilizing the sudden and short-term increase in emissivity in the innermost region of the accretion disk. It is found that the flux of the photon ring increases simultaneously as the flux of the direct ring, which brightens first, decreases, and then gradually diminishes, when the increase in emissivity persists for $15 t_{\\rm g}$ with $t_{\\rm g}$ being the light crossing time of the gravitational radius. The direct ring is formed by photons emitted from the vicinity of the innermost region of the disk and traveling directly to the observer without orbiting around the black hole, while the photon ring is formed by photons passing near the spherical photon orbit. The time-averaged width of the dark region between the direct ring and the photon ring (dark crescent) becomes thinner when the spin parameter is higher and the increase in the emissivity of the accretion disk is greater. The time variation of two rings also causes the intensity-weighted center to oscillate both in the direction of the black hole's angular momentum vector projected onto the screen ($Y$-direction) and in the perpendicular direction ($X$-direction). The amplitude of oscillatory time variation in the $X$-direction becomes large when the spin parameter is higher, and that in the $Y$-direction becomes large when the increase in the emissivity of the disk is large. The spin parameter can be estimated by combining the time-averaged dark crescent width and the ratio of the amplitudes in the $X$- and $Y$-directions. This method is applicable when the duration of the increase in emissivity of the accretion disk ranges at least from approximately 10-20 $t_{\\rm g}$."}
{"id": "2511.19190", "categories": ["astro-ph.IM", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2511.19190", "abs": "https://arxiv.org/abs/2511.19190", "authors": ["Morgan A. Mitchell", "Paul Chote", "James McCormac", "Don Pollacco", "Ioannis Apergis", "J. D. Lyman", "Isobel S. Lockley", "Samuel Gill", "James A. Blake", "Alastair B. Claringbold", "D. T. H. Steeghs", "J. Casares"], "title": "A search for photometric variability towards the globular cluster M3 with the TWenty Inch Survey Telescope", "comment": "21 pages, 19 figures, accepted for publication in MNRAS", "summary": "We present the commissioning results and first scientific observations from the newly installed TWIST observatory - a 50 cm telescope equipped with an sCMOS camera providing a $36.1\\times24.1$ arcmin$^2$ field of view - housed in the former SuperWASP-North enclosure. We conducted a 67-night, 199-day baseline white-light monitoring campaign centred on the globular cluster M3 aimed at characterizing stellar variability within the cluster while also assessing the photometric performance of the newly commissioned system. We report the discovery of four new SX Phoenicis variables (V301-304), confirm their cluster membership, and identify fundamental-mode pulsation in one, allowing an independent period-luminosity-based distance estimate to M3. We revisited 231 previously known RR Lyrae stars, providing updated period measurements for 203 and white-light amplitudes for 198. We detected Blazhko-like modulation in 53 stars and characterized the modulation parameters for 28. Notably, we measure periods and amplitudes for the unclassified variables V286 and V287 for the first time. We also identify three foreground flaring M dwarfs, and assess the feasibility of detecting microlensing events in M3, concluding that expected rates are negligible. Alongside the scientific results, we introduce a new correction technique for flat-field images affected by scattered light and present a full characterization of the observatory's photometric capabilities. These results demonstrate the scientific utility of TWIST for high-cadence time-domain surveys using modest-aperture instrumentation."}
{"id": "2511.18469", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.18469", "abs": "https://arxiv.org/abs/2511.18469", "authors": ["G. S. Bisnovatyi-Kogan"], "title": "Approximate analytic model of the boundary layer around a low magnetic field neutron star at the disk accretion", "comment": "11 pages, 1 figure", "summary": "An approximate analytic one-dimensional model is constructed, for the accretion disk boundary layer surrounding a neutron star whose low magnetic field does not affect the process of accretion. A high luminosity model is considered, with radiation pressure dominant in the interior part of the disk."}
{"id": "2511.18348", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2511.18348", "abs": "https://arxiv.org/abs/2511.18348", "authors": ["Qingzheng Gao", "Xiao-Jin Liu", "Zhi-Qiang You", "Zheng Li", "Xingjiang Zhu"], "title": "A Bayesian statistical analysis of 897 pulsar flux density spectra", "comment": "12 pages, 8 figures, 7 tables", "summary": "We present a comprehensive re-evaluation of pulsar radio spectra using the largest curated dataset of calibrated flux densities to date, comprising 897 pulsars, and employing a robust Bayesian framework for model comparison alongside frequentist methods. Contrary to the established consensus that pulsar spectra are predominantly simple power laws, our analysis reveals that complex spectral shapes with curvature or breaks are in fact the norm. The broken power law emerges as the most common spectral shape, accounting for 60\\% of pulsars, while the simple power law describes only 13.5\\%, with 68.8\\% of pulsars decisively favoring curved or broken models. We further identify 74 confident gigahertz-peaked spectrum pulsars, and demonstrate that millisecond pulsars frequently exhibit spectral curvature. A key finding is that the previously reported dominance of the simple power law was largely a statistical artifact of the frequentist method used in earlier work. These findings substantially revise the prevailing view of pulsar spectra and establish a critical, model-classified foundation for future theoretical work."}
{"id": "2511.18565", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.18565", "abs": "https://arxiv.org/abs/2511.18565", "authors": ["KM3NeT Collaboration", "O. Adriani", "A. Albert", "A. R. Alhebsi", "S. Alshalloudi", "M. Alshamsi", "S. Alves Garre", "F. Ameli", "M. Andre", "L. Aphecetche", "M. Ardid", "S. Ardid", "J. Aublin", "F. Badaracco", "L. Bailly-Salins", "B. Baret", "A. Bariego-Quintana", "Y. Becherini", "M. Bendahman", "F. Benfenati Gualandi", "M. Benhassi", "D. M. Benoit", "Z. Beňušová", "E. Berbee", "E. Berti", "V. Bertin", "P. Betti", "S. Biagi", "M. Boettcher", "D. Bonanno", "M. Bondì", "S. Bottai", "A. B. Bouasla", "J. Boumaaza", "M. Bouta", "M. Bouwhuis", "C. Bozza", "R. M. Bozza", "H. Brânzaš", "F. Bretaudeau", "M. Breuhaus", "R. Bruijn", "J. Brunner", "R. Bruno", "E. Buis", "R. Buompane", "I. Burriel", "J. Busto", "B. Caiffi", "D. Calvo", "A. Capone", "F. Carenini", "V. Carretero", "T. Cartraud", "P. Castaldi", "V. Cecchini", "S. Celli", "L. Cerisy", "M. Chabab", "A. Chen", "S. Cherubini", "T. Chiarusi", "W. Chung", "M. Circella", "R. Clark", "R. Cocimano", "J. A. B. Coelho", "A. Coleiro", "A. Condorelli", "R. Coniglione", "P. Coyle", "A. Creusot", "G. Cuttone", "R. Dallier", "A. De Benedittis", "G. De Wasseige", "V. Decoene", "P. Deguire", "I. Del Rosso", "L. S. Di Mauro", "I. Di Palma", "A. F. Díaz", "D. Diego-Tortosa", "C. Distefano", "A. Domi", "C. Donzaud", "D. Dornic", "E. Drakopoulou", "D. Drouhin", "J. -G. Ducoin", "P. Duverne", "R. Dvornický", "T. Eberl", "E. Eckerová", "A. Eddymaoui", "T. van Eeden", "M. Eff", "D. van Eijk", "I. El Bojaddaini", "S. El Hedri", "S. El Mentawi", "V. Ellajosyula", "A. Enzenhöfer", "M. Farino", "G. Ferrara", "M. D. Filipović", "F. Filippini", "D. Franciotti", "L. A. Fusco", "T. Gal", "J. García Méndez", "A. Garcia Soto", "C. Gatius Oliver", "N. Geißelbrecht", "E. Genton", "H. Ghaddari", "L. Gialanella", "B. K. Gibson", "E. Giorgio", "I. Goos", "P. Goswami", "S. R. Gozzini", "R. Gracia", "B. Guillon", "C. Haack", "C. Hanna", "H. van Haren", "E. Hazelton", "A. Heijboer", "L. Hennig", "J. J. Hernández-Rey", "A. Idrissi", "W. Idrissi Ibnsalih", "G. Illuminati", "R. Jaimes", "O. Janik", "D. Joly", "M. de Jong", "P. de Jong", "B. J. Jung", "P. Kalaczyński", "U. F. Katz", "J. Keegans", "V. Kikvadze", "G. Kistauri", "C. Kopper", "A. Kouchner", "Y. Y. Kovalev", "L. Krupa", "V. Kueviakoe", "V. Kulikovskiy", "R. Kvatadze", "M. Labalme", "R. Lahmann", "M. Lamoureux", "A. Langella", "G. Larosa", "C. Lastoria", "J. Lazar", "A. Lazo", "G. Lehaut", "V. Lemaître", "E. Leonora", "N. Lessing", "G. Levi", "M. Lindsey Clark", "F. Longhitano", "S. Madarapu", "F. Magnani", "L. Malerba", "F. Mamedov", "A. Manfreda", "A. Manousakis", "M. Marconi", "A. Margiotta", "A. Marinelli", "C. Markou", "L. Martin", "M. Mastrodicasa", "S. Mastroianni", "J. Mauro", "K. C. K. Mehta", "G. Miele", "P. Migliozzi", "E. Migneco", "M. L. Mitsou", "C. M. Mollo", "L. Morales-Gallegos", "N. Mori", "A. Moussa", "I. Mozun Mateo", "R. Muller", "M. R. Musone", "M. Musumeci", "S. Navas", "A. Nayerhoda", "C. A. Nicolau", "B. Nkosi", "B. Ó Fearraigh", "V. Oliviero", "A. Orlando", "E. Oukacha", "L. Pacini", "D. Paesani", "J. Palacios González", "G. Papalashvili", "P. Papini", "V. Parisi", "A. Parmar", "C. Pastore", "A. M. Păun", "G. E. Păvălaš", "S. Peña Martínez", "M. Perrin-Terrin", "V. Pestel", "M. Petropavlova", "P. Piattelli", "A. Plavin", "C. Poirè", "V. Popa", "T. Pradier", "J. Prado", "S. Pulvirenti", "C. A. Quiroz-Rangel", "N. Randazzo", "A. Ratnani", "S. Razzaque", "I. C. Rea", "D. Real", "G. Riccobene", "J. Robinson", "A. Romanov", "E. Ros", "A. Šaina", "F. Salesa Greus", "D. F. E. Samtleben", "A. Sánchez Losa", "S. Sanfilippo", "M. Sanguineti", "D. Santonocito", "P. Sapienza", "M. Scaringella", "M. Scarnera", "J. Schnabel", "J. Schumann", "J. Seneca", "P. A. Sevle Myhr", "I. Sgura", "R. Shanidze", "Chengyu Shao", "A. Sharma", "Y. Shitov", "F. Šimkovic", "A. Simonelli", "A. Sinopoulou", "B. Spisso", "M. Spurio", "O. Starodubtsev", "D. Stavropoulos", "I. Štekl", "D. Stocco", "M. Taiuti", "Y. Tayalati", "H. Thiersen", "S. Thoudam", "I. Tosta e Melo", "B. Trocmé", "V. Tsourapis", "C. Tully", "E. Tzamariudaki", "A. Ukleja", "A. Vacheret", "V. Valsecchi", "V. Van Elewyck", "G. Vannoye", "E. Vannuccini", "G. Vasileiadis", "F. Vazquez de Sola", "A. Veutro", "S. Viola", "D. Vivolo", "A. van Vliet", "E. de Wolf", "I. Lhenry-Yvon", "S. Zavatarelli", "D. Zito", "J. D. Zornoza", "J. Zúñiga"], "title": "Optimizing the potential of KM3NeT in detecting core-collapse supernovae", "comment": "24 pages, 11 figures", "summary": "Core-collapse supernovae mark the end of life of massive stars. However, despite their importance in astrophysics, their underlying mechanisms remain unclear. Neutrinos that emerge from the dense core of the star offer a promising way to study supernova dynamics. A strategy is presented to improve the potential of the KM3NeT neutrino telescope to detect core-collapse supernovae in our Galaxy or the Large Magellanic Cloud by further exploiting the properties of its optical modules equipped with multiple photomultipliers. A supernova burst is expected to produce a sudden hit rate increase in the KM3NeT detectors. New observables have been defined for individual optical modules that exploit the geometry and time distribution of the detected hits, enabling a better discrimination between signal and background signatures. In addition, a thorough investigation of the related systematic uncertainties is presented for the first time. When implemented, this new methodology allowed KM3NeT to probe 46% more Galactic core-collapse supernova candidates than with the previous trigger strategy, reaching the dense Galactic bulge. It is now expected that, once completed, KM3NeT will achieve full Galactic sensitivity to core-collapse supernovae."}
{"id": "2511.18584", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.18584", "abs": "https://arxiv.org/abs/2511.18584", "authors": ["Peter Anninos", "Matthew Portman", "Scott Carmichael", "Robert Hoffman", "Andre Sieverding"], "title": "r-Process nucleosynthesis from hyperaccreting neutron stars in common envelopes", "comment": null, "summary": "We investigate nuclear reactions and feedback in hyperaccreting neutron star environments, considering accretion rates in the range 0.3 - $3\\times10^4$ $M_\\odot$ yr$^{-1}$, typical of short-period compact object binaries in common envelopes. Our mode ls account for weak reactions, neutrino energy loss, nuclear energy release, pair production, degenerate equations of state, and general relativistic hydrodynamics. Depending on accretion rates, these systems can develop both proton and neutron-rich atmospheres with strong convective instabilities linking the neutrino sphere to the outgoing accretion shock inside the radia tion trapping zone. Convection drives nucleons through multiple heating and cooling cycles, with photodisintegration dominat ing during the heating phase and heavy element synthesis during the cooling phase, ejecting material with abundances that dep end on the accretion rate and depth of the final decompression trajectory. The turbulent nature of convective currents is con ducive to creating a wide range of nuclear products through a variety of effects, including NSE freezeout and $r$, $p$ and $\\ gamma$ processes. We also observe a novel multi-step process in reheated trajectories, consisting of proton-capture and photo-dissociation reactions operating on $r$-process seeds, producing overall neutron-deficient isotopes. A significant amount of infalling gas experiences high entropy and short (millisecond) freezeout timescales capable of making $r$-process elements w ith high over-abundances through a disequilibrium effect between neutrons and $α$-particles that does not require an excess of neutrons."}
{"id": "2511.18624", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2511.18624", "abs": "https://arxiv.org/abs/2511.18624", "authors": ["B. Dalla Barba", "L. Foschini", "M. Berton", "A. Lähteenmäki", "M. Tornikoski", "E. Sani", "L. Crepaldi", "E. Congiu", "G. Venturi", "W. J. Hon", "A. Vietri"], "title": "Insights into jet-NLR energetics in PMN J0948+0022", "comment": "7 pages, proceeding of the 15SCSLSA", "summary": "The analysis of the optical spectra of PMN J0948+0022 showed significant variations in the spectral lines that, when combined with the Fermi $γ$-ray light curve and radio observations reported by other authors, were interpreted as the result of interactions between the relativistic jet and the narrow-line region (NLR). In this work, we present order-of-magnitude calculations of the energetics associated with this proposed jet-NLR interaction. We demonstrate that the observed outflows are capable of absorbing a fraction of the jet energy and converting it into kinetic energy. This mechanism provides a natural explanation for the optical spectral variability recorded with the X-shooter and Multi-Unit Spectroscopic Explorer (MUSE) instruments. Our results support the scenario in which feedback from the relativistic jet can dynamically influence the circumnuclear gas, offering new insights into the coupling between jets and the NLR in $γ$-ray-emitting narrow-line Seyfert 1 galaxies."}
{"id": "2511.18678", "categories": ["astro-ph.HE", "astro-ph.GA", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2511.18678", "abs": "https://arxiv.org/abs/2511.18678", "authors": ["Cheyanne Shariat", "Claire S. Ye", "Smadar Naoz", "Sanaea Rose"], "title": "Fast Radio Bursts from White Dwarf Binary Mergers: Isolated and Triple-Induced Channels", "comment": "11 pages, 3 figures; Submitted to ApJL, all comments are welcome!", "summary": "The detection of fast radio bursts (FRBs) in both young and old stellar populations suggests multiple formation pathways, beyond just young magnetars from core-collapse supernovae. A promising delayed channel involves the formation of FRB-emitting neutron stars through merger- or accretion-induced collapse of a massive white dwarf (WD). By simulating a realistic stellar population with both binaries and triples, we identify pathways to WD collapse that could produce FRB candidates. We find that (i) triple dynamics open new merger channels inaccessible to isolated binaries, significantly enhancing the overall merger rate; (ii) triple-induced mergers broaden the delay-time distribution, producing long-delay ($\\gtrsim1$-8~Gyr) events largely independent of metallicity, alongside a shorter-delay population ($\\lesssim100$~Myr) of rapid mergers; (iii) these long delays naturally yield FRBs in older environments such as quiescent host galaxies and galactic halos; (iv) when convolved with the cosmic star-formation history, binary channels track the star-formation rate ($z_{\\rm peak} \\sim 2$), while triple channels peak later ($z_{\\rm peak} \\sim 1$), giving a combined local source rate of $R_0 \\approx 2\\times10^4~{\\rm Gpc^{-3}~yr^{-1}}$, consistent with observations; and (v) applying the same framework to Type~Ia supernovae, we find that triples extend the delay-time tail and roughly double the Ia efficiency relative to binaries, yielding rates and redshift evolution in good agreement with observations. If FRBs originate from the collapse of WDs, our results establish triples, alongside binaries, as a crucial and previously overlooked formation pathway whose predicted rates, host demographics, and redshift evolution offer clear tests for upcoming surveys."}
{"id": "2511.18681", "categories": ["astro-ph.HE", "gr-qc", "nucl-th"], "pdf": "https://arxiv.org/pdf/2511.18681", "abs": "https://arxiv.org/abs/2511.18681", "authors": ["Shiyue Ren", "Lap-Ming Lin"], "title": "Tracing the Trace Anomaly of Dense Matter inside Neutron Stars", "comment": "13 pages, 9 figures", "summary": "The trace anomaly $Δ$ is an important quantity that measures the broken conformal symmetry in neutron star matter. In this work, we present quasi-universal relations that connect the stellar profile of $Δ$ to the compactness, moment of inertia, and tidal deformability of neutron stars. We apply the quasi-universal relations to determine the trace anomaly profiles for PSR J0030+0451 and PSR J0740+6620 based on their mass-radius measurements. We also analyze PSR J0737-3039A according to its moment of inertia inferred from Bayesian modeling of nuclear equation of state. A recent multimessenger constraint on the tidal deformability is also studied, resulting in an estimate value of the trace anomaly $Δ_c = 0.1770^{+0.0365}_{-0.0432}$ at the center of a $1.4M_\\odot$ canonical neutron star. It is expected that more precise observations from both electromagnetic and gravitational-wave channels in the future will provide tighter constraints on the behavior of $Δ$ inside neutron stars."}
{"id": "2511.18744", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.18744", "abs": "https://arxiv.org/abs/2511.18744", "authors": ["Andrés F. Vargas", "Andrew Melatos", "Julian B. Carlin", "Marcus E. Lower", "Simon Johnston", "Patrick Weltevrede"], "title": "Hierarchical Bayesian estimation of population-level torque law parameters from $68$ young radio pulsars observed with the Murriyang telescope", "comment": "20 pages, 6 figures", "summary": "Abridged. The measured braking index, $n=ν\\ddotν/\\dotν^2$, of a rotation-powered pulsar with spin frequency $ν$ and braking torque $K ν^{n_{\\rm pl}}$, features secular and stochastic anomalies arising from $\\dot{K} \\neq 0$ and random torque noise respectively. Previous studies quantified the variance $\\langle n^{2} \\rangle = (n_{\\rm pl}+\\dot{K}_{\\rm dim})^{2}+σ_{\\rm dim}^{2}$, where the secular anomaly, $\\dot{K}_{\\rm dim}$, is inversely proportional to the characteristic time-scale $τ_{K}$ over which $K$ varies; the stochastic anomaly, $σ_{\\rm dim}^{2} = σ_{\\ddotν}^{2}ν^{2}γ_{\\ddotν}^{-2}\\dotν^{-4}T_{\\rm obs}^{-1}$, is a function of the timing noise amplitude $σ_{\\ddotν}$, a damping time-scale $γ_{\\ddotν}^{-1}$ and the total observing time $T_{\\rm obs}$; and the average is taken over an ensemble of random realizations of the noise process. Here, we use a hierarchical Bayesian scheme, based on the formula for $\\langle n^{2} \\rangle$, to infer the population-level distribution of $n_{\\rm pl}+\\dot{K}_{\\rm dim}$ for a sample of $68$ young radio pulsars, observed for $\\gtrsim 10~{\\rm years}$ with Murriyang, the 64-m Parkes radio telescope. Upon assuming that the $n_{\\rm pl}+\\dot{K}_{\\rm dim}$ values are drawn from a population-level Gaussian, $N(μ_{\\rm pl}, σ_{\\rm pl})$, the Bayesian scheme returns the mean $μ_{\\rm pl} = 9.95^{+5.58}_{-5.26}$ and standard deviation $σ_{\\rm pl}=10.89^{+5.14}_{-3.69}$. At a per-pulsar level it returns posterior medians satisfying $-13.86 \\leq n_{\\rm pl}+\\dot{K}_{\\rm dim} \\leq 30.38$. The secular anomaly dominates the stochastic anomaly, with posterior medians satisfying $|n_{\\rm pl} + \\dot{K}_{\\rm dim}| \\geq σ_{\\rm dim}$ in 10 out of 68 objects."}
{"id": "2511.18881", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.18881", "abs": "https://arxiv.org/abs/2511.18881", "authors": ["Ye Xu"], "title": "Measurement of Milli-Charged Particles with a running electromagnetic coupling constant at IceCube", "comment": "15 pages, 9 figures", "summary": "It is assumed that heavy dark matter $φ$ with O(TeV) mass captured by the Earth may decay to relativistic light milli-charged particles (MCPs). These MCPs could be measured by the IceCube neutrino telescope. The massless hidden photon model was taken for MCPs to interact with nuclei with a running electromagnetic coupling constant, so that the numbers and fluxes of expected MCPs may be evaluated at IceCube. Meanwhile, the numbers of expected neutrino background events were also evaluated at IceCube. Based on the assumption that no events are observed at IceCube in 10 years, the corresponding upper limits on MCP fluxes were calculated at 90\\% C. L.. These results indicated that the MCPs from the Earth's core could be directly detected at O(1TeV) energies at IceCube when $5.65\\times10^{-5}\\lesssimε^2\\lesssim1.295\\times10^{-3}$. And a new region of 4 GeV < $m_{MCP}$ < 100 GeV and $5.51\\times10^{-2}$ < $ε$ < 0.612 is ruled out in the $m_{MCP}$-$ε$ plane with 10 years of IceCube data."}
{"id": "2511.18975", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2511.18975", "abs": "https://arxiv.org/abs/2511.18975", "authors": ["Claudia M. Raiteri"], "title": "The variability of blazars throughout the electromagnetic spectrum", "comment": "Review article published by The Astronomy and Astrophysics Review", "summary": "With their jet pointing towards us, blazars are ideal tools to study the physics and structure of extragalactic jets. Their powerful jets are cosmic particle accelerators and are alleged to be one of the production sites of the high-energy neutrinos detected by the IceCube Observatory. Doppler beaming of the jet nonthermal radiation increases blazar brightness, blue-shifts their emission, and shortens their variability time scales, which are observed to range from years down to minutes. This review will focus on blazar flux, spectral, and polarization variability across the electromagnetic spectrum. Interpretation of blazar variability calls into question both intrinsic and extrinsic mechanisms. Shock waves, magnetic reconnection, and turbulence can accelerate particles inside the jet, while jet precession, rotation, and twisting can produce variations in Doppler beaming. Microvariability puts strong constraints on the size of the emitting regions, suggesting a multizone emitting jet. Twisting jets have been proposed to explain the long-term multiwavelength variability. They are supported by radio observations of bent or helical jets, and by results of relativistic magnetohydrodynamics simulations of plasma jets. Detection of (quasi)periodic behaviour has been ascribed to orbital motion in black hole binary systems, jet precession, kink instabilities developing inside the jet, or perturbations in the accretion disc. Gravitational microlensing has been suggested to explain blazar behaviour in some cases. Polarization provides information on the structure and behaviour of the magnetic field in the emission zones. Both the degree and angle of polarization can show strong and fast variability, which is sometimes correlated with flux. The interpretation of flux, spectral, and polarization variability within a consistent picture challenges current models of blazar variability."}
{"id": "2511.19016", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.19016", "abs": "https://arxiv.org/abs/2511.19016", "authors": ["E. Quintin", "E. Russeil", "M. Llamas Lanza", "S. Karpov", "E. E. O. Ishida", "J. Peloton", "M. V. Pruzhinskaya", "A. Möller", "M. Giustini", "G. Miniutti", "R. S. Saxton", "P. Sánchez-Sáez", "S. Zheltoukhov", "A. Dodin", "A. Belinski"], "title": "Lost and Found - A gallery of overlooked optical nuclear transients from the ZTF archive", "comment": "Submitted to A&A; 25 pages, 14 figures", "summary": "Tidal disruption events (TDEs) correspond to the destruction of a star by the tidal forces around a black hole, leading to outbursts which can last from months to years. These transients are rare, and increasing the current sample is paramount to understand them. As part of the Fink alert broker, we have developed an early detection system for TDEs for the Zwicky Transient Facility (ZTF) data. In this paper, we report on the optical transients we found either during the development of this tool, or when applying the classifier to the existing archive. We use this sample to anticipate what improvements to the TDE detection systems will need to be implemented for future surveys. For all the transients, we present optical and infrared archival photometry from ZTF, WISE, and Catalina, and assess the previous nuclear activity of the host. We fit the ZTF lightcurves with both a phenomenological and a physically-motivated model. We report on a total of 19 optical nuclear transients, out of which nine are in passive galaxies, eight in active galaxies, and two for which the activity of the host is uncertain. Two transients are newly discovered repeated TDE candidates, and we compare them to the current sample of repeated optical nuclear transients. One transient is exceptionally long-lived (over 5 years), in an until-now passive galaxy. Three of the TDE-like flares in active galaxies have absolute g-band magnitudes brighter than -24, making them new Extreme Nuclear Transient (ENT) candidates. One seemingly repeated object was revealed to be two independent supernovae in the same galaxy. This sample shows both the potential of our detection system for future discovery, and the relevance of archival searches to reveal overlooked transients. It also raises several points of concern and avenues of improvement for current and future classifiers."}
{"id": "2511.19243", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.19243", "abs": "https://arxiv.org/abs/2511.19243", "authors": ["Dhruv Jain", "Shasvath J. Kapadia", "Kuntal Misra", "Dimple", "L. Resmi", "Ajay Kumar Singh", "K. G. Arun"], "title": "What do gravitational-wave observations tell us about Luminous Red Novae?", "comment": "7 Pages, 3 figures, 1 Table; To be Submitted in ApJL", "summary": "Luminous Red Novae (LRNe) have been argued to be related to the ejection of common envelopes (CEs) in binary star systems. Ejection of CEs leads to tightened stellar orbits capable of forming compact binaries that merge in Hubble time. As these mergers are seen by gravitational-wave (GW) detectors such as LIGO, Virgo and KAGRA (LVK), we ask what the merger rates of compact binaries in LVK tell us about the fraction of LRNe that lead to the formation of compact binaries that merge in Hubble time. Using the observed volumetric rates of LRNe from the Zwicky Transient Facility (ZTF) and of compact binary mergers from LVK observations, we derive limits on the fraction of LRNe that produce compact binaries that merge in Hubble time. Assuming the LRNe rate closely follows the star formation rate at any redshift, we use the delay time distribution models for compact binaries to compute the compact binary merger rate. A comparison of this merger rate with the latest volumetric rates of compact binary mergers from the fourth GW transient catalog (GWTC-4) at the present epoch of LVK allows us to constrain the above fraction. We find that only a fraction as small as $\\sim 10^{-3}$ (median) of the LRNe correspond to the GW-observed binary neutron star (BNS) and neutron star-black hole (NSBH) mergers. This potentially implies that the majority of the LRNe population will not lead to mergers of compact objects, but other end products, such as stellar mergers."}
{"id": "2511.19362", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.19362", "abs": "https://arxiv.org/abs/2511.19362", "authors": ["Clara Lilje", "Rob Fender", "James H. Matthews"], "title": "Kinematics show consistency between stellar mass and supermassive black hole parent population jet speeds", "comment": "Accepted for publication in MNRAS", "summary": "Jets from stellar-mass and supermassive black holes provide the unique opportunity to study similar processes in two very different mass regimes. Historically, the apparent speeds of black hole x-ray binary (BHXRBs) jets have been observed to be lower than jet speeds from active galactic nuclei (AGN) and specifically blazars. In this work, we show that selection effects could be the primary cause of the observed population differences. For the first time, it is possible to perform a statistical analysis of the underlying BHXRB jet Lorentz factor distribution. We use both the Anderson-Darling test and apply nested sampling to this problem. With Bayes factors, we confirm that the Lorentz factor distribution of BHXRBs is best described with a power law, the same model that has been applied to AGN jets. For a Lorentz factor distribution following $\\rm N(Γ) \\propto Γ^b$ we find a value for the exponent of $b=-2.64_{-0.55}^{+0.46}$. This exponent is consistent with values found in AGN population studies, within $1σ$ for \\textit{Swift}-BAT and \\textit{Fermi}-LAT selected AGN. The best-fit exponent for the radio selected MOJAVE sample is just above our $2 σ$ limit. This is a remarkable agreement given the different scales at which the jets are observed. The observed slower apparent speeds in BHXRBs are largely due to the much larger inclinations in this sample. Furthermore, nested sampling confirms that $Γ_{\\rm max}$ is completely unconstrained using this method. Therefore, based on kinematics alone, BHXRB jets are broadly consistent with being just as relativistic as those from supermassive black holes."}
{"id": "2511.19385", "categories": ["astro-ph.HE", "hep-ph"], "pdf": "https://arxiv.org/pdf/2511.19385", "abs": "https://arxiv.org/abs/2511.19385", "authors": ["R. Abbasi", "M. Ackermann", "J. Adams", "S. K. Agarwalla", "J. A. Aguilar", "M. Ahlers", "J. M. Alameddine", "S. Ali", "N. M. Amin", "K. Andeen", "C. Argüelles", "Y. Ashida", "S. Athanasiadou", "S. N. Axani", "R. Babu", "X. Bai", "J. Baines-Holmes", "A. Balagopal V.", "S. W. Barwick", "S. Bash", "V. Basu", "R. Bay", "J. J. Beatty", "J. Becker Tjus", "P. Behrens", "J. Beise", "C. Bellenghi", "S. Benkel", "S. BenZvi", "D. Berley", "E. Bernardini", "D. Z. Besson", "E. Blaufuss", "L. Bloom", "S. Blot", "I. Bodo", "F. Bontempo", "J. Y. Book Motzkin", "C. Boscolo Meneguolo", "S. Böser", "O. Botner", "J. Böttcher", "J. Braun", "B. Brinson", "Z. Brisson-Tsavoussis", "R. T. Burley", "D. Butterfield", "M. A. Campana", "K. Carloni", "J. Carpio", "S. Chattopadhyay", "N. Chau", "Z. Chen", "D. Chirkin", "S. Choi", "B. A. Clark", "A. Coleman", "P. Coleman", "G. H. Collin", "D. A. Coloma Borja", "A. Connolly", "J. M. Conrad", "D. F. Cowen", "C. De Clercq", "J. J. DeLaunay", "D. Delgado", "T. Delmeulle", "S. Deng", "P. Desiati", "K. D. de Vries", "G. de Wasseige", "T. DeYoung", "J. C. Díaz-Vélez", "S. DiKerby", "T. Ding", "M. Dittmer", "A. Domi", "L. Draper", "L. Dueser", "D. Durnford", "K. Dutta", "M. A. DuVernois", "T. Ehrhardt", "L. Eidenschink", "A. Eimer", "C. Eldridge", "P. Eller", "E. Ellinger", "D. Elsässer", "R. Engel", "H. Erpenbeck", "W. Esmail", "S. Eulig", "J. Evans", "P. A. Evenson", "K. L. Fan", "K. Fang", "K. Farrag", "A. R. Fazely", "A. Fedynitch", "N. Feigl", "C. Finley", "L. Fischer", "D. Fox", "A. Franckowiak", "S. Fukami", "P. Fürst", "J. Gallagher", "E. Ganster", "A. Garcia", "M. Garcia", "G. Garg", "E. Genton", "L. Gerhardt", "A. Ghadimi", "T. Glüsenkamp", "J. G. Gonzalez", "S. Goswami", "A. Granados", "D. Grant", "S. J. Gray", "S. Griffin", "S. Griswold", "K. M. Groth", "D. Guevel", "C. Günther", "P. Gutjahr", "C. Ha", "C. Haack", "A. Hallgren", "L. Halve", "F. Halzen", "L. Hamacher", "M. Ha Minh", "M. Handt", "K. Hanson", "J. Hardin", "A. A. Harnisch", "P. Hatch", "A. Haungs", "J. Häußler", "K. Helbing", "J. Hellrung", "B. Henke", "L. Hennig", "F. Henningsen", "L. Heuermann", "R. Hewett", "N. Heyer", "S. Hickford", "A. Hidvegi", "C. Hill", "G. C. Hill", "R. Hmaid", "K. D. Hoffman", "D. Hooper", "S. Hori", "K. Hoshina", "M. Hostert", "W. Hou", "M. Hrywniak", "T. Huber", "K. Hultqvist", "K. Hymon", "A. Ishihara", "W. Iwakiri", "M. Jacquart", "S. Jain", "O. Janik", "M. Jansson", "M. Jeong", "M. Jin", "N. Kamp", "D. Kang", "W. Kang", "A. Kappes", "L. Kardum", "T. Karg", "M. Karl", "A. Karle", "A. Katil", "M. Kauer", "J. L. Kelley", "M. Khanal", "A. Khatee Zathul", "A. Kheirandish", "H. Kimku", "J. Kiryluk", "C. Klein", "S. R. Klein", "Y. Kobayashi", "A. Kochocki", "R. Koirala", "H. Kolanoski", "T. Kontrimas", "L. Köpke", "C. Kopper", "D. J. Koskinen", "P. Koundal", "M. Kowalski", "T. Kozynets", "A. Kravka", "N. Krieger", "J. Krishnamoorthi", "T. Krishnan", "K. Kruiswijk", "E. Krupczak", "A. Kumar", "E. Kun", "N. Kurahashi", "N. Lad", "C. Lagunas Gualda", "L. Lallement Arnaud", "M. J. Larson", "F. Lauber", "J. P. Lazar", "K. Leonard DeHolton", "A. Leszczyńska", "C. Li", "J. Liao", "C. Lin", "Q. R. Liu", "Y. T. Liu", "M. Liubarska", "C. Love", "L. Lu", "F. Lucarelli", "W. Luszczak", "Y. Lyu", "M. Macdonald", "J. Madsen", "E. Magnus", "Y. Makino", "E. Manao", "S. Mancina", "A. Mand", "I. C. Mariş", "S. Marka", "Z. Marka", "L. Marten", "I. Martinez-Soler", "R. Maruyama", "J. Mauro", "F. Mayhew", "F. McNally", "K. Meagher", "S. Mechbal", "A. Medina", "M. Meier", "Y. Merckx", "L. Merten", "J. Mitchell", "L. Molchany", "S. Mondal", "T. Montaruli", "R. W. Moore", "Y. Morii", "A. Mosbrugger", "M. Moulai", "D. Mousadi", "E. Moyaux", "T. Mukherjee", "R. Naab", "M. Nakos", "U. Naumann", "J. Necker", "L. Neste", "M. Neumann", "H. Niederhausen", "M. U. Nisa", "K. Noda", "A. Noell", "A. Novikov", "A. Obertacke", "V. O'Dell", "A. Olivas", "R. Orsoe", "J. Osborn", "E. O'Sullivan", "V. Palusova", "H. Pandya", "A. Parenti", "N. Park", "V. Parrish", "E. N. Paudel", "L. Paul", "C. Pérez de los Heros", "T. Pernice", "T. C. Petersen", "J. Peterson", "M. Plum", "A. Pontén", "V. Poojyam", "Y. Popovych", "M. Prado Rodriguez", "B. Pries", "R. Procter-Murphy", "G. T. Przybylski", "L. Pyras", "C. Raab", "J. Rack-Helleis", "N. Rad", "M. Ravn", "K. Rawlins", "Z. Rechav", "A. Rehman", "I. Reistroffer", "E. Resconi", "S. Reusch", "C. D. Rho", "W. Rhode", "L. Ricca", "B. Riedel", "A. Rifaie", "E. J. Roberts", "M. Rongen", "A. Rosted", "C. Rott", "T. Ruhe", "L. Ruohan", "D. Ryckbosch", "J. Saffer", "D. Salazar-Gallegos", "P. Sampathkumar", "A. Sandrock", "G. Sanger-Johnson", "M. Santander", "S. Sarkar", "M. Scarnera", "P. Schaile", "M. Schaufel", "H. Schieler", "S. Schindler", "L. Schlickmann", "B. Schlüter", "F. Schlüter", "N. Schmeisser", "T. Schmidt", "F. G. Schröder", "L. Schumacher", "S. Schwirn", "S. Sclafani", "D. Seckel", "L. Seen", "M. Seikh", "S. Seunarine", "P. A. Sevle Myhr", "R. Shah", "S. Shah", "S. Shefali", "N. Shimizu", "B. Skrzypek", "R. Snihur", "J. Soedingrekso", "D. Soldin", "P. Soldin", "G. Sommani", "C. Spannfellner", "G. M. Spiczak", "C. Spiering", "J. Stachurska", "M. Stamatikos", "T. Stanev", "T. Stezelberger", "T. Stürwald", "T. Stuttard", "G. W. Sullivan", "I. Taboada", "S. Ter-Antonyan", "A. Terliuk", "A. Thakuri", "M. Thiesmeyer", "W. G. Thompson", "J. Thwaites", "S. Tilav", "K. Tollefson", "S. Toscano", "D. Tosi", "A. Trettin", "A. K. Upadhyay", "K. Upshaw", "A. Vaidyanathan", "N. Valtonen-Mattila", "J. Valverde", "J. Vandenbroucke", "T. Van Eeden", "N. van Eijndhoven", "L. Van Rootselaar", "J. van Santen", "J. Vara", "F. Varsi", "M. Venugopal", "M. Vereecken", "S. Vergara Carrasco", "S. Verpoest", "D. Veske", "A. Vijai", "J. Villarreal", "C. Walck", "A. Wang", "E. H. S. Warrick", "C. Weaver", "P. Weigel", "A. Weindl", "J. Weldert", "A. Y. Wen", "C. Wendt", "J. Werthebach", "M. Weyrauch", "N. Whitehorn", "C. H. Wiebusch", "D. R. Williams", "L. Witthaus", "M. Wolf", "G. Wrede", "X. W. Xu", "J. P. Yanez", "Y. Yao", "E. Yildizci", "S. Yoshida", "R. Young", "F. Yu", "S. Yu", "T. Yuan", "S. Yun-Cárcamo", "A. Zander Jurowitzki", "A. Zegarelli", "S. Zhang", "Z. Zhang", "P. Zhelnin", "P. Zilberman"], "title": "Limits on GeV-scale WIMP Annihilation in Dwarf Spheroidals with IceCube DeepCore", "comment": "22 pages, 14 figures, 3 tables. Submitted to PRD. Comments welcome!", "summary": "Dark matter is approximately five times more abundant than baryonic matter in the universe, but its physical nature continues to elude physicists. One potential candidate for dark matter is a weakly-interacting massive particle (WIMP), which is predicted by various extensions to the Standard Model (SM) of particle physics. After becoming gravitationally bound in cosmic structures, WIMPs can self-annihilate and produce SM particles including neutrinos, which are observable by detectors like IceCube. We present a search for neutrinos from low-mass $(\\leq 300 \\, \\mathrm{GeV})$ WIMP annihilation in dwarf spheroidal galaxies with over seven years of IceCube livetime. We find no statistically significant evidence of neutrinos produced by WIMP annihilation, and therefore set upper limits on the velocity-averaged annihilation cross section $\\left<σv\\right>$. Our strongest upper limits at the 90\\% confidence level are $\\mathcal{O}\\!\\left(10^{-22} \\, \\mathrm{{cm}^{3} \\, s^{-1}}\\right)$ for WIMP annihilation directly into neutrino-antineutrino pairs. For our least sensitive channel, the corresponding limits are $\\mathcal{O}\\!\\left(10^{-20} \\, \\mathrm{{cm}^{3} \\, s^{-1}}\\right)$, which is an improvement of over two orders of magnitude over previous IceCube limits from dwarf galaxies at the upper end of our mass range."}
{"id": "2511.19393", "categories": ["astro-ph.HE", "gr-qc", "physics.comp-ph", "physics.data-an", "physics.space-ph"], "pdf": "https://arxiv.org/pdf/2511.19393", "abs": "https://arxiv.org/abs/2511.19393", "authors": ["Utkarsh Mali", "Reed Essick"], "title": "Guesswork in the gap: the impact of uncertainty in the compact binary population on source classification", "comment": "26 pages, 12 figures, 5 tables", "summary": "The nature of the compact objects within the supposed \"lower mass gap\" remains uncertain. Observations of GW190814 and GW230529 highlight the challenges gravitational waves face in distinguishing neutron stars from black holes. Interpreting these systems is especially difficult because classifications depend simultaneously on measurement noise, compact binary population models, and equation of state (EOS) constraints on the maximum neutron star mass. We analyze 66 confident events from GWTC-3 to quantify how the probability of a component being a neutron star, P(NS), varies across the population. The effects are substantial, the dominant drivers of classification are the pairing preferences of neutron stars with other compact objects, and the neutron star spin distributions. The data reveals that P(NS) varies between 1% - 67% for GW230529's primary and between 51% - 100% for GW190425's primary. By contrast, P(NS) for GW190814's secondary varies by <10%, demonstrating robustness from its high signal-to-noise ratio and small mass ratio. Analysis using EOS information tends to affect P(NS) through the inferred maximum neutron star mass rather than the maximum spin. As it stands, P(NS) remains sensitive to numerous population parameters, limiting its reliability and potentially leading to ambiguous classifications of future GW events."}
{"id": "2511.19407", "categories": ["astro-ph.HE", "astro-ph.CO"], "pdf": "https://arxiv.org/pdf/2511.19407", "abs": "https://arxiv.org/abs/2511.19407", "authors": ["Johan Samsing", "Lorenz Zwick", "Pankaj Saini", "János Takátsy"], "title": "Probing the Formation Environment of Strongly Lensed Black Hole Mergers: Implications for the AGN-disk Channel", "comment": "comments welcome", "summary": "The observation of multiple images from a strongly lensed gravitational wave (GW) source provides the observer with a stereoscopic view of the source. This allows for a measure of its relative proper motion by comparing the induced GW Doppler shifts between the different images. In addition, if the GW source is in a dynamical environment it will be subject to an acceleration, which will show up as a time dependent Doppler shift in each individual image. In this work we quantify for the first time how a joint detection of these effects can be used to constrain the underlying dynamics and environment of the lensed GW source. We consider a range of different astrophysical environments, from massive clusters to stellar triples, and find that binary black hole (BBH) mergers in Active Galactic Nuclei disks (AGN-disks) are particularly likely to have orbital parameters that can be constrained through our considered lensing setup. Applying these methods to the upcoming catalog of cosmologically strongly lensed GW sources will open up new possibilities for probing their origin and underlying formation mechanisms."}
{"id": "2511.19419", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.19419", "abs": "https://arxiv.org/abs/2511.19419", "authors": ["S. Buson", "M. De Toma", "S. Larsson", "C. C. Cheung", "P. Cristarella Orestano", "S. Ciprini", "C. Spingola", "M. Razzano", "A. Dominguez", "M. Ajello", "S. Cutini"], "title": "Gamma-ray Time Delay and Magnification Ratio in the Gravitationally-Lensed Blazar PKS 1830-211", "comment": "Under review; feedback welcome", "summary": "We present the characterization of macrolensing properties of the gravitationally lensed system PKS 1830-211, utilizing data from the Fermi Large Area Telescope. While at gamma-rays we can not spatially resolve the lensed images, a macrolensing-induced time pattern is expected in the blazar's lightcurve, resulting from the delay between variable gamma-ray components originating from its two brightest lensed images. Compared to our previous study, here we employ high-quality lightcurves coupled with prolonged outburst activity, and improved time-series techniques. Analyzing six independent data segments, we identified a delay of 20.26 +/- 0.62 days (statistical and stochastic uncertainty), with a chance detection probability at the 2.5 x $10^{-5}$ level (post-trial). We also present a novel approach to the magnification ratio estimate based on a comparison with simulated data. Our work suggests that the gamma-ray flux ratio between the two main lens components is $μ_γ \\lesssim$ 1.8. We do not observe convincing evidence of microlensing effects, as previously claimed. The measured gamma-ray time delay is in 2-sigma tension with radio-based estimates, suggesting either distinct emission sites, underestimated radio uncertainties, or gamma-ray production in a region opaque to radio. Our study highlights the potential of well sampled lightcurves and advanced time-series techniques to distinguish true lensing-induced delays from stochastic variability. When combined with improved radio constraints and refined lens models, PKS 1830-211 and similar sources constitute promising systems for time-delay cosmography, offering new insights into both jet structure and cosmological parameters."}
{"id": "2511.17706", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.17706", "abs": "https://arxiv.org/abs/2511.17706", "authors": ["Paul Tiede", "William Moses", "Valentin Churavy", "Michael D. Johnson", "Dominic Pesce", "Lindy Blackburn", "Peter Galison"], "title": "Hierarchical Interferometric Bayesian Imaging", "comment": "submitted to ApJ", "summary": "Very long baseline interferometry (VLBI) achieves the highest angular resolution in astronomy. VLBI measures corrupted Fourier components, known as visibilities. Reconstructing on-sky images from these visibilities is a challenging inverse problem, particularly for sparse arrays such as the Event Horizon Telescope (EHT) and the Very Long Baseline Array (VLBA), where incomplete sampling and severe calibration errors introduce significant uncertainty in the image. To help guide convergence and control the uncertainty in image reconstructions, regularization on the space of images is utilized, such as enforcing smoothness or similarity to a fiducial image. Coupled with this regularization is the introduction of a new set of parameters that modulate its strength. We present a hierarchical Bayesian imaging approach (Hierarchical Interferometric Bayesian Imaging, HIBI) that enables the quantification of uncertainty for al parameters. Incorporating instrumental effects within HIBI is straightforward, allowing for simultaneous imaging and calibration of data. To showcase HIBI's effectiveness and flexibility, we build a simple imaging model based on Markov random fields and demonstrate how different physical components can be included, e.g., black hole shadow size, and their uncertainties can be inferred. For example, while the original EHT publications were unable to constrain the ring width of M87*, HIBI measures a width of $9.3\\pm 1.3\\,μ{\\rm as}$. We apply HIBI to image and calibrate EHT synthetic data, real EHT observations of M87*, and multifrequency observations of \\oj287. Across these tests, HIBI accurately recovers a wide variety of image structures and quantifies their uncertainties. HIBI is publicly available in the Comrade.jl VLBI software repository."}
{"id": "2511.17797", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.17797", "abs": "https://arxiv.org/abs/2511.17797", "authors": ["L. J. M. Houben", "H. Falcke", "L. G. Spitler", "E. D. Barr", "M. Berezina", "D. J. Champion", "R. Karuppusamy", "M. Kramer"], "title": "The Northern High Time Resolution Universe pulsar survey -- II. Single-pulse search set-up and simulations", "comment": "21 pages, 15 figures, 5 tables", "summary": "The High Time Resolution Universe (HTRU) survey is an all-sky survey looking for pulsars and other radio transients. A new single-pulse (SP) search pipeline is presented, tailored to the northern part of the HTRU survey collected with the 100m Effelsberg Radio Telescope. In a selection of this data, synthetic SPs are injected with frequency-time structures resembling those of the detected Fast Radio Burst (FRB) population and processed by the pipeline to characterize its performance. Therefore, several new software toolkits have been developed (FRBfaker and RFIbye) to enable the injection of SPs with complex frequency-time structures and cope with the Radio Frequency Interference (RFI) in the survey's data. The operation of these toolkits is described alongside the overall functionality of the SP pipeline. Qualification of the pipeline confirmed that it is ready to process all the HTRU-North data. Additionally, the survey's sensitivity to SPs, the impact of RFI thereon, the performance of the deep-learning classifier FETCH, and some insights that may be used to improve the pipeline's performance in the future are determined. Within the small data sample analysed, 21 known pulsars and a RRAT are detected. In addition, eight faint SP trains that might originate from yet undiscovered neutron stars and 141 isolated SP candidates were discovered."}
{"id": "2511.19014", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.19014", "abs": "https://arxiv.org/abs/2511.19014", "authors": ["Sergio Belmonte Diaz", "Rene P. Breton", "Zafiirah Hosenie", "Ben W. Stappers"], "title": "Enhancing Fast Radio Transient Detection with Mask R-CNN Image Segmentation", "comment": "Manuscript submitted to Royal Astronomical Society Techniques and Instruments. 14 pages. 11 figures", "summary": "Traditionally, fast radio transient searches are conducted on dedispersed time series using thresholding techniques based on the statistical properties of the data. However, peaks in dedispersed time series do not directly provide information on the nature of the source. In the DM-time domain, the S/N variation of real, dispersed astrophysical signals forms a characteristic bow tie shape, whereas radio frequency interference (RFI) can take multiple different forms. We have developed a method that bypasses the thresholding step of traditional single-pulse searches in favour of a direct DM-time domain image analysis. The backbone of our pipeline is a Mask R-CNN, a deep learning model designed for object detection, enabling it to identify the bow tie signature and distinguish real sources from RFI. Previous deep learning models often include a snippet of the DM-time domain in their input. We have trained the model on simulated bursts injected on top of real MeerKAT noise observations. We tested the model on MeerKAT follow-up observations of the repeater FRB20240114A and we were able to recover all bursts with a signal-to-noise above the traditional threshold, while detecting two bursts that were fainter. Our new approach considerably reduces the number of candidates above a nominal threshold while being capable of running in real time for typical surveys. We also propose a modified version of the traditional dedispersion plan optimised for this method."}
