{"id": "2511.21818", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.21818", "abs": "https://arxiv.org/abs/2511.21818", "authors": ["Simona Pacuraru", "Clément Bonnerot", "Martin E. Pessah"], "title": "The impact of magnetic fields during tidal disruption events", "comment": "Submitted to MNRAS, comments are welcome!", "summary": "During a tidal disruption event (TDE) the stream debris inherits the magnetic field of the star. As the stream stretches, the magnetic field evolves and can eventually become dynamically important. We study this effect by means of magnetohydrodynamic simulations and a semi-analytic model of the disruption of a main-sequence star by a supermassive black hole. For stellar magnetic fields stronger than $\\sim 10^4\\,\\rm{G}$, magnetic pressure becomes important in a significant fraction of the mass of the stream, leading to a fast increase in its thickness, an effect that may impact its subsequent evolution. We find that this dynamical effect is associated with a phase of transverse equilibrium between magnetic and tidal forces, which causes the stream width to increase with distance to the black hole as $H \\propto R^{5/4}$. In the unbound tail, this fast expansion could enhance the radio emission produced by the interaction with the ambient medium, while in the returning stream, it may qualitatively affect the subsequent gas evolution, particularly the gas dynamics and radiative properties of shocks occurring after the stream's return to pericentre. By characterizing the magnetohydrodynamic properties of the stream from disruption to the first return to pericentre, this work provides physically motivated initial conditions for future studies of the later phases of TDEs, accounting for magnetic fields. This will ultimately shed light on the role of magnetic fields in enabling angular momentum transport in the ensuing accretion disk, thereby affecting observable signatures such as X-ray radiation and relativistic outflows."}
{"id": "2511.21895", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.21895", "abs": "https://arxiv.org/abs/2511.21895", "authors": ["R. Daniel Murphy", "Elle Brinkman", "Colter J. Richardson", "Evan Semenak", "Anthony Mezzacappa", "Pedro Marronetti", "Eric J. Lentz", "Stephen W. Bruenn"], "title": "Gravitational Waves as a Probe of Core Collapse Supernova Progenitor Structure", "comment": "14 pages, 12 figures", "summary": "We present the gravitational wave predictions from two-dimensional core collapse supernova (CCSN) simulations initiated from two nearly identical progenitors that have significantly different internal structures due to their late-stage stellar evolution. At the time of collapse, the 15.78 $M_{\\odot}$ and 15.79 $M_{\\odot}$ progenitors have compactness parameters $ξ_{2.5}$ of 0.136 and 0.206, respectively. We connect several features of the gravitational wave signal from each model to its previously explored explosion dynamics. In particular, the greater accretion onto the PNS of the more compact model is evident in broad-band frequency features with larger amplitude gravitational wave strains and greater gravitational wave energy release when compared to the less compact model. Additionally, the faster contraction rate of the more compact model is reflected in the $\\sim$26% greater slope of the $g$-/$f$-mode feature (gfF) evolution of the gravitational wave signal. This work shows that in principle gravitational wave detection may provide information about interior stellar structure."}
{"id": "2511.21933", "categories": ["astro-ph.HE", "astro-ph.CO", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2511.21933", "abs": "https://arxiv.org/abs/2511.21933", "authors": ["Irene Ferranti", "Mikel Falxa", "Federico Fantoccoli", "Alberto Sesana", "Golam Mohiuddin Shaifullah"], "title": "Data span and frequency coverage requirements for robust detection and inference in PTAs: A case study with EPTA DR2", "comment": null, "summary": "Pulsar Timing Arrays (PTAs) are approaching the sensitivity required for a $5σ$ detection of the nanohertz stochastic gravitational-wave background (GWB). This makes it crucial to deeply understand the behaviour of our analysis pipelines. A counterintuitive feature of the European Pulsar Timing Array (EPTA) second data release is that restricting the dataset to the last 10.3 years (DR2new) increases the inferred GWB significance from $\\leq2σ$ for the full 25-year dataset (DR2full) to $\\geq3.5σ$. We investigate whether this behaviour indicates an anomaly or is a possible outcome of the pipeline. Using realistic, DR2-like simulations with varying timespans, we find that the first 10 years contribute little to the GWB evidence due to their limited frequency coverage. This produces substantial overlap between the HD S/N distributions of DR2full and DR2new. Random noise fluctuations therefore yield a higher GWB evidence in DR2new than in DR2full in $15\\%$ of cases. Furthermore, $5\\%$ of simulations match the HD S/N of the real data, indicating that the observed behaviour is consistent with being a $\\sim2σ$ outcome due to noise fluctuations. Regardless of significance, DR2new simulations introduce biases in the GWB parameter estimation due to spectral leakage effects that are ignored in standard analyses and which flatten the inferred spectrum. Including leakage removes these biases, demonstrating the reliability of DR2new when the signal is properly modelled. Furthermore, we demonstrate that combining EPTA DR2full with long-baseline data from NANOGrav and PPTA, as well as low-frequency data from LOFAR and NenuFAR, significantly enhances GWB evidence and parameter accuracy. Finally, we examine the impact of the observation timespan and find that short-baseline datasets introduce strong amplitude biases and are ineffective at constraining the GWB."}
{"id": "2511.22093", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2511.22093", "abs": "https://arxiv.org/abs/2511.22093", "authors": ["Omkar Sridhar", "Anarya Ray", "Vicky Kalogera"], "title": "Characterizing Binary Black Hole Subpopulations in GWTC-4 with Binned Gaussian Processes: On the Origins of the $35M_{\\odot}$ Peak", "comment": "16 pages, 8 figures", "summary": "Understanding the astrophysical origins of binary black holes requires accurate and flexible modeling of multi-dimensional population properties. In this paper, using a data-driven framework based on binned Gaussian processes, we characterize the joint distribution of BBH primary masses, mass ratios, and effective inspiral spins. We identify three distinct subpopulations in the GWTC-4 sample of observations and investigate their astrophysical origins. We find that only one of the three subpopulations exhibits the $35M_{\\odot}$ peak, which is characterized by a strong preference for equal mass systems and isotropic spin orientations. Our inferred distributions are consistent with a predominantly dynamical origin of this feature. By comparing with theoretical simulations, we further show that the subpopulation that exhibits the $35M_{\\sun}$ peak can exclusively comprise dynamically assembled systems in globular clusters, specifically if black hole birth spins are in the range~$(0.1-0.2)$, whereas the other two subpopulations require substantial contributions from alternative formation channels. We constrain the \\textit{lower bound} on the merger rate of BBHs in globular clusters to be $0.69^{+0.23}_{-0.33} \\rm{Gpc}^{-3}\\rm{yr}^{-1}$, which is consistent with theoretical predictions. We conclude that dynamical formation in globular clusters remains a strong candidate for the origin of this excess near $30-40M_{\\odot}$ and that more data and targeted parametric models are necessary to rigorously establish this interpretation."}
{"id": "2511.21816", "categories": ["astro-ph.IM", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2511.21816", "abs": "https://arxiv.org/abs/2511.21816", "authors": ["Ryohei Kawabe", "Takeshi Sakai", "Kunihiko Tanaka", "Akio Taniguchi", "Bunyo Hatsukade", "Yoichi Tamura", "Yuki Yoshimura", "Tatsuya Takekoshi", "Tai Oshima", "Masato Hagimoto", "Teppei Yonetsu", "Kotomi Taniguchi", "Kotaro Kohno", "Hiroyuki Maezawa", "David H. Hughes", "Peter F. Schloerb", "Edgar Colín-Beltrán", "Miguel Chávez Dagostino", "Víctor Gómez-Rivera", "Arturo I. Gómez-Ruiz", "Gopal Narayanan", "Iván Rodríguez-Montoya", "David Sánchez-Argüelles", "Yoshito Shimajiri", "Kamal Souccar", "Min S. Yun", "Tom J. L. C. Bakx", "Kevin C. Harrington", "Shinji Fujita", "Fumitaka Nakamura", "O. S. Rojas-García", "Alfredo A. Montaña Barbano", "Javier Zaragoza-Cardiel"], "title": "The LMT 2 Millimeter Receiver System (B4R). I. Overview and Results of Science Demonstration", "comment": "15 pages, 11 figures, 5 tables, accepted for publication in AJ", "summary": "We report on the results of the on-sky test and science demonstration conducted with the 2 mm receiver system, B4R, on the 50 m Large Millimeter Telescope (LMT), located at an altitude of 4600 m in Mexico. The B4R receiver was developed based on the dual-polarization sideband-separating mixer technology of the Atacama Large Millimeter/submillimeter Array, and is equipped with a fast Fourier transform digital spectrometer, XFFTS. The primary science objective is the spectroscopic redshift identification of high-redshift dusty star-forming galaxies, complementing the existing 3 mm Redshift Search Receiver by enabling the detection of multiple carbon monoxide lines. Additionally, the B4R receiver broadens the range of science cases possible with the LMT, including astrochemistry, as the 2 mm band encompasses unique molecular lines such as deuterated molecules and shock tracers. During on-site commissioning in 2018 and 2019, we successfully demonstrated on-the-fly mapping and position-switching observations toward the Orion Molecular Cloud 1 and bright high-redshift dusty star-forming galaxies, respectively. We confirmed that the installed B4R system largely met its basic performance specifications. Furthermore, we measured the LMT's aperture efficiencies across the entire B4R frequency range (130-160 GHz), finding them to be roughly consistent with expectations based on a surface accuracy of 100 $μ$m and the receiver optics design. These results with the B4R will enable the most sensitive single-dish spectroscopic observations at 2 mm using the LMT."}
{"id": "2511.22149", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.22149", "abs": "https://arxiv.org/abs/2511.22149", "authors": ["Lin Lan", "He Gao", "Litao Zhao", "Shunke Ai", "Jie Lin", "Long Li", "Lang Xie", "Li-Ping Xin", "Jian-Yan Wei"], "title": "Constraining the Properties of GRB Accreting Magnetar with $R/I$ Evolutionary Effects Using \\emph{Swift}/XRT Data", "comment": "22 pages, 6 figures, and 2 tables. Accepted for publication in ApJ", "summary": "A newly born millisecond magnetar has been proposed as one possible central engine of some long gamma-ray bursts (LGRBs) with X-ray plateau. In this work, we used a universal correlation between initial spin period ($P_0$) and surface magnetic field ($B_p$) of newborn magnetar based on an LGRB sample in \\cite{Lan2025} to explore the propeller properties of accreting magnetar with $R/I$ evolutionary effects. We found that $B_p-P_0$ relation is approximately consistent with $B_p\\propto P_{\\rm eq}^{7/6}$. Here, $P_{\\rm eq}$ is equilibrium spin period in magnetic propeller model. The $B_p-P_0$ relation indicates that $P_0$ may not be true initial spin period of newborn magnetar, but had reached an equilibrium spin period via fallback accretion in propeller model. The magnetar accretion rate in our LGRBs is in range of $\\dot{M}\\sim10^{-5}-10^{-2} M_{\\odot} \\rm s^{-1}$ by incorporating $R/I$ evolutionary effects, and using the transition relation between gravitational mass $M_g$ and baryonic mass $M_b$ in different equation of states. Such accretion rates ensure that the accreting magnetars in our sample survive until reaching the equilibrium spin period, and the accretion rate is one order of magnitude lower compared to the statistical results in \\cite{Stratta2018} and \\cite{Linweili2020}, which used constant $R/I/M_g$ scenario. We suggested that adopting a constant $R/I/M_g$ scenario for modeling propeller regime in accreting magnetar results in a higher mass accretion rate, which may impair our understanding of the physical nature and its surroundings of accreting magnetar, and low-metallicity progenitors can provide enough material to satisfy the accretion requirements of newborn accreting magnetar in LGRBs."}
{"id": "2511.22071", "categories": ["astro-ph.IM", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2511.22071", "abs": "https://arxiv.org/abs/2511.22071", "authors": ["Zihan kang", "Jingyi Zhang", "Yanxia Zhang", "Changhua Li", "Xiao Kong", "Minzhi Kong", "Jinghang Shi", "Shirui Wei", "Xue-Bing Wu"], "title": "A Catalogue of Mid-infrared Variable Sources from unTimely", "comment": null, "summary": "The WISE and NEOWISE missions have provided the only mid-infrared all-sky time-domain data, opening a unique observational window for variability studies. Yet, a comprehensive and systematic catalog of mid-infrared variable sources has remained unavailable. In this work, we construct the first large-scale mid-infrared variability catalog based on the unTimely coadded photometry, covering tens of millions of sources. By employing a Bayesian Gaussian mixture model with a Dirichlet process, we identified 8,256,042 variable sources in the W1 band and 7,147,661 in the W2 band, significantly expanding the landscape of known mid-infrared variables. In addition to robust variability metrics, our analysis highlights rare and extreme outliers through dedicated outlier-detection algorithms, enabling the discovery of unusual classes of objects such as eruptive young stellar objects, highly variable active galactic nuclei, and other rare transients. This unprecedented dataset provides a new foundation for time-domain astronomy in the mid-infrared, offering complementary insights to optical and near-infrared surveys, and opening the door to systematic investigations of stellar evolution, accretion processes, and dust-enshrouded astrophysical environments on a Galactic and extragalactic scale."}
{"id": "2511.22520", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.22520", "abs": "https://arxiv.org/abs/2511.22520", "authors": ["E. Quintin", "N. Khan", "N. A. Webb", "R. Webbe", "R. D. Saxton", "G. Miniutti", "M. Giustini"], "title": "Needle in a Poissonian haystack -- An X-ray astronomer's guide to QPE fishing", "comment": "Proceedings of \"X-ray Quasi-Periodic Eruptions and Repeating Nuclear Transients\", 16-19 June 2025, ESAC, Madrid. Submitted to Astronomische Nachrichten", "summary": "After six years of studies following the discovery of GSN069, a link is starting to appear between the elusive Quasi-Periodic Eruptions (QPEs) and other types of nuclear transients, among which are Tidal Disruption Events (TDEs). As such, observing strategies are adapting, with a current trend focusing on late-time X-ray follow-ups of (optical) TDEs. While these campaigns are so far proving quite successful, the inherent confirmation bias they introduce in our sample could lead the community to hasty, and perhaps erroneous, conclusions. It is thus important to still pursue the search for nuclear transients in other, more agnostic directions. In this work, we focus on the observational aspects of our field, and lay out two different methods that can be deployed in order to reveal new QPE sources. These complementary methods enable the detection of long-term ($\\sim$years) and short term ($\\sim$minutes) transient events, that would have otherwise been missed by the standard detection pipelines. Both of these methods can be used either for data mining in the 25 years worth of XMM-Newton archive, or to trigger real-time follow-ups upon a more recent discovery."}
{"id": "2511.22161", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2511.22161", "abs": "https://arxiv.org/abs/2511.22161", "authors": ["Gabriella Montano", "Cheukyu Edward Tong", "Dan Marrone"], "title": "A Novel Comb Generator for Frequency Phase Transfer", "comment": null, "summary": "This paper presents the design and testing of a millimeter-wave frequency comb generator developed for the Black Hole Explorer (BHEX) mission, a space Very-Long-Baseline Interferometry (VLBI) mission concept. The heart of BHEX is a dual-band receiver, centered at 90 and 270 GHz. This novel comb generator is based on a microwave phase modulator producing phase-coherent comb signals with multi-octave bandwidth, which will be used to track instrumental delays when injected into the receiver system. The comb generator was tested with astronomical receivers, which confirms its expected operation."}
{"id": "2511.22534", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.22534", "abs": "https://arxiv.org/abs/2511.22534", "authors": ["C. T. Hao", "J. H. Jing", "X. L. Han", "H. R. Lan", "W. C. Du", "X. N. Liu", "Z. B. Zhang", "H. C. Liu", "J. F. Wu", "X. L. Xia"], "title": "Towards Understanding the Origin of Swift Gamma-Ray Bursts Driven by Magnetars", "comment": "35 pages, 7 figures and 3 tables, accepted by ApJ", "summary": "We analyze a sample of\\textit{ Swift} gamma-ray bursts (GRBs) with extended emissions in $γ$-rays and/or X-ray plateaus that may be driven by magnetars. Multi-wavelength data and multi-standards have been adopted to investigate the issue jointly. First, we find that GRBs with both extended emission and X-ray plateau satisfy a three-parameter relation between the luminosity and the end time of X-ray plateaus and the $γ$-ray isotropic energy as $L_X\\varpropto T_a^{-1.13}E_{γ,iso}^{0.74}$, which is consistent with that of normal GRBs. Second, we distinguish these GRBs in the plane of magnetic field versus period of neutron star and find that almost all GRBs but GRB 211024B have reasonable periods and majority of them could be powered by magnetars. Third, we standardize the X-ray afterglows with distinct characteristics and find that the standard X-ray light curves with/without plateaus are significantly different. The standardized X-ray plateaus are similar to the mean temporal profile of magnetars. Fourth, it is verified with a K-S test that all types of GRBs except short ones have the similar distributions of redshift and isotropic energy in the observer/rest frame. GRBs with internal plateaus are significantly different from those of normal long GRBs and GRBs with external plateaus and/or extended emissions. Interestingly, the isotropic energy distributions of GRBs with internal and external plateaus are identical with those of short and long GRBs, respectively. Overall, our study can bring solid evidence that the fascinating magnetars could have multi-formation channels to account for not only short but also long GRBs with either internal or external X-ray plateaus as well."}
{"id": "2511.22299", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2511.22299", "abs": "https://arxiv.org/abs/2511.22299", "authors": ["Adarsh Bathula", "M. A. Krishnakumar", "S. Jena"], "title": "Recovering Intrinsic Pulsar Profiles and Scattering Parameters with a CLEAN-Based Algorithm for High-Precision Timing", "comment": null, "summary": "In high precision pulsar timing, the accurate recovery of intrinsic pulsar profiles and their associated scattering parameters is of paramount importance. In this paper, we present a comprehensive study focused on the retrieval of intrinsic pulsar profiles through the utilization of a CLEAN-based algorithm as described in Bhat et al. (2003). The primary objective of this study is to elucidate the capabilities of our pipeline in the context of recovering the intrinsic profiles and associated parameters, such as dispersion measure, frequency scaling index, scattering time, pulse broadening function, and time of arrival residuals. We use simulated profiles to rigorously test and validate the efficiency of our recovery pipeline. These simulated profiles encompass single and multi-component Gaussians, designed to emulate the diverse nature of pulsar profiles. By comparing the recovered profiles and parameters to their injected values, as derived from simulations, we provide a robust evaluation of the pipeline's performance along with its drawbacks and limitations."}
{"id": "2511.22670", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.22670", "abs": "https://arxiv.org/abs/2511.22670", "authors": ["Xin Sheng", "Bennett Link", "Matthew E. Caplan", "Yuri Levin"], "title": "Vortex Dynamics in the Neutron Star Inner Crust", "comment": "20 pages, 15 figures. Submitted to ApJ", "summary": "We study the superfluid vortex motion in the neutron star inner crust through direct three-dimensional simulations of the coupled dynamics of the vortex and the nuclear lattice. We demonstrate the pinning of an initially moving vortex to the lattice through excitation of lattice vibrations, and show that the efficiency of this process is higher for attractive than for repulsive nucleus-vortex interactions. We explore the unpinning of a vortex under the action of the applied Magnus force, and find that it is influenced by multiple parameters, including the sign of the pinning force, the lattice orientation, composition, temperature, and the energy of pinning to individual nucleus. In lattices with multiple grains, the unpinning transition is triggered inside the grains with weaker pinning, propagates along the vortex (mediated by the excited Kelvin waves) and crosses into grains with stronger pinning. This is likely to effectively decrease the critical force at which vortices unpin and to produce extended regions of unpinned vorticity. Shearing of the crust lattice (e.g., by a starquake) initiates the unpinning of the vortices that are crossing the slip plane. A close encounter of an unpinned vortex with a pinned vortex would cause the latter to unpin, perhaps initiating an unpinning avalanche of many vortices."}
{"id": "2511.22597", "categories": ["astro-ph.IM", "astro-ph.HE", "gr-qc"], "pdf": "https://arxiv.org/pdf/2511.22597", "abs": "https://arxiv.org/abs/2511.22597", "authors": ["Jeffrey S. Hazboun", "Joseph Simon", "Jeremy Baier", "Bjorn Larsen", "Daniel J. Oliver", "Paul T. Baker", "Bence Bécsy", "Siyuan Chen", "Alberto Diaz Hernandez", "Justin A. Ellis", "A. Miguel Holgado", "Kristina Islo", "Aaron Johnson", "Andrew R. Kaiser", "Nima Laal", "Alexander McEwen", "Nihan S. Pol", "Joey Shapiro Key", "Min Young Kim", "Matthew Samson", "Brent J. Shapiro-Albert", "Jerry P. Sun", "Stephen R. Taylor", "Caitlin A. Witt", "Jeremy Volpe", "Christine Ye", "Harsha Blumer", "Paul R. Brook", "Shami Chatterjee", "James M. Cordes", "Fronefield Crawford", "H. Thankful Cromartie", "Megan E. DeCesar", "Paul B. Demorest", "Timothy Dolch", "Robert D. Ferdman", "Elizabeth C. Ferrara", "William Fiore", "Emmanuel Fonseca", "Nathan Garver-Daniels", "Peter A. Gentile", "Deborah C. Good", "Ross J. Jennings", "Megan L. Jones", "David L. Kaplan", "Michael T. Lam", "T. Joseph W. Lazio", "Duncan R. Lorimer", "Jing Luo", "Ryan S. Lynch", "Dustin R. Madison", "Maura A. McLaughlin", "Chiara M. F. Mingarelli", "Cherry Ng", "David J. Nice", "Timothy T. Pennucci", "Scott M. Ransom", "Paul S. Ray", "Xavier Siemens", "Renée Spiewak", "Ingrid H. Stairs", "Daniel R. Stinebring", "Kevin Stovall", "Joseph K. Swiggum", "Jacob E. Turner", "Michele Vallisneri", "Sarah J. Vigeland"], "title": "The NANOGrav 12.5-year Data Set: Chromatic Noise Characterization & Mitigation with Time-Domain Kernels", "comment": "30 pages, 12 Figures, 6 Tables", "summary": "Pulsar timing arrays (PTAs) have recently entered the detection era, quickly moving beyond the goal of simply improving sensitivity at the lowest frequencies for the sake of observing the stochastic gravitational wave background (GWB), and focusing on its accurate spectral characterization. While all PTA collaborations around the world use Fourier-domain Gaussian processes to model the GWB and intrinsic long time-correlated (red) noise, techniques to model the time-correlated radio frequency-dependent (chromatic) processes have varied from collaboration to collaboration. Here we test a new class of models for PTA data, Gaussian processes based on time-domain kernels that model the statistics of the chromatic processes starting from the covariance matrix. As we will show, these models can be effectively equivalent to Fourier-domain models in mitigating chromatic noise. This work presents a method for Bayesian model selection across the various choices of kernel as well as deterministic chromatic models for non-stationary chromatic events and the solar wind. As PTAs turn towards high frequency (>1/yr) sensitivity, the size of the basis used to model these processes will need to increase, and these time-domain models present some computational efficiencies compared to Fourier-domain models."}
{"id": "2511.22987", "categories": ["astro-ph.HE", "gr-qc", "hep-ph"], "pdf": "https://arxiv.org/pdf/2511.22987", "abs": "https://arxiv.org/abs/2511.22987", "authors": ["Thibeau Wouters", "Peter T. H. Pang", "Tim Dietrich", "Chris Van Den Broeck"], "title": "Incorporating neutron star physics into gravitational wave inference with neural priors", "comment": "19 pages, 7 figures, 4 tables", "summary": "Bayesian inference, widely used in gravitational-wave parameter estimation, depends on the choice of priors, i.e., on our previously existing knowledge. However, to investigate neutron star mergers, priors are often chosen in an agnostic way, leaving valuable information from nuclear physics and independent observations of neutron stars unused. In this work, we propose to encode information on neutron star physics into data-driven prior distributions constructed with normalizing flows, referred to as neural priors. These priors take input from constraints on the nuclear equation of state and neutron star population models. Applied to GW170817, GW190425, and GW230529, we highlight two contributions of the framework. First, we demonstrate its ability to provide source classification and to enable model selection of equation of state constraints for loud signals such as GW170817, directly from the gravitational-wave data. Second, we obtain narrower constraints on the source properties through these informed priors. As a result, the neural priors consistently recover higher luminosity distances compared to agnostic priors. Our method paves the way for classifying future ambiguous low-mass mergers observed through gravitational waves and for continuously incorporating advances in our understanding of neutron star properties into gravitational-wave data analysis."}
{"id": "2511.22634", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2511.22634", "abs": "https://arxiv.org/abs/2511.22634", "authors": ["Josh G. Weston", "David R. Young", "Stephen J. Smartt", "Matt Nicholl", "Matt J. Jarvis", "I. H. Whittam"], "title": "Identifying Transient Hosts in LSST's Deep Drilling Fields with Galaxy Catalogues", "comment": "Submitted to ApJ", "summary": "The upcoming Vera C. Rubin Observatory Legacy Survey of Space and Time (LSST) will enable astronomers to discover rare and distant astrophysical transients. Host-galaxy association is crucial for selecting the most scientifically interesting transients for follow-up. LSST Deep Drilling Field observations will detect distant transients occurring in galaxies below the detection limits of most all-sky catalogues. Here we investigate the use of pre-existing smaller-scale, field-specific catalogues for host identification in the Deep Drilling Fields (DDFs) and a ranking of their usefulness. We have compiled a database of 70 deep catalogues that overlap with the Rubin DDFs and constructed thin catalogues to be homogenised and combined for transient-host matching. A systematic ranking of their utility is discussed and applied based on the inclusion of information such as spectroscopic redshifts and morphological information. Utilising this data against a Dark Energy Survey (DES) sample of supernovae with pre-identified hosts in the XMM-LSS and ECDFS fields, we evaluate different methods for transient-host association in terms of both accuracy and processing speed. We also apply light data-cleaning techniques to identify and remove contaminants within our associations, such as diffraction spikes and blended galaxies where the correct host cannot be determined with confidence. We use a lightweight machine learning approach in the form of extreme gradient boosting to generate confidence scores in our contaminant selections and associated metrics. Finally, we discuss the computational expense of implementation within the LSST transient alert brokers, which will require efficient, fast-paced processing to handle the large stream of survey data."}
{"id": "2511.23134", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.23134", "abs": "https://arxiv.org/abs/2511.23134", "authors": ["Saqlain Afroz", "Titir Mukherjee", "Raj Prince"], "title": "Blazar classification from multi-wavelength data using Deep Learning", "comment": "11 pages, 5 figures, 4 tables", "summary": "The launch of the Fermi-LAT telescope has revolutionized gamma-ray astronomy by detecting over 7,000 gamma-ray emitting objects. A major fraction of the objects are blazars of known type, and a similar fraction of objects were classified as blazars of uncertain types (BCUs). Apart from that, some of the objects were found to be unassociated with any other classes, and no information is available in other wavebands. These types of objects are classified as unassociated objects in the Fermi catalog. To classify the unassociated objects into known categories and BCUs into a known type of blazar, numerous efforts have been made using the machine learning approach. The ideal way of classification would be to have multi-wavelength temporal and spectral information, which is nearly impossible to have for this number of objects in the near future. In this paper, we focus on classifying BCUs into other types of blazars, such as FSRQs and BL Lacs. For this purpose, we have developed for the first time a deep feed-forward Artificial Neural Network (ANN) to classify them, using multi-wavelength data. The complete understanding of blazars can only be known through multi-wavelength observation, and hence, we begin with four input parameters that cover broadband information (radio, optical, X-ray fluxes, and redshift) to train the neural network, and then extend the framework by including additional parameters to examine their impact on the outcome."}
{"id": "2511.22668", "categories": ["astro-ph.IM", "astro-ph.EP", "cs.CV"], "pdf": "https://arxiv.org/pdf/2511.22668", "abs": "https://arxiv.org/abs/2511.22668", "authors": ["Aditya Pratap Singh", "Shrey Shah", "Ramanakumar Sankar", "Emma Dahl", "Gerald Eichstädt", "Georgios Georgakis", "Bernadette Bucher"], "title": "Structure-Preserving Unpaired Image Translation to Photometrically Calibrate JunoCam with Hubble Data", "comment": null, "summary": "Insights into Jupiter's atmospheric dynamics are vital for understanding planetary meteorology and exoplanetary gas giant atmospheres. To study these dynamics, we require high-resolution, photometrically calibrated observations. Over the last 9 years, the Juno spacecraft's optical camera, JunoCam, has generated a unique dataset with high spatial resolution, wide coverage during perijove passes, and a long baseline. However, JunoCam lacks absolute photometric calibration, hindering quantitative analysis of the Jovian atmosphere. Using observations from the Hubble Space Telescope (HST) as a proxy for a calibrated sensor, we present a novel method for performing unpaired image-to-image translation (I2I) between JunoCam and HST, focusing on addressing the resolution discrepancy between the two sensors. Our structure-preserving I2I method, SP-I2I, incorporates explicit frequency-space constraints designed to preserve high-frequency features ensuring the retention of fine, small-scale spatial structures - essential for studying Jupiter's atmosphere. We demonstrate that state-of-the-art unpaired image-to-image translation methods are inadequate to address this problem, and, importantly, we show the broader impact of our proposed solution on relevant remote sensing data for the pansharpening task."}
{"id": "2511.23263", "categories": ["astro-ph.HE", "hep-ph"], "pdf": "https://arxiv.org/pdf/2511.23263", "abs": "https://arxiv.org/abs/2511.23263", "authors": ["Siyu Jiang", "Aidi Yang", "Fa Peng Huang"], "title": "Macroscopic Dark Matter under siege: from White Dwarf Data to Gravitational Wave Detection", "comment": "8+12 pages, 3+6 figures, 0+1 table, comments are welcome", "summary": "The nature of dark matter (DM) remains a profound mystery. Macroscopic candidates, such as Fermi-balls, offer a distinct alternative to conventional particle DM, yet their low number density makes terrestrial detection challenging. In this work, we present a unified search strategy for sub-saturated Fermi-ball DM. We first revisit and significantly update astrophysical constraints from compact objects, utilizing rigorous expressions and additional white dwarf data related to ignition and subsequent supernovae. Crucially, we then explore novel signatures of Fermi-balls in future gravitational wave experiments like LISA and TianQin, performing detailed signal-to-noise ratio and Fisher matrix analyses. By combining these updated white dwarf/neutron star limits with the projected gravitational wave sensitivities, we derive the most comprehensive constraints on Fermi-ball parameter space to date, demonstrating the power of multi-messenger approaches for probing macroscopic DM."}
{"id": "2511.22702", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2511.22702", "abs": "https://arxiv.org/abs/2511.22702", "authors": ["Lawrence Toomey", "George Hobbs", "James Dempsey", "Shane Majewski", "Shi Dai", "John Reynolds"], "title": "The Parkes Observatory Pulsar Data Archive", "comment": "22 pages, 3 figures", "summary": "Data from observations of pulsars made by Murriyang, the CSIRO Parkes 64-metre radio-telescope over the last three decades are more accessible than ever before, largely due to their storage in expansive long-term archives. Containing nearly 2 million files from more than 400 Parkes pulsar projects, CSIRO's Data Access Portal is leading the global effort in making pulsar data accessible. In this article, we present the current status of the archive, and provide information about the acquisition, analysis, reduction, visualisation, preservation and dissemination of these data sets. We highlight the importance of such an archive, and present a selection of new results emanating from archival data."}
{"id": "2511.23267", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.23267", "abs": "https://arxiv.org/abs/2511.23267", "authors": ["Jia-Lun Li", "H. -Y. Karen Yang"], "title": "Simulating AGN feedback in galaxy clusters with pre-existing turbulence", "comment": "16 pages, 11 figures, submitted to ApJ", "summary": "Feedback from active galactic nuclei (AGN) is believed to play a significant role in suppressing cooling flows in cool-core (CC) clusters. Turbulence in the intracluster medium (ICM), which may be induced by AGN activity or pre-existing motions, has been proposed as a potential heating mechanism based on analysis of Chandra X-ray surface brightness fluctuations. However, subsequent simulation results have found the subdominant role of turbulence in heating the ICM. To investigate this discrepancy, we perform three-dimensional hydrodynamic simulations of a Perseus-like cluster including both AGN feedback and pre-existing turbulence, which is stirred to the observationally constrained level in the Perseus cluster. Our results indicate that, although the velocity field is dominated by the pre-existing turbulence, AGN heating through bubbles and shocks remains significant. More importantly, analysis of the velocity structure function and the energy power spectrum shows that the turbulent heating rate is smaller than the radiative cooling rate, especially in the cluster core. Our results offer insights relevant for recent XRISM observations and indicate that turbulent heating alone cannot offset radiative cooling in CC clusters."}
{"id": "2511.23048", "categories": ["astro-ph.IM", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2511.23048", "abs": "https://arxiv.org/abs/2511.23048", "authors": ["Evgenii Volkov", "Kseniia Chelidze", "Dmitrii Gromushkin", "Semen Khokhlov", "Evgenii Khomchuk", "Anatoly Petrukhin", "Ivan Shulzhenko"], "title": "The observation of Ground Level Enhancement GLE 77 by the neutron detectors of the Experimental Complex NEVOD", "comment": null, "summary": "A Ground Level Enhancement event was observed by neutron detectors designed for the registration of extensive air showers at the Experimental Complex NEVOD. The potential for that was unlocked by a recent modernization of the experimental setup that included implementation of additional channels for measuring neutron flux variation. At 10:15 UT on November 11, 2025, a sudden and significant increase in the neutron flux was detected by two installations: PRISMA-36 and URAN arrays. For the first time, a GLE has been recorded using a set of neutron detectors oriented at the extensive air shower studies. We present the measured EC NEVOD data and the results of the preliminary analysis of the observed GLE."}
{"id": "2511.23349", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.23349", "abs": "https://arxiv.org/abs/2511.23349", "authors": ["Edilberto Aguilar-Ruiz", "Ramandeep Gill", "Paz Beniamini", "Jonathan Granot"], "title": "Synchrotron Self-Compton Model of TeV Afterglows in Gamma-Ray Bursts", "comment": "Submitted to MNRAS", "summary": "The detection of a very-high-energy TeV spectral component in the afterglow emission of gamma-ray bursts (GRBs) has opened a new probe into the energetics of ultra-relativistic blast waves and the nature of the circumburst environment in which they propagate. The afterglow emission is well understood as the synchrotron radiation from the shock-accelerated electrons in the medium swept up by the blast wave. The same distribution of electrons also inverse-Compton upscatters the softer synchrotron photons to produce the synchrotron self-Compton (SSC) TeV emission. Accurate modeling of this component generally requires a computationally expensive numerical treatment, which makes it impractical when fitting to observations using Markov Chain Monte Carlo (MCMC) methods. Simpler analytical formalisms are often limited to broken power-law solutions and some predict an artificially high Compton-Y parameter. Here we present a semi-analytic framework for a spherical blast wave that accounts for adiabatic cooling and expansion, photon escape, and equal-arrival-time-surface integration, in addition to Klein-Nishina effects. Our treatment produces the broadband afterglow spectrum and its temporal evolution at par with results obtained from more sophisticated kinetic calculations. We fit our model to the afterglow observations of the TeV bright GRB\\,190114C using MCMC, and find an energetic blast wave with kinetic energy $E_{k, \\rm iso} = 9.1^{+7.41}_{-3.13} \\times 10^{54} \\, \\rm erg$ propagating inside a radially stratified external medium with number density $n(r)\\propto r^{-k}$ and $k=1.67^{+0.09}_{-0.10}$. A shallower external medium density profile ($k<2$) departs from the canonical approximation of a steady wind ($k=2$) from the progenitor star and may indicate a non-steady wind or a transition to an interstellar medium."}
{"id": "2511.23228", "categories": ["astro-ph.IM", "gr-qc", "physics.data-an"], "pdf": "https://arxiv.org/pdf/2511.23228", "abs": "https://arxiv.org/abs/2511.23228", "authors": ["Niklas Houba", "Giovanni Giarda", "Lorenzo Speri"], "title": "SlotFlow: Amortized Trans-Dimensional Inference with Slot-Based Normalizing Flows", "comment": "58 pages, 20 figures", "summary": "Inferring the number of distinct components contributing to an observation, while simultaneously estimating their parameters, remains a long-standing challenge across signal processing, astrophysics, and neuroscience. Classical trans-dimensional Bayesian methods such as Reversible Jump Markov Chain Monte Carlo (RJMCMC) provide asymptotically exact inference but can be computationally expensive. Instead, modern deep learning provides a faster alternative to inference but typically assume fixed component counts, sidestepping the core challenge of trans-dimensionality. To address this, we introduce SlotFlow, a deep learning architecture for trans-dimensional amortized inference. The architecture processes time-series observations, which we represent jointly in the frequency and time domains through parallel encoders. A classifier produces a distribution over component counts K, and its MAP estimate specifies the number of slots instantiated. Each slot is parameterized by a shared conditional normalizing flow trained via permutation-invariant Hungarian matching. On sinusoidal decomposition with up to 10 overlapping components and Gaussian noise, SlotFlow achieves 99.85% cardinality accuracy and well-calibrated parameter posteriors, with systematic biases well below one posterior standard deviation. Direct comparison with RJMCMC shows close agreement in amplitude and phase, with Wasserstein distances $W_2 < 0.01$ and $< 0.03$, indicating that shared global context captures inter-component structure despite a factorized posterior. Frequency posteriors remain centered but exhibit 2-3x broader intervals, consistent with an encoder bottleneck in retaining long-baseline phase coherence. The method delivers a $\\sim 10^6\\times$ speedup over RJMCMC, suggesting applicability to time-critical workflows in gravitational-wave astronomy, neural spike sorting, and object-centric vision."}
{"id": "2511.23426", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.23426", "abs": "https://arxiv.org/abs/2511.23426", "authors": ["Nissim Fraija", "Boris Betancourt-Kamenetskaia", "Antonio Galván", "Maria Dainotti"], "title": "Variation of Microphysical Parameters in Reverse-shock Scenario", "comment": "36 pages, 14 figures, 10 tables. Accepted in MNRAS", "summary": "Gamma-ray bursts (GRBs), among the most compelling astrophysical phenomena, are potential candidates for exploring the evolution of energy distribution among magnetic fields and particles through multiwavelength observations. The fraction of energy transferred between particles and the magnetic field is governed by microphysical parameters, typically assumed to be constant during relativistic shocks but may in fact vary with time. In this work, we derive the light curves and closure relations (CRs) of the synchrotron-self Compton (SSC) process from the external reverse shock (RS) with variations of microphysical parameters in a homogeneous and stellar-wind medium. We consider the evolution of the RS in the thick- and thin-shell regimes. We demonstrate that, depending on the microphysical parameters, this process can mimic plateau phases and produce temporal decay indices steeper than those predicted by high-latitude emission alone. The current model is employed to examine the evolution of the spectral and temporal indices of GRBs reported in the Second Fermi-LAT Gamma-ray Burst Catalog (2FLGC) and bursts detected at very high energies, using Markov Chain Monte Carlo (MCMC) simulations."}
{"id": "2511.23244", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2511.23244", "abs": "https://arxiv.org/abs/2511.23244", "authors": ["C. P. Walther", "C. Nigro", "D. Elsässer", "W. Rhode"], "title": "Tools and Advancements towards Data Standardization of the MAGIC Collaboration", "comment": null, "summary": "Gamma-ray astronomy is able to acquire large data volumes that astronomers use to draw scientific conclusions from. Ensuring the possibility of accessing and utilizing this data also after the lifetime of currently running experiments requires the use of a standardized data format. Following the data standardization format proposed by the gamma-ray astronomy community, we present 104 h of the first production of 166 h of data from the MAGIC Imaging Air Cherenkov Telescopes in standardized data format. Six datasets were processed from which three are presented, all of which have been analyzed and validated through comparison using the open-source software Gammapy and the MAGIC analysis software MARS.\n  Furthermore, looking towards a large-scale production of standardized data and a legacy of the data taken by the MAGIC experiment, we have developed and implemented the automated database-driven MAGIC data reduction tool autoMAGIC which offers a reliable and reproducible way to produce high-level datasets. By utilizing the automatization of parameter configuration choices, the software allows for a reduction of human error as well as an acceleration in the production of standardized data. Here, we also show comparable results for data processed with manual and automatic methods."}
{"id": "2511.22597", "categories": ["astro-ph.IM", "astro-ph.HE", "gr-qc"], "pdf": "https://arxiv.org/pdf/2511.22597", "abs": "https://arxiv.org/abs/2511.22597", "authors": ["Jeffrey S. Hazboun", "Joseph Simon", "Jeremy Baier", "Bjorn Larsen", "Daniel J. Oliver", "Paul T. Baker", "Bence Bécsy", "Siyuan Chen", "Alberto Diaz Hernandez", "Justin A. Ellis", "A. Miguel Holgado", "Kristina Islo", "Aaron Johnson", "Andrew R. Kaiser", "Nima Laal", "Alexander McEwen", "Nihan S. Pol", "Joey Shapiro Key", "Min Young Kim", "Matthew Samson", "Brent J. Shapiro-Albert", "Jerry P. Sun", "Stephen R. Taylor", "Caitlin A. Witt", "Jeremy Volpe", "Christine Ye", "Harsha Blumer", "Paul R. Brook", "Shami Chatterjee", "James M. Cordes", "Fronefield Crawford", "H. Thankful Cromartie", "Megan E. DeCesar", "Paul B. Demorest", "Timothy Dolch", "Robert D. Ferdman", "Elizabeth C. Ferrara", "William Fiore", "Emmanuel Fonseca", "Nathan Garver-Daniels", "Peter A. Gentile", "Deborah C. Good", "Ross J. Jennings", "Megan L. Jones", "David L. Kaplan", "Michael T. Lam", "T. Joseph W. Lazio", "Duncan R. Lorimer", "Jing Luo", "Ryan S. Lynch", "Dustin R. Madison", "Maura A. McLaughlin", "Chiara M. F. Mingarelli", "Cherry Ng", "David J. Nice", "Timothy T. Pennucci", "Scott M. Ransom", "Paul S. Ray", "Xavier Siemens", "Renée Spiewak", "Ingrid H. Stairs", "Daniel R. Stinebring", "Kevin Stovall", "Joseph K. Swiggum", "Jacob E. Turner", "Michele Vallisneri", "Sarah J. Vigeland"], "title": "The NANOGrav 12.5-year Data Set: Chromatic Noise Characterization & Mitigation with Time-Domain Kernels", "comment": "30 pages, 12 Figures, 6 Tables", "summary": "Pulsar timing arrays (PTAs) have recently entered the detection era, quickly moving beyond the goal of simply improving sensitivity at the lowest frequencies for the sake of observing the stochastic gravitational wave background (GWB), and focusing on its accurate spectral characterization. While all PTA collaborations around the world use Fourier-domain Gaussian processes to model the GWB and intrinsic long time-correlated (red) noise, techniques to model the time-correlated radio frequency-dependent (chromatic) processes have varied from collaboration to collaboration. Here we test a new class of models for PTA data, Gaussian processes based on time-domain kernels that model the statistics of the chromatic processes starting from the covariance matrix. As we will show, these models can be effectively equivalent to Fourier-domain models in mitigating chromatic noise. This work presents a method for Bayesian model selection across the various choices of kernel as well as deterministic chromatic models for non-stationary chromatic events and the solar wind. As PTAs turn towards high frequency (>1/yr) sensitivity, the size of the basis used to model these processes will need to increase, and these time-domain models present some computational efficiencies compared to Fourier-domain models."}
{"id": "2511.21933", "categories": ["astro-ph.HE", "astro-ph.CO", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2511.21933", "abs": "https://arxiv.org/abs/2511.21933", "authors": ["Irene Ferranti", "Mikel Falxa", "Federico Fantoccoli", "Alberto Sesana", "Golam Mohiuddin Shaifullah"], "title": "Data span and frequency coverage requirements for robust detection and inference in PTAs: A case study with EPTA DR2", "comment": null, "summary": "Pulsar Timing Arrays (PTAs) are approaching the sensitivity required for a $5σ$ detection of the nanohertz stochastic gravitational-wave background (GWB). This makes it crucial to deeply understand the behaviour of our analysis pipelines. A counterintuitive feature of the European Pulsar Timing Array (EPTA) second data release is that restricting the dataset to the last 10.3 years (DR2new) increases the inferred GWB significance from $\\leq2σ$ for the full 25-year dataset (DR2full) to $\\geq3.5σ$. We investigate whether this behaviour indicates an anomaly or is a possible outcome of the pipeline. Using realistic, DR2-like simulations with varying timespans, we find that the first 10 years contribute little to the GWB evidence due to their limited frequency coverage. This produces substantial overlap between the HD S/N distributions of DR2full and DR2new. Random noise fluctuations therefore yield a higher GWB evidence in DR2new than in DR2full in $15\\%$ of cases. Furthermore, $5\\%$ of simulations match the HD S/N of the real data, indicating that the observed behaviour is consistent with being a $\\sim2σ$ outcome due to noise fluctuations. Regardless of significance, DR2new simulations introduce biases in the GWB parameter estimation due to spectral leakage effects that are ignored in standard analyses and which flatten the inferred spectrum. Including leakage removes these biases, demonstrating the reliability of DR2new when the signal is properly modelled. Furthermore, we demonstrate that combining EPTA DR2full with long-baseline data from NANOGrav and PPTA, as well as low-frequency data from LOFAR and NenuFAR, significantly enhances GWB evidence and parameter accuracy. Finally, we examine the impact of the observation timespan and find that short-baseline datasets introduce strong amplitude biases and are ineffective at constraining the GWB."}
