{"id": "2512.02099", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.02099", "abs": "https://arxiv.org/abs/2512.02099", "authors": ["Pugazhendhi A D", "Subhadip Bouri", "Bei Zhou", "Rachana", "Ranjan Laha"], "title": "Possible $ν$ Source Class: 3-sigma Detection of High-Energy Neutrinos from Supermassive Black Hole Binary Candidates", "comment": "v1: 18 pages, 8 figures. Comments and suggestions welcome. Please see the short video in: https://youtu.be/IDqujoCPO-s", "summary": "Identifying the sources of high-energy (TeV-PeV) astrophysical neutrinos is crucial for studies in both astrophysics and particle physics. Despite extensive searches for more than a decade, which revealed several individual potential sources and only one potential source class, the origins of these neutrinos remain largely unresolved; thus, more source classes should be investigated. In this work, we conduct the first search for high-energy neutrino emission from a new source class, supermassive black hole binaries (SMBHBs), which are also theoretically motivated. We perform an unbinned maximum-likelihood-ratio analysis on our constructed catalog of 693 SMBHB candidates and 10 years of IceCube public data. Our results show positive correlations, with higher significance in more physically motivated scenarios and the highest significance at 3.0$σ$. In addition, we also study potential connections between SMBHBs' high-energy neutrino and nano-Hz gravitational-wave emissions, the latter being the main target of pulsar timing arrays. Our results provide the first evidence of SMBHBs being high-energy neutrino emitters."}
{"id": "2512.02113", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2512.02113", "abs": "https://arxiv.org/abs/2512.02113", "authors": ["Yuh Tsunetoe", "Dominic W. Pesce", "Ramesh Narayan"], "title": "Slow-Light Effect in the Jet-Launching Region of M87", "comment": "21 pages, 13 figures. Submitted to ApJ. Movies are available at https://youtu.be/VIzLOhfJFaI", "summary": "We explore the impact of \"slow-light\" radiative transfer - i.e., general relativistic radiative transfer (GRRT) calculations in which the simulated fluid evolves while light rays are propagating through it - in general relativistic magnetohydrodynamic (GRMHD) models of the M87 jet. Because the plasma in the jet-launching region is accelerated to relativistic velocities, and because the jet in M87 is nearly aligned with the line of sight (offset by ~17 degrees), a slow-light treatment is important for accurately modeling the observable structure. While fast-light images exhibit prominent helical or loop-shaped features in the jet - which we associate with narrow bundles of magnetic field lines - these features become stretched and smoothed-out in slow-light images. Our slow-light images instead exhibit a double-edged, cone-like morphology that is more consistent with observations of M87 than corresponding fast-light images. We find that the radius at which the plasma transitions from sub-relativistic to relativistic velocities is imprinted on slow-light images via a transition from loop-dominated at small distances from the black hole to edge-dominated at a larger distance, with the loop-edge transition occurring at larger distances for lower black hole spins. The jet image dynamics also vary with black hole spin, with low-spin models producing jets that exhibit substantial \"wobbling\", while high-spin models produce jets that are straighter and more stable in time. The spin-dependent jet morphology and variability are revealed by slow-light imaging because slow-light effects become more enhanced as the plasma velocity becomes more relativistic, and because the plasma acceleration is itself a strong function of the spin."}
{"id": "2512.02129", "categories": ["astro-ph.HE", "physics.plasm-ph"], "pdf": "https://arxiv.org/pdf/2512.02129", "abs": "https://arxiv.org/abs/2512.02129", "authors": ["P. S. Santhiya", "Pallavi Bhat", "Prayush Kumar", "Tushar Mondal", "Indu K. Dihingia"], "title": "Dynamo and Jet interconnections in GRMHD simulations of black hole accretion disks", "comment": "27 pages, 31 figures", "summary": "We present global 3D GRMHD simulations of black hole (BH) accretion disks designed to investigate how MRI-driven dynamo action regulates jet formation and evolution. Unlike standard SANE/MAD setups that impose a coherent large-scale poloidal loop, our \"sub-SANE\" initial conditions use multiple same-polarity small-scale magnetic loops. Rapid reconnection erases magnetic memory and enables large-scale dynamo to emerge early from MRI turbulence. We perform two such sub-SANE simulations at different BH spins ($a = 0.5, 0.9375$) and compare them with conventional SANE runs. The sub-SANE disks show regular large-scale dynamo cycles with periods of about ten orbits. Decomposition of the induction equation shows that the turbulent dynamo term is stronger in 3D compared to 2.5D and balances advection in the saturated state, confirming sustained large-scale field generation. These dynamo-generated fields are advected inward with minimal time lag, producing correlated peaks in both poloidal and toroidal field strengths from $r_{\\rm max}$ to the horizon. Early in the evolution, these peaks imprint directly onto the jet's electromagnetic energy flux, indicating that the jet mirrors the dynamo wave. Though jets form at early times, the sub-SANE runs eventually undergo jet shutdown. We show that this occurs when the magnetic field at the horizon loses coherence, as quantified by a decline in the signed-to-unsigned flux ratio $\\mathcal{C}_{\\rm BH}$ below $\\approx 0.6$. In contrast, the SANE reference case with similar accretion rate and horizon magnetic flux maintains high magnetic coherence because its initial large-scale field persists, allowing its jet to survive. Our results show that both dynamo-driven field evolution and horizon magnetic-field coherence critically regulate jet longevity, establishing a direct dynamo-jet connection in GRMHD disks."}
{"id": "2512.02136", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2512.02136", "abs": "https://arxiv.org/abs/2512.02136", "authors": ["Kristen C. Dage", "Phelipe Darc", "Thallis Pessi", "Rupesh Durgesh", "Shravya Shenoy", "Lilianne Nakazono", "Celine Boehm", "Ana L. Chies-Santos", "Rafael S. de Souza", "Zsofia V. Kovacs-Stermeczky", "Arash Bahramian", "Bahar Bidaran", "Emille E. O. Ishida", "Alberto Krone-Martins", "Aarya A. Patil", "Reinaldo R. Rosa", "Andressa Wille", "Richard M. Plotkin", "Behzad Tahmazebzadeh"], "title": "AT2022zod: An Unusual Tidal Disruption Event in an Elliptical Galaxy at Redshift 0.11", "comment": "17 pages, 8 figures, submitted", "summary": "Tidal Disruption Events (TDEs) have long been hypothesized as valuable indicators of black holes, offering insight into their demographics and behaviour out to high redshift. TDEs have also enabled the discovery of a few Massive Black Holes (MBHs) with inferred masses of $10^4$--$10^6\\,M_\\odot$, often associated with the nuclei of dwarf galaxies or ultra-compact dwarf galaxies (UCDs). Here we present AT2022zod, an extreme and short-lived optical flare in an elliptical galaxy at z=0.11, residing within 3kpc of the galaxy's centre. Its luminosity and ~30-day duration make it unlikely to have originated from the host galaxy's central supermassive black hole (SMBH), which estimate to have a mass around $10^8\\,M_\\odot$. Assuming that the emission mechanism is consistent with known observed TDEs, we find that such a rapidly evolving transient could either be produced by a MBH in the intermediate-mass range or, alternatively, result from the tidal disruption of a star on a non-parabolic orbit around the central SMBH. We suggest that the most plausible origin for AT2022zod is the tidal disruption of a star by a MBH embedded in a UCD. As the Vera C. Rubin Observatory's Legacy Survey of Space and Time comes online, we propose that AT2022zod serves as an important event for refining search strategies and characterization techniques for intermediate-mass black holes."}
{"id": "2512.02248", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2512.02248", "abs": "https://arxiv.org/abs/2512.02248", "authors": ["Jacob E. Turner"], "title": "Evaluating the Prospects of Cyclic Deconvolution across 312 Pulsars", "comment": "Submitted to ApJ", "summary": "We use the cyclic figure of merit to determine the likelihood of achieving cyclic deconvolution for 312 pulsars with sub-40 ms spin periods across 14 different telescope-observing frequency combinations. We find that the optimal frequency range for achieving cyclic deconvolution for most pulsars is between $\\sim$80$-$300 MHz, making low frequency observatories like uGMRT, LOFAR, and MWA the best-suited instruments for the technique. Moreover, we find that, as quantified by the total number sources with sufficient cyclic merits that are observed within the full deconvolution regime, uGMRT is likely the best current instrument for cyclic spectroscopy among the nine telescopes we considered, with LOFAR being the second best, and future telescopes like SKA-Low serving as the most likely eventual successors. The relatively high cyclic merit of the Crab Pulsar in the frequency ranges considered for GBT, MWA, LOFAR, and uGMRT suggests that some faster-spinning canonical pulsars may be able to achieve cyclic deconvolution, and we discuss potential follow-up analyses on other non-recycled pulsars. We conclude by advocating for near real-time cyclic spectroscopy backends to be considered for current and upcoming low frequency telescopes to increase the accessibility of this technique."}
{"id": "2512.02147", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.02147", "abs": "https://arxiv.org/abs/2512.02147", "authors": ["Wenkai Li", "Ning Jiang", "Tinggui Wang", "Rongfeng Shen", "Erlin Qiao", "Lixin Dai", "Di Luo", "Dongyue Li", "Chichuan Jin", "Jiazheng Zhu"], "title": "Inefficient Circularization, Delayed Stream-Disk Interaction and Reprocessing: A Five-Stage Model for the Intermediate-Mass Black Hole Tidal Disruption Event EP240222a", "comment": "to be submitted, comments are welcome", "summary": "EP240222a is the first intermediate-mass black hole (IMBH) tidal disruption event (TDE) captured in real-time with multi-wavelength observations and spectroscopic confirmation. However, its light curves deviate substantially from previous theoretical expectations. Motivated by these unique features, we have developed a novel model that successfully reproduces its peculiar evolution. Our model delineates five stages: (1) Initial Stage of inefficient circularization; (2) Slow-Rising Stage with a faint X-ray precursor disk fed by successive self-crossings; (3) Fast-Rising Stage, where delayed stream-disk interaction at momentum flux matching drives a sharp luminosity rise; (4) Plateau Stage with super-Eddington accretion, outflow, reprocessing, and a clear polar line-of-sight; and (5) Decline Stage of sub-Eddington accretion and ongoing reprocessing. Our fit indicates the disruption of a $M_* \\approx 0.4~M_\\odot$ main-sequence (MS) star with a penetration factor $β\\approx 1.0$. Our model, which incorporates key TDE processes, establishes EP240222a-like light curves as typical IMBH-TDE signatures. The distinctive identifier is a slow rise in X-rays and a corresponding slow rise/quasi-plateau in the UV/optical, followed by a brighter, super-Eddington plateau in both bands, though other forms exist, such as the rapid rise from white dwarf (WD) disruptions over minutes to days."}
{"id": "2512.02431", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2512.02431", "abs": "https://arxiv.org/abs/2512.02431", "authors": ["Slava G. Turyshev"], "title": "High-Precision Amplitude-Modulated Continuous-Wave Lunar Laser Ranging", "comment": "27 pages, 4 figure, 8 tables", "summary": "Lunar laser ranging (LLR) currently delivers mm-class tests of relativistic gravity and the lunar interior, but further gains are limited by photon-starved pulsed systems, array-induced pulse broadening, and atmospheric variability. Pushing into the sub-0.1mm regime is required to probe ultra-slow tidal dissipation, long-period librations, uHz-band gravitational waves. We develop a complete amplitude-modulated continuous-wave (AM-CW) framework for high-power LLR, including measurement models, estimators, a unified covariance description, and an observatory CONOPS. CW LLR is treated as RF phase metrology on a bright CW optical carrier: 2-way range and 1-way line-of-sight range-rate obtained from the phase and phase slope of a GHz-class modulation tone. The joint estimators are characterized by a covariance matrix decomposed into photon, atmospheric, instrumental, oscillator, nonlinearity contributions, mapped into subsystem requirements, including a closed-form range-rate bias from modulation-frequency slew across the ~2.56s round trip and synthetic-wavelength constraints on multi-tone nonlinearity. Using realistic photon budgets for a 1 kW, 1064 nm CW transmitter on a 1-m telescope ranging to 10cm corner-cube retroreflectors, we show that the photon-statistical floor for 2-way range at a GHz-class modulation frequency is at the level of a few-10 um in ~100s. With allocations to residual atmosphere and instrument, the resulting single-station 2-way precision is ~80 um, with range-rate sensitivities of ~0.1-1 um/s. Differential LLR between reflectors separated on the Moon by ~1000km can deliver 20-50 um and few (0.1-1) um/s differential range and range-rate. These precisions are realized across three representative regimes that span detected photon rates of (5-7) x 10^3-10^5 s^{-1} and are translated directly into hardware and CONOPS requirements for next-generation high-power AM-CW LLR."}
{"id": "2512.02167", "categories": ["astro-ph.HE", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2512.02167", "abs": "https://arxiv.org/abs/2512.02167", "authors": ["Qing Wang", "Ertao Li", "Zhihong Li", "Youbao Wang", "Bing Guo", "Yunju Li", "Jun Su", "Shipeng Hu", "Yinwen Guan", "Dong Xiang", "Yu Liu", "Lei Yang", "Weiping Liu"], "title": "Impact of Nuclear Reaction Rate Uncertainties on Type I X-ray Burst Nucleosynthesis: A Monte Carlo Study", "comment": "23 pages, 13 figures, 2 tables", "summary": "To investigate the impact of nuclear reaction rate uncertainties on type I X-ray burst nucleosynthesis, comprehensive Monte Carlo simulations are performed with temperature-independent and -dependent variations in reaction rates using the REACLIB and STARLIB libraries, respectively. A total of 1,711 $(p, γ)$, $(p, α)$, $(α, p)$, and $(α, γ)$ reactions are varied simultaneously, along with their inverse reactions, via detailed balance. For the first time, it is found that Monte Carlo sampling with larger perturbations to these reaction rates may lead to multi-peaked abundance distributions for some isotopes. These multi-peak structures arise not only from coupled reactions but also, in some cases, from single reactions. Our study also confirmed previously identified key reactions and provides more robust lists. These reactions deserve priority consideration in future study."}
{"id": "2512.02171", "categories": ["astro-ph.HE", "gr-qc"], "pdf": "https://arxiv.org/pdf/2512.02171", "abs": "https://arxiv.org/abs/2512.02171", "authors": ["Parth Bambhaniya", "Elisabete M. de Gouveia Dal Pino"], "title": "High-Energy Extractions from Horizonless Compact Objects", "comment": "Conference Proceddings: High Energy Phenomena in Relativistic Outflows IX (HEPRO-IX)", "summary": "High-energy astrophysical sources such as active galactic nuclei, quasars, X-ray binaries, and gamma-ray bursts are powered by mechanisms that convert gravitational or rotational energy into radiation, jets, and relativistic outflows. Understanding the physics of these processes remains a major challenge. Black holes have traditionally served as the central engines behind such phenomena, with well established energy extraction mechanisms including the Penrose process, the Blandford-Znajek process, and the Banados-Silk-West mechanism. However, studies in general relativity indicate that, under certain conditions, gravitational collapse may lead to the formation of naked singularities or other horizonless compact objects, which could in principle allow more efficient energy extraction than classical black holes. This brief review summarizes recent progress on energy extraction mechanisms in naked singularity spacetimes. We examine the roles of rotation, electromagnetic fields, and particle interactions in shaping extraction efficiency and dynamics. Particular attention is given to negative energy orbits and ergoregion physics, which enable Penrose type and magnetic Penrose mechanisms without an event horizon. We also discuss collisional Penrose processes and particle acceleration near the singularity, emphasizing their potential astrophysical implications. By comparing extraction efficiencies and physical conditions in black holes and naked singularities, we highlight how the absence of a horizon fundamentally alters the dynamics of energy release. These results suggest that naked singularities may serve as natural laboratories for strong field gravity and as alternative engines for high-energy astrophysical phenomena in the era of multi-messenger observations."}
{"id": "2512.02296", "categories": ["astro-ph.HE", "gr-qc"], "pdf": "https://arxiv.org/pdf/2512.02296", "abs": "https://arxiv.org/abs/2512.02296", "authors": ["Alexandre Toubiana", "Irina Dvorkin"], "title": "Observing binary neutron star subpopulations with the Einstein Telescope", "comment": "6 pages, 9 with appendices, 8 figures", "summary": "The formation channels of binary neutron stars (BNSs) remain uncertain. The detection of GW190425 by LIGO/Virgo/KAGRA (LVK) suggests a subpopulation of massive BNSs, possibly formed through unstable \"case BB\" mass transfer with short merger delays. We investigate whether next-generation detectors such as the Einstein Telescope (ET) can identify and characterise such subpopulations. Using the latest LVK constraints on the BNS merger rate, we generate mock ET catalogues containing a mixture of light and heavy subpopulations. The redshift distribution of each subpopulation is modeled as the convolution of the cosmic star formation rate with a time-delay distribution: heavy BNSs have fixed short delays, while light BNSs follow power-law delays with indices -0.5,-1,-1.5. Hierarchical Bayesian analyses are then performed on catalogues of 100-5,000 events. With hundreds of detections from ET, we will be able to establish that the total mass distribution is bimodal. A few thousand events are sufficient to disentangle the redshift distributions of the two subpopulations for moderate time-delay indices (-0.5 or -1). For steeper indices (-1.5), the differences are more subtle, requiring larger catalogues, beyond what we could explore given our computational resources. Next-generation detectors should enable the detection of multiple BNS subpopulations and their redshift evolution, providing valuable insight into their formation pathways."}
{"id": "2512.02357", "categories": ["astro-ph.HE", "astro-ph.CO"], "pdf": "https://arxiv.org/pdf/2512.02357", "abs": "https://arxiv.org/abs/2512.02357", "authors": ["Marios Kalomenopoulos", "Jiaming Zhuge"], "title": "Padé Approximants for Fast Radio Bursts Diffuse Dispersion Measure", "comment": "Submitted in JCAP. Comments welcome!", "summary": "Fast Radio Bursts (FRBs) have become an indispensable tool for studying the Universe's ionisation properties, as well as its cosmological parameters. This is achieved by analysing their diffuse dispersion measure (${\\rm DM}_{\\rm diff}$) as a function of redshift. However, this requires an integration along the line-of-sight, which is time-consuming. In this work, we derive an analytical approximation formula for ${\\rm DM}_{\\rm diff}$ for flat, $Λ$CDM and $w$CDM universes. We show that our approximation works well for the ranges $0.01 \\leq z \\leq 2$, $0.2 \\leq Ω_m \\leq 1.0$ and $-3.0 \\leq w \\leq -0.5$, with relative fractional error to a numerically evaluated ${\\rm DM}_{\\rm diff}$ always smaller than $3.5\\ \\%$, in the worst case scenario, and in most cases smaller than $0.5\\ \\%$. Moreover, the approximation is more than $15$ ($2$) times faster than the numerical solution of $Λ$CDM ($w$CDM). Therefore, we hope that it could be a useful tool for the FRB community."}
{"id": "2512.02360", "categories": ["astro-ph.HE", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2512.02360", "abs": "https://arxiv.org/abs/2512.02360", "authors": ["Qian-Qi Ma", "Jiachang Zhang", "Wei-Min Gu", "Zhiyuan Li", "Shan-Shan Weng", "Tong Bao"], "title": "The first extragalactic ultra-compact X-ray binary : a candidate black hole-white dwarf system", "comment": "18 pages, 8 figures, author's version, accepted for publication in The Innovation", "summary": "M31 UCXB-1 is one of the brightest X-ray point sources in the bulge of M31, with a peak X-ray luminosity $ L_{\\mathrm{0.5-10 \\: keV}} = 2.9^{+0.2}_{-0.2} \\times 10^{38} \\: \\mathrm{erg} \\: \\mathrm{s}^{-1} $. Both XMM-Newton and Chandra observations have detected an eclipsing signal with a period of about 465 seconds from this source, and we note that the periodic signal is detected exclusively during the source's high-luminosity states. This signal probably originates from its orbital motion, therefore it is an ultra-compact X-ray binary (UCXB) candidate with the highest X-ray luminosity. Our theoretical analyses show that M31 UCXB-1 is in good agreement with the luminosity-orbital period relation ($ L_{\\mathrm{2-10 \\: keV}}-P_{\\mathrm{orb}} $) of the black hole/neutron star--white dwarf (BH/NS--WD) UCXB system. Moreover, our spectral analyses indicate that the primary in M31 UCXB-1 is more likely to be a BH rather than an NS. The results show that M31 UCXB-1 is a BH--WD system, with the shortest orbital period, the possibly strongest gravitational wave emission, and the most massive white dwarf among the known UCXBs."}
{"id": "2512.02434", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.02434", "abs": "https://arxiv.org/abs/2512.02434", "authors": ["Man Ho Chan"], "title": "The exotic black hole-neutron star binaries in our Galaxy", "comment": "Accepted in The Astrophysical Journal", "summary": "It has been suggested that there are $\\sim 10^5$ black hole-neutron star (BH-NS) binaries in our Galaxy. However, despite the effort of intensive radio search for decades, none of these binaries has been found to date. These binaries are regarded as a holy grail of astronomy because they can greatly improve our understanding about relativistic systems of compact objects and fundamental physics. In this article, we propose the existence of exotic BH-NS binaries which can open a new way in searching the missing BH-NS binaries in our Galaxy. By considering the possible dark matter density spikes formed around the primordial black holes in the BH-NS binaries, we show that extremely high temperature ($\\sim 10^6$ K) could be maintained on the surface of the neutron stars due to effective dark matter capture. This interesting feature can also help reveal the nature of dark matter and possibly further improve the upper limit of dark matter scattering cross section well below $10^{-47}$ cm$^2$."}
{"id": "2512.02574", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.02574", "abs": "https://arxiv.org/abs/2512.02574", "authors": ["Anton Dmytriiev", "Frans van der Merwe", "Markus Böttcher"], "title": "Modeling Particle Acceleration and MWL Emission of a PeVatron Microquasar V4641 Sgr", "comment": "8 pages, 1 figure. High Energy Astrophysics in Southern Africa (HEASA 2025), 16-20 September 2025", "summary": "The Large High Altitude Air Shower Observatory (LHAASO) has recently reported five Galactic microquasars as Ultra-High-Energy (UHE) $γ$-ray emitters (> 100 TeV). Among these sources, the microquasar V4641 Sgr exhibits $γ$-ray emission up to $\\sim$0.8 PeV, requiring the acceleration of particles to multi-PeV energies, as well as the hardest UHE spectrum. The mechanisms behind particle acceleration to such energies are not well understood. Furthermore, the limited multi-wavelength (MWL) information on this source appears contradictory, further complicating interpretation and suggesting that V4641 Sgr may represent a particularly unusual case. In this work, we present a detailed physical model of V4641 Sgr that combines first-principles simulations of stochastic (turbulent) particle acceleration with MWL emission modeling. We adopt a leptonic scenario in which electrons are accelerated via the second-order Fermi process driven by relativistic strong turbulence ($δB/B \\sim 1$). The particle energization is simulated using a dedicated Monte Carlo framework STRIPE that incorporates the effects of intermittent energy gains and radiative losses. The resulting accelerated electrons produce UHE $γ$-rays through inverse Compton scattering on both the cosmic microwave background (CMB) and the interstellar radiation fields (ISRF). Our model is capable of reproducing key observational characteristics of the system, including particle acceleration to energies of tens of PeV, as well as the TeV-PeV $γ$-ray spectrum and the hard spectral index measured by LHAASO. Nonetheless, several aspects remain unresolved, highlighting the need for deeper observational coverage and further theoretical refinement."}
{"id": "2512.02588", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.02588", "abs": "https://arxiv.org/abs/2512.02588", "authors": ["Nurimangul Nurmamat", "Yong-Feng Huang", "Xiao-Fei Dong", "Chen-Ran Hu", "Orkash Amat", "Ze-Cheng Zou", "Abdusattar Kurban", "Jin-Jun Geng", "Chen Deng"], "title": "A Statistical Analysis of Fluence and Energy Distributions of Non-repeating Fast Radio Bursts Detected by CHIME", "comment": "12 page, 6 figures, 4 tables ;accepted in MNRAS", "summary": "Fast Radio Bursts (FRBs) are energetic radio bursts that typically last for milliseconds. They are mostly of extragalactic origin, but the progenitors, trigger mechanisms and radiation processes are still largely unknown. Here we present a comprehensive analysis on 415 non-repeating FRBs detected by CHIME, applying manual filtering to ensure sample completeness. It is found that the distribution of fluence can be approximated by a three-segment power-law function, with the power-law indices being $-3.76 \\pm 1.61$, $0.20 \\pm 0.68$ and $2.06 \\pm 0.90$ in the low, middle, and high fluence segments, respectively. Both the total dispersion measure (\\text{DM}) and the extragalactic \\text{DM} follow a smoothly broken power-law distribution, with characteristic break DM values of $\\sim 703$ pc $\\rm cm^{-3}$ and $\\sim 639$ pc $\\rm cm^{-3}$, respectively. The redshifts are estimated from the extragalactic \\text{DM} by using the Macquart relation, which are found to peak at $ z \\sim 0.6$. The isotropic energy release ($E_{\\text{iso}}$) is also derived for each burst. Two-Gaussian components are revealed in the distribution of $E_{\\text{iso}}$, with the major population narrowly clustered at $\\sim 2.3 \\times 10^{40} {\\rm erg}$. The minor population have a characteristic energy of $\\sim 1.6 \\times 10^{39}$ erg and span approximately one order of magnitude. The distribution hints a near-uniform energy release mechanism for the dominant population as expected from some catastrophic channels, whereas the lower-energy component (potentially including repeat-capable sources) may reflect a broader diversity in FRB origins, emission mechanisms and evolutionary stages."}
{"id": "2512.02642", "categories": ["astro-ph.HE", "astro-ph.CO", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2512.02642", "abs": "https://arxiv.org/abs/2512.02642", "authors": ["Sandeep Kumar Acharya"], "title": "The role of the galaxy stellar mass function in determining the cosmological distribution of astrophysical transients with applications to fast radio bursts and merging binary black holes", "comment": "Comments welcome", "summary": "The cosmological distribution and formation rate of compact astrophysical objects such as fast radio bursts (FRBs) are typically assumed to be proportional to a linear combination of cosmological star formation rate and stellar mass. In the literature, a template for star formation rate, which is just a function of redshift, is typically used. In this work, we point out the importance of galaxy stellar mass function which captures the host galaxy information of observed FRBs as well as the redshift evolution of galaxy stellar mass. Using this information, we find that FRB formation efficiency per stellar mass has to be more efficient (by a factor of $\\approx 3$) than previously calculated, in order to reproduce the observed volumetric rate of FRBs at $z=0$. We show that cosmological population studies of FRBs have to include host galaxy information along with its redshift evolution in order to obtain unbiased results. This consideration is also applicable to other transients, e.g. gamma-ray bursts and merging binary black hole events. We show that our approach may open up the possibility to infer the host galaxy stellar mass of merging binary black holes with a detection of few thousand gravitational wave events."}
{"id": "2512.02656", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.02656", "abs": "https://arxiv.org/abs/2512.02656", "authors": ["Francesco Carenini", "Giulia Illuminati"], "title": "KM3NeT/ARCA stacking search for high-energy neutrinos from blazars", "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC2025)", "summary": "Blazars are promising targets for neutrino astronomy, as highlighted by IceCube's identification of TXS 0506+056 as a cosmic neutrino source candidate. High-frequency-peaked BL Lacs (HBLs) stand out due to their characteristic electromagnetic high-energy emission properties, which makes them as well promising candidates for the production of high-energy neutrinos. Such neutrinos could be detected by KM3NeT/ARCA, a next-generation deep-sea Cherenkov detector under construction in the Mediterranean Sea. This contribution presents the results of a binned likelihood stacking analysis investigating high-energy neutrino emissions from a subset of HBLs. A total of 232 sources have been selected from the 3HSP catalogue and targeted in the analysis of KM3NeT/ARCA data taken with several detector configurations, specifically in the period in which from 6 to 21 detection units were deployed. The analysis is based on neutrino emission models of blazars developed using the LeHa-Paris numerical code, which simulates the spectral energy distribution of jetted active galactic nuclei."}
{"id": "2512.02693", "categories": ["astro-ph.HE", "astro-ph.CO"], "pdf": "https://arxiv.org/pdf/2512.02693", "abs": "https://arxiv.org/abs/2512.02693", "authors": ["Thulo Letsele", "Lebogang Mfulwane", "Christo Venter", "James O. Chibueze", "Mechiel Christiaan Bezuidenhout"], "title": "Search for persistent radio emission towards selected localised Fast Radio Burst positions using the MeerKAT Telescope", "comment": "7 pages, 3 figures, accepted for publication in the Proc. 69th annual SAIP2025 conference", "summary": "Fast Radio Bursts (FRBs) are millisecond-duration radio pulses originating from cosmological distances, as indicated by their large dispersion measures. While numerous FRBs have now been localised to their host galaxies, a distinct class of compact electromagnetic counterpart, a Persistent Radio Source (PRS), has also been identified in some cases. Currently, only three, and possible a fourth repeating FRBs (FRB20121102A, FRB20190417A, FRB20190520B, and FRB20240114A) have confirmed associations with a PRS. Insight into progenitors, local environments, and the evolution of FRBs can be clarified by characterising these PRSs. In this work, we present 2 detected candidate PRSs using MeerKAT radio telescope data and one non-detection (as part of a larger study involving 25 FRB positions). Both FRB20221106 and FRB20181112 were found to have a host galaxy, and whether the detected radio continuum emission comes from the host galaxy or PRS is still an open question. High-resolution observations from a telescope such as e-MERLIN are required to resolve this question. If a compact PRS is detected, this telescope will provide the size, and investigate the flux variability and spectral shape of this compact PRS. Lastly, in the case of FRB220190102, which was observed over two epochs, no radio continuum was detected. However, a flux upper limit is provided for both epochs."}
{"id": "2512.02839", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.02839", "abs": "https://arxiv.org/abs/2512.02839", "authors": ["Megha", "Pankaj Kushwaha"], "title": "VHE FSRQs with Fermi-LAT: VHE and even brighter states in high-z FSRQs due to an HBL-like component?", "comment": "Submitted", "summary": "Very high-energy (VHE) detected flat-spectrum radio quasars (FSRQs) are relatively few despite being the most persistent bright MeV-GeV sources. Focusing on VHE emission, we investigated the spectral and temporal properties of VHE-detected FSRQs using 14-year Fermi-LAT data. All are highly variable (flux-amplitude$>$100) with VHE detection associated with brighter flux states and relatively harder spectra. Above a flux limit, flux anti-correlates with spectral index, exhibiting a bluer-when-brighter trend. The low-flux state spectral energy distributions (SEDs) for all resembles a power-law, while high-flux and VHE-associated states resemble a log-parabola, accompanied by an almost nil (PKS0736+017, PKS1510-089) to marginal (4C+21.35, 3C279) to significant (B21420+32, TON0599, PKS1441+25, S30218+35, PKS0346-27, OP313) MeV-GeV peak-upshift -- more prominent in high-redshift sources. For no/marginal peak-upshift, the VHE emission is consistent with external Comptonization of infrared photons (EC-IR) driven primarily by a power-law continuation of the particle spectrum to higher energies. For those with a significant MeV-GeV peak-upshift, PKS0346-27 and OP313 shows peak-upshift in the synchrotron spectrum, and thus VHE is EC-IR origin, while for others without synchrotron-peak upshift, we attribute the VHE to an HBL-like component with a Compton-Dominance (CD) like FSRQs, with VHE driven primarily by particle spectrum continuation. In some, even high-state SEDs seem to require an HBL-like component. Thus, VHE activities in FSRQs mainly result from particle spectrum continuation, aided by spectral transition or a new HBL-like component with FSRQ-like CD. Such spectral changes naturally brighten the GeV-VHE flux, overcoming extragalactic background light absorption without requiring extraordinary brightening under the traditional EC-IR scenario than normally exhibited."}
{"id": "2512.02880", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.02880", "abs": "https://arxiv.org/abs/2512.02880", "authors": ["R. Grau", "A. Moralejo"], "title": "Insights into Extragalactic Background Light constraints with MAGIC archival data", "comment": "5 pages, 5 figures. Submitted to Memorie della Società Astronomica Italiana (MemSAIt). Presented at the 8th Heidelberg International Symposium on High-Energy Gamma-Ray Astronomy (Gamma-2024), 2024", "summary": "The Extragalactic Background Light (EBL) is the accumulated light emitted throughout the history of the universe, spanning the UV, optical, and IR spectral ranges. Stars and dust in galaxies are expected to be the main source of the EBL. However, recent direct measurements performed beyond Pluto's orbit (less affected by foregrounds than those performed from the Earth) hint at an EBL level in the optical band larger than the one expected from the integrated contribution of known galaxy populations. One approach that could solve this controversy uses Very High Energy (VHE) photons coming from sources at cosmological distances. These photons can interact with the EBL producing electron-positron pairs, a process that leaves an imprint on the observed VHE spectrum. This technique, however, requires assumptions on the intrinsic spectrum of the source, which can compromise the robustness of EBL constraints. In this contribution, we used Monte Carlo simulations and archival data of the MAGIC telescopes to study the impact that the assumptions adopted in the literature have on the estimate of the EBL density, and how using more generic ones would modify the results. Our results show how the EBL density constraints obtained highly depend on the intrinsic spectral shape assumed for the source. We have studied two different methods to reduce the assumptions on the intrinsic spectral shape to get more robust results. This will be especially important for upcoming with new VHE facilities, where systematic uncertainties are expected to play a more significant role compared to statistical ones."}
