{"id": "2510.25842", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.25842", "abs": "https://arxiv.org/abs/2510.25842", "authors": ["Jonatan Jacquemin-Ide", "Mitchell C. Begelman", "Beverly Lowell", "Matthew Liska", "Jason Dexter", "Alexander Tchekhovskoy"], "title": "Demystifying flux eruptions: Magnetic flux transport in magnetically arrested disks", "comment": "We welcome comments, submitted to ApJ", "summary": "Magnetically arrested disks (MADs) are a compelling model for explaining\nvariability in low-luminosity active galactic nuclei (AGN), including\nhorizon-scale outbursts like those observed in Sagittarius A*. MADs experience\npowerful flux eruptions-episodic ejections of magnetic flux from the black hole\nhorizon-that may drive the observed luminosity variations. In this work, we\ndevelop and validate a new formalism describing large-scale magnetic field\ntransport in general relativistic magnetohydrodynamic simulations of MADs with\ngeometrical thicknesses of $h/R=0.1$ and $h/R=0.3$. We introduce a net flux\ntransport velocity, $v_\\Phi$, which accounts for both advective and diffusive\nprocesses. We show that MADs maintain a statistical quasi-steady state where\nadvection and diffusion nearly balance. Flux eruptions appear as small\ndeviations from this equilibrium, with $v_\\Phi/V_k\\ll1$, where $V_k$ is the\nlocal Keplerian velocity. Using this framework, we analytically derive a\nrecurrence timescale for flux eruptions, $t_{\\rm rec}\\sim1500\\, r_g/c$. This\ntimescale closely matches simulation results. The smallness of $v_\\Phi$\nexplains the long recurrence times of flux eruptions compared to other system\ntimescales. We also take a closer look at the diffusion of the magnetic field\nby performing the first measurement of turbulent resistivity in MADs. We then\nestimate the turbulent magnetic Prandtl number, defined as the ratio of\nturbulent viscosity to turbulent resistivity. We find $\\mathcal{P}_m\\sim3$,\nconsistent with shearing-box simulations of magneto rotational\ninstability-driven turbulence. While flux eruptions excite large-scale\nnon-axisymmetric modes and locally enhance turbulent resistivity, magnetic\nfield diffusion is dominated by smaller-scale turbulent motions. These results\nprovide new insight into the nature of AGN variability and the fundamental\nphysics of magnetic field transport."}
{"id": "2510.25873", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.25873", "abs": "https://arxiv.org/abs/2510.25873", "authors": ["Patrick Slane", "Ákos Bogdán", "David Pooley"], "title": "25 Years of Groundbreaking Discoveries with Chandra", "comment": "30 pages, 6 figures", "summary": "The Chandra X-ray Observatory is a mainstay of modern observational\nastrophysics. With the highest angular resolution of any X-ray facility, its\nimaging and spectral capabilities in the 0.5-10 keV band have led to both\nunique and complementary breakthroughs in nearly all areas of the field. Now\nmore than a quarter century into its mission, Chandra continues to provide\nunique information on the contributions of compact objects to the evolution of\ngalaxies, the nature of supernova explosions, the impact of energetic jets from\nsupermassive black holes on their host environments, and the fate of exoplanet\natmospheres in systems rich with stellar flares. Here we provide a summary of\nChandra results - one that is embarrassingly incomplete, but representative of\nboth the exquisite past and promising future for Chandra's contributions to\nhigh energy astrophysics and all of mainstream astronomy."}
{"id": "2510.26042", "categories": ["astro-ph.HE", "gr-qc"], "pdf": "https://arxiv.org/pdf/2510.26042", "abs": "https://arxiv.org/abs/2510.26042", "authors": ["Victor Guedes", "Siddarth Ajith", "Shu Yan Lau", "Kent Yagi"], "title": "Gravitational-Wave Constraints on Neutron-Star Pressure Anisotropy via Universal Relations", "comment": null, "summary": "Neutron stars may exhibit pressure anisotropy arising from various physical\nmechanisms, such as elasticity, magnetic fields, viscosity, and superfluidity.\nWe compute the tidal deformability and the $f$-mode oscillation frequency of\nanisotropic neutron stars using a phenomenological quasi-local model\ncharacterized by a single dimensionless anisotropy parameter. We find that\nwhile the relation between the tidal deformability and the $f$-mode frequency\ndepends on the degree of anisotropy, it remains largely insensitive to\nvariations in the equation of state (the relation between radial pressure and\nenergy density) for a fixed anisotropy parameter, similar to the isotropic\ncase. Leveraging this anisotropy-dependent universal relation within a\nstatistical framework, we place constraints on the anisotropy parameter using\nboth the gravitational wave observation of GW170817 and simulated data for a\nGW170817-like event observed by a future network of detectors. We find that the\nanisotropy parameter can be constrained to order unity with current data, and\nthe bounds remain comparable with future detector sensitivities. Importantly,\nthese constraints are only weakly affected by uncertainties in the neutron-star\nequation of state."}
{"id": "2510.26111", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2510.26111", "abs": "https://arxiv.org/abs/2510.26111", "authors": ["Cheng-Liang Jiao", "Liying Zhu", "Er-gang Zhao", "Jia Zhang"], "title": "Accretion rates of stellar-mass compact objects embedded in AGN discs", "comment": "14 pages, 5 figures, accepted for publication in MNRAS", "summary": "Stellar-mass compact objects (COs) embedded in active galactic nucleus (AGN)\ndiscs are commonly assumed to accrete via Bondi or Bondi-Hoyle-Lyttleton (BHL)\nprescriptions, neglecting gas angular momentum. We show that differential\nrotation in AGN discs can impart non-negligible angular momentum, in which case\naccretion proceeds through a viscous disc rather than Bondi/BHL flow. Our model\nprovides a new framework estimating the CO accretion rate as\n$\\dot{M}_\\mathrm{CO} = \\min\\{\\dot{M}_\\mathrm{vis}, \\dot{M}_\\mathrm{BHL}\\}$,\nwhere the viscous rate $\\dot{M}_\\mathrm{vis}$ accounts for gas--CO relative\nmotion decomposed into a local gradient term (due to differential rotation) and\nbulk motion (from differing orbital parameters). This rate can be expressed as\n$\\dot{M}_\\mathrm{vis} = \\alpha \\xi\n(r_\\mathrm{H}/r_\\mathrm{BHL})^3\\dot{M}_\\mathrm{BHL}$, where $\\xi$ is a\ncoefficient of order unity. It can also be approximately scaled to the global\nAGN accretion rate as $\\dot{M}_\\mathrm{vis} \\propto \\dot{M}_1$, with the\nscaling coefficients in both forms determined by the specific dynamical\nconfiguration. The accretion is viscosity-limited when $q > [\\alpha\n\\xi(1+\\mathcal{M}^2)^{3}/3]^{1/2} h^3$, where $q$ is the mass ratio between the\nCO and the supermassive black hole, $\\alpha$ the viscosity parameter,\n$\\mathcal{M}$ the Mach number of the bulk relative motion, and $h$ the aspect\nratio of the AGN disc. In thin AGN discs this condition is satisfied for most\nstellar-mass or more massive COs. Our framework also naturally allows for the\ninclusion of established outflow corrections, thereby enabling a more realistic\ntreatment of super-Eddington flows. Our formulation thus improves upon\nBondi/BHL prescriptions and offers a more physically motivated basis for\nstudying CO evolution in AGN environments."}
{"id": "2510.25774", "categories": ["astro-ph.IM", "cs.LG"], "pdf": "https://arxiv.org/pdf/2510.25774", "abs": "https://arxiv.org/abs/2510.25774", "authors": ["Manideep Pendyala"], "title": "Pulsar Detection with Deep Learning", "comment": "56 pages, My master's thesis", "summary": "Pulsar surveys generate millions of candidates per run, overwhelming manual\ninspection. This thesis builds a deep learning pipeline for radio pulsar\ncandidate selection that fuses array-derived features with image diagnostics.\nFrom approximately 500 GB of Giant Metrewave Radio Telescope (GMRT) data, raw\nvoltages are converted to filterbanks (SIGPROC), then de-dispersed and folded\nacross trial dispersion measures (PRESTO) to produce approximately 32,000\ncandidates. Each candidate yields four diagnostics--summed profile, time vs.\nphase, subbands vs. phase, and DM curve--represented as arrays and images. A\nbaseline stacked model (ANNs for arrays + CNNs for images with\nlogistic-regression fusion) reaches 68% accuracy. We then refine the CNN\narchitecture and training (regularization, learning-rate scheduling, max-norm\nconstraints) and mitigate class imbalance via targeted augmentation, including\na GAN-based generator for the minority class. The enhanced CNN attains 87%\naccuracy; the final GAN+CNN system achieves 94% accuracy with balanced\nprecision and recall on a held-out test set, while remaining lightweight enough\nfor near--real-time triage. The results show that combining array and image\nchannels improves separability over image-only approaches, and that modest\ngenerative augmentation substantially boosts minority (pulsar) recall. The\nmethods are survey-agnostic and extensible to forthcoming high-throughput\nfacilities."}
{"id": "2510.26112", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.26112", "abs": "https://arxiv.org/abs/2510.26112", "authors": ["Zhen Cao", "F. Aharonian", "Y. X. Bai", "Y. W. Bao", "D. Bastieri", "X. J. Bi", "Y. J. Bi", "W. Bian", "A. V. Bukevich", "C. M. Cai", "W. Y. Cao", "Zhe Cao", "J. Chang", "J. F. Chang", "A. M. Chen", "E. S. Chen", "G. H. Chen", "H. X. Chen", "Liang Chen", "Long Chen", "M. J. Chen", "M. L. Chen", "Q. H. Chen", "S. Chen", "S. H. Chen", "S. Z. Chen", "T. L. Chen", "X. B. Chen", "X. J. Chen", "Y. Chen", "N. Cheng", "Y. D. Cheng", "M. C. Chu", "M. Y. Cui", "S. W. Cui", "X. H. Cui", "Y. D. Cui", "B. Z. Dai", "H. L. Dai", "Z. G. Dai", "Danzengluobu", "Y. X. Diao", "X. Q. Dong", "K. K. Duan", "J. H. Fan", "Y. Z. Fan", "J. Fang", "J. H. Fang", "K. Fang", "C. F. Feng", "H. Feng", "L. Feng", "S. H. Feng", "X. T. Feng", "Y. Feng", "Y. L. Feng", "S. Gabici", "B. Gao", "C. D. Gao", "Q. Gao", "W. Gao", "W. K. Gao", "M. M. Ge", "T. T. Ge", "L. S. Geng", "G. Giacinti", "G. H. Gong", "Q. B. Gou", "M. H. Gu", "F. L. Guo", "J. Guo", "X. L. Guo", "Y. Q. Guo", "Y. Y. Guo", "Y. A. Han", "O. A. Hannuksela", "M. Hasan", "H. H. He", "H. N. He", "J. Y. He", "X. Y. He", "Y. He", "S. Hernández-Cadena", "B. W. Hou", "C. Hou", "X. Hou", "H. B. Hu", "S. C. Hu", "C. Huang", "D. H. Huang", "J. J. Huang", "T. Q. Huang", "W. J. Huang", "X. T. Huang", "X. Y. Huang", "Y. Huang", "Y. Y. Huang", "X. L. Ji", "H. Y. Jia", "K. Jia", "H. B. Jiang", "K. Jiang", "X. W. Jiang", "Z. J. Jiang", "M. Jin", "S. Kaci", "M. M. Kang", "I. Karpikov", "D. Khangulyan", "D. Kuleshov", "K. Kurinov", "B. B. Li", "Cheng Li", "Cong Li", "D. Li", "F. Li", "H. B. Li", "H. C. Li", "Jian Li", "Jie Li", "K. Li", "L. Li", "R. L. Li", "S. D. Li", "T. Y. Li", "W. L. Li", "X. R. Li", "Xin Li", "Y. Li", "Y. Z. Li", "Zhe Li", "Zhuo Li", "E. W. Liang", "Y. F. Liang", "S. J. Lin", "B. Liu", "C. Liu", "D. Liu", "D. B. Liu", "H. Liu", "H. D. Liu", "J. Liu", "J. L. Liu", "J. R. Liu", "M. Y. Liu", "R. Y. Liu", "S. M. Liu", "W. Liu", "X. Liu", "Y. Liu", "Y. Liu", "Y. N. Liu", "Y. Q. Lou", "Q. Luo", "Y. Luo", "H. K. Lv", "B. Q. Ma", "L. L. Ma", "X. H. Ma", "J. R. Mao", "Z. Min", "W. Mitthumsiri", "G. B. Mou", "H. J. Mu", "A. Neronov", "K. C. Y. Ng", "M. Y. Ni", "L. Nie", "L. J. Ou", "P. Pattarakijwanich", "Z. Y. Pei", "J. C. Qi", "M. Y. Qi", "J. J. Qin", "A. Raza", "C. Y. Ren", "D. Ruffolo", "A. Sáiz", "D. Semikoz", "L. Shao", "O. Shchegolev", "Y. Z. Shen", "X. D. Sheng", "Z. D. Shi", "F. W. Shu", "H. C. Song", "Yu. V. Stenkin", "V. Stepanov", "Y. Su", "D. X. Sun", "H. Sun", "Q. N. Sun", "X. N. Sun", "Z. B. Sun", "N. H. Tabasam", "J. Takata", "P. H. T. Tam", "H. B. Tan", "Q. W. Tang", "R. Tang", "Z. B. Tang", "W. W. Tian", "C. N. Tong", "L. H. Wan", "C. Wang", "G. W. Wang", "H. G. Wang", "J. C. Wang", "K. Wang", "Kai Wang", "Kai Wang", "L. P. Wang", "L. Y. Wang", "L. Y. Wang", "R. Wang", "W. Wang", "X. G. Wang", "X. J. Wang", "X. Y. Wang", "Y. Wang", "Y. D. Wang", "Z. H. Wang", "Z. X. Wang", "Zheng Wang", "D. M. Wei", "J. J. Wei", "Y. J. Wei", "T. Wen", "S. S. Weng", "C. Y. Wu", "H. R. Wu", "Q. W. Wu", "S. Wu", "X. F. Wu", "Y. S. Wu", "S. Q. Xi", "J. Xia", "J. J. Xia", "G. M. Xiang", "D. X. Xiao", "G. Xiao", "Y. L. Xin", "Y. Xing", "D. R. Xiong", "Z. Xiong", "D. L. Xu", "R. F. Xu", "R. X. Xu", "W. L. Xu", "L. Xue", "D. H. Yan", "T. Yan", "C. W. Yang", "C. Y. Yang", "F. F. Yang", "L. L. Yang", "M. J. Yang", "R. Z. Yang", "W. X. Yang", "Z. H. Yang", "Z. G. Yao", "X. A. Ye", "L. Q. Yin", "N. Yin", "X. H. You", "Z. Y. You", "Q. Yuan", "H. Yue", "H. D. Zeng", "T. X. Zeng", "W. Zeng", "X. T. Zeng", "M. Zha", "B. B. Zhang", "B. T. Zhang", "C. Zhang", "F. Zhang", "H. Zhang", "H. M. Zhang", "H. Y. Zhang", "J. L. Zhang", "Li Zhang", "P. F. Zhang", "P. P. Zhang", "R. Zhang", "S. R. Zhang", "S. S. Zhang", "W. Y. Zhang", "X. Zhang", "X. P. Zhang", "Yi Zhang", "Yong Zhang", "Z. P. Zhang", "J. Zhao", "L. Zhao", "L. Z. Zhao", "S. P. Zhao", "X. H. Zhao", "Z. H. Zhao", "F. Zheng", "W. J. Zhong", "B. Zhou", "H. Zhou", "J. N. Zhou", "M. Zhou", "P. Zhou", "R. Zhou", "X. X. Zhou", "X. X. Zhou", "B. Y. Zhu", "C. G. Zhu", "F. R. Zhu", "H. Zhu", "K. J. Zhu", "Y. C. Zou", "X. Zuo"], "title": "Evidence of cosmic-ray acceleration up to sub-PeV energies in the supernova remnant IC 443", "comment": null, "summary": "Supernova remnants (SNRs) have been considered as the primary contributors to\ncosmic rays (CRs) in our Galaxy. However, the maximum energy of particles that\ncan be accelerated by shocks of SNRs is uncertain observationally and\ntheoretically, and the role of contribution to CRs around PeV energies by SNRs\nis unclear. In this study, we present observations of high-energy $\\gamma$-ray\nemission from the SNR IC 443 using the Large High Altitude Air Shower\nObservatory (LHAASO). The morphological analysis reveals a pointlike source\nwhose location and spectrum are consistent with those of the Fermi-LAT-detected\ncompact source with $\\pi^0$-decay signature, and a more extended source which\nis consistent with a newly discovered source, previously unrecognized by\nFermi-LAT. The spectrum of the point source can be described by a power-law\nfunction with an index of $\\sim3.0$, extending beyond $\\sim 30$ TeV without\napparent cutoff. Assuming a hadronic origin of the $\\gamma$-ray emission, the\n$95\\%$ lower limit of accelerated protons reaches about 300 TeV. The extended\nsource might be coincident with IC 443, SNR G189.6+3.3 or the putative pulsar\nwind nebula CXOU J061705.3+222127, and can be explained by either a hadronic or\nleptonic model. The LHAASO results provide compelling evidence that CR protons\nup to sub-PeV energies can be accelerated by the SNR."}
{"id": "2510.25824", "categories": ["astro-ph.IM", "stat.ML"], "pdf": "https://arxiv.org/pdf/2510.25824", "abs": "https://arxiv.org/abs/2510.25824", "authors": ["Peter Behroozi"], "title": "The Ray Tracing Sampler: Bayesian Sampling of Neural Networks for Everyone", "comment": "28 pages, submitted to OJAp; comments welcome", "summary": "We derive a Markov Chain Monte Carlo sampler based on following ray paths in\na medium where the refractive index $n(x)$ is a function of the desired\nlikelihood $\\mathcal{L}(x)$. The sampling method propagates rays at constant\nspeed through parameter space, leading to orders of magnitude higher resilience\nto heating for stochastic gradients as compared to Hamiltonian Monte Carlo\n(HMC), as well as the ability to cross any likelihood barrier, including holes\nin parameter space. Using the ray tracing method, we sample the posterior\ndistributions of neural network outputs for a variety of different\narchitectures, up to the 1.5 billion-parameter GPT-2 (Generative Pre-trained\nTransformer 2) architecture, all on a single consumer-level GPU. We also show\nthat prior samplers including traditional HMC, microcanonical HMC, Metropolis,\nGibbs, and even Monte Carlo integration are special cases within a generalized\nray tracing framework, which can sample according to an arbitrary weighting\nfunction. Public code and documentation for C, JAX, and PyTorch are available\nat https://bitbucket.org/pbehroozi/ray-tracing-sampler/src"}
{"id": "2510.26152", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.26152", "abs": "https://arxiv.org/abs/2510.26152", "authors": ["Xiaoyu Zhang", "Lile Wang", "Yang Gao", "Yao Zhou"], "title": "Direct Numerical Simulations of Oxygen-Flame-Driven Deflagration-to-Detonation Transition in Type Ia Supernovae", "comment": null, "summary": "We present direct numerical simulations demonstrating\ndeflagration-to-detonation transition (DDT) driven by oxygen flames in Type Ia\nsupernova progenitors. Using the Castro hydrodynamics code coupled with the\n``aprox13'' 13-isotope nuclear network, we simulate combustion in isolated fuel\nregions where oxygen flames trail carbon flames. In a fiducial one-dimensional\nrun at $\\rho_{0}=3.5\\times10^{7}\\ \\mathrm{g\\ cm^{-3}}$ we observe spontaneous\nDDT of the oxygen flame via the Zel'dovich gradient mechanism when the\ncarbon-oxygen separation reaches $\\sim 10\\ \\mathrm{km}$. The oxygen detonation\nthen captures the carbon flame and triggers a stable carbon detonation.\nSystematic one-dimensional parameter scans show that successful carbon DDT\nrequires upstream densities in the range $(3.1$--$3.6)\\times10^{7}\\ \\mathrm{g\\\ncm^{-3}}$ and a minimum carbon-flame thickness of $\\gtrsim 20\\ \\mathrm{m}$.\nTwo-dimensional simulations confirm DDT and demonstrate that the\nmultidimensional cellular structure of the oxygen detonation can promote carbon\ndetonation at somewhat lower densities than in one dimension. These results\nprovide direct numerical evidence that oxygen-flame-driven DDT is physically\nplausible in turbulent white-dwarf environments and underscore the importance\nof multidimensional effects for Type Ia supernova explosion modeling."}
{"id": "2510.25847", "categories": ["astro-ph.IM", "astro-ph.CO", "astro-ph.GA", "physics.plasm-ph"], "pdf": "https://arxiv.org/pdf/2510.25847", "abs": "https://arxiv.org/abs/2510.25847", "authors": ["Tirso Marin-Gilabert", "Ulrich P. Steinwandel", "Milena Valentini", "John A. ZuHone", "Klaus Dolag"], "title": "Cosmological Simulations of Weakly Collisional Plasmas with Braginskii Viscosity in Galaxy Clusters", "comment": "19 pages, 17 figures, submitted to MNRAS", "summary": "We present the implementation of an anisotropic viscosity solver within the\nmagnetohydrodynamics (MHD) framework of the TreeSPH code OpenGadget3. The\nsolver models anisotropic viscous transport along magnetic field lines\nfollowing the Braginskii formulation and includes physically motivated limiters\nbased on the mirror and firehose instability thresholds, which constrain the\nviscous stress in weakly collisional plasmas. To validate the implementation,\nwe performed a suite of standard test problems -- including two variants of the\nsound-wave test, circularly and linearly polarized Alfven waves, fast\nmagnetosonic wave, and the Kelvin-Helmholtz instability -- both with and\nwithout the plasma-instability limiters. The results show excellent agreement\nwith the AREPO implementation of a similar anisotropic viscosity model (Berlok\net al. 2019), confirming the accuracy and robustness of our method. Our\nformulation integrates seamlessly within the individual adaptive timestepping\nframework of OpenGadget3, avoiding the need for subcycling. This provides\nefficient and stable time integration while maintaining physical consistency.\nFinally, we applied the new solver to a cosmological zoom-in simulation of a\ngalaxy cluster, demonstrating its capability to model anisotropic transport and\nplasma microphysics in realistic large-scale environments. Our implementation\noffers a versatile and computationally efficient tool for studying anisotropic\nviscosity in magnetized astrophysical systems."}
{"id": "2510.26209", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.26209", "abs": "https://arxiv.org/abs/2510.26209", "authors": ["Habtamu Menberu Tedila", "Di Li", "Pei Wang", "Rai Yuen", "Ziwei Wu", "Shijun Dang", "Jianping Yuan", "Na Wang", "Marilyn Cruces", "Jun Shuo Zhang", "Juntao Bai", "De Zhao", "FAST Collaboration"], "title": "Multi-Faceted Emission Properties of PSR J2129+4119 Observed with FAST", "comment": "22 pages, 18 figures, Revised for ApJ", "summary": "We present a detailed single-pulse study of the long-period pulsar PSR\nJ2129+4119 using high-sensitivity FAST observations. Despite locating well\nbelow the traditional death line, the pulsar exhibits sustained and multi-modal\nemission behavior, including nulls, weak pulses, regular emission, and\noccasional bright pulses. The nulling fraction is measured to be $8.13\\% \\pm\n0.51\\%$, with null durations typically under four pulse periods. Fluctuation\nspectral analysis reveals both phase-modulated subpulse drifting and\nintermittent beat-like modulation. At the same time, polarization profiles show\nhigh linear polarization and stable polarization position angle (PPA) swings\nconsistent with a near-tangential sightline geometry. Quasi-periodic\nmicrostructures are detected in 11.54\\% of regular pulses, with a mean\nperiodicity and width of 4.57 ms and 4.30 ms, respectively. A well-defined\nscintillation arc in the secondary spectrum confirms the presence of a\nlocalized scattering screen. These results indicate that PSR J2129+4119 remains\nmagnetospherically active and coherently emitting despite its low energy loss\nrate, offering key insights into pulsar emission physics near the death line."}
{"id": "2510.25953", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2510.25953", "abs": "https://arxiv.org/abs/2510.25953", "authors": ["Prathamesh Tamhane"], "title": "A Natural Language Interface for Efficient Data Retrieval in SDSS", "comment": "Submitted to the Proceedings of the International Astronomical Union\n  (IAU Symposium 397, ''UniversAI: Exploring the Universe with Artificial\n  Intelligence,'' 2025). 4 pages", "summary": "Modern astronomical surveys such as the Sloan Digital Sky Survey (SDSS)\nprovide extensive astronomical databases enabling researchers to access vast\namount of diverse data. However, retrieving data from archives requires\nknowledge of query languages and familiarity with their schema, which presents\na barrier for non-experts. This work investigates the use of Microsoft Phi-2, a\ncompact yet powerful transformer-based language model, fine-tuned on natural\nlanguage--SQL pairs constructed from SDSS query examples. We develop an\ninterface that translates user queries in natural language into SQL commands\ncompatible with SDSS SkyServer. Preliminary evaluation shows that the\nfine-tuned model produces syntactically valid and largely semantically correct\nqueries across a variety of astronomy-related requests. Our results show that\neven small-scale models, when carefully fine-tuned, can provide effective\ndomain-specific natural language interfaces for large scientific databases."}
{"id": "2510.26218", "categories": ["astro-ph.HE", "astro-ph.CO", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2510.26218", "abs": "https://arxiv.org/abs/2510.26218", "authors": ["Jia-Rou Liou", "Alvina Y. L. On", "H. -Y. Karen Yang", "J. A. ZuHone"], "title": "Rotation Measure Analysis of Shocks and Sloshing Fronts in a Galaxy Cluster Merger Simulation", "comment": "18 pages, 11 figures", "summary": "Recent observations of the Fornax cluster show depolarization signatures on\nmegaparsec scales, which may be associated with shocks and/or sloshing motions\nduring cluster merger and/or in-fall. To investigate the possible reasons\nbehind the depolarization, we carry out analytical and full polarized radiative\ntransfer (PRT) calculations of radio point sources behind a merging galaxy\ncluster simulated using the FLASH code. With uniform background light, we\nanalyzed the rotation measure (RM) morphology near the shock front and the\ncluster center, where sloshing cold fronts appear. For the shock scenario, we\nfind a local RM enhancement by $\\sim56\\%$ behind the shock front on megaparsec\nscales, arising from the compression of hot gas and magnetic field lines.\nBehind the sloshing cold front, the cluster center shows decrement in RM\nmagnitude by $\\sim23.3\\%$, as a result of the cancellation effect of\nrandomly-oriented magnetic fields induced by sloshing-driven turbulence. We\nfind that beam depolarization increases behind shock fronts and across sloshing\ncold fronts, indicating enhanced magnetic field fluctuations across the plane\nof the sky in both scenarios. By fully accounting for all radiative transfer\ncoefficients in the PRT calculations, the uniform background light becomes more\ndepolarized near the cluster center, with the effect growing more pronounced as\nbackground intensity decreases. This suggests that synchrotron emission and\nFaraday rotation of the intracluster medium can significantly influence the\npolarization of background sources."}
{"id": "2510.25987", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2510.25987", "abs": "https://arxiv.org/abs/2510.25987", "authors": ["Kevin Phan", "William Mitchell", "David Chaparro", "Enrique De Alba", "J. Zachary Gazak"], "title": "HS-ANET: Star Spectral Type Enhanced Astrometric Calibration for Hyper Spectral Space Imaging", "comment": null, "summary": "Traditional lost-in-space algorithms, such as those implemented in\nastrometry.net, solve for spacecraft orientation by matching observed star\nfields to celestial catalogs using geometric asterisms alone. In this work, we\npropose a novel extension to astrometry.net that incorporates stellar spectral\ntype, which is derived from hyperspectral imagery, into the matching process.\nBy adding this spectral dimension to each star detection, we constrain the\nsearch space and improve match specificity, enabling successful astrometric\nsolutions with significantly fewer stars. Our modified pipeline demonstrates\nimproved fit rates and reduced failure cases in cluttered or ambiguous star\nfields, which is especially critical for autonomous space situational awareness\nand traffic management. Our results suggest that modest spectral resolution,\nwhen incorporated into existing geometric frameworks, can dramatically improve\nrobustness and efficiency in onboard star identification systems."}
{"id": "2510.26554", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.26554", "abs": "https://arxiv.org/abs/2510.26554", "authors": ["Samantha Creech", "Francesca Civano", "Daniel R. Wik", "Ross Silver", "Xiurui Zhao", "Rafael Ortiz III", "Tonima Ananna", "Normal A. Grogin", "Rolf Jansen", "Christopher N. A. Willmer", "Rogier A. Windhorst"], "title": "The $N_H$ Distribution of Hard X-ray Selected AGN in the NEP Field", "comment": "24 pages, 14 figures, 7 tables", "summary": "X-ray surveys are one of the most unbiased methods for detecting Compton\nThick (CT; $N_{{\\mathrm{H}}} \\geq 10^{24}$ cm$^{-2}$) AGN, which are thought to\ncomprise up to $60\\%$ of AGN within $z \\lesssim 1.0$. These CT AGN are often\ndifficult to detect with current instruments, but the X-ray data within the\nJWST-North Ecliptic Pole (NEP) Time Domain Field (TDF) present a unique\nopportunity to study faint and obscured AGN. The NEP contains the deepest\nNuSTAR survey to date, and Zhao et al. (2024) detected 60 hard X-ray sources\nfrom the combined exposure of NuSTAR's Cycle 5 and 6 observations. In this\nwork, we utilize the NuSTAR Cycle 5+6+8+9 data and simultaneous XMM-Newton\nobservations in order to perform the first spectroscopic analysis of the\n60-source catalog. We present this analysis and measure the $N_{{\\mathrm{H}}}$\ndistribution of the sample. We measure an observed CT fraction of\n$0.13_{-0.04}^{+0.15}$ down to an observed $8-24$ keV flux of $6.0 \\times\n10^{-14}$ erg/s/cm$^{2}$, and we correct our analysis for absorption bias to\nestimate an underlying CT fraction of $0.32_{-0.08}^{+0.23}$. The derived\nobscuration distribution and CT fraction are consistent with population\nsynthesis models and previous surveys."}
{"id": "2510.26239", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2510.26239", "abs": "https://arxiv.org/abs/2510.26239", "authors": ["Davide Fiorina", "Elisabetta Baracchini", "Giorgio Dho", "Paolo Soffitta", "Samuele Torelli", "David J. M. Marques", "Enrico Costa", "Sergio Fabiani", "Fabio Muleri", "Giovanni Mazzitelli", "Atul Prajapati"], "title": "A Triple-GEM Time Projection Chamber for Wide Field-of-View Hard X-ray Polarimetry: First Results", "comment": "8 pages, 14 figures", "summary": "We report on the development of a large-volume, wide field-of-view time\nprojection chamber (TPC) for X-ray polarimetry, featuring a triple-GEM\namplification stage and optical readout. Originally developed within the CYGNO\nprogram for directional dark matter searches, the system employs a scientific\nCMOS (sCMOS) camera and a photomultiplier tube (PMT) to collect secondary\nscintillation light produced during charge amplification. A prototype with a\ncylindrical active volume (radius 3.7 cm, height 5 cm) was tested at the\nINAF--IAPS calibration facility (Rome, Tor Vergata) to assess sensitivity to\nlow-energy electron directionality. We fully reconstruct electrons in the 10-60\nkeV range, obtain angular resolutions as good as 15{\\deg}, and infer modulation\nfactors up to 0.9. These first results demonstrate robust photoelectron\ntracking at tens of keV with strong modulation, indicating that\nphotoelectric-effect polarimetry can be extended to higher energies. This\ncapability is promising for rapid transients (GRBs, solar flares) and would\nbroaden the astrophysical reach of X-ray polarimetry."}
{"id": "2510.26561", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.26561", "abs": "https://arxiv.org/abs/2510.26561", "authors": ["Yibo Wang", "Tingui Wang", "Shifeng Huang", "Jiazheng Zhu", "Ning Jiang", "Wenbin Lu", "Rongfeng Shen", "Shiyan Zhong", "Dong Lai", "Yi Yang", "Xinwen Shu", "Tianyu Xia", "Di Luo", "Jianwei Lyu", "Thomas Brink", "Alex Filippenko", "Weikang Zheng", "Minxuan Cai", "Zelin Xu", "Mingxin Wu", "Xiaer Zhang", "Weiyu Wu", "Lulu Fan", "Ji-an Jiang Xu Kong", "Bin Li", "Feng Lin", "Ming Liang", "Wentao Luo", "Jinlong Tang", "Zhen Wan", "Hairen Wang", "Jian Wang", "Yongquan Xue", "Dazhi Yao", "Hongfei Zhang", "Wen Zhao", "Xianzhong Zheng", "Qingfeng Zhu", "Yingxi Zuo"], "title": "A Star's Death by a Thousand Cuts: The Runaway Periodic Eruptions of AT2023uqm", "comment": "Submitted. Comments are welcome", "summary": "Stars on bound orbits around a supermassive black hole may undergo repeated\npartial tidal disruption events (rpTDEs), producing periodic flares. While\nseveral candidates have been suggested, definitive confirmation of these events\nremains elusive. We report the discovery of AT2023uqm, a nuclear transient that\nhas exhibited at least five periodic optical flares, making it only the second\nconfirmed case of periodicity after ASASSN-14ko. Uniquely, the flares from\nAT2023uqm show a nearly exponential increase in energy--a \"runaway\" phenomenon\nsignaling the star's progressive destruction. This behavior is consistent with\nrpTDEs of low-mass, main-sequence stars or evolved giant stars. Multiwavelength\nobservations and spectroscopic analysis of the two most recent flares reinforce\nits interpretation as an rpTDE. Intriguingly, each flare displays a similar\ndouble-peaked structure, potentially originating from a double-peaked mass\nfallback rate or two discrete collisions per orbit. The extreme ratio of peak\nseparation to orbital period draws attention to the possibility of a giant star\nbeing disrupted, which could be distinguished from a low-mass main-sequence\nstar by its future mass-loss evolution. Our analysis demonstrates the power of\nrpTDEs to probe the properties of disrupted stars and the physical processes of\ntidal disruption, though it is currently limited by our knowledge of these\nevents. AT2023uqm emerges as the most compelling rpTDE thus far, serving as a\ncrucial framework for modeling and understanding these phenomena."}
{"id": "2510.26333", "categories": ["astro-ph.IM", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2510.26333", "abs": "https://arxiv.org/abs/2510.26333", "authors": ["P. Scicluna", "S. Zeegers", "J. P. Marshall", "F. Kemper", "S. Srinivasan T. E. Dharmawardena", "L. Fanciullo", "O. Morata", "A. Trejo-Cruz"], "title": "{\\sc ampere}: A tool to fit heterogeneous observations consistently", "comment": "Submitted to RAS Techniques and Instruments. 11 pages, 9 figures", "summary": "As astronomy advances and data becomes more complex, models and inference\nalso become more expensive and complex. In this paper we present {\\sc ampere},\nwhich aims to solve this problem using modern inference techniques such as\nflexible likelihood functions and likelihood-free inference. {\\sc ampere}\\ can\nbe used to do Bayesian inference even with very expensive models (hours of CPU\ntime per model) that do not include all the features of the observations (e.g.\nmissing lines, incomplete descriptions of PSFs, etc). We demonstrate the power\nof \\ampere\\ using a number of simple models, including inferring the posterior\nmineralogy of circumstellar dust using a Monte Carlo Radiative Transfer model.\n{\\sc ampere}\\ reproduces the input parameters well in all cases, and shows that\nsome past studies have tended to underestimate the uncertainties that should be\nattached to the parameters. {\\sc ampere}\\ can be applied to a wide range of\nproblems, and is particularly well-suited to using expensive models to\ninterpret data."}
{"id": "2510.26594", "categories": ["astro-ph.HE", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2510.26594", "abs": "https://arxiv.org/abs/2510.26594", "authors": ["Shaswata Chowdhury", "M. A. Krishnakumar", "Manjari Bagchi", "Bhal Chandra Joshi", "Nobleson K.", "Jibin Jose", "Shantanu Desai", "Manpreet Singh", "Vaishnavi Vyasraj", "Kuldeep Meena", "Amarnath", "Manoneeta Chakraborty", "Shubham Kala", "Debabrata Deb", "Zenia Zuraiq", "Arul Pandian B", "Neelam Dhanda Batra", "Churchil Dwivedi", "Sushovan Mondal", "Avinash Kumar Paladi", "Kaustubh Rai", "Abhimanyu Susobhanan", "Adya Shukla", "Aman Srivastava", "Mayuresh Surnis", "Hemanga Tahbildar", "Keitaro Takahashi", "Pratik Tarafdar", "Prabu Thiagaraj", "Kunjal Vara"], "title": "The second data release of the Indian Pulsar Timing Array: Investigating the Effect of Coronal Mass Ejection on PSR J1022+1001 and a Possible Mode Change of PSR J2145-0750", "comment": "19 pages, 10 figures, 1 table", "summary": "The Indian Pulsar Timing Array (InPTA) has recently published its second data\nrelease (DR2), comprising the timing analysis of seven years of data on 27\nmillisecond pulsars (MSPs), observed simultaneously in the 300-500 MHz (band 3)\nand 1260-1460 MHz (band 5), using the upgraded Giant Metrewave Radio Telescope\n(uGMRT). The low-frequency data, particularly in band 3, is highly sensitive to\npropagation effects such as dispersion measure (DM) fluctuations, which can be\nimprints of some astrophysical phenomena (scientific outliers). Here, we\nanalyze the two outliers of possible astrophysical origin coming from the band\n3 DM time series of two pulsars: PSR J1022+1001, with an ecliptic latitude of\n-0.06 degree , and PSR J2145-0750, one of the brightest MSPs, with\nmulti-component profile morphology. Our study reveals compelling evidence for a\ncoronal mass ejection (CME) event traced in the data of PSR J1022+1001, and\nreports evidence for a potential mode-changing event in PSR J2145-0750.\nExtending the analyses presented here to the full sample of InPTA-DR2 pulsars\nis expected to reveal additional CME events, and possible mode-changing events.\nSuch detections will not only improve our understanding of solar and pulsar\nmagnetospheric plasma interactions but will also enable more accurate modelling\nof DM variations, leading to improved pulsar timing solutions, which are\ncrucial for high-precision Pulsar Timing Array (PTA) science."}
{"id": "2510.26507", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2510.26507", "abs": "https://arxiv.org/abs/2510.26507", "authors": ["Anwesh Kumar Mishra", "Deekshya Roy Sarkar", "Prachi Prajapati", "Alka Singh", "Prashanth K. Kasarla", "Shashikiran Ganesh"], "title": "A summary of instruments proposed for observing pulsating variables from the Mt. Abu Observatory", "comment": null, "summary": "Pulsating variables play a significant role in shaping modern astronomy.\nPresently it is an exciting era in observational study of variable stars owing\nto surveys like OGLE and TESS. The vast number of sources being discovered by\nthese surveys is also creating opportunities for 1-2m class telescopes to\nprovide follow-up observations to characterize these. We present some initial\nobservations of type-II cepheids from the Mt. Abu observatory and highlight the\nneed for dedicated observing runs of pulsating variables. We also present\noptical designs for several suggested instruments for the Mt. Abu observatory\nthat will contribute towards this goal. We present designs that are fairly\nsimple and yet take due benefit of the unique telescopes and facilities present\nat the observatory."}
{"id": "2510.26663", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2510.26663", "abs": "https://arxiv.org/abs/2510.26663", "authors": ["Noah Kubli", "Alessia Franchini", "Eric R. Coughlin", "C. J. Nixon", "Sebastian Keller", "Pedro R. Capelo", "Lucio Mayer"], "title": "Tidal disruption events with SPH-EXA: resolving the return of the stream", "comment": "10 pages, 4 figures, submitted to ApJL", "summary": "In a tidal disruption event (TDE), a star is disrupted by the tidal field of\na massive black hole, creating a debris stream that returns to the black hole,\nforms an accretion flow, and powers a luminous flare. Over the last few\ndecades, several numerical studies have concluded that shock-induced\ndissipation occurs as the stream returns to pericentre (i.e.,\npre-self-intersection), resulting in efficient circularisation of the debris.\nHowever, the efficacy of these shocks is the subject of intense debate. We\npresent high-resolution simulations (up to 10^10 particles) of the disruption\nof a solar-like star by a 10^6M_sun black hole with the new, GPU-based,\nsmoothed-particle hydrodynamics code SPH-EXA, including the relativistic\napsidal precession of the stellar debris orbits; our simulations run from\ninitial disruption to the moment of stream self-intersection. With 10^8\nparticles - corresponding to the highest-resolution SPH simulations of TDEs in\nthe pre-existing literature - we find significant, in-plane spreading of the\ndebris as the stream returns through pericenter, in line with previous works\nthat suggested this is a significant source of dissipation and luminous\nemission. However, with increasing resolution this effect is dramatically\ndiminished, and with 10^10 particles there is effectively no change between the\nincoming and the outgoing stream widths. Our results demonstrate that the\nparadigm of significant dissipation of kinetic energy during pericentre passage\nis incorrect, and instead it is likely that debris circularisation is mediated\nby the originally proposed, stream-stream collision scenario."}
{"id": "2510.26689", "categories": ["astro-ph.IM", "physics.ed-ph"], "pdf": "https://arxiv.org/pdf/2510.26689", "abs": "https://arxiv.org/abs/2510.26689", "authors": ["Abhinav Roy", "Niti Singh"], "title": "Stellar Spectroscopy Using Diffraction Grating, CMOS Monochrome Sensor, and Reflecting Telescopes", "comment": "10 pages, 8 figures", "summary": "We present the design and testing of a compact, low-cost stellar spectrometer\ndeveloped for undergraduate and outreach applications. The instrument employs a\n600 lines/mm diffraction grating, a CMOS monochrome sensor, and a 3D-printed\nmount integrated with reflecting telescopes. Calibration was performed using\nhelium emission sources in the laboratory and Vega as a spectrophotometric\nstandard, supported by a custom Python-based image-processing pipeline for\nwavelength calibration and spectral stacking. The spectrometer successfully\nrecorded usable spectra of bright stars including Vega, Sirius, Procyon,\nCapella, and Betelgeuse, covering spectral types A through M. The results\ndemonstrate that meaningful stellar spectroscopy can be achieved with\naccessible, low-cost equipment, providing a practical framework for student-led\nastronomical instrumentation projects."}
{"id": "2510.26666", "categories": ["astro-ph.HE", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2510.26666", "abs": "https://arxiv.org/abs/2510.26666", "authors": ["Alessandro Bruno", "Melissa Pesce-Rollins", "Silvia Dalla", "Nicola Omodei", "Ian G. Richardson", "James M. Ryan"], "title": "The 2024 July 16 Solar Event: A Challenge To The Coronal Mass Ejection Origin Of Long-Duration Gamma-Ray Flares", "comment": "Accepted for publication in A&A", "summary": "We present a multi-spacecraft analysis of the 2024 July 16 Long-Duration\nGamma-Ray Flare (LDGRF) detected by the Large Area Telescope on the Fermi\nsatellite. The measured >100 MeV $\\gamma$-ray emission persisted for over seven\nhours after the flare impulsive phase, and was characterized by photon energies\nexceeding 1 GeV and a remarkably-hard parent-proton spectrum. In contrast, the\nphenomena related to the coronal mass ejection (CME)-driven shock linked to\nthis eruption were modest, suggesting an inefficient proton acceleration\nunlikely to achieve the energies well-above the 300 MeV pion-production\nthreshold to account for the observed $\\gamma$-ray emission. Specifically, the\nCME was relatively slow (~600 km/s) and the accompanying interplanetary\ntype-II/III radio bursts were faint and short-duration, unlike those typically\ndetected during large events. In particular, the type-II emission did not\nextend to kHz frequencies and disappeared ~5.5 hours prior to the LDGRF end\ntime. Furthermore, the associated solar energetic particle (SEP) event was very\nweak, short-duration, and limited to a few tens of MeV, even at magnetically\nwell-connected spacecraft. These findings demonstrate that a very-fast CME\nresulting in a high-energy SEP event is not a necessary condition for the\noccurrence of LDGRFs, challenging the idea that the high-energy $\\gamma$-ray\nemission is produced by the back-precipitation of shock-accelerated ions into\nthe solar surface. The alternative origin scenario based on local particle\ntrapping and acceleration in large-scale coronal loops is instead favored by\nthe observation of giant arch-like structures of hot plasma over the source\nregion persisting for the entire duration of this LDGRF."}
{"id": "2510.26774", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2510.26774", "abs": "https://arxiv.org/abs/2510.26774", "authors": ["M. Guolo", "A. Mummery", "S. van Velzen", "S. Gezari", "M. Nicholl", "Y. Yao", "M. Karmen", "Y. Ajay", "T. Wevers", "N. LeBaron", "R. Chornock"], "title": "Compact Accretion Disks in the Aftermath of Tidal Disruption Events: Parameter Inference from Joint X-ray Spectra and UV/Optical Photometry Fitting", "comment": "Submitted to ApJ", "summary": "We present a multi-wavelength analysis of 14 tidal disruption events\n(TDEs)-including an off-nuclear event associated with an ultra-compact dwarf\ngalaxy-selected for having available thermal X-ray spectra during their\nlate-time UV/optical plateau phase. We show that at these stages, the full\nspectral energy distribution - X-ray spectra and UV/optical photometry - is\nwell described by a compact, yet standard accretion disk, the same disk which\npowers the X-rays at all times. By fitting up to three three epochs per source\nwith a fully relativistic disk model, we show that many system properties can\nbe reliably recovered, including importantly the black hole mass\n($M_{\\bullet}$). These accretion-based $M_{\\bullet}$ values, which in this\nsample span nearly three orders of magnitude, are consistent with galactic\nscaling relations but are significantly more precise (68\\% credible interval $\n< \\pm 0.3$ dex) and physically motivated. Expected accretion scaling relations\n(e.g., $L_{Bol}^{ disk} / L_{Edd} \\propto T_p^4 \\propto M_{\\bullet}^{-1}$),\nTDE-specific physics correlations ($L_{plat} \\propto M_{\\bullet}^{2/3}$ and\n$R_{out}/r_g \\propto M_{\\bullet}^{-2/3}$) and black hole-host galaxy\ncorrelations ($M_{\\bullet}$-$M_{\\star}$ and $M_{\\bullet}$-$\\sigma_{\\star}$)\nnaturally emerge from the data and, for the first time, are self-consistently\nextended into the intermediate-mass (IMBH, $M_{\\bullet} < 10^{5}$) regime. We\ndiscuss the implications of these results for TDE physics and modeling. We also\nreview and discuss different methods for $M_{\\bullet}$ inference in TDEs, and\nfind that approaches based on physical models of the early-time UV/optical\nemission are not able to recover (at a statistically significant level) black\nhole-host galaxy scalings."}
