{"id": "2509.10505", "categories": ["astro-ph.IM", "gr-qc"], "pdf": "https://arxiv.org/pdf/2509.10505", "abs": "https://arxiv.org/abs/2509.10505", "authors": ["Jericho Cain"], "title": "CWT-LSTM Autoencoder: A Novel Approach for Gravitational Wave Detection in Synthetic Data", "comment": "11 pages, 3 figures", "summary": "Gravitational wave detection requires sophisticated signal processing to\nidentify weak astrophysical signals buried in instrumental noise. Traditional\nmatched filtering approaches face computational challenges with diverse signal\nmorphologies and non-stationary noise. This work presents a deep learning\napproach combining Continuous Wavelet Transform (CWT) preprocessing with Long\nShort-Term Memory (LSTM) autoencoder architecture for gravitational wave\ndetection in synthetic data. The CWT provides optimal time-frequency\ndecomposition capturing chirp evolution and transient characteristics essential\nfor compact binary coalescence identification. The LSTM autoencoder learns\ncompressed representations while maintaining sensitivity to subtle signal\nfeatures distinguishing true astrophysical events from noise artifacts. We\ngenerate realistic synthetic datasets incorporating binary black hole merger\nsignals with masses ranging from 10 to 80 solar masses, embedded in colored\nGaussian noise representative of Advanced LIGO sensitivity. The trained model\ndemonstrates strong performance metrics: 92.3 percent precision, 67.6 percent\nrecall, and 80.6 percent AUC-ROC, with an average precision score of 0.780.\nThese results exceed LIGO's stringent detection thresholds for confident\ngravitational wave identification. Compared to traditional approaches, the\nCWT-LSTM autoencoder shows superior ability to maintain low false alarm rates\nwhile preserving sensitivity to weak signals. The method's end-to-end learning\neliminates hand-crafted features and template banks, offering a promising\npathway toward more robust gravitational wave detection systems. The\nunsupervised nature enables discovery of signals with unknown morphologies,\nproviding complementary \"blind search\" capability for detecting exotic\nastrophysical sources and novel physics beyond current theoretical models."}
{"id": "2509.10883", "categories": ["astro-ph.IM", "astro-ph.EP", "astro-ph.GA", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2509.10883", "abs": "https://arxiv.org/abs/2509.10883", "authors": ["Michael Perryman"], "title": "Space Astrometry with Gaia: Advances in Understanding our Galaxy", "comment": "271 pages, 126 figures, accepted for publication in Physics Reports", "summary": "Gaia is a satellite mission of the European Space Agency which is creating a\ncatalogue of extremely accurate positions, distances and space motions of two\nbillion stars in our Galaxy, along with more than one hundred thousand solar\nsystem asteroids, and several million distant quasars, all on the same\nextragalactic reference system. Complementary information on each object's\nmulti-epoch photometry and spectra provides a vast and unprecedented data base\nof (model-dependent) fundamental physical quantities, such as each star's mass,\nage, and chemical composition. I outline the field's historical context, and\nexplain the key principles involved in these space measurements. This is\nfollowed by a broad review of the many areas of solar system science, stellar\nstructure and evolution, and topics in Galactic structure, evolution, and\ndynamics, that are being derived from these data."}
{"id": "2509.10901", "categories": ["astro-ph.IM", "astro-ph.GA", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2509.10901", "abs": "https://arxiv.org/abs/2509.10901", "authors": ["Mahdi Abdollahi", "Atefeh Javadi", "Barry F. Madore", "Wendy L. Freedman", "Hamidreza Mahani"], "title": "Mitigating Random-Phase Sampling Noise in the Cepheid Period-Luminosity Relation: A Cross-Filter Consistency Approach", "comment": "Accepted for publication in ApJ", "summary": "The Period-Luminosity (PL) relation is usually derived using time-averaged\nmagnitudes, which require multiple-epoch observations to determine periods and\nadequately sample the light curves. Although single-epoch observations are more\npractical and require significantly less observational effort, they inherently\nintroduce greater photometric scatter, leading to an increased dispersion in\nthe derived Period-Luminosity relations. In this paper, we explore, in detail,\na method that transforms single random-phase data to their mean-light values,\nusing information obtained in other bands for the same Cepheid. This approach\nenables the accurate re-construction of mean-light PL relations for wavelengths\nobserved with space-based facilities, for instance, where the number of epochs\nper star makes simple averaging or template fitting less than optimal, with the\nlatter requiring very high-precision periods for predictive phasing. While\napplying this technique across multiple bands, from optical to mid-IR, we focus\nparticularly on widely separated bands covering the mid-IR to the optical. We\nshowcase this method using the J band (as being observed by JWST) as the\nrandom-phase component. Our results show that this correction reduces the\nscatter of the PL relation in the J band by a factor of approximately\n$0.7\\times$, equivalent to increasing the number of random-phase observations\nby a factor of 10, needed to obtain the same increase in precision as delivered\nhere."}
{"id": "2509.10992", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.10992", "abs": "https://arxiv.org/abs/2509.10992", "authors": ["Zheng Zhang", "Philip Bull", "Mario G. Santos", "Ainulnabilah Nasirudin"], "title": "Joint Bayesian calibration and map-making for intensity mapping experiments", "comment": "23 pages, 14 figures. Submitted to RASTI", "summary": "Line intensity maps have high dynamic range, and demand careful spectral and\nspatial calibration. We present a Bayesian framework for joint calibration and\nmap-making using Gibbs sampling, which provides access to the full joint\nposterior of calibration and sky map parameters. Our data model incorporates\ninstrumental noise based on the radiometer equation, capturing the coupling\nbetween noise level and system temperature without assuming a fixed noise\namplitude. To enable unbiased and fast estimation of gain and system\ntemperature, we develop an iterative generalised least squares (GLS) sampling\nmethod. Absolute flux calibration can be achieved either with external sources\nor internally using known signal injections, such as noise diodes. To handle\nstochastic gain variations, we introduce a $1/f$ noise model that avoids\nspurious periodic correlations in the time domain caused by the conventional\nassumption of diagonal DFT noise covariance. Furthermore, we implement this\nworkflow in an efficient software package, using the Levinson algorithm and a\npolynomial emulator to reduce the computational complexity of noise parameter\nsampling, ensuring good scalability. Although demonstrated for auto-correlation\nmeasurements, the framework and techniques generalise to cross-correlation and\ninterferometric data."}
{"id": "2509.10638", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.10638", "abs": "https://arxiv.org/abs/2509.10638", "authors": ["Lizhong Zhang", "James M. Stone", "Patrick D. Mullen", "Shane W. Davis", "Yan-Fei Jiang", "Christopher J. White"], "title": "Radiation GRMHD Models of Accretion onto Stellar-Mass Black Holes: II. Super-Eddington Accretion", "comment": "37 pages, 25 figures, 3 tables, submitted to ApJ", "summary": "We present a comprehensive analysis of super-Eddington black hole accretion\nsimulations that solve the GRMHD equations coupled with angle-discretized\nradiation transport. The simulations span a range of accretion rates, two black\nhole spins, and two magnetic field topologies, and include resolution studies\nas well as comparisons with non-radiative models. Super-Eddington accretion\nflows consistently develop geometrically thick disks supported by radiation\npressure, regardless of magnetic field configuration. Radiation generated in\nthe inner disk drives substantial outflows, forming conical funnel regions that\nlimit photon escape and result in very low radiation efficiency. The accretion\nflows are highly turbulent with thermal energy transport dominated by radiation\nadvection rather than diffusion. Angular momentum is primarily carried outward\nby Maxwell stress, with turbulent Reynolds stress playing a subdominant role.\nBoth strong and weak jets are produced. Strong jets arise from sufficient net\nvertical magnetic flux and rapid black hole spin and can effectively evacuate\nthe funnel, enabling radiation to escape through strong geometric beaming. In\ncontrast, weak jets fail to clear the funnel, which becomes obscured by\nradiation-driven outflows and leads to distinct observational signatures.\nSpiral structures are observed in the plunging region, behaving like density\nwaves. These super-Eddington models are applicable to a variety of astronomical\nsystems, including ultraluminous X-ray sources, little red dots, and black hole\ntransients."}
{"id": "2509.11215", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.11215", "abs": "https://arxiv.org/abs/2509.11215", "authors": ["D. O. Kudryavtsev", "S. A. Trushkin", "P. G. Tsybulev", "V. A. Stolyarov"], "title": "Neural networks in the search for fast radio bursts with RATAN-600", "comment": "Accepted for publication in Astronomy and Computing", "summary": "We present a technique to search for fast radio bursts in records obtained\nwith broadband radiometers having few radio channels. The technique is applied\nto the RATAN-600 surveys carried out at its Western Sector since the year 2017.\nA 1D convolutional neural network for multichannel time series classification\nis developed based on the EfficientNet family of models. The procedure to\ngenerate synthetic FRB signals needed for the training dataset is described. We\nimplement a two-stage cascade scheme to effectively suppress the rate of false\npositive detections. Evaluation of the trained model is provided based on the\nsynthetic events and the giant pulse of the Crab Pulsar."}
{"id": "2509.11186", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2509.11186", "abs": "https://arxiv.org/abs/2509.11186", "authors": ["Xiangli Lei", "Qingwen Wu", "Ya-Ping Li", "Wei-Hua Lei"], "title": "Simulations of Tidal Disruption of Supernova in Galaxy Nuclear Region: A Novel Model for Ambiguous Nuclear Transients", "comment": "submitted to ApJL", "summary": "An increasing number of ambiguous nuclear transients, including some extreme\nnuclear transients, have been reported, which cannot be simply explained by the\ntidal disruption event (TDE) due to their high energy and/or overmassive black\nholes. Stars that form in or are captured by AGN disks will grow and migrate\ninward, potentially exploding as supernovae once the inner cold accretion disk\ndisappears during the phase of AGN decay. We propose that tidal disruption of a\nsupernova (TDS) by a supermassive black hole (SMBH) can produce nuclear\ntransients that are even more luminous than typical TDEs and are not limited by\nthe SMBH mass. In this scenario, the SMBH can capture the supernova ejecta,\nwhich subsequently self-intersects and circularizes into an accretion disk.\nBased on hydrodynamical simulations, we find that the accretion rate of the TDS\ndisk exhibits a slow decline that can last for months to decades. The peak\naccretion rate of a typical core-collapse SN scenario can exceed the Eddington\nlimit for SMBHs with $M_{\\rm BH} \\lesssim 10^{7.5}\\,M_\\odot$, while it remains\nsub-Eddington for more massive SMBHs. This model provides a mechanism for\ntriggering an energetic TDE-like flare with luminosity\n\\(\\gtrsim10^{45}\\,\\mathrm{erg\\,s^{-1}}\\) in galaxies with $M_{\\rm\nBH}\\gtrsim10^{8}\\,M_\\odot$ or triggering turn-on changing-look AGNs."}
{"id": "2509.11679", "categories": ["astro-ph.IM", "astro-ph.CO"], "pdf": "https://arxiv.org/pdf/2509.11679", "abs": "https://arxiv.org/abs/2509.11679", "authors": ["Joe H. N. Pattison", "Dominic J. Anstey", "Eloy de Lera Acedo"], "title": "Quantifying the Impact of Lunar and Planetary Occultation on Experimental Global 21 cm Cosmology", "comment": "10 Pages, 11 Figures", "summary": "The global 21 cm signal from the hyperfine transition of cosmic atomic\nhydrogen is theorised to track the state of the early Universe via the analysis\nof its absorption and emission with respect to the radio background. Detecting\nthis signal has been a challenge for astronomers since it was first postulated\ndue to the presence of strong galactic foregrounds obfuscating the transition.\nForward modelling techniques that aim to simulate and then remove these\nforegrounds have been suggested as a workaround to this problem. This\ntechnique, however, requires a precise and accurate understanding of the\nforegrounds in question. As we move into the next major lunar standstill, the\nmoon will be able to occult high power areas of the sky in ways that are\nunaccounted for by maps used to simulate these foregrounds, and thereby disrupt\nsignal recovery. We show that in toy cases an occultation from the moon, or\nother proximate object, leading to a mismatch in our expected and actual\nforegrounds of 15 parts per million increases the error in signal recovery of\nup to 20\\%. We show that this level of disruption can happen when the moon is\nfound towards the centre of the galaxy and is amplified when this alignment\nhappens at high directivity regions of the antenna beam, causing a disruption\nof up to 180 parts per million, leading to a signal recovery error of 115\\%.\nThis allows us to identify lunar alignment scenarios that should be actively\navoided to preserve signal fidelity. We also demonstrate that a body with a\nsmaller apparent size than the moon, such as Venus, is unlikely to cause any\nsignal disruption due to occultation, giving a base map error of <2 parts per\nmillion."}
{"id": "2509.11245", "categories": ["astro-ph.HE", "astro-ph.GA", "gr-qc"], "pdf": "https://arxiv.org/pdf/2509.11245", "abs": "https://arxiv.org/abs/2509.11245", "authors": ["Yuxuan Shi", "Hongbo Cheng"], "title": "Probing Hernquist dark matter with black hole shadows: A comprehensive study of various accretions", "comment": null, "summary": "The appearance of a black hole shadow, in both astronomical observations and\ntheoretical analysis, depends critically on the properties of the surrounding\naccretion. In this study, we analyse the emission and observational properties\nof a Schwarzschild black hole surrounded by a Hernquist dark matter (DM) halo\nby considering three simplified accretion models, which have not been\npreviously explored in such detail. Based on our findings, direct emission\ncontributes markedly to the whole observed intensity for a\nSchwarzschild-Hernquist black hole encircled by a geometrically thin accretion\ndisk. The corresponding regions and measured intensities of the lensing ring,\nthe photon ring, and direct emission are sensitive to the parameters of the\nHernquist DM halo. Apart from disk accretion, we also study two spherical\naccretion models: static and infalling. With increasing Hernquist DM\nparameters, both models exhibit a significant decrease in the measured\nintensity, yet the photon spheres are enlarged by an increase of $\\sim2\\%$ to\n$\\sim30\\%$. Furthermore, Doppler de-boosting due to the infalling accretion\nresults in darker shadow images compared to static cases. By precising\nvisualisations of the shadows, our results suggest that the observational\ncharacteristics of black hole shadows can serve as a powerful probe for\ndistinguishing between different DM distributions around supermassive black\nholes."}
{"id": "2509.11894", "categories": ["astro-ph.IM", "astro-ph.CO"], "pdf": "https://arxiv.org/pdf/2509.11894", "abs": "https://arxiv.org/abs/2509.11894", "authors": ["Ainulnabilah Nasirudin", "Philip Bull"], "title": "Bayesian recalibration of flux scale factors in diffuse radio maps using low-resolution absolute radiometers", "comment": "14 pages, 12 figures", "summary": "The Haslam 408 MHz all-sky map is widely used as a template to model the\ndiffuse Galactic synchrotron emission at radio and microwave frequencies.\nRecent studies have suggested that there are large uncorrected flux scale\nerrors in this map, however. We investigate the possibility of statistically\nrecalibrating the Haslam map using absolutely-calibrated (but low angular\nresolution) radio experiments designed to measure the 21cm global signal at low\nfrequencies. We construct a Gibbs sampling scheme to recover the full joint\nposterior distribution of $\\sim 50,000$ parameters, representing the true sky\nbrightness temperature field, as-yet uncorrected flux scale factors, and\nsynchrotron power-law spectral indices. Using idealised full-sky simulated\ndata, we perform a joint analysis of a $1^\\circ$ resolution diffuse map at 408\nMHz and multi-band 21cm global signal data with $30^\\circ$ resolution under\ndifferent assumptions about 1) noise levels in the maps, 2) sky coverage, and\n3) synchrotron spectral index information. For our fiducial scenario in which\nthe global signal experiment has a 50 mK noise rms per coarse pixel in each of\n20 frequency bins between 50 -- 150 MHz, we find that the notional Haslam flux\nscale factors can be recovered in most (but not all) sub-regions of the sky to\nan accuracy of $\\pm 2 \\%$. In all cases we are able to rectify the sky map to\nwithin $\\sim 5$ K of the true brightness temperature."}
{"id": "2509.11631", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.11631", "abs": "https://arxiv.org/abs/2509.11631", "authors": ["Ruo-Yu Guan", "Feifei Wang", "Yuan-Chuan Zou"], "title": "Hurst Index of Gamma-Ray Burst Light Curves and Its Statistical Study", "comment": "submitted to Journal of Hign Energy Astrophysics", "summary": "Gamma-ray bursts (GRBs) rank among the most powerful astrophysical phenomena,\ncharacterized by complex and highly variable prompt emission light curves that\nreflect the dynamics of their central engines. In this work, we analyze a\nsample of 163 long-duration GRBs detected by the Burst and Transient Source\nExperiment (BATSE), applying detrended fluctuation analysis (DFA) to derive the\nHurst index as a quantitative descriptor of temporal correlations in the light\ncurves. We further explore statistical correlations between the Hurst index and\n12 other observational parameters through regression and correlation analyses.\nOur results reveal anti-correlations between the Hurst index and the burst\ndurations (T50, T90), and a negative trend with the low-energy spectral index\n\\alpha. We also find that correlations with peak photon flux are strongest at\nthe shorter timescale (64 ms) and systematically weaken at longer timescales\n(256-1024 ms), indicating that the persistence of temporal correlations is most\nevident in the rapid variability component of GRB emission. The results offer\nnew perspectives on the temporal structure of the GRB emission and its\npotential link to the underlying physical mechanisms driving these bursts."}
{"id": "2509.11850", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.11850", "abs": "https://arxiv.org/abs/2509.11850", "authors": ["Fabio Convenga"], "title": "Education and Outreach Across Seventeen Countries of the Pierre Auger Collaboration", "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC\n  2025). 12 pages, 4 figures", "summary": "The Pierre Auger Observatory, dedicated to measuring ultra-high energy cosmic\nrays, has been promoting for more than two decades educational and scientific\noutreach activities to make its results known in an understandable language to\ndiverse audiences. Among its most notable efforts, we can mention the creation\nof a visitor center at the Observatory site in Malarg\\\"ue, Argentina, the\nproduction of brochures, posters, videos, talks, and special actions with the\ncommunity in the site of the Observatory and beyond. In addition to joint\nefforts, collaborators from participating countries carry out local efforts,\nsome of them related to national initiatives in their respective regions, such\nas the International Cosmic Day, Masterclasses, exhibitions of artworks with\nthe theme of astroparticles, the Night of the Stars, European Researchers'\nNight, summer schools and initiatives to improve the gender balance in the\nscience community. In addition, there have been board games based on the\ndynamics of the observatory's work, online graphic viewers of the different\nevents, talks, workshops, etc. In recent years, the Pierre Auger Outreach group\nhas focused on presenting actions that directly impact the community in\nMalarg\\\"ue. However, this time, special emphasis will be placed on highlighting\nthe outreach efforts of Pierre Auger collaborators in various countries."}
{"id": "2509.11682", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.11682", "abs": "https://arxiv.org/abs/2509.11682", "authors": ["Sricheta Karmakar", "Alexander A. Mushtukov", "Matthew Middleton"], "title": "Angle-dependent hardening of the reprocessed spectra in ULXs powered by accretion onto neutron stars", "comment": "accepted for publication in MNRAS but comments are welcome, 10 pages,\n  8 figures", "summary": "It is anticipated that mass accretion rates exceeding approximately\n$10^{19}\\,{\\rm g\\,s^{-1}}$ in X-ray pulsars lead to radiation-driven outflows\nfrom super-critical accretion discs. The outflows launched from the disc\ninfluence the angular distribution of X-ray radiation, resulting in geometrical\nbeaming. The beaming, in turn, impacts the apparent luminosity of the X-ray\npulsar, detectability of pulsations, and the spectral composition of the X-ray\nflux. We employ a straightforward geometrical model of the outflows, perform\nMonte Carlo simulations, and model the spectra of radiation, reprocessed by the\nwalls of the accretion cavity formed by the outflows. We consider the\nreprocessed emission only; direct pulsar emission is not included in our\nmodelling. Our results demonstrate that the spectra of reprocessed radiation\ndepend on the actual luminosity of the central engine, the geometry of the\noutflows, and the viewing angle - most notably on the latter, through changing\nvisibility of the hotter wall regions near the disc plane. The high-energy part\nof the reprocessed spectrum depends strongly on viewing angle (harder at lower\ninclinations), while the soft flux varies comparatively little with\ninclination. In our model, this contrast is a prediction: variable\nultra-luminous X-ray sources are expected to exhibit strong high-energy angle\nsensitivity together with comparatively modest soft-band variation, naturally\narising if precession modulates the effective inclination."}
{"id": "2509.11960", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.11960", "abs": "https://arxiv.org/abs/2509.11960", "authors": ["Yilun Guan", "Sigurd Naess", "Ian Niebres", "Louis Branch", "Adam D. Hincks", "Hongbo Cai", "Allen Foster", "Carlos Hervías-Caimapo", "John P. Hughes", "Cristóbal Sifón", "Edward J. Wollack"], "title": "Atacama Cosmology Telescope: Constraints on the Millimetre Flux of the Crab Pulsar", "comment": "16 pages, 12 figures, submitted to ApJ", "summary": "Millimeter-wave observations of pulsars, while crucial for understanding\ntheir emission mechanisms, remain scarce. We demonstrate that high-precision\ncosmic microwave background (CMB) experiments like the Atacama Cosmology\nTelescope (ACT), though designed for cosmology, offer a unique capability for\nsuch time-domain science due to their high cadence and broad sky coverage in\nmillimeter bands. While previous ACT searches have focused on transients\nlasting minutes or longer, we develop and validate analysis methods to search\nfor periodic, millisecond-scale transients, a capability not typically\nassociated with CMB experiments. We describe a phase-resolved mapmaking\napproach, which leverages the known periodicity of the signal to enhance\nsensitivity and offers advantages in diagnosing systematic errors. We also\nintroduce a template-based fit to the raw data timestreams that independently\nvalidate our results. Applying these methods to estimate the millimeter flux of\nthe Crab Pulsar (PSR B0531+21), we derive 95% confidence upper limits of 4.6\nmJy, 4.4 mJy, and 20.7 mJy on the pulsar's period-averaged flux density at 96\nGHz, 148 GHz, and 225 GHz, respectively. These constraints fill a gap in our\nknowledge of the Crab Pulsar's spectral energy distribution, suggesting that it\ndoes not significantly flatten or invert at millimeter wavelengths. This work\ndemonstrates the potential for future searches of short-timescale astrophysical\nphenomena with the next-generation CMB experiments like the Simons Observatory."}
{"id": "2509.11726", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2509.11726", "abs": "https://arxiv.org/abs/2509.11726", "authors": ["Grzegorz Wiktorowicz", "Matthew Middleton", "Aleksandra Olejak", "Cordelia Dashwood-Brown", "Madeleine-Mai Ward", "Adam Ingram"], "title": "Self-lensing binaries as probes of Supernova physics", "comment": "19 pages, 14 figures, submitted to MNRAS", "summary": "Self-lensing (SL) in binary systems has the potential to provide a unique\nobservational window into the Galactic population of compact objects. Using the\n$\\mathtt{startrack}$ and COSMIC population synthesis codes, we investigate how\ndifferent supernova mechanisms affect the observable population of SL systems,\nwith particular attention to the mass gap (2$\\mathrm{-}$5 M$_\\odot$) in compact\nobject distributions. We test three supernova remnant formation models with\ndifferent convective growth timescales ($f_{\\rm mix}$ = 0.5, 1.0, and 4.0),\nsimulating SL binary systems across the Galactic disk and bulge. We identify\ndistinct groupings of SL sources based on lens mass and Einstein crossing time,\nclearly differentiating neutron star from black hole systems and close from\nwide orbits. Notably, the delayed $f_{\\rm mix} = 0.5$ model predicts a\nsignificantly higher fraction of systems with lens masses in the mass gap\nregion (up to $\\sim10$ times more for certain surveys), suggesting that SL\nobservations could help constrain this controversial population. Our analysis\nreveals a strong preference for systems with low centre-of-mass velocities\n($v_{\\rm cm}\\leq20$ km/s) across all models, resulting primarily from physical\nprocesses governing compact object formation and binary survival. While many\npotential detections will have limited observational coverage, ZTF is predicted\nto yield several dozen well-covered systems that should enable detailed\ncharacterization. When applying simple detection criteria including photometric\nprecision and signal-to-noise requirements, predicted rates decrease by\napproximately two orders of magnitude, but still yield up to a few tens of\nexpected detections for LSST and ZTF in the Galactic disk population."}
{"id": "2509.11758", "categories": ["astro-ph.HE", "hep-th", "nucl-th"], "pdf": "https://arxiv.org/pdf/2509.11758", "abs": "https://arxiv.org/abs/2509.11758", "authors": ["Rashmita Jena", "Padmalaya Dash", "S. K. Biswal"], "title": "Investigating the correlations of bulk properties of hyperon star with dark matter", "comment": "28 pages, 8 Figures", "summary": "The strong gravitational pull of the neutron star leads to the accretion of\ndark matter (DM) inside the core of the neutron star. The accretion of DM\naffects the bulk properties of the neutron star. Here, we study how the\naccretion of WIMP (Weakly Interacting Massive Particles) dark matter particles\naffects the $\\Delta-$admixed hyperon star's bulk properties specifically mass,\nradius, tidal deformability, $f-$mode frequency and moment of inertia. The\ninclusion of dark matter softens the EOS (equation of state) and reduces the\nmaximum possible mass, canonical radius, canonical tidal deformability, and\nmoment of inertia of canonical star. However, the $f-$mode frequency of the\ncanonical star increases. We find a cubical correlation between the dark matter\nfermi momenta $k_f^{DM}$ and bulk properties of canonical star."}
{"id": "2509.11820", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.11820", "abs": "https://arxiv.org/abs/2509.11820", "authors": ["Hubing Xiao", "Haitao Cao", "Rui Xue", "Zhihao Ouyang", "Shaohua Zhang", "Junping Chen", "Zhijian Luo", "Jianghe Yang", "Junhui Fan"], "title": "The averaged broadband spectral energy distribution study of Fermi bright BL Lac objects", "comment": null, "summary": "The physics-determined broadband spectral energy distributions (SEDs) of\nblazars have been widely used to study the property during their\nflaring/outburst states, while the non-flaring state takes up most of their\nlifetime and the general property of blazars has been barely discussed. In this\nwork, for the first time, we used the archival data and employed the\nphysics-determined SED processing method to form approximately average-state\nSEDs for 513 \\textit{Fermi} bright BL Lacs. In general, we found that the\nmagnetic field ($B$) is weaker than those obtained for flaring/outburst state\nby nearly one order of magnitude, and the dissipation region size ($R$) is\nlarger than those obtained for flaring/outburst state, suggesting that the\ndissipation region could be more extend and less magnetized. A correlation\nbetween the synchrotron-self Compton (SSC) peak frequency ($\\log \\nu_{\\rm\nssc}$) against the synchrotron peak frequency ($\\log \\nu_{\\rm sy}$) suggest\nthat the inverse Compton scattering of HBLs suffer a significant Klein-Nishina\n(KN) suppression, we quantified the condition of KN suppression by determining\nthe critical synchrotron peak frequency ($\\nu_{\\rm sy}^{\\rm c}$) and found 359\nout of 513 sources in our sample suffer KN suppression. Furthermore, our\nanalysis of the relationship between synchrotron curvature ($1/b_{\\rm sy}$) and\n$\\log \\nu_{\\rm sy}$ indicates that the energy-dependent probability\nacceleration (EDPA) mechanism may dominate the particle acceleration in BL Lac\njets."}
{"id": "2509.11827", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2509.11827", "abs": "https://arxiv.org/abs/2509.11827", "authors": ["G. Harutyunyan", "N. Sahakyan", "D. Bégué", "M. Khachatryan"], "title": "A comprehensive view of PKS 2155-304 from 2008 to 2023 through a multi-epoch modeling of its spectral energy distributions", "comment": "submitted to MNRAS", "summary": "We present a detailed investigation of the temporal and spectral evolution of\nthe emission from the blazar PKS 2155-304, a high-synchrotron-peaked (HSP)\nblazar. Using $\\gamma$-ray, X-ray, optical/UV, and infrared data assembled from\nthe Markarian Multiwavelength Data Center, we constructed multi-band light\ncurves and temporally resolved spectral energy distributions (SEDs) of PKS\n2155-304 to probe the origin of its emission. The light curves show significant\nvariability, with fractional variability peaking at 0.75 in X-rays, 0.4 in the\noptical/UV, and 0.65 in $\\gamma$-ray band-consistent with expectations for\nHSPs. Segmenting the $\\gamma$-ray light curve with Bayesian blocks, we defined\n253 time-resolved epochs with adequate multi-band coverage and categorized them\ninto quiescent states (QS), multiwavelength flares (MWF), $\\gamma$-ray flares\n($\\gamma$F), X-ray flares (XF), and optical/UV flares (OUF). Each SED is\nmodeled within a synchrotron self-Compton (SSC) framework that\nself-consistently evolves particle injection and cooling; a neural-network\nsurrogate is used to accelerate parameter inference. Kolmogorov-Smirnov tests\nreveal state-dependent parameter variations relative to QS: (i) during MWF, the\nmagnetic field B, electron luminosity $L_{e}$, maximum electron Lorentz factor\n$\\gamma_{max}$, and Doppler factor $\\delta$ differ significantly; (ii) during\n$\\gamma$F, a harder electron index p is estimated; (iii) XF shows higher B and\n$\\gamma_{max}$ with a more compact emitting region; and (IV) during OUF,\nchanges in B, $L_{e}$, $\\gamma_{max}$, $\\delta$, and p are found while the\nemitting-zone size remains approximately constant. The jet power is\nelectron-dominated (magnetic-to-electron power ratio\n$\\eta_{B}\\simeq0.09-0.17$), with $\\eta_{B}$ rising during XF. These results\nsuggest that variations in acceleration efficiency and magnetization drive\nband-dependent flaring in PKS 2155-304."}
{"id": "2509.11837", "categories": ["astro-ph.HE", "astro-ph.EP", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2509.11837", "abs": "https://arxiv.org/abs/2509.11837", "authors": ["Miguel Orcinha", "Fernando Barão", "Bruna Bertucci", "Emanuele Fiandrini", "David Pelosi", "Nicola Tomassetti"], "title": "Understanding variations of galactic energetic particles in the heliosphere: modelling and radiation hazard assessment", "comment": "Submitted to 28th European Cosmic Rays Symposium (ECRS2024)\n  proceedings, to be published on the Central European Astrophysical Bulletin", "summary": "The intensity and energy spectrum of energetic charged radiation in the\nheliosphere are significantly influenced by solar activity. This phenomenon is\nknown as solar modulation of galactic cosmic rays.\n  As interplanetary travel becomes a reality, missions in low Earth orbit\nbecome longer and more frequent. In low Earth orbit we need to estimate the\ninfluence of Earth's magnetosphere accurately to assess the radiation hazard\nexperienced by astronauts during space missions, there is an emergent need for\naccurately depicting the space radiation environment and predicting the\ncosmic-ray flux in the heliosphere.\n  Here we present a new effective and predictive model of solar modulation\nwhich incorporates fundamental physics processes of particle transport such as\ndiffusion, convection, and adiabatic cooling to compute the energy spectrum;\nand temporal evolution of cosmic radiation in the inner heliosphere.\n  Empowered by this model and a time-dependent effective description of the\ngeomagnetic field, we will show our estimates of the dose rates experienced by\nastronauts over time, as they orbit Earth onboard the International Space\nStation and while travelling through interplanetary space."}
{"id": "2509.11850", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.11850", "abs": "https://arxiv.org/abs/2509.11850", "authors": ["Fabio Convenga"], "title": "Education and Outreach Across Seventeen Countries of the Pierre Auger Collaboration", "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC\n  2025). 12 pages, 4 figures", "summary": "The Pierre Auger Observatory, dedicated to measuring ultra-high energy cosmic\nrays, has been promoting for more than two decades educational and scientific\noutreach activities to make its results known in an understandable language to\ndiverse audiences. Among its most notable efforts, we can mention the creation\nof a visitor center at the Observatory site in Malarg\\\"ue, Argentina, the\nproduction of brochures, posters, videos, talks, and special actions with the\ncommunity in the site of the Observatory and beyond. In addition to joint\nefforts, collaborators from participating countries carry out local efforts,\nsome of them related to national initiatives in their respective regions, such\nas the International Cosmic Day, Masterclasses, exhibitions of artworks with\nthe theme of astroparticles, the Night of the Stars, European Researchers'\nNight, summer schools and initiatives to improve the gender balance in the\nscience community. In addition, there have been board games based on the\ndynamics of the observatory's work, online graphic viewers of the different\nevents, talks, workshops, etc. In recent years, the Pierre Auger Outreach group\nhas focused on presenting actions that directly impact the community in\nMalarg\\\"ue. However, this time, special emphasis will be placed on highlighting\nthe outreach efforts of Pierre Auger collaborators in various countries."}
{"id": "2509.11886", "categories": ["astro-ph.HE", "gr-qc", "physics.hist-ph"], "pdf": "https://arxiv.org/pdf/2509.11886", "abs": "https://arxiv.org/abs/2509.11886", "authors": ["M. Paola Vaccaro"], "title": "Astrophysics: a Modern Discipline with a Newtonian origin", "comment": "14 pages. This article is part of the theme issue \"Newton, Principia,\n  Newton Geneva Edition (17th-19th) and modern Newtonian mechanics: heritage,\n  past, and present\"", "summary": "Understanding the formation and evolution of stellar-mass binary black holes\n(BBHs) requires a thorough investigation of the key physical processes\ninvolved. While one pathway involves the isolated evolution of massive binary\nstars, affected by uncertain stages like core-collapse supernovae and common\nenvelope evolution, an alternative channel is dynamical formation in dense\nstellar environments. Newtonian gravity has traditionally provided a robust and\ncomputationally efficient framework for modeling large-scale gravitational\ninteractions. However, accurately capturing close encounters and black hole\nmergers necessitates the use of general relativity. This work focuses on\nassessing the applicability of post-Newtonian gravity in bridging these\nregimes, offering a physically insightful and computationally tractable\napproach to modeling BBH formation in the gravitational-wave era of astronomy."}
{"id": "2509.11945", "categories": ["astro-ph.HE", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2509.11945", "abs": "https://arxiv.org/abs/2509.11945", "authors": ["P. Jaroenjittichai", "S. Johnston", "S. Dai", "M. Kerr", "M. E. Lower", "R. N. Manchester", "L. S. Oswald", "R. M. Shannon", "C. Sobey", "P. Weltevrede"], "title": "Frequency evolution of pulsar emission: Further evidence for fan beam model", "comment": null, "summary": "Aims. We explore frequency-dependent changes in pulsar radio emission by\nanalyzing their profile widths and emission heights, assessing whether the\nsimple radius-to-frequency mapping (RFM) or the fan beam model can describe the\ndata. Methods. Using wideband (704-4032 MHz) Murriyang (Parkes) observations of\nover 100 pulsars, we measured profile widths at multiple intensity levels, fit\nGaussian components, and used aberration-retardation effects to estimate\nemission altitudes. We compared trends in width evolution and emission height\nwith a fan beam model. Results. Similar to other recent studies, we find that\nwhile many pulsars show profiles narrowing with increasing frequency, a\nsubstantial fraction show the reverse. The Gaussian decomposition of the\nprofiles reveals that the peak locations of the components vary little with\nfrequency. However, the component widths do, in general, narrow with increasing\nfrequency. This argues that propagation effects are responsible for the width\nevolution of the profiles rather than emission height. Overall, the evolution\nof the emission height with frequency is unclear, and clouded by the\nassumptions in the model. Spin-down luminosity correlates weakly with profile\nnarrowing but not with emission height. Conclusions. The classic picture where\npulsars emit at a single emission height which decreases with increasing\nobserving frequency cannot explain the diversity in behavior observed here.\nInstead, pulsar beams likely originate from extended regions at multiple\naltitudes, with fan-beam or patchy structures dominating their frequency\nevolution. Future models must incorporate realistic plasma physics and\nmulti-altitude emission to capture the range of pulsar behaviors."}
{"id": "2509.11960", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.11960", "abs": "https://arxiv.org/abs/2509.11960", "authors": ["Yilun Guan", "Sigurd Naess", "Ian Niebres", "Louis Branch", "Adam D. Hincks", "Hongbo Cai", "Allen Foster", "Carlos Hervías-Caimapo", "John P. Hughes", "Cristóbal Sifón", "Edward J. Wollack"], "title": "Atacama Cosmology Telescope: Constraints on the Millimetre Flux of the Crab Pulsar", "comment": "16 pages, 12 figures, submitted to ApJ", "summary": "Millimeter-wave observations of pulsars, while crucial for understanding\ntheir emission mechanisms, remain scarce. We demonstrate that high-precision\ncosmic microwave background (CMB) experiments like the Atacama Cosmology\nTelescope (ACT), though designed for cosmology, offer a unique capability for\nsuch time-domain science due to their high cadence and broad sky coverage in\nmillimeter bands. While previous ACT searches have focused on transients\nlasting minutes or longer, we develop and validate analysis methods to search\nfor periodic, millisecond-scale transients, a capability not typically\nassociated with CMB experiments. We describe a phase-resolved mapmaking\napproach, which leverages the known periodicity of the signal to enhance\nsensitivity and offers advantages in diagnosing systematic errors. We also\nintroduce a template-based fit to the raw data timestreams that independently\nvalidate our results. Applying these methods to estimate the millimeter flux of\nthe Crab Pulsar (PSR B0531+21), we derive 95% confidence upper limits of 4.6\nmJy, 4.4 mJy, and 20.7 mJy on the pulsar's period-averaged flux density at 96\nGHz, 148 GHz, and 225 GHz, respectively. These constraints fill a gap in our\nknowledge of the Crab Pulsar's spectral energy distribution, suggesting that it\ndoes not significantly flatten or invert at millimeter wavelengths. This work\ndemonstrates the potential for future searches of short-timescale astrophysical\nphenomena with the next-generation CMB experiments like the Simons Observatory."}
{"id": "2509.11996", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.11996", "abs": "https://arxiv.org/abs/2509.11996", "authors": ["Matías Sotomayor Webar", "Yosef Abed", "Dieter Horns"], "title": "Discovery of femto Gauss intergalactic magnetic fields towards Mkn 501", "comment": null, "summary": "The existence of intergalactic magnetic fields (IGMF) has so far not been\nestablished through observations. The IGMF is expected to be generated either\nvia processes mainly connected to astrophysical processes or it could be a\nrelic of phase transitions in the early universe. Upper bounds to the average\nfield present are set via observations of Faraday rotation measure. Lower\nbounds have been derived from the non-detection of secondary gamma-rays\npossibly produced in electromagnetic cascades. We investigate the presence of\nIGMFs by studying the GeV gamma-ray emission from the nearby blazar Mkn~501\n($z=0.034$), searching for evidence of the extended halo expected to be\nobserved around the point source. We analyse 14 years of data from Fermi-LAT\nand Swift-XRT/BAT to construct a time-average synchrotron-self Compton model\nfor the TeV spectrum of Mkn~501. This injection spectrum is used to simulate\nthe resulting cascade emission with the ELMAG code for different magnetic field\nand coherence length configurations. These templates are fit to the Fermi-LAT\ndata to find a best-fitting model for the cascade emission. We find significant\n($\\ge 5 \\sigma$ trial-corrected) evidence for extended secondary emission\naround Mkn~501, which is consistent with an IGMF with\n$B_\\mathrm{rms}=1.5_{-0.6}^{+1.6}\\times 10^{-15}~\\mathrm{G}$ and a coherence\nlength of $\\ell_C=(10\\pm 3)~\\mathrm{kpc}$. The source needs to actively inject\nTeV gamma-rays for at least 45000 years to match the level of secondary\nemission. Our results indicate that the secondary gamma-rays are significantly\npresent in the $\\it{Fermi}$-LAT data. The effect of plasma-heating by pairs in\nthe cascade appears to be negligible for Mkn 501. This is consistent with the\nobservation that Mkn~501 is one of the objects with the lowest injection power\namong the blazars studied in the context of cascade emission."}
{"id": "2509.12016", "categories": ["astro-ph.HE", "astro-ph.CO"], "pdf": "https://arxiv.org/pdf/2509.12016", "abs": "https://arxiv.org/abs/2509.12016", "authors": ["Q. Pan", "X. Y. Du", "Z. B. Zhang", "Y. F. Huang", "L. B. Li", "G. A. Li"], "title": "Revealing Event Rate of Repeating Fast Radio Bursts", "comment": "11 pages, 7 figures and 5 tables. Comments are welcome", "summary": "How the event rate of fast radio bursts (FRBs) evolves with redshift is a hot\ntopic to explore their cosmological origin and the circum-burst environment.\nParticularly, it is urgent to know what the difference of event rates between\nrepeating and non-repeating FRBs is. For the first time, we calculate the event\nrates of repeating FRBs detected by diverse telescopes at frequencies\nhigher/lower than 1 GHz in this work. Luminosity and redshift are found to be\npositively correlated with a power law form for both high- and low-frequency\nFRBs, showing an obvious evolution of luminosity with redshift. Furthermore, we\ncompare the differential luminosity and local event rate distributions of high-\nand low-luminosity FRBs at different frequencies. It is found that the event\nrates of these sub-samples of repeating FRBs similarly exceed the star\nformation rate at lower redshift than 1. Interestingly, we confirm with\nbootstrap method that the event rates of low-frequency FRBs exhibit different\nevolution patterns and are higher than that of high-frequency ones."}
{"id": "2509.12050", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.12050", "abs": "https://arxiv.org/abs/2509.12050", "authors": ["Aman Upadhyay", "Tanuman Ghosh", "Vikram Rana"], "title": "A Study of Spectral Variability between flaring and non-flaring state in M74 X-1", "comment": "Published in The Astrophysical Journal", "summary": "We conducted an extensive long-term spectral and timing study of the\nultraluminous X-ray source (ULX) M74 X-1, using data taken between 2001 and\n2021 by Chandra and XMM-Newton X-ray observatories. Our analysis shows that\nflares are present in some observations, whereas they are absent in others.\nFlaring state exhibits two-component spectra at a lower average flux level,\nwhereas the non-flaring state displays single-component spectra at a higher\naverage flux level. The M74 X-1 spectra are best described by the combination\nof accretion disk and Comptonization components, a dual thermal disk blackbody\nmodel, and a modified multi-temperature disk blackbody model. Using the dual\nthermal disk blackbody model, we obtain cool and hot temperatures of $T_{in}$\n(cool) = $0.38^{+0.08}_{-0.06}$ keV and $T_{in}$ (hot) = $1.67^{+0.18}_{-0.13}$\nkeV, respectively, suggesting two temperature emitting regions and indicating\npossible presence of outflowing wind along with the accretion disk. We found a\nGaussian feature at $E_{line}$ = $0.96^{+0.05}_{-0.11}$ keV with $\\sigma$ =\n$0.11^{+0.13}_{-0.06}$ keV in the spectra of the flaring state which can be\ninterpreted as the unresolved wind feature in the system when compared to\nsimilar feature seen in other ULXs. Plotting the hardness luminosity diagram,\nwe get a trend of increasing hardness with luminosity, suggesting the presence\nof geometrical beaming in a low-inclination system. Additionally, using the hot\ndisk blackbody component from the dual thermal disk blackbody model, we\nestimate the mass of the compact object to be M = $7.1^{+1.4}_{-1.3}$\nM$_\\odot$, classifying it as a stellar-mass black hole and confirming\nsuper-Eddington accretion in the system."}
{"id": "2509.12114", "categories": ["astro-ph.HE", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2509.12114", "abs": "https://arxiv.org/abs/2509.12114", "authors": ["Paulo E. Stecchini", "Francisco Jablonski", "Marcos P. Diaz", "Alexandre S. Oliveira", "Flavio D'Amico", "Natália Palivanas"], "title": "Spectral Energy Distribution Analysis of the Supersoft X-ray Source CAL 87: Multiwavelength Constraints", "comment": "Accepted for publication in The Journal of High Energy Astrophysics\n  (JHEAP)", "summary": "We analyse the spectral energy distribution (SED) of the eclipsing supersoft\nX-ray source CAL 87 covering wavelengths from X-rays to the near-infrared. Our\nstudy incorporates 26 data points across ultraviolet to near-infrared, sourced\nfrom published literature, unpublished data, and new observations. In addition,\narchival XMM-Newton spectra were used to represent the X-ray emission. Care was\ntaken to use out-of-eclipse flux measurements when the irradiated side of the\ncompanion faces the observer. The SED model includes contributions from a\ncentral source, a reprocessed accretion disk, and an irradiated companion star\natmosphere, resulting in a good match to the observed fluxes. The revised and\nnew parameters for the disk and the central source align with previous studies\nand match expectations for such systems. The temperature of the irradiated side\nof the companion star was estimated based on its B-V colour during the\nsecondary eclipse. This work highlights the importance of broad wavelength\ncoverage for understanding the properties of supersoft X-ray sources."}
{"id": "2509.12150", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.12150", "abs": "https://arxiv.org/abs/2509.12150", "authors": ["Allard Jan van Marle"], "title": "Combining PIC and MHD to model particle acceleration in astrophysical shocks", "comment": "Part of the conference proceedings of Stanfest 2024", "summary": "When supersonic plasma flows collide, many physical processes contribute to\nthe morphology of the resulting shock. One of these processes is the\nacceleration of non-thermal ions, which will, eventually, reach relativistic\nspeeds and become cosmic rays. This process is difficult to simulate in a\ncomputer model because it requires both macro-physics (the overall shape of the\nshock) and micro-physics (the interaction between individual particles and the\nmagnetic field). The combined PIC-MHD method is one of several options to get\naround this problem. It is based on the assumption that a plasma can be\ndescribed as a combination of a thermal gas, which can be accurately described\nas a fluid using grid-based magnetohydrodynamics (MHD) and a small non-thermal\ncomponent which has to be described as individual particles using\nparticle-in-cell (PIC). By combining aspects of both methods, we reduce the\ncomputational costs while maintaining the ability to trace the acceleration of\nindividual particles. We apply this method to a variety of astrophysical shock\nconfigurations to investigate if, and how, they can contribute to the cosmic\nray spectrum."}
{"id": "2509.12157", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.12157", "abs": "https://arxiv.org/abs/2509.12157", "authors": ["Xi Long", "Paul P. Plucinsky", "Terrance J. Gaetz", "Vinay L. Kashyap", "Aya Bamba", "William P. Blair", "Daniel Castro", "Adam R. Foster", "Charles J. Law", "Dan Milisavljevic", "Eric Miller", "Daniel J. Patnaude", "Manami Sasaki", "Hidetoshi Sano", "Piyush Sharda", "Benjamin F. Williams", "Brian J. Williams", "Hiroya Yamaguchi"], "title": "Chandra Large Project Observations of the Supernova Remnant N132D: Measuring the Expansion of the Forward Shock", "comment": "Accepted for publication in ApJ, 31 pages, 21 figures", "summary": "We present results from the Chandra X-ray Observatory Large Project (878 ks\nin 28 observations) of the Large Magellanic Cloud supernova remnant N132D. We\nmeasure the expansion of the forward shock in the bright southern rim to be\n$0.\\!^{\\prime\\prime}10 \\pm 0.\\!^{\\prime\\prime}02$ over the $\\sim14.5$ yr\nbaseline, which corresponds to a velocity of $1620\\pm400~\\mathrm{km\\,s^{-1}}$\nafter accounting for several instrumental effects. We measure an expansion of\n$0.\\!^{\\prime\\prime}23 \\pm 0.\\!^{\\prime\\prime}02$ and a shock velocity of\n$3840\\pm260~\\mathrm{km\\,s^{-1}}$ for two features in an apparent blowout region\nin the northeast. The emission-measure-weighted average temperature inferred\nfrom X-ray spectral fits to regions in the southern rim is $0.95\\pm0.17$ keV,\nconsistent with the electron temperature implied by the shock velocity after\naccounting for Coulomb equilibration and adiabatic expansion. In contrast, the\nemission-measure-weighted average temperature for the northeast region is\n$0.77\\pm0.04$ keV, which is significantly lower than the value inferred from\nthe shock velocity. We fit 1-D evolutionary models for the shock in the\nsouthern rim and northeast region, using the measured radius and propagation\nvelocity into a constant density and power-law profile circumstellar medium. We\nfind good agreement with the age of $\\sim2500$ years derived from optical\nexpansion measurements for explosion energies of $1.5-3.0 \\times\n10^{51}\\,\\mathrm{erg}$, ejecta masses of $2-6 \\,\\mathrm{M_{\\odot}}$ and ambient\nmedium densities of $\\sim0.33-0.66$ $\\mathrm{amu~cm}^{-3}$ in the south and\n$\\sim0.01-0.02$ $\\mathrm{amu~cm}^{-3}$ in the northeast assuming a constant\ndensity medium. These results are consistent with previous studies that\nsuggested the progenitor of N132D was an energetic supernova that exploded into\na pre-existing cavity."}
{"id": "2509.11215", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.11215", "abs": "https://arxiv.org/abs/2509.11215", "authors": ["D. O. Kudryavtsev", "S. A. Trushkin", "P. G. Tsybulev", "V. A. Stolyarov"], "title": "Neural networks in the search for fast radio bursts with RATAN-600", "comment": "Accepted for publication in Astronomy and Computing", "summary": "We present a technique to search for fast radio bursts in records obtained\nwith broadband radiometers having few radio channels. The technique is applied\nto the RATAN-600 surveys carried out at its Western Sector since the year 2017.\nA 1D convolutional neural network for multichannel time series classification\nis developed based on the EfficientNet family of models. The procedure to\ngenerate synthetic FRB signals needed for the training dataset is described. We\nimplement a two-stage cascade scheme to effectively suppress the rate of false\npositive detections. Evaluation of the trained model is provided based on the\nsynthetic events and the giant pulse of the Crab Pulsar."}
