{"id": "2511.16714", "categories": ["astro-ph.IM", "astro-ph.EP"], "pdf": "https://arxiv.org/pdf/2511.16714", "abs": "https://arxiv.org/abs/2511.16714", "authors": ["Benjamin J. Farcy", "Darryl Z. Seligman", "Kathleen E. Mandt", "John W. Noonan", "Sarah E. Anderson"], "title": "Habitable from the start: How initial planetary formation conditions may create habitable worlds", "comment": "5 pages with references, submitted in response to the NASA Decadal Astrobiology Research and Exploration Strategy (NASA-DARES 2025) call for white papers", "summary": "The breadth of topics that encompass the search for life has expanded and evolved significantly since the emergence of the field of astrobiology. Initial astrobiology centered investigations focused on detecting biosignatures in the Martian soil with the Viking lander. The field now encompasses identification of biosignatures throughout the galaxy and habitable worlds, planets with sufficient liquid water and prebiotic chemistry to support life. This evolution mirrors the improvement in our understanding of environments that may harbor life. The bulk planetary chemistry governs the habitability of a planet, which is in turn set by the early solar system environment and planet formation processes. Therefore, investigations of solar and exoplanetary systems as a whole would provide insights into the factors that make a planet habitable. Bulk planetary chemistry govern planetary atmospheres, core sizes, magnetic fields, heat engines, volatile inventories, and silicate mantle compositions. We therefore advocate for investigations of formation conditions that establish planetary chemistry, and by extension, habitability."}
{"id": "2511.16749", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2511.16749", "abs": "https://arxiv.org/abs/2511.16749", "authors": ["Shivani Harer", "Maxime Vincent", "Hubert Halloin", "Ouali Acef", "Nisrine Arab", "Romain Arguel", "Axel Arhancet", "Damien Bachet", "Nathalie Besson", "Sébastien Bize", "Sara Bruhier", "Christelle Buy", "Michael Carle", "Jean-Pierre Coulon", "Nicoleta Dinu-Jaeger", "Mathieu Dupont", "Christophe Fabron", "Rémi Granelli", "David Holleville", "Dominique Huet", "Eric Kajfasz", "Mickael Lacroix", "Matthieu Laporte", "Michel Lintz", "Christophe Meessen", "Mourad Merzougui", "Alexis Mehlman", "Marco Nardello", "Laure Oudda", "Benjamin Pointard", "Pierre Prat", "Emmanuelle Rivière", "Jérôme Royon", "Aurélia Secroun", "Samuel Sube", "Thomas Zerguerras", "Julien Zoubian"], "title": "Validation of optical pathlength stability in a LISA test-bench demonstrator", "comment": "27 pages, 11 figures", "summary": "The Laser Interferometer Space Antenna (LISA) observatory is a future L3 mission of the European Space Agency (ESA) to detect gravitational waves, set to launch in 2035. The detector constellation will conduct interferometry to picometer stability over an unprecedented arm length of 2.5 million km. In this paper, we present the development and testing results for the Zerodur interferometer (ZIFO), an optical demonstrator built to validate critical technology for the test setup of the interferometric core of LISA. Optical path length stability measurements on the ZIFO demonstrate successful reduction of bench noise to maintain the 10 pm/$\\sqrt{\\text{Hz}}$ specification across the 1 mHz to 1 Hz frequency band. We also identify and characterize dominant noise sources from phasemeters and correlations of beam tilt into the path length that were observed during the test campaign."}
{"id": "2511.16750", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2511.16750", "abs": "https://arxiv.org/abs/2511.16750", "authors": ["Miquel Llorens-Monteagudo", "Alejandro Torres-Forné", "José A. Font"], "title": "CLAWDIA: A dictionary learning framework for gravitational-wave data analysis", "comment": "20 pages, 6 figures", "summary": "Deep-learning methods are becoming increasingly important in gravitational-wave data analysis, yet their performance often relies on large training datasets and models whose internal representations are difficult to interpret. Sparse dictionary learning (SDL) offers a complementary approach: it performs well in scarce-data regimes and yields physically interpretable representations of gravitational-wave morphology. Here we present CLAWDIA (Comprehensive Library for the Analysis of Waves via Dictionary-based Algorithms), an open-source Python framework that integrates SDL-based denoising and classification under realistic detector noise. We systematise previously isolated SDL workflows into a unified, modular environment with a consistent, user-friendly interface. The current release provides several time-domain denoising strategies based on LASSO-regularised sparse coding and a classifier based on Low-Rank Shared Dictionary Learning. A companion toolbox, GWADAMA, supports dataset construction and realistic conditioning of real and simulated interferometer data. We demonstrate CLAWDIA's performance by denoising the signal from binary neutron star event GW170817 and by classifying families of instrumental glitches from LIGO's third observing run, highlighting robustness at low signal-to-noise ratios. CLAWDIA is intended as a community-driven, interoperable library extensible to additional tasks, including detection and parameter estimation."}
{"id": "2511.16754", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2511.16754", "abs": "https://arxiv.org/abs/2511.16754", "authors": ["Douglas P. Finkbeiner", "Joshua S. Speagle", "Tanveer Karim"], "title": "Data-Driven Stellar Spectral Modelling with GSPICE", "comment": "18 pages, 12 figures", "summary": "Spectral data reduction pipelines deal with a wide variety of challenges including masking cosmic rays, calibrating wavelength solutions, and estimating background noise while trying to remain model-agnostic. Traditional methods rely on hardware-specific code or pre-calculated stellar model templates to solve this problem, making them model-dependent and not suitable for large datasets that may contain new classes of objects. To solve this problem, we present a flexible, data-driven method: the GausSian PIxelwise Conditional Estimator (GSPICE) that models an ensemble of spectra as a multivariate Gaussian and estimates the expected value and expected variance of each pixel in each spectrum conditional on others. GSPICE compares observed fluxes and errors to its own flux and error estimates to reveal outliers, which then can be completely masked or replaced by their estimates. We apply GSPICE to 3.9 million stellar spectra from the LAMOST survey, and show that variations of the method can directly identify and correct both individual pixel-level outliers (e.g., from cosmic ray hits) as well as extended systematic features (e.g., from incorrect wavelength calibrations), while still providing a novel characterization of the true per-pixel measurement uncertainties. We also demonstrate how GSPICE can take advantage of data partitioning with an application to diffuse interstellar bands. Implementations of GSPICE in both Python and IDL can be found here http://github.com/dfink/gspice."}
{"id": "2511.16706", "categories": ["astro-ph.HE", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2511.16706", "abs": "https://arxiv.org/abs/2511.16706", "authors": ["Fronefield Crawford", "Haoyang Xu"], "title": "No Pulsar Detected in Reprocessed Archival Parkes Observations of SNR 1987A", "comment": "Published in RNAAS; 3 pages, 1 table", "summary": "We have reprocessed the available archival radio pulsar search observations of SNR 1987A taken with the Parkes 64-m telescope, some of which have not been previously published. We conducted a standard periodicity search on these data as well as a single pulse search at a range of dispersion measures. We found no convincing candidate signals, and we calculate flux density, luminosity, and single pulse fluence limits from these observations. The derived luminosity limits are comparable to the luminosities of three young, energetic pulsars (the Crab pulsar, PSR B0540$-$69, and PSR J0537$-$6910), and so we cannot rule out the existence of a pulsar in SNR 1987A with a similar radio luminosity."}
{"id": "2511.16780", "categories": ["astro-ph.IM", "astro-ph.EP"], "pdf": "https://arxiv.org/pdf/2511.16780", "abs": "https://arxiv.org/abs/2511.16780", "authors": ["Robert J. S Airey", "Paul Chote", "James A. Blake", "James McCormac", "Billy Shrive", "Don Pollacco", "Benjamin F. Cooke"], "title": "Lord of the (sub-)Rings : Mapping the surface reflectance and spin-axis of Ajisai", "comment": "12 pages, 13 figures", "summary": "Active debris removal techniques are posed to become an important tool in maintaining the safety of the near-Earth space environment. These techniques rely on a clear understanding of the rotational motion of the debris targets, which is challenging to constrain from unresolved imaging. The Ajisai satellite provides an ideal test case for developing and demonstrating these techniques due to its simple geometry and well constrained spin behaviour. We present four observations of the Ajisai satellite taken with SuperWASP in August of 2019, where high cadence photometry was extracted from streaked images as a part of a larger survey of Low Earth Orbit. We develop an MCMC-driven method to determine the spin-state of Ajisai by comparing the alignment between a map of modelled mirror positions and a novel derived map of surface reflectivity. We generally find good agreement within the expectation and uncertainties set by empirical models and our determined spin-state solutions align the surface reflectivity map and modelled mirror location well. Our results show that streak photometry can be used to recover the spin-axis and rotation period of fast-spinning objects such as Ajisai using modest ground-based instrumentation, making it readily scalable to a wider range of targets and observatories."}
{"id": "2511.16755", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.16755", "abs": "https://arxiv.org/abs/2511.16755", "authors": ["David Calvert", "Michael Redle", "Bibek Gautam", "Charles J. Stapleford", "Carla Fröhlich", "James P. Kneller", "Matthias Liebendorfer"], "title": "Turbulence in Core-Collapse Supernovae", "comment": "27 pages, 16 figures. Accepted to ApJ. Data behind the figures available at https://zenodo.org/records/17555447", "summary": "It is understood in a general sense that turbulent fluid motion below the shock front in a core-collapse supernova stiffens the effective equation of state of the fluid and aids in the revival of the explosion. However, when one wishes to be precise and quantify the amount of turbulence in a supernova simulation, one immediately encounters the problem that turbulence is difficult to define and measure. Using the 3D magnetohydrodynamic code ELEPHANT, we study how different definitions of turbulence change one's conclusions about the amount of turbulence in a supernova and the extent to which it helps the explosion. We find that, while all the definitions of turbulence we use lead to a qualitatively similar growth pattern over time of the turbulent kinetic energy in the gain region, the total amount of turbulent kinetic energy, and especially the ratios of turbulent to total kinetic energy, distinguish them. Some of the definitions appear to indicate turbulence is a necessary contributor to the explosion, and others indicate it is not. The different definitions also produce turbulence maps with different correlations with maps of the enstrophy, a quantity widely regarded as also indicating the presence of turbulence. We also compute the turbulent adiabatic index and observe that in regions of low enstrophy, this quantity is sensitive to the definition used. As a consequence, the effective adiabatic index depends upon the method used to measure the turbulence and thus alter one's conclusions regarding the impact of turbulence within the supernova."}
{"id": "2511.16861", "categories": ["astro-ph.IM", "gr-qc", "hep-ph"], "pdf": "https://arxiv.org/pdf/2511.16861", "abs": "https://arxiv.org/abs/2511.16861", "authors": ["Man Leong Chan", "Jess McIver", "Yannick Lecoeuche", "Dhatri Raghunathan", "Sofía Álvarez-López", "Julian Ding", "Annudesh Liyanage", "Raymond Ng", "Heather Fong"], "title": "GSpyNetTreeS: a machine learning solution for glitch localization in time and frequency", "comment": null, "summary": "Data from ground-based gravitational wave detectors are often contaminated by non-Gaussian instrumental artifacts or detector noise transients. Unbiased source property estimation relies on the ability to correctly identify and characterize these artifacts and remove them if necessary. To this end, the LIGO-Virgo-KAGRA Collaboration has implemented candidate vetting for all significant candidates to identify the presence of artifacts and assess the need for mitigation. The current candidate vetting process requires human experts to identify the frequency ranges and the time windows associated with any data quality issues present. Differences in judgment between human experts may cause inconsistency, making results difficult to reproduce across gravitational wave events. We present GSpyNetTreeS, an extension to GSpyNetTree based on the You Only Look Once algorithm, for the automatic detection, classification, and time-frequency localization of detector noise transients. As a proof of concept, we tested GSpyNetTreeS's performance on the data collected by the LIGO detectors during the third observing run for gravitational waves as well as common detector glitch classes included in GSpyNetTree: Blip, Low frequency blip, Low frequency line and Scratchy. We also demonstrated that GSpyNetTreeS is capable of accurately identifying common glitch classes and capturing the frequency and time information associated with detected detector noise transients, establishing its potential as an automatic event validation tool for LIGO-Virgo-KAGRA's observing runs."}
{"id": "2511.16759", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2511.16759", "abs": "https://arxiv.org/abs/2511.16759", "authors": ["Isiah M. Holt", "M. Coleman Miller", "Alexander J. Dittmann", "Frederick K. Lamb"], "title": "An Investigation of Systematic Effects from Background Priors on PSR J0740$+$6620 Radius Estimates using Synthetic NICER and XMM-Newton Data", "comment": "19 pages, 7 figures, 4 tables. Submitted to ApJ", "summary": "Accurate and precise measurements of neutron star radii provide invaluable information about the cold, dense matter in neutron star cores. Analyses of synthetic X-ray pulse waveform data similar to the data obtained from non-accreting neutron stars using the Neutron star Interior Composition Explorer (NICER) have indicated that mass and radius estimates made using such data are robust against some systematic errors that may be made when modeling these data, such as errors in the assumed pattern of the thermal X-ray emission from the surface of these stars. A potentially important but so far unexplored source of systematic error is misparameterization of unmodulated background components, which can bias the inferred radius, particularly when data from different telescopes are used in the analysis. In this study, we investigate the effects of the background model on radius estimates by jointly analyzing synthetic NICER and XMM-Newton data, using the $\\sim 2.1~M_\\odot$ pulsar PSR~J0740$+$6620 as a prototypical example. Our analysis shows that even if the background assumed in the model underestimates the actual background by a factor of more than five, the resulting shift of the radius posterior from the true value of the radius corresponds to only $\\sim1σ$. In all the cases we examined, the Bayesian evidence for the correct background model is greater than for the incorrect background model. These results add to the evidence that analyses of NICER-like data provide accurate measurements of neutron star radii when the statistical sampling is thorough and the model fits the data well."}
{"id": "2511.16967", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2511.16967", "abs": "https://arxiv.org/abs/2511.16967", "authors": ["Oliver Jeong", "Jacques Delabrouille", "Michel Piat"], "title": "Fast far-sidelobe modeling for centimeter to sub-millimeter astrophysical observations", "comment": null, "summary": "Next-generation centimeter to sub-millimeter telescopes require exquisite control over instrumental far-sidelobe response to accurately measure faint signals like the Cosmic Microwave Background B modes. Because existing electromagnetic modeling methods are computationally expensive, we developed a novel, diffraction-based beam modeling method for rapid and low-cost calculations. We applied this methodology to model the BICEP3 far-sidelobes and found good qualitative agreement with in situ beam measurements. Using this validated simulated beam, we calculated the sidelobe temperature pickup for a specific observation scenario: scanning near the slopes of Cerro Toco in the Atacama Desert. This rapid, predictive framework is most valuable as a tool for optimizing instrument baffling and identifying efficient scan strategies during the conceptual design phase."}
{"id": "2511.16764", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.16764", "abs": "https://arxiv.org/abs/2511.16764", "authors": ["Seth Gagnon", "Yichao Lin", "Alexander Lange", "Hui Yang", "Noel Klingler", "Jeremy Hare", "Oleg Kargaltsev"], "title": "The nature of UHE source 1LHAASO J1740+0948u and its connection to PSR J1740+1000", "comment": "Accepted to ApJ 17 pages, 7 figures, 2 tables", "summary": "We present multi-wavelength analysis of 1LHAASO J1740+0948u and its surroundings including the pulsar wind nebula of middle-aged pulsar PSR J1740+1000. Although a dozen X-ray sources are found within the UHE emission site, careful analysis shows that they are unlikely to produce the observed UHE emission. The most likely particle accelerator is pulsar J1740+1000 which if offset by 13' north of the UHE source but appears to be connected to it by an extended feature seen in X-rays. For a plausible pulsar distance of 1.2 kpc, 1LHAASO J1740+0948u must be located about 5 pc away which requires rapid transport of electrons along the feature to avoid radiative losses. This poses several challenges for standard pulsar theory. Firstly, being produced $\\lesssim$ 10 kyrs ago, particles must have been accelerated to the energy corresponding to a large fraction of the pulsar's full potential drop across the polar cap. Secondly, due to the lack of TeV emission extension toward the pulsar, particles must be accumulating in the UHE region. In this context, we discuss two possible scenarios: a tail filled with pulsar wind and confined by the bow-shock due to the fast pulsar's motion and an ISM filament filled by the most energetic pulsar wind particles escaping from the apex of the bow-shock."}
{"id": "2511.16970", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2511.16970", "abs": "https://arxiv.org/abs/2511.16970", "authors": ["Jacques Delabrouille", "Oliver Jeong", "Michel Piat", "Alexander Steier"], "title": "A novel double-rim forebaffle design for centimeter to sub-millimeter astrophysical observations", "comment": null, "summary": "Stray radiation of various origin is a major source of degradation of centimeter to sub-millimeter astronomical observations. This is particularly problematic for the detection of signals such as faint cosmic microwave background polarization B modes, or for mapping large-scale extragalactic or Galactic diffuse emission. In this paper, we propose a double-rim forebaffle design to reduce the impact of such stray radiation contamination. Using qualitative arguments and numerical simulations, we show that such a design has the potential to substantially improve the quality of future observations."}
{"id": "2511.16800", "categories": ["astro-ph.HE", "astro-ph.CO", "hep-ph"], "pdf": "https://arxiv.org/pdf/2511.16800", "abs": "https://arxiv.org/abs/2511.16800", "authors": ["Julien Lavalle", "Pierre Salati"], "title": "In-depth analysis of the clustering of dark matter particles around primordial black holes. Part II. Analytical prescriptions for spikes", "comment": "59 pages, 13 figures", "summary": "Primordial black holes (PBHs) are very appealing dark matter (DM) candidates. It is highly plausible though, should they exist, that they would not make up all of the DM. Several studies showed that if the rest of DM is made of thermal particles, then these should accumulate around such PBHs, leading to the formation of very dense spikes in the radiation era. We contributed a detailed analytical study about this phenomenon, providing clear explanations as for the origin of scaling relations in the form of power-law density profiles with up to 3 different spectral indices, i.e. $3/4$, $3/2$, and $9/4$, and 4 asymptotic regimes. Here, we further derive an approximate analytical solution that enables fast numerical predictions for the density profiles of these spikes. We also address the specific case of self-annihilating DM species and derive new approximate analytical formulae. Our approximate density yields the correct annihilation rate within $\\pm 15\\%$ precision. We then focus on indirect detection in the cosmic microwave background and in extragalactic gamma-rays. We shed new and subtle light on how mutually exclusive PBHs and self-annihilating DM species can really be. In particular, the discovery of a population of sub-solar PBHs would set stringent constraints on the $s$-wave annihilation cross-section of these particles, a point so far missed in the literature."}
{"id": "2511.17061", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2511.17061", "abs": "https://arxiv.org/abs/2511.17061", "authors": ["Felix Stoehr", "Andrea Farago", "Stefan Curiban", "Alisdair Manning", "Jorge Garcia", "Pei-Ying Hsieh", "Andrew Lipnicky", "Adele Plunkett"], "title": "Morphological Image Similarity Search on the ALMA Science Archive Query Interface Using Deep Unsupervised Contrastive Representation Learning", "comment": "3 pages, 2 figures", "summary": "With the exponential growth of astronomical data over time, finding the needles in the haystack is becoming increasingly difficult. The next frontier for science archives is to enable searches not only on observational metadata, but also on the content of the observations themselves. As a step in this direction, we have implemented morphological image similarity search into the ALMA Science Archive (ASA). To achieve this we use self-supervised contrastive affine-transformation-independent representation learning of source morphologies with a deep neural network. For a given image on the ASA web interface, astronomers are presented with a summary view of the morphologically most similar images. Each time an astronomer selects an additional image from that view, the display is instantly updated to show the images most similar to the combination of the selected images. Each selection thus refines the similarity display according to the scientific needs of the astronomer. This is the first time image similarity search has been offered in an astronomical science archive."}
{"id": "2511.16869", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.16869", "abs": "https://arxiv.org/abs/2511.16869", "authors": ["Shuying Zhou", "Mouyuan Sun", "Guobin Mou", "Da-bin Lin", "Tong Liu", "Ming-Xuan Lu", "Yongquan Xue"], "title": "Which active galaxies might be neutrino emitters?", "comment": "11 pages, 3 figures, 1 table. accepted to ApJ. Comments welcome", "summary": "The IceCube Neutrino Observatory has identified several individual neutrino emitters associated with supermassive black hole accretion phenomena, including blazars, tidal disruption events, and, unexpectedly, Seyfert galaxies. A key open question is which types of active galactic nuclei (AGNs) are most likely to be neutrino emitters. Here we show that high-confidence extragalactic neutrino emitters tend not only to have higher hard X-ray fluxes but also to be more variable in mid-infrared (MIR) than other AGNs in the \\textit{Swift} BAT AGN Spectroscopic Survey. MIR variations effectively trace long-term fluctuations in AGN accretion disks and/or jets. In addition to the role of X-ray flux emphasized in previous studies, we speculate that long-term central engine fluctuations may also be critical for neutrino production. This hypothesis may inform IceCube neutrino-electromagnetic counterpart association studies and provide new insights into cosmic ray acceleration sites. First, the observed neutrinos are unlikely to originate from AGN host galaxies or from interactions between large-scale (dozens of parsecs) winds/outflows and the surrounding interstellar medium. Second, if neutrinos are produced in the X-ray corona, the corona should exhibit strong magnetic turbulence dissipation or magnetic reconnection whose rate changes substantially on timescales of years. Third, the relativistic jets of blazar neutrino emitters may be intrinsically unstable over years. Finally, if neutrinos are related to interactions between small-scale winds/outflows and torus clouds, such winds/outflows must be highly episodic."}
{"id": "2511.17139", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2511.17139", "abs": "https://arxiv.org/abs/2511.17139", "authors": ["Zbigniew Plebaniak"], "title": "From Ground to Space: An Overview of the JEM-EUSO Program for the Study of UHECRs and Astrophysical Neutrinos", "comment": "Proceedings for the 39th International Cosmic Ray Conference, 15-24 July 2025, Geneva, Switzerland", "summary": "The JEM-EUSO (Joint Exploratory Missions for Extreme Universe Space Observatory) collaboration is an international initiative studying ultra-high-energy cosmic rays and related phenomena. These particles, with energies exceeding 10$^{20}$~eV, provide insights into extreme astrophysical processes but remain challenging to detect due to their low flux. At the heart of JEM-EUSO's technology is an ultra-fast, highly sensitive UV camera capable of detecting EASs in the atmosphere with exceptional spatial and temporal resolution. A dedicated Cherenkov camera has been developed to evaluate the viability of the Earth-skimming technique from high altitudes. Fluorescence and Cherenkov detectors can be used together to create a hybrid detection surface. This innovative approach enables detailed studies of fluorescence and Cherenkov light from cosmic ray and neutrino interactions. The JEM-EUSO technology will allow for observations from space to significantly increase the exposure to these rare phenomena. The collaboration employs a multi-platform strategy with ground-based experiments like EUSO-TA calibrating detection systems and validating models, and balloon-borne missions such as EUSO-Balloon and EUSO-SPB1/SPB2 demonstrating observations from the stratosphere and testing technologies. Space-based missions, particularly Mini-EUSO on the ISS, have provided valuable data on UV backgrounds, TLEs, and meteoroids, as well as demonstrating the potential for future space-based detection. While we are developing a cross-platform methodology, we are ultimately moving towards space-based measurements. Future efforts include the POEMMA space mission, designed for stereoscopic observations of UHECRs and multi-messenger phenomena, the PBR experiment, which integrates radio detection and is scheduled to fly in 2027, and the M-EUSO satellite mission, proposed to ESA."}
{"id": "2511.16874", "categories": ["astro-ph.HE", "astro-ph.SR", "hep-ph", "nucl-th"], "pdf": "https://arxiv.org/pdf/2511.16874", "abs": "https://arxiv.org/abs/2511.16874", "authors": ["G. Teruya", "G. Lugones", "A. G. Grunfeld"], "title": "Self-bound quark stars with a first-order two-to-three flavor phase transition", "comment": "14 pages, 12 figures", "summary": "We investigate self-bound quark stars in a flavor-dependent quark-mass density-dependent (QMDD) model with an excluded-volume correction. We chart the parameter space at zero pressure to identify self-bound regimes, including cases with a first-order $ud \\to uds$ transition, and construct cold, $β$-equilibrated stellar sequences via the Tolman-Oppenheimer-Volkoff equations. The excluded-volume parameter $κ$ controls the stiffness of the equation of state and thus masses, radii, tidal deformabilities, and moments of inertia. Intermediate repulsion typically reconciles $M_{\\max} \\gtrsim 2\\,M_\\odot$ with current radius/tidal constraints, with hybrid self-bound objects more compatible than pure strange-quark stars. We identify three EOS-insensitive trends $-$ dimensionless moment of inertia vs. compactness, tidal deformability vs. compactness, and gravitational vs. baryonic compactness $-$ whose explicit $κ$-dependence largely disappears in dimensionless form (the first two being notably tighter than the third). These results provide model-guided priors and tools for discriminating between hadronic and self-bound EOS families with multimessenger data."}
{"id": "2511.17307", "categories": ["astro-ph.IM", "astro-ph.CO"], "pdf": "https://arxiv.org/pdf/2511.17307", "abs": "https://arxiv.org/abs/2511.17307", "authors": ["Jonghwan Rhee", "Richard Dodson", "Alexander Williamson", "Martin Meyer", "Kristóf Rozgony", "Pascal J. Elahi", "Matthew Whiting", "Daniel Mitchell", "Tobias Westmeier"], "title": "Deep Investigation of Neutral Gas Origins (DINGO): Options for robust Deep Spectral Line Imaging in the SKA-Era", "comment": "submitted to MNRAS, along with \"Deep Investigation of Neutral Gas Origins (DINGO): Options for the Processing and Storage of Radio Astronomy Data for robust Deep Spectral Line Imaging in the SKA-Era using uv-Grids\"", "summary": "The data storage requirements for deep spectral line observations with next-generation radio interferometers like the Australian Square Kilometre Array Pathfinder (ASKAP) and the Square Kilometre Array (SKA) are extremely challenging. The default strategy is to reduce data after each daily observation and stack the resulting images. Although this approach is computationally efficient, it risks propagating systematic errors and significantly degrades the final data quality. However, storage and computation requirements for a traditional way to image the entire deep dataset together are prohibitively expensive. We present an alternative \\textit{uv}-grid stacking method and compare its scientific outcomes with both the traditional approach, which processes all data jointly and serves as the best-possible result, and the default image-stacking method. Our technique involves halting the standard imaging pipeline after the daily residual visibility grids are formed. These grids are then stacked and jointly deconvolved to combine many epochs of data. Using the traditional approach as a benchmark, we show that image-stacking recovers only 92\\% of the true {\\HI} flux. In contrast, our \\textit{uv}-grid stacking method recovers 99\\%, which is in excellent agreement with the traditional method within the noise limits. Furthermore, image-stacking introduces significant non-physical artefacts, such as negative bowls around strong sources, indicating poor deconvolution and a loss of physical information. Based on these findings, we intend to apply the \\textit{uv}-grid stacking to the Deep Investigation of Neutral Gas Origins (DINGO) survey on ASKAP and strongly recommend this or a similar approach for future radio astronomy facilities."}
{"id": "2511.16891", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.16891", "abs": "https://arxiv.org/abs/2511.16891", "authors": ["Jonhatan U. Guerrero-González", "Vahram Chavushyan", "Víctor M. Patiño-Álvarez"], "title": "Exploring Emission Line Variability and Jet-Broad Line Region Interaction in the Blazar TON 599", "comment": "12 pages, 5 figures, accepted for publication in Contributions of the Astronomical Observatory Skalnaté Pleso (CAOSP). Refereed Proceedings of the 15th Serbian Conference on Spectral Line Shapes in Astrophysics", "summary": "Blazars, a highly variable Active Galactic Nuclei (AGNs) subclass, provide a unique opportunity to explore the physical processes within their relativistic jets and emission regions. In this study, we investigate the multiwavelength variability of the blazar TON 599, a Flat Spectrum Radio Quasar (FSRQ), with a particular emphasis on its emission line behavior. We focus on the Mg II $λ$2798 Å emission line, a key tracer of the ionized gas in the broad-line region (BLR), and its role in jet-induced variability. In addition to optical emission lines, we analyze gamma-rays (0.1-300 GeV), X-rays (0.2-10 keV), optical continuum ($λ$3000 Å), optical polarization, and millimeter-wavelength light curves. Three cross-correlation methods are employed to investigate temporal relationships between the emission line and continuum across various wavelengths. Using the Non-Thermal Dominance (NTD) parameter, our analysis confirms that synchrotron emission dominates the continuum during active states, highlighting the jet's primary role in the observed variability. The Mg II emission line exhibits quasi-simultaneous variability with the optical continuum, suggesting photoionization driven by the jet's non-thermal radiation. Additionally, the minimal time lag between gamma-ray and optical/near-ultraviolet emissions supports a synchrotron self-Compton origin for the most variable component of the gamma-ray emission. These findings highlight the importance of emission line variability and multiwavelength observations in constraining the interaction between jets and the BLR in blazars. The results contribute to a deeper understanding of AGN emission mechanisms and the complex interplay between jets and their surrounding environments."}
{"id": "2511.17410", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2511.17410", "abs": "https://arxiv.org/abs/2511.17410", "authors": ["Hendrik Müller", "Mingyu Hsieh", "Sanjay Bhatnagar"], "title": "Accelerating the CLEAN algorithm of radio interferometry with convex optimization", "comment": "accepted for publication A&A", "summary": "In radio-interferometry, we recover an image from an incompletely sampled Fourier data. The de-facto standard algorithm, the Cotton-Schwab CLEAN, is iteratively switching between computing a deconvolution (minor loop) and subtracting the model from the visibilities (major loop). The next generation of radio interferometers is expected to deal with much higher data rates, image sizes and sensitivity, making an acceleration of current data processing algorithms necessary. We aim to achieve this by evaluating the potential of various well-known acceleration techniques in convex optimization to the major loop. For the present manuscript, we limit the scope to study these techniques only in the CLEAN framework. To this end, we identify CLEAN with a Newton scheme, and use this chain of arguments backwards to express Nesterov acceleration and conjugate gradient orthogonalization in the major and minor loop framework. The resulting algorithms are simple extensions of the traditional framework, but converge multiple times faster than traditional techniques, and reduce the residual significantly deeper. These improvements achieved by accelerating the major loop are competitive to well-known improvements by replacing the minor loop with more advanced algorithms, but at lower numerical cost. The best performance is achieved by combining these two developments.CLEAN remains among the fastest and most robust algorithms for imaging in radio interferometry, and can be easily extended to an almost an order of magnitude faster convergence speed and dynamic range. The procedure outlined in this manuscript is relatively straightforward and could be easily extended."}
{"id": "2511.17084", "categories": ["astro-ph.HE", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2511.17084", "abs": "https://arxiv.org/abs/2511.17084", "authors": ["Anders Jerkstrand"], "title": "Spectral synthesis techniques for supernovae and kilonovae", "comment": "Invited review article for Living Reviews in Computational Astrophysics, August 2025", "summary": "Supernovae (SNe) and kilonovae (KNe) are the most violent explosions in cosmos, signalling the destruction of a massive star (core-collapse SN), a white dwarf (thermonuclear SN) and a neutron star (KN), respectively. The ejected debris in these explosions is believed to be the main cosmic source of most elements in the periodic table. However, decoding the spectra of these transients is a challenging task requiring sophisticated spectral synthesis modelling. Here, the techniques for such modelling is reviewed, with particular focus on the computational aspects. We build from a historical review of how methodologies evolved from modelling of stellar winds, to supernovae, to kilonovae, studying various approximations in use for the central physical processes. Similarities and differences in the numeric schemes employed by current codes are discussed, and the path towards improved models is laid out."}
{"id": "2511.17488", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2511.17488", "abs": "https://arxiv.org/abs/2511.17488", "authors": ["Brianna Peck", "Jessica R. Lu", "Lianqi Wang", "Brooke DiGia", "Richard Dekany", "Antonin H. Bouchez", "Peter Wizinowich", "Maxwell A. Millar-Blanchaer", "Mark Chun", "Philip Hinz", "Charles-Antoine Claveau"], "title": "Performance Simulations for Kola: Achieving High-Resolution, Visible-Light AO Correction Over a 1 Arcminute Field", "comment": "18 pages, 9 figures", "summary": "We present performance simulations for a proposed visible-light, multi-conjugate adaptive optics system for the 10-meter W. M. Keck I telescope that aims to deliver near diffraction-limited angular resolution at optical wavelengths. Our proposed architecture, the Keck Optical Laser Guide Star Adaptive Optics System (KOLA), combines multiple laser guide stars (LGS) and deformable mirrors to enable wide-field correction across a 60 arcsecond field of view. Simulations were conducted using the open-source Multi-Threaded Adaptive Optics Simulator (MAOS), which we validated against on-sky data for the current Keck I adaptive optics system. We evaluated KOLA performance across a range of design parameters and report key point spread function metrics, including Strehl ratio, full width at half maximum, and encircled energy radius. Example science-driven requirements include resolving black hole spheres of influence, probing crowded stellar fields, and imaging protoplanetary disks. Trade studies on actuator count and laser guide star configuration help inform future design decisions. We present a nominal KOLA design (10 LGS, 3 tip-tilt natural guide stars (TTNGS), and 3600 actuators on the adaptive secondary mirror). Performance simulations show a 15 mas angular resolution with a Strehl ratio of 34% at 652 nm on-axis. More work is needed to explore alternative LGS/TTNGS asterisms, optimize conjugation heights for high-altitude deformable mirrors, and test performance under poorer seeing conditions."}
{"id": "2511.17137", "categories": ["astro-ph.HE", "gr-qc"], "pdf": "https://arxiv.org/pdf/2511.17137", "abs": "https://arxiv.org/abs/2511.17137", "authors": ["G. Mustafa", "Faisal Javed", "S. K. Maurya", "A. Ditta", "Orhan Donmez", "Tayyab Naseer", "Abdelmalek Bouzenada", "Farruh Atamurotov"], "title": "Magnetized particle motion and accretion process with shock cone morphology around a decoupled hairy black holes", "comment": "28 pages, 25 figures", "summary": "Relativistic accretion onto compact objects such as black holes and neutron stars is one of the most efficient known mechanisms for converting gravitational potential energy into radiation. In the case of rapidly spinning black holes, up to $40\\%$ of the rest-mass energy of accreting matter can be released, far exceeding the efficiency of nuclear fusion. In this work, we investigate magnetized particle motion and relativistic accretion processes around a decoupled hairy black hole via extended geometric deformation. The developed geometry involves two hairy parameters that preserve the horizon structure with the additional feature of the fulfillment of weak energy conditions outside the event horizon. We provide the foundation with necessary formalism for magnetized particle motion around a decoupled black hole. The effective potential and innermost stable circular orbits are then derived, which demonstrate a significant reduction of the radius of the latter quantity under the hairy parameters for the magnetized particle. Afterwards, we obtain exact analytical expressions for radial velocity profiles, mass accretion rates, and a few others which reveal improved energy efficiency and emissivity as compared to the standard black hole. Furthermore, the decoupling parameter shows strong influence on oscillations, accretion presenting fantastic agreement between analytical predictions and numerical simulations, and thus offering noticeable observational signatures for future gravitational wave and X-ray astronomy."}
{"id": "2511.16759", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2511.16759", "abs": "https://arxiv.org/abs/2511.16759", "authors": ["Isiah M. Holt", "M. Coleman Miller", "Alexander J. Dittmann", "Frederick K. Lamb"], "title": "An Investigation of Systematic Effects from Background Priors on PSR J0740$+$6620 Radius Estimates using Synthetic NICER and XMM-Newton Data", "comment": "19 pages, 7 figures, 4 tables. Submitted to ApJ", "summary": "Accurate and precise measurements of neutron star radii provide invaluable information about the cold, dense matter in neutron star cores. Analyses of synthetic X-ray pulse waveform data similar to the data obtained from non-accreting neutron stars using the Neutron star Interior Composition Explorer (NICER) have indicated that mass and radius estimates made using such data are robust against some systematic errors that may be made when modeling these data, such as errors in the assumed pattern of the thermal X-ray emission from the surface of these stars. A potentially important but so far unexplored source of systematic error is misparameterization of unmodulated background components, which can bias the inferred radius, particularly when data from different telescopes are used in the analysis. In this study, we investigate the effects of the background model on radius estimates by jointly analyzing synthetic NICER and XMM-Newton data, using the $\\sim 2.1~M_\\odot$ pulsar PSR~J0740$+$6620 as a prototypical example. Our analysis shows that even if the background assumed in the model underestimates the actual background by a factor of more than five, the resulting shift of the radius posterior from the true value of the radius corresponds to only $\\sim1σ$. In all the cases we examined, the Bayesian evidence for the correct background model is greater than for the incorrect background model. These results add to the evidence that analyses of NICER-like data provide accurate measurements of neutron star radii when the statistical sampling is thorough and the model fits the data well."}
{"id": "2511.17248", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.17248", "abs": "https://arxiv.org/abs/2511.17248", "authors": ["Hang Gong", "Alexey Bobrick", "Francisco Garzón", "Deven Bhakta", "Thomas Maccarone", "Sangita Kumari", "Nieves Castro Rodríguez", "Antonio Cabrera-Lavers", "Arash Bahramian", "Jifeng Liu"], "title": "An Alternative Explanation for the Helium Star Pulsar Binary J1928$+$1815: The Most Heavyweight Black Widow System to Date", "comment": "ApJ accepted; Eastern Zhou or Western Zhou? Comments are welcome!", "summary": "We present the results of deep near-infrared imaging of the recently discovered helium star pulsar binary J1928$+$1815 situated in the Galactic plane. Our observations did not achieve significant detections, providing limiting magnitudes of J=23.7 and H=22.2, which are both 2.4\\,magnitudes deeper than the expected J and H magnitudes for a modeled stripped helium star with a mass of 1\\,$\\rm M_{\\odot}$ after extinction. Although we cannot completely rule out the possibility of more significant extinction and the exact evolutionary status of the supposed helium star is uncertain, by comparing J1928$+$1815 with other pulsar binaries, we propose a natural alternative solution: that J1928$+$1815 is a heavyweight black widow system with a massive ablated white dwarf. Due to the pulsar's relatively high spin-down power and short orbital separation, the irradiation heating timescale is uniquely shorter than the cooling timescale for the WD companion. As a result, the WD effectively boils, with its outer layers expanding, overfilling the Roche lobe and producing low-density binary-scale haze opaque in the radio band. If this interpretation is correct, J1928$+$1815 would represent a new category distinct from canonical lightweight black widow systems. Radio eclipses can occur in pulsar binaries across a wider range of WD companion masses than previously thought. Therefore, they do not serve as a definitive indicator of a helium star without its direct detection. We contend that a spectroscopic identification remains the smoking gun for its existence. Given the crowding in this field, an \\textit{HST} imaging in the near-infrared band would provide even better constraints."}
{"id": "2511.17363", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2511.17363", "abs": "https://arxiv.org/abs/2511.17363", "authors": ["Paxson Swierc", "Damiano Caprioli", "Luca Orusa", "Miha Cernetic"], "title": "Deep Learning Analysis of Ions Accelerated at Shocks", "comment": "21 pages, 8 figures. Submitted to JCAP", "summary": "We study the application of deep learning techniques to the analysis and classification of ions accelerated at collisionless shocks in hybrid (kinetic ions--fluid electrons) simulations. Ions were classified as thermal, suprathermal, or nonthermal, depending on the energy they achieved and the acceleration regime they fell under. These classifications were used to train deep learning models to predict which particles are injected into the acceleration process with high accuracy (>90%), using only time series of the local magnetic field they experienced during their initial interaction with the shock. An autoencoder architecture was also tested, for which time series of various parameters were reconstructed from encoded representations. This study shows the potential of applying machine learning techniques to extract physical insights from kinetic plasma simulations and sets the groundwork for future applications, including the construction of sub-grid models in fluid approaches."}
{"id": "2511.17285", "categories": ["astro-ph.HE", "hep-ph"], "pdf": "https://arxiv.org/pdf/2511.17285", "abs": "https://arxiv.org/abs/2511.17285", "authors": ["Shuai-Kang Yang", "Bei You", "Niek Bollemeijer", "Phil Uttley", "A. J. Tetarenko", "Andrzej A. Zdziarski", "Liang Chen", "P. Casella", "J. A. Paice", "Yang Bai", "Sai-En Xu"], "title": "Covariance spectrum of MAXI J1820+070: On the nature of the Comptonizing flow", "comment": null, "summary": "We present an analysis of the covariance spectrum of the black hole X-ray binary MAXI J1820+070 during its hard state. For the first time, we extend coherence and covariance studies into the hard X-ray band up to 150 keV. We detect a clear drop in coherence above 30 keV on both short- and long-timescales relative to the 2-10 keV reference band. To investigate the origin of the coherent variability, we simultaneously fit the short- and long-timescale covariances and the time-averaged spectra with a Comptonization model. Surprisingly, the electron temperature associated with long-timescale variability is significantly higher than that on short timescales. Moreover, the temperature on long timescales remains relatively constant throughout the hard state, whereas the short-timescale temperature evolves with X-ray luminosity. We attribute the drop in coherence to multiple sources of seed photons, i.e., the blackbody and synchrotron photons. The independence between these two photon fields leads to the drop in coherence. To explain the lower electron temperature on short timescales, we propose a two-Comptonization framework in which short-timescale variability arises from a vertically extended central region, while long-timescale variability originates at larger radii. The elevated geometry of the inner region leads to illumination primarily by cooler outer-disk photons, yielding a lower electron temperature. In this case, the evolution of the height of the elevated region could explain the evolution of the electron temperature associated with the coherent variability throughout the hard state."}
{"id": "2511.17338", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.17338", "abs": "https://arxiv.org/abs/2511.17338", "authors": ["Paul A. Draghis", "Jon M. Miller", "Erin Kara", "Elisa Costantini", "Oluwashina Adegoke", "Javier A. Garcia"], "title": "A XRISM View of Relativistic Reflection in Cygnus X-1", "comment": "Accepted for publication in ApJL", "summary": "We present the first high-resolution XRISM/Resolve view of the relativistically broadened Fe K line in Cygnus X-1. The data clearly separate the relativistic broad line from the underlying continuum and from narrow emission and absorption features in the Fe band. The unprecedented spectral resolution in the Fe K band clearly demonstrates that the flux excess can be attributed to a single, broad feature, as opposed to a superposition of previously unresolved narrow features. This broad feature can be best interpreted as emission consistent with an origin near the innermost stable circular orbit around a rapidly rotating black hole. By modeling the shape of the broad line, we find a black hole spin of $a\\simeq0.98$ and an inclination of the inner accretion disk of $θ\\simeq63^\\circ$. The spin is consistent with prior reflection studies, reaffirming the robustness of past spin measurements using the relativistic reflection method. The measured inclination provides reinforcing evidence of a disk-orbit misalignment in Cygnus X-1. These results highlight the unique abilities of XRISM in separating overlapping spectral features and providing constraints on the geometry of accretion in X-ray binaries."}
{"id": "2511.17363", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2511.17363", "abs": "https://arxiv.org/abs/2511.17363", "authors": ["Paxson Swierc", "Damiano Caprioli", "Luca Orusa", "Miha Cernetic"], "title": "Deep Learning Analysis of Ions Accelerated at Shocks", "comment": "21 pages, 8 figures. Submitted to JCAP", "summary": "We study the application of deep learning techniques to the analysis and classification of ions accelerated at collisionless shocks in hybrid (kinetic ions--fluid electrons) simulations. Ions were classified as thermal, suprathermal, or nonthermal, depending on the energy they achieved and the acceleration regime they fell under. These classifications were used to train deep learning models to predict which particles are injected into the acceleration process with high accuracy (>90%), using only time series of the local magnetic field they experienced during their initial interaction with the shock. An autoencoder architecture was also tested, for which time series of various parameters were reconstructed from encoded representations. This study shows the potential of applying machine learning techniques to extract physical insights from kinetic plasma simulations and sets the groundwork for future applications, including the construction of sub-grid models in fluid approaches."}
{"id": "2511.17385", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2511.17385", "abs": "https://arxiv.org/abs/2511.17385", "authors": ["Natalie A. Webb", "Vincent Foustoul", "Robbie Webbe", "Matteo Bachetti", "Erwan Quintin", "Laurent Michel"], "title": "Discovering periodic and repeating nuclear transients in the XMM-Newton archives", "comment": "6 pages, 1 figure. Proceedings of \"X-ray Quasi-Periodic Eruptions and Repeating Nuclear Transients\", 16-19 June 2025, ESAC, Madrid. Submitted to Astronomische Nachrichten", "summary": "The regions around massive black holes can show X-ray variability on timescales from seconds to decades. Observing many black holes over different timescales can enhance our chances of detecting variability coming from (partial) tidal disruption events, massive black hole binaries, changing state AGN, blazar activity and much more. X-ray catalogues with hundreds of thousands of detections are treasure troves of such sources, which require innovative methods to identify these black holes. We present the current XMM-Newton catalogues available and describe several examples of tidal disruption events (TDEs) and quasi-periodic eruption sources that have been found whilst mining this data. We describe preliminary work on a search for periodic variables in the XMM-Newton EPIC archival data, with the example of finding new massive black hole binaries. We also describe the STONKS pipeline that is now in the XMM-Newton automatic reduction pipeline and the near real-time alert system that allows the follow-up of new and fading transients. We provide examples of fading sources that are newly identified candidate TDEs."}
