{"id": "2509.21366", "categories": ["astro-ph.IM", "astro-ph.HE", "hep-ph"], "pdf": "https://arxiv.org/pdf/2509.21366", "abs": "https://arxiv.org/abs/2509.21366", "authors": ["Hana Ali Messaoud", "Tom François", "Thomas Vuillaume"], "title": "Advanced stereoscopy applied to CTAO", "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC\n  2025), 2025", "summary": "The Cherenkov Telescope Array Observatory (CTAO) is an international\nobservatory currently under construction, which will consist of two sites (one\nin the Northern Hemisphere and one in the Southern Hemisphere). It will\neventually be the largest and most sensitive ground-based gamma-ray\nobservatory. In the meantime, a small subarray composed of four Large-Sized\nTelescopes (LSTs) at the Northern site will begin collecting data in the coming\nyear. In preparation, we present a stereoscopic event reconstruction using\ngraph neural networks (GNNs) to combine information from several telescopes of\nthis subarray. In our previous work, we explored the use of GNNs for the\nstereoscopic reconstruction of gamma-ray events on simulated data from the\nProd5 sample and showed that GNNs provide a better stereoscopic reconstruction.\nWe now compare this approach to the currently foreseen method that analytically\ncombines the output of monoscopic random forests, and explore how GNNs can be\nused in fusion with the Random forest algorithm in order to provide a more\nsensitive stereoscopic system."}
{"id": "2509.21407", "categories": ["astro-ph.IM", "astro-ph.EP", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2509.21407", "abs": "https://arxiv.org/abs/2509.21407", "authors": ["Isabel Rebollido", "Yasuhiro Hasegawa", "Meredith MacGregor", "Bin Ren", "Mark Booth", "Jonathan Marshall", "Courtney Dressing", "Patricia Luppe"], "title": "Debris disks and their properties with the Habitable Worlds Observatory", "comment": "Part of the HWO Solar Systems in Context working group Endorsers:\n  Narsireddy Anugu, Nicholas Ballering, Aarynn Carter, Gianni Cataldi, Miguel\n  Chavez Dagostino, Denis Defr\\`ere, Vincent Esposito, Ryan Fortenberry, Luca\n  Fossati, Eunjeong Lee, Briley Lewis, Briley Lewis, Meredith MacGregor,\n  Stanimir Metchev, Patricio Reller, Pablo Santos-Sanz, Antranik Sefilian,\n  Sarah Steiger, Schuyler Wolff", "summary": "The study of the last stages of planet formation, also known as debris disks,\nis fundamental to place constrains on the formation of planetary sized bodies.\nDebris disks are composed of dust and occasionally small amounts of gas, both\nreleased through dynamical interactions of small rocky bodies and dust\nparticles, such as collisions and evaporation. The distribution of the dust can\nreveal the presence of forming planets and its composition can directly trace\nthat of comets, asteroids and even planets. While we have been observing debris\ndisks for 40 years now, most observations so far have been restricted to the\ncold outer regions of the system, and therefore information of the terrestrial\nzone is still missing. The improved spatial resolution, inner working angle and\nsensitivity that the Habitable Worlds Observatory will provide will enable a\nmuch closer look into the structure and composition of debris disks\n(particularly of its inner region) and enable the search for the forming rocky\nplanets within the disk."}
{"id": "2509.21431", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.21431", "abs": "https://arxiv.org/abs/2509.21431", "authors": ["GRAVITY+ Collaboration"], "title": "First Light for the GRAVITY+ Adaptive Optics: Extreme Adaptive Optics for the Very Large Telescope Interferometer", "comment": "Accepted in A&A", "summary": "GRAVITY+ improves by orders of magnitude the sensitivity, sky-coverage and\ncontrast of the Very Large Telescope Interferometer (VLTI). A central part of\nthis project is the development of Gravity Plus Adaptive Optics (GPAO), a\ndedicated high-order and laser-guide star Adaptive Optics (AO) system for VLTI.\nGPAO consists of four state-of-the-art AO systems equipping all 8m-class Unit\nTelescopes (UTs) for the wavefront correction of the VLTI instruments. It\noffers both visible and infrared Natural Guide Star (NGS) and Laser Guide Star\n(LGS) operations. The paper presents the design, operations and performances of\nGPAO. We illustrate the improvement brought by GPAO with interferometric\nobservations obtained during the commissioning of the NGS mode end-2024. These\nscience results include the first optical interferometry observations of a\nredshift $z\\sim4$ quasar, the spectroscopy of a cool brown-dwarf with magnitude\n$K\\sim 21.0$, the first observations of a Class I young star with GRAVITY, and\nthe first sub-micro arcsecond differential astrometry in the optical. Together\nwith the entire GRAVITY+ project, the implementation of GPAO is a true paradigm\nshift for observing the optical Universe at very high angular resolution."}
{"id": "2509.21546", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.21546", "abs": "https://arxiv.org/abs/2509.21546", "authors": ["Valentin Sauvage", "Anaïs Besnard", "Clémence de Jabrun", "Mehdi Bouzit", "Bruno Maffei"], "title": "Performance characterization of a new Structural and Thermal Architecture for a future spaceborne Closed-Cycle Dilution Refrigerator", "comment": null, "summary": "A Structural and Thermal Model (STM) has been developed to support the new\nspaceborne Closed-Cycle Dilution Refrigerator (CCDR), which aims to provide\ncontinuous cooling at 100~mK for long-duration astrophysical missions. The STM\nis based on a hexapod architecture that ensures both thermal decoupling and\nmechanical robustness during launch. In this paper, we present the\ncharacterization of its thermal and mechanical performances. A dedicated\nexperimental setup was used to investigate the thermal behavior of the STM\nacross a broad temperature range. The study reveals limitations of the collar\ndesign, with incomplete power interception from thermal boundary resistances\nand vibration test failure traced to defective strut gluing. These results\nguide the next STM iteration with optimized collar and strut assembly for\nreliable CCDR operation in space."}
{"id": "2509.21461", "categories": ["astro-ph.HE", "nucl-ex", "nucl-th"], "pdf": "https://arxiv.org/pdf/2509.21461", "abs": "https://arxiv.org/abs/2509.21461", "authors": ["Leonel Morejon", "Karl-Heinz Kampert"], "title": "Stochastic analysis of ultra-high energy cosmic ray interactions", "comment": null, "summary": "Photonuclear interactions between ultra-high-energy cosmic ray (UHECR) nuclei\nand surrounding photon fields are key to understanding the connection between\nthe compositions observed at Earth and those emitted from the sources. These\ninteractions can completely disintegrate a nucleus of iron over trajectory\nlengths of a few and up to hundreds of megaparsecs, depending on the energy of\nthe UHECR. The stochastic nature of these interactions means that it is not\npossible to describe them deterministically for a single cosmic ray, and an\nexact formulation of the probability distributions is not yet available.\nCurrent approaches describe these interactions using either Monte Carlo\nsimulations or solving ordinary differential equations that neglect\nstochasticity. Because of the limitations of these approaches, only partial\ncapture of the process is achieved. This paper presents an analytic\nprobabilistic description of UHECR interactions and the resulting nuclear\ncascades, establishing their connection to Markov jump processes. The\nfundamental properties of these cascades are presented, as is the computation\nof the usual quantities of interest, such as the horizon, spectrum, and\ncomposition. The benefits of this description are outlined using astrophysical\nexamples related to extragalactic propagation and UHECR sources."}
{"id": "2509.21754", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.21754", "abs": "https://arxiv.org/abs/2509.21754", "authors": ["X. Li", "K. Adamek", "W. Armour"], "title": "FITrig: A High-Performance Detection Technique for Efficient Ultra-Long-Period Pulsars", "comment": null, "summary": "Ultra-long-period (ULP) pulsars, a newly identified class of celestial\ntransients, offer unique insights into astrophysics, though very few have been\ndetected to date. In radio astronomy, most time-domain detection methods cannot\nfind these pulsars, and current image-based detection approaches still face\nchallenges, including low sensitivity, high false positive rate, and low\ncomputational efficiency. In this article, we develop Fast Imaging Trigger\n(FITrig), a GPU-accelerated, statistics-based method for ULP pulsar detection\nand localisation. FITrig includes two complementary approaches -- an image\ndomain and an image-frequency domain strategy. FITrig offers advantages by\nincreasing sensitivity to faint pulsars, suppressing false positives (from\nnoise, processing artefacts, or steady sources), and improving search\nefficiency in large-scale wide-field images. Compared to the state-of-the-art\nsource finder SOFIA 2, FITrig increases the detection speed by 4.3 times for\nlarge images (50K x 50K pixels) and reduces false positives by up to 858.8\ntimes (at 6$\\sigma$ significance) for the image domain branch, while the\nimage-frequency domain branch suppresses false positives even further. FITrig\nmaintains the capability to detect pulsars that are 20 times fainter than\nsurrounding steady features, even under critical Nyquist sampling conditions.\nIn this article, the performance of FITrig is demonstrated using both\nreal-world data (MeerKAT observations of PSR J0901-4046) and simulated datasets\nbased on MeerKAT and SKA AA2 telescope configurations. With its real-time\nprocessing capabilities and scalability, FITrig is a promising tool for\nnext-generation telescopes, such as the SKA, with the potential to uncover\nhidden ULP pulsars."}
{"id": "2509.21532", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2509.21532", "abs": "https://arxiv.org/abs/2509.21532", "authors": ["Indrani Pal", "Stefano Marchesi", "Ross Silver", "Marco Ajello", "Vittoria Gianolli", "Núria Torres-Albà", "Isaiah Cox", "Xiurui Zhao", "Dhrubojyoti Sengupta", "Anuvab Banerjee", "Kouser Imam", "Andrealuna Pizzetti"], "title": "Unveiling Obscured Accretion in the Local Universe", "comment": "16 pages, 13 Figures, submitted to the journal", "summary": "Heavily obscured Active Galactic Nuclei (AGN), especially Compton-thick\nsources with line-of-sight column density ($N_{\\rm H,los}$) $>$ 10$^{24}$\ncm$^{-2}$, are critical to understanding supermassive black hole (SMBH) growth\nand the origin of the Cosmic X-ray Background (CXB). However, their observed\nfraction remains significantly below model predictions, due to strong\nabsorption bias, even in the hard X-ray (i.e., above 10 keV) band. We analyze a\nsample of 26 nearby ($z < 0.1$) AGN from the Swift-BAT 150-month catalog,\nselected via mid-IR to X-ray diagnostics and observed with NuSTAR and soft\nX-ray telescopes (Xmm-Newton, Chandra, or Swift-xrt). Using self-consistent\ntorus models (MyTorus, Borus02, and UXCLUMPY), we aim to constrain $N_{\\rm\nH,los}$, the average torus column density, and other geometrical parameters of\nthe obscuring medium. A comparative analysis among the three torus models\nshowed that while estimates of $N_{\\rm{H,los}}$ were generally in agreement,\nBorus02 tended to classify a slightly larger number of sources as Compton-thick\nAGN (CT-AGN). Building on this comparison, we benchmark two prediction schemes\n-- a mid-IR/X-ray relation and a machine-learning model -- against our\nbroadband best-fit $N_{\\rm H,los}$ measurements to assess which approach more\neffectively bridges the gap between predicted and measured obscuration, finding\nthat while the former works effectively in the heavily obscured region\n(log$\\rm{N_H} \\gtrsim$ 23.5 $\\rm{cm^{-2}}$), the latter provides improved\naccuracy, particularly for Compton-thin to moderately thick regimes\n(log$\\rm{N_H} \\lesssim$ 23.5 $\\rm{cm^{-2}}$)."}
{"id": "2509.22071", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.22071", "abs": "https://arxiv.org/abs/2509.22071", "authors": ["Miku Tsujii", "Tomonaga Tanaka", "Alessandro Fasano", "Ricardo Génova-Santos", "Shunsuke Honda", "Yonggil Jo", "Keisuke Kataoka", "Chiko Otani", "Mike Peel", "Junya Suzuki", "Osamu Tajima", "Eunil Won", "Makoto Hattori"], "title": "Optimization procedure of the baffle of the GroundBIRD Telescope to mitigate stray light", "comment": null, "summary": "We presented the optimization procedures of the baffle mounted on the\nGroundBIRD telescope for measuring the polarization of the Cosmic Microwave\nBackground~(CMB). The telescope employs dual mirror reflective telescopes\ninstalled in a cryostat. The primary objectives were to minimize stray light\ncontamination, maintain the integrity of the main beam, and ensure that thermal\nloading from the baffle remains significantly below that from the atmosphere.\nUsing quasi-optical simulations, we have optimized the baffle's aperture angle\nto suppress stray light without degrading the main beam quality. We confirmed\nthrough Moon observations that the optimized baffle design works to eliminate\nthe contamination of the stray light as expected. Furthermore, no measurable\ndegradation in the noise equivalent temperature~(NET) was detected, indicating\nminimal thermal impact. These results show that our baffle optimization\nstrategy effectively reduces systematic errors while maintaining observational\nsensitivity, providing valuable insights for future CMB experiments with\nsimilar optical architectures."}
{"id": "2509.21692", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.21692", "abs": "https://arxiv.org/abs/2509.21692", "authors": ["Litao Zhu", "Zhongxiang Wang", "Dong Zheng", "Alok C. Gupta", "Ju-Jia Zhang"], "title": "A Disk-Originated 329-day Quasi-Periodic Oscillation in the Seyfert 1 Galaxy J1626+5120", "comment": "10 pages, 1 table, 9 figures, accepted for publication in ApJL", "summary": "The Seyfert 1 galaxy J1626+5120 is estimated to host a $10^8 M_{\\odot}$ black\nhole (BH) accreting at Eddington ratio $\\dot{m}_{\\text{Edd}} \\approx 0.043$.\nIts long-term multi-band light curve data show flicker-like variations, but in\na well-sampled $g$-band light curve, we are able to determine a $\\simeq 329$\\,d\nquasi-periodic oscillation (QPO) at a $\\sim$4.53$\\sigma$ significance. Six\noptical spectra were obtained for the source, three of which were taken by us.\nThe spectra show that the variations were mainly because of flux changes\nblueward of 4000\\,\\AA. We also analyze X-ray and ultraviolet (UV) data obtained\nwith {\\it the Neil Gehrels Swift Observatory (Swift)}, which targeted the\nsource in the past two years. X-ray and UV emissions of the source show\nvariations correlated with optical. Time lags of four UV bands and four optical\nbands are determined with respect to the X-ray emission, which are consistent\nwith a continuum reprocessing disk model. These properties point out a disk\norigin for the QPO, likely due to Lense-Thirring (LT) precession of the\naccretion flow at $\\sim$20 gravitational radii of the BH. This QPO could be a\nkey case linking sub-year long QPOs in jets, which have more cases reported, to\nLT precession."}
{"id": "2509.22074", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.22074", "abs": "https://arxiv.org/abs/2509.22074", "authors": ["A. Dinesh", "M. Láinez", "R. A. Cerviño", "D. Morcuende", "A. Moralejo", "J. L. Contreras", "A. Baquero", "J. Lozano"], "title": "Next-day observation processing for the LST-1 and MAGIC", "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC\n  2025), 2025", "summary": "The MAGIC and LST-1 telescopes, located at the Roque de los Muchachos\nObservatory on La Palma, operate dedicated On-Site Analysis (OSA) pipelines\nthat provide rapid, automated processing of observational data. These systems\nproduce high-level data products just a few hours after observations are\ncompleted, enabling quick-look analyses, next-day data quality assessments, and\nrapid-response science such as flare detection and Target of Opportunity\nfollow-ups. OSA pipelines have been in continuous operation since 2012 for\nMAGIC and since 2021 for LST-1, automatically processing nightly data using the\nstandard analysis chain. The experience gained from both systems provides\nessential lessons for the development of Cherenkov Telescope Array\nObservatory's (CTAO's) on-site analysis, demonstrating the practical and\nscientific benefits of fast data processing in Cherenkov telescopes."}
{"id": "2509.21958", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2509.21958", "abs": "https://arxiv.org/abs/2509.21958", "authors": ["Jun-Rong Liu", "Hua Feng", "Jian-Min Wang"], "title": "Fermi detection of $γ$-rays from the radio-quiet Seyfert galaxy NGC 3281", "comment": "Accepted for publication in ApJ", "summary": "We report the detection of significant $\\gamma$-ray emission with $\\it\nFermi$-LAT from the radio-quiet Seyfert 2 galaxy NGC 3281, with a luminosity of\n$5.9\\,(\\pm 1.7)\\times10^{41}\\rm\\,erg\\,s^{-1}$ at a significance of\n$6.22\\,\\sigma$ (TS = $42.81$). The power-law photon index is $2.61~(\\pm 0.24)$,\nindicative of a soft spectrum. The star formation activity in NGC 3281 is\ninsufficient to explain its $\\gamma$-ray luminosity based on the empirical\nrelation between the infrared and $\\gamma$-ray luminosities observed in other\nsources. The multiwavelength spectrum can be explained as due to inverse\nCompton scattering by relativistic electrons in the corona or jet of seed\nphotons from the corona, disk and torus. The source is Compton-thick and\nattenuation of GeV photons due to pair production in the corona is\nnonnegligible (with an optical depth of about 10). The intrinsic $\\gamma$-ray\nluminosity is inferred to be $3.4\\,\\times10^{42}$ and\n$2.2\\,\\times10^{41}\\rm\\,erg\\,s^{-1}$ for the corona and jet model,\nrespectively. The observed $\\gamma$-ray and radio luminosities is roughly\nconsistent with the known correlation between the two quantities, among the\nlowest luminosity regime. The jet origin is valid only if the radio emission is\ndominated by the jet."}
{"id": "2509.22322", "categories": ["astro-ph.IM", "astro-ph.CO"], "pdf": "https://arxiv.org/pdf/2509.22322", "abs": "https://arxiv.org/abs/2509.22322", "authors": ["M. Galloway", "H. K. Eriksen", "R. M. Sullivan", "D. J. Watts", "I. K. Wehus", "L. Zapelli"], "title": "N+2 Mapmaking for Polarized CMB Experiments", "comment": null, "summary": "We introduce N+2 mapmaking as a novel approach to constructing maps in both\nintensity and polarization for multi-detector CMB data. The motivation behind\nthis method is two-fold: Firstly, it provides individual temperature detector\nmaps from a multi-detector set, which may be useful for component separation\npurposes, in particular for line emission reconstruction. Secondly, it\nsimultaneously outputs coadded polarization maps with minimal\ntemperature-to-polarization leakage sensitivity. Algorithmically speaking, the\nN+2 mapmaker is closely related to the `spurious mapmaking' algorithm pioneered\nby the WMAP team, but rather than solving for a spurious S map together with\nthe three normal Stokes IQU parameters, we solve for N temperature maps and two\nStokes (Q and U) parameters per pixel. The result is a statistically coherent\nset of physically meaningful per-detector temperature maps, each with slightly\ndifferent bandpasses as defined by each detector, combined with coadded\npolarization maps. We test this approach on Planck Low Frequency Instrument\n(LFI) 30 GHz data, and find that the Planck scanning strategy is too poorly\ncross-linked to allow for a clean separation between temperature and\npolarization. However, noting that pairs of detectors within a single horn are\nstrongly anti-correlated, we anticipate that solving for horn maps, as opposed\nto individual detector maps, may provide an optimal compromise between noise\nand temperature-to-polarization leakage minimization. When applied to simulated\ndata with a rotating half-wave plate, for which the polarization angle coverage\nis greatly improved, the algorithm performs as expected."}
{"id": "2509.21987", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.21987", "abs": "https://arxiv.org/abs/2509.21987", "authors": ["Teresa Toscano", "José L. Gómez", "Guang-Yao Zhao", "Rocco Lico", "Antonio Fuentes", "Tuomas Savolainen", "Jan Röder", "Maciek Wielgus", "B. Alexander Pushkarev", "Efthalia Traianou", "Ai-Ling Zeng", "I. Leonid Gurvits", "Y. Yuri Kovalev", "M. Felix Pötzl", "Mikhail Lisakov"], "title": "Revisiting 3C 279 jet morphology with space VLBI at 26 microarcsecond resolution", "comment": null, "summary": "We present observations of the blazar 3C 279 at 22 GHz using the space VLBI\nmission RadioAstron on 2018 January 15. Images in both total intensity and\nfractional polarization are reconstructed using RML method implemented in the\neht-imaging library. The electric vector position angles are found to be mostly\naligned with the general jet direction, suggesting a predominantly toroidal\nmagnetic field, in agreement with the presence of a helical magnetic field.\nGround-space fringes were detected up to a projected baseline length of $\\sim\n8$G$\\lambda$, achieving the angular resolution of around 26$\\mu$as. The\nfine-scale structure of the relativistic jet is found in our study extending to\na projected distance of $\\sim 180$ parsec from the radio core. However, the\nfilamentary structure reported by previous RadioAstron observations of 2014 is\nnot detected in our current study. We discuss potential causes for this\nphenomenon, together with a comparison using public 43 GHz data from the\nBEAM-ME program, showing a significant drop in the jet's total intensity. The\noptically thick core is observed with a brightness temperature of $ 1.6 \\times\n10^{12}$ K, consistent with equipartition between the energy densities of the\nrelativistic particles and the magnetic field. This yields an estimated\nmagnetic field strength of 0.2 G."}
{"id": "2509.22382", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.22382", "abs": "https://arxiv.org/abs/2509.22382", "authors": ["Daniel Dutcher", "Peter Dow", "Shannon M. Duff", "Shawn W. Henderson", "Johannes Hubmayr", "Bradley R. Johnson", "Michael J. Link", "Tammy J. Lucas", "Michael D. Niemack", "Yudai Seino", "Rita F. Sonka", "Suzanne Staggs", "Yuhan Wang", "Kaiwen Zheng"], "title": "The Simons Observatory: Characterization of the 220/280 GHz TES Detector Modules", "comment": "6 pages, 7 figures. Proceedings of the 21st International Conference\n  on Low Temperature Detectors (LTD2025)", "summary": "The Simons Observatory (SO) is a new suite of cosmic microwave background\ntelescopes in the Chilean Atacama Desert with an extensive science program\nspanning cosmology, Galactic and extragalactic astrophysics, and particle\nphysics. SO will survey the millimeter-wave sky over a wide range of angular\nscales using six spectral bands across three types of dichroic,\npolarization-sensitive transition-edge sensor (TES) detector modules:\nLow-Frequency (LF) modules with bandpasses centered near 30 and 40 GHz,\nMid-Frequency (MF) modules near 90 and 150 GHz, and Ultra-High-Frequency (UHF)\nmodules near 220 and 280 GHz. Twenty-five UHF detector modules, each containing\n1720 optically-coupled TESs connected to microwave SQUID multiplexing readout,\nhave now been produced. This work summarizes the pre-deployment\ncharacterization of these detector modules in laboratory cryostats. Across all\nUHF modules, we find an average operable TES yield of 83%, equating to over\n36,000 devices tested. The distributions of (220, 280) GHz saturation powers\nhave medians of (24, 26) pW, near the centers of their target ranges. For both\nbands, the median optical efficiency is 0.6, the median effective time constant\nis 0.4 ms, and the median dark noise-equivalent power (NEP) is ~40 aW/rtHz. The\nexpected photon NEPs at (220, 280) GHz are (64, 99) aW/rtHz, indicating these\ndetectors will achieve background-limited performance on the sky. Thirty-nine\nUHF and MF detector modules are currently operating in fielded SO instruments,\nwhich are transitioning from the commissioning stage to full science\nobservations."}
{"id": "2509.22344", "categories": ["astro-ph.HE", "astro-ph.CO", "hep-ph"], "pdf": "https://arxiv.org/pdf/2509.22344", "abs": "https://arxiv.org/abs/2509.22344", "authors": ["Denys Malyshev", "Lidiia Zadorozhna", "Yuriy Bidasyuk", "Andrea Santangelo", "Oleg Ruchayskiy"], "title": "AGN spectral variability across activity states and searches for axion-like particles", "comment": "Submitted to PoS Multifrequency Behaviour of High Energy Cosmic\n  Sources - XV (MULTIF2025)", "summary": "Axion-like particles (ALPs) are compelling candidates for dark matter and\npotential portals to new physics beyond the Standard Model. Photons traversing\nmagnetized regions can convert into ALPs, producing characteristic,\nenergy-dependent absorption features in astrophysical spectra. The probability\nof such conversions depends sensitively on both the photon energy and the\nproperties of the intervening magnetic fields.\n  Most existing searches have focused on individual astrophysical sources, but\nuncertainties in the structure and strength of cosmic magnetic fields have\nlimited their reach. Recently, we have demonstrated that active galactic nuclei\n(AGNs) observed through galaxy clusters provide especially promising targets\nfor ALP searches. By stacking multiple AGN-cluster sightlines, one can average\nover poorly known magnetic field configurations in galaxy clusters and recover\na distinctive ALP-induced spectral suppression, thereby significantly enhancing\nsensitivity.\n  In this work, we investigate a possible systematic uncertainty in such\nanalyses: the intrinsic time-variability of AGN spectra. We demonstrate that\nAGN flux variability is correlated with spectral hardness, and that\ntime-averaging over flaring and quiescent states can potentially mimic the\nsuppression features imprinted by ALP-photon mixing. Our findings imply that\nthe recent constraints remain conservative, and that incorporating detailed\nspectral variability into stacking analyses can further sharpen the search for\naxion-like particles."}
{"id": "2509.22453", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.22453", "abs": "https://arxiv.org/abs/2509.22453", "authors": ["Alessio Traficante", "Fabrizio De Angelis", "Alice Nucara", "Milena Benedettini"], "title": "Hyper-py: HYbrid Photometry and Extraction Routine in PYthon", "comment": "Submitted to Journal of Open Source Software (JOSS). The code is\n  freely available for download via its GitHub repository:\n  https://github.com/Alessio-Traficante/hyper-py. It can also be installed\n  using pip, as described in the accompanying README file (also available in\n  the repository)", "summary": "We present Hyper-Py, a fully restructured and extended Python implementation\nof HYPER (HYbrid Photometry and Extraction Routine, Traficante et al. 2015).\nHYPER was originally implemented in IDL, aiming to deliver robust and\nreproducible photometry of compact sources in FIR/sub-mm/mm maps. HYPER\ncombines source detection via high-pass filtering, background estimation\nthrough local polynomial fitting, and source modeling with 2D elliptical\nGaussians, simultaneously fitting multiple Gaussians to deblend overlapping\nsources. Hyper-Py preserves the original logic while offering improvements in\nperformance, configurability, and background modeling capabilities, making it a\nflexible modern tool for source extraction and photometry across diverse\ndatasets. Notably, Hyper-Py enables background estimation and subtraction\nacross individual slices of 3D datacubes, allowing consistent background\nmodeling along the spectral axis for line or continuum studies in spectrally\nresolved observations."}
{"id": "2509.22419", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.22419", "abs": "https://arxiv.org/abs/2509.22419", "authors": ["Matteo Pais", "Angela Zegarelli", "Silvia Celli", "Enrico Peretti"], "title": "Choked jets in BSG/RSG as possible sources of high-energy neutrinos", "comment": "8 pages, 2 figures, accepted for publication in Proceedings of\n  Science, PoS(ICRC2025)1138 (Multi-messenger emission from choked jets in\n  collapsars)", "summary": "The death of massive stars is accompanied by the formation of central and\naccreting compact objects and the subsequent launch of relativistic jets.\nHowever, not all jets successfully drill their way out of the stellar envelope.\nUnsuccessful jets, also known as choked jets, may still produce radiation at\nlower frequencies by dissipating the jet energy into a pressurized cocoon. This\ncocoon expands within the stellar envelope and eventually breaks out as a\nmildly relativistic outflow. We investigate the plasma physics in the\nsurroundings of massive collapsing stars harboring choked jets via\nrelativistic, non-resistive MHD simulations. As a result, we define the\nparameter space allowing for jets to remain choked, and we quantify the\nacceleration rate and efficiency for charged particles in the strong shocks of\nsuch astrophysical environments. Preliminary results show that high Mach\nnumbers ($\\sim 100$) after 5-10 seconds of constant energy injection\ncharacterize the forward shock, possibly allowing for efficient particle\nacceleration and high-energy neutrino production. Our results are presented for\nblue supergiant progenitors."}
{"id": "2509.22478", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.22478", "abs": "https://arxiv.org/abs/2509.22478", "authors": ["Florian Kéruzoré"], "title": "halox: Dark matter halo properties and large-scale structure calculations using JAX", "comment": "6 pages, submitted to the Journal of Open Source Software. halox is\n  available at https://github.com/fkeruzore/halox", "summary": "Dark matter halos are fundamental structures in cosmology, forming the\ngravitational potential wells hosting galaxies and clusters of galaxies. Their\nproperties and statistical distribution (including the halo mass function) are\ninvaluable tools to infer the fundamental properties of the Universe. The\n\\texttt{halox} package is a JAX-powered Python library enabling differentiable\nand accelerated computations of key properties of dark matter halos, and of the\nhalo mass function. The automatic differentiation capabilities of\n\\texttt{halox} enable its usage in gradient-based workflows, e.g. in efficient\nHamiltonian Monte Carlo sampling or machine learning applications."}
{"id": "2509.22639", "categories": ["astro-ph.HE", "gr-qc"], "pdf": "https://arxiv.org/pdf/2509.22639", "abs": "https://arxiv.org/abs/2509.22639", "authors": ["George N. Wong", "Andrew Chael", "Alexandru Lupsasca", "Eliot Quataert"], "title": "Black Hole Polarimetry II: The Connection Between Spin and Polarization", "comment": "22 pages, 11 figures", "summary": "We study synchrotron polarization in spatially resolved horizon-scale images,\nsuch as those produced by the Event Horizon Telescope (EHT). In both general\nrelativistic magnetohydrodynamic (GRMHD) simulations as well as simplified\nmodels of the black hole magnetosphere, the polarization angle, quantified by\nthe complex observable arg(beta_2), depends strongly and systematically on the\nblack hole spin. This relationship arises from the coupling between spin and\nthe structure of the magnetic field in the emission region, and it can be\ncomputed analytically in the force-free limit. To explore this connection\nfurther, we develop a semi-analytic inflow framework that solves the time\nstationary axisymmetric equations of GRMHD in the black hole's equatorial\nplane; this model can interpolate between the force-free and inertial regimes\nby varying the magnetization of the inflow. Our model demonstrates how finite\ninertia modifies the structure of the electromagnetic field and can be used to\nquantitatively predict the observed polarization pattern. By comparing reduced\nmodels, GRMHD simulations, and analytic limits, we show that the observed\nsynchrotron polarization can serve as a robust diagnostic of spin under\nassumptions about Faraday rotation and the emission geometry. Applied to EHT\ndata, the model disfavors high-spin configurations for both M87* and Sgr A*,\nhighlighting the potential of polarimetric imaging as a probe of both black\nhole spin and near-horizon plasma physics."}
{"id": "2509.21366", "categories": ["astro-ph.IM", "astro-ph.HE", "hep-ph"], "pdf": "https://arxiv.org/pdf/2509.21366", "abs": "https://arxiv.org/abs/2509.21366", "authors": ["Hana Ali Messaoud", "Tom François", "Thomas Vuillaume"], "title": "Advanced stereoscopy applied to CTAO", "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC\n  2025), 2025", "summary": "The Cherenkov Telescope Array Observatory (CTAO) is an international\nobservatory currently under construction, which will consist of two sites (one\nin the Northern Hemisphere and one in the Southern Hemisphere). It will\neventually be the largest and most sensitive ground-based gamma-ray\nobservatory. In the meantime, a small subarray composed of four Large-Sized\nTelescopes (LSTs) at the Northern site will begin collecting data in the coming\nyear. In preparation, we present a stereoscopic event reconstruction using\ngraph neural networks (GNNs) to combine information from several telescopes of\nthis subarray. In our previous work, we explored the use of GNNs for the\nstereoscopic reconstruction of gamma-ray events on simulated data from the\nProd5 sample and showed that GNNs provide a better stereoscopic reconstruction.\nWe now compare this approach to the currently foreseen method that analytically\ncombines the output of monoscopic random forests, and explore how GNNs can be\nused in fusion with the Random forest algorithm in order to provide a more\nsensitive stereoscopic system."}
{"id": "2509.22074", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.22074", "abs": "https://arxiv.org/abs/2509.22074", "authors": ["A. Dinesh", "M. Láinez", "R. A. Cerviño", "D. Morcuende", "A. Moralejo", "J. L. Contreras", "A. Baquero", "J. Lozano"], "title": "Next-day observation processing for the LST-1 and MAGIC", "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC\n  2025), 2025", "summary": "The MAGIC and LST-1 telescopes, located at the Roque de los Muchachos\nObservatory on La Palma, operate dedicated On-Site Analysis (OSA) pipelines\nthat provide rapid, automated processing of observational data. These systems\nproduce high-level data products just a few hours after observations are\ncompleted, enabling quick-look analyses, next-day data quality assessments, and\nrapid-response science such as flare detection and Target of Opportunity\nfollow-ups. OSA pipelines have been in continuous operation since 2012 for\nMAGIC and since 2021 for LST-1, automatically processing nightly data using the\nstandard analysis chain. The experience gained from both systems provides\nessential lessons for the development of Cherenkov Telescope Array\nObservatory's (CTAO's) on-site analysis, demonstrating the practical and\nscientific benefits of fast data processing in Cherenkov telescopes."}
