{"id": "2510.09683", "categories": ["astro-ph.IM", "astro-ph.CO"], "pdf": "https://arxiv.org/pdf/2510.09683", "abs": "https://arxiv.org/abs/2510.09683", "authors": ["David Wittman"], "title": "Fisher Matrix for Beginners", "comment": "This pedagogical document is posted only on arXiv", "summary": "The Fisher information matrix is used widely in astronomy (and presumably\nother fields) to forecast the precision of future experiments while they are\nstill in the design phase. Although many sources describe the mathematics of\nthe formalism, few sources offer simple examples to help the beginner. This\npedagogical document works through a few simple examples to develop conceptual\nunderstanding of the applications."}
{"id": "2510.09748", "categories": ["astro-ph.IM", "astro-ph.CO"], "pdf": "https://arxiv.org/pdf/2510.09748", "abs": "https://arxiv.org/abs/2510.09748", "authors": ["Michelle Ntampaka", "A. Ciprijanovic", "Ana Maria Delgado", "John Soltis", "John F. Wu", "Mikaeel Yunus", "John ZuHone"], "title": "The Importance of Being Adaptable: An Exploration of the Power and Limitations of Domain Adaptation for Simulation-Based Inference with Galaxy Clusters", "comment": null, "summary": "The application of deep machine learning methods in astronomy has exploded in\nthe last decade, with new models showing remarkably improved performance on\nbenchmark tasks. Not nearly enough attention is given to understanding the\nmodels' robustness, especially when the test data are systematically different\nfrom the training data, or \"out of domain.\" Domain shift poses a significant\nchallenge for simulation-based inference, where models are trained on simulated\ndata but applied to real observational data. In this paper, we explore domain\nshift and test domain adaptation methods for a specific scientific case:\nsimulation-based inference for estimating galaxy cluster masses from X-ray\nprofiles. We build datasets to mimic simulation-based inference: a training set\nfrom the Magneticum simulation, a scatter-augmented training set to capture\nuncertainties in scaling relations, and a test set derived from the\nIllustrisTNG simulation. We demonstrate that the Test Set is out of domain in\nsubtle ways that would be difficult to detect without careful analysis. We\napply three deep learning methods: a standard neural network (NN), a neural\nnetwork trained on the scatter-augmented input catalogs, and a Deep\nReconstruction-Regression Network (DRRN), a semi-supervised deep model\nengineered to address domain shift. Although the NN improves results by 17% in\nthe Training Data, it performs 40% worse on the out-of-domain Test Set.\nSurprisingly, the Scatter-Augmented Neural Network (SANN) performs similarly.\nWhile the DRRN is successful in mapping the training and Test Data onto the\nsame latent space, it consistently underperforms compared to a straightforward\nYx scaling relation. These results serve as a warning that simulation-based\ninference must be handled with extreme care, as subtle differences between\ntraining simulations and observational data can lead to unforeseen biases\ncreeping into the results."}
{"id": "2510.09756", "categories": ["astro-ph.IM", "astro-ph.GA", "astro-ph.HE", "astro-ph.SR", "physics.comp-ph"], "pdf": "https://arxiv.org/pdf/2510.09756", "abs": "https://arxiv.org/abs/2510.09756", "authors": ["Philip F. Hopkins", "Elias R. Most"], "title": "Time-Dilation Methods for Extreme Multiscale Timestepping Problems", "comment": "15 pages, 4 figures, 3 appendices. Submitted to the Open Journal of\n  Astrophysics. Comments welcome. Example implementation in the public GIZMO\n  code at: http://www.tapir.caltech.edu/~phopkins/Site/GIZMO.html", "summary": "Many astrophysical simulations involve extreme dynamic range of timescales\naround 'special points' in the domain (e.g. black holes, stars, planets, disks,\ngalaxies, shocks, mixing interfaces), where processes on small scales couple\nstrongly to those on large scales. Adaptive resolution, multi-physics, and\nhybrid numerical methods have enabled tremendous progress on the spatial,\nphysics, and numerical challenges involved. But often the limiter for following\nthe long timescales of global evolution is the extremely short numerical\ntimestep required in some subdomains (which leads to their dominating\nsimulation costs). Recently several approaches have been developed for tackling\nthis in problems where the short timescale solution is sampled and then\nprojected as an effective subgrid model over longer timescales (e.g. 'zooming\nin and out'). We generalize these to a family of models where time evolution is\nmodulated by a variable but continuous in space-and-time dilation/stretch\nfactor $a({\\bf x},\\,t)$. This extends previous well-studied approaches\n(including reduced-speed-of-light and binary orbital dynamics methods), and\nensures that the system comes to correct local steady-state solutions, and\nderive criteria that the dilation factor/timesteps/resolution must obey to\nensure good behavior. We present a variety of generalizations to different\nphysics or coupling scales. Compared to previous approaches, this method makes\nit possible to avoid imprinting arbitrary scales where there is no clear\nscale-separation, and couples well to Lagrangian or Eulerian methods. It is\nflexible and easily-implemented and we demonstrate its validity (and\nlimitations) in test problems. We discuss the relationship between these\nmethods and physical time dilation in GRMHD. We demonstrate how this can be\nused to obtain effective speedup factors exceeding $\\gtrsim 10^{4}$ in\nmultiphysics simulations."}
{"id": "2510.09759", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2510.09759", "abs": "https://arxiv.org/abs/2510.09759", "authors": ["Anna Ordog", "Rebecca A. Booth", "T. L. Landecker", "Ettore Carretti", "Alex S. Hill", "Jo-Anne C. Brown", "Artem Davydov", "Leonardo Moutinho Caffarello", "Luca B. Galler", "Jonas Flygare", "Jennifer L. West", "A. G. Willis", "Mehrnoosh Tahani", "G. J. Hovey", "Dustin Lagoy", "Stephen Harrison", "Mike Smith", "Charl Baard", "Rob H. Messing", "D. A. Del Rizzo", "Benoit Robert", "Timothy Robishaw", "John M. Dickey", "George Morgan", "Ian R. Kennedy", "Marijke Haverkorn", "Andrea Bracco", "John Conway"], "title": "GMIMS-DRAGONS: A Faraday Depth Survey of the Northern Sky Covering 350 to 1030 MHz", "comment": "Submitted to Astrophysical Journal Supplement (ApJS)", "summary": "Polarized synchrotron emission at meter to centimeter wavelengths provides an\neffective tracer of the Galactic magnetic field. Calculating Faraday depth, the\nmost useful parameter for mapping the line-of-sight magnetic field, requires\nobservations covering wide frequency bands with many channels. As part of the\nGlobal Magneto-Ionic Medium Survey we have observed polarized emission spanning\n350-1030 MHz over the Northern sky, in the declination range\n${-20^{\\circ}}\\leq{\\delta}\\leq{90^{\\circ}}$. We used the 15 m telescope at the\nDominion Radio Astrophysical Observatory (DRAO), equipped to receive orthogonal\ncircular polarizations, with the Onsala Space Observatory band-1 feed developed\nfor the Square Kilometre Array. Angular resolution varies across the band from\n$1.3^{\\circ}$ to $3.6^{\\circ}$. A digital spectrometer provided 42 kHz\nfrequency resolution. Data were taken with the telescope moving rapidly in\nazimuth and are absolutely calibrated in intensity. Approximately 20% of the\nband was obscured by radio-frequency interference. Resolution in Faraday depth\nis $\\sim6$ rad m$^{-2}$, and features as wide as $\\sim38$ rad m$^{-2}$ are\nrepresented. The median sensitivity of the Faraday depth cube is 11 mK.\nApproximately 55% of sight-lines in this survey show Faraday complexity. This\ndataset, called ``DRAO GMIMS of the Northern Sky'' (DRAGONS), is the first to\nprobe Faraday depth of the Northern sky in its frequency range and will support\nmany scientific investigations. The data will be used to calibrate surveys with\nhigher angular resolution, particularly Galactic foreground maps from the\nCanadian Hydrogen Intensity Mapping Experiment, and to provide information on\nlarge structures for aperture-synthesis telescopes, particularly the DRAO\nSynthesis Telescope. The data are available through the Canadian Astronomy Data\nCentre."}
{"id": "2510.09744", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.09744", "abs": "https://arxiv.org/abs/2510.09744", "authors": ["Genevieve Schroeder", "Ben Margalit", "Brian D. Metzger", "Wen-fai Fong", "Benjamin P. Gompertz", "Kate D. Alexander", "Edo Berger", "Tanmoy Laskar", "Gavin P. Lamb", "Andrew Levan", "Charles D. Kilpatrick", "Jillian C. Rastinejad"], "title": "No Sign of a Magnetar Remnant Following the Kilonova-Producing Long GRB 211211A $\\sim 1.7~$Years Later", "comment": "15 pages, 4 figures, submitted to ApJ", "summary": "In addition to a $\\gamma$-ray burst (GRB), the merger of two neutron stars\nmay produce a temporarily or indefinitely stable neutron star remnant with a\nstrong magnetic field (a \"magnetar\"). As this magnetar remnant spins down, it\ncan deposit its rotational energy into the surrounding kilonova ejecta,\nproducing synchrotron emission that peaks in the radio bands $\\sim$months-years\nafter the merger (\"boosted kilonova\"). The nearby ($z=0.0763$) long-duration\nGRB 211211A, which has an apparent kilonova counterpart and likely neutron star\nmerger progenitor, may have produced such a remnant. We observed the location\nof GRB 211211A at 6 GHz with the NSF's Karl G. Jansky Very Large Array (VLA)\nspanning $\\approx 0.54$-$1.7~$years after the burst. We do not detect any radio\nemission, placing strong limits on the energy deposited into the ejecta by any\nremnant to $\\lesssim 4.4 \\times 10^{52}~{\\rm erg}$. Due to the proximity of the\nevent, we are also able to place limits on a kilonova afterglow that did not\nreceive any additional energy deposition, though it is possible such emission\nwill be suppressed until $\\sim 4~{\\rm years}$ after the burst, when the\nkilonova is expected to overtake the forward shock of the GRB. Future\nobservations with the VLA and next-generation radio facilities will be able to\nfurther constrain the magnetar-boosted kilonova and kilonova afterglow\nscenarios, as well as directly constrain models in the scenario that GRB\n211211A was instead produced by a collapsar."}
{"id": "2510.09774", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2510.09774", "abs": "https://arxiv.org/abs/2510.09774", "authors": ["Raed Diab", "Alvaro Herrera", "Chance Jackson", "Paul Fulda"], "title": "A quantitative performance analysis of two different interferometric alignment sensing schemes for gravitational wave detectors", "comment": null, "summary": "Precise laser alignment in optical cavities is essential for high-precision\nlaser interferometry. We report on a table-top optical experiment featuring two\nalignment sensing schemes: the conventional Wavefront Sensing (WFS) scheme\nwhich uses quadrant photodetectors (QPDs) to recover optical alignment, and the\nnewly developed Radio Frequency Jitter Alignment Sensing (RFJAS) scheme, which\nuses an electro-optic beam deflector (EOBD) to apply fast angular modulation.\nThis work evaluates the performance of RFJAS through a direct, side-by-side\ncomparison with WFS. We present a detailed noise budget for both techniques,\nwith particular emphasis on limitations at low frequencies, below 30\\,Hz. Our\nresults show that WFS performance is constrained by technical noise arising\nfrom beam spot motion (BSM), mainly due to beam miscentering on QPDs. In\ncontrast, RFJAS is primarily limited by residual RF amplitude modulation. A\nblended scheme that combines both sensing methods may offer the most practical\napproach for use in gravitational wave detectors such as Advanced LIGO."}
{"id": "2510.09745", "categories": ["astro-ph.HE", "astro-ph.SR", "gr-qc"], "pdf": "https://arxiv.org/pdf/2510.09745", "abs": "https://arxiv.org/abs/2510.09745", "authors": ["Jakub Klencki", "Brian D. Metzger"], "title": "Luminous Fast Blue Optical Transients as \"Failed\" Gravitational Wave Sources: Helium Core$-$Black Hole Mergers Following Delayed Dynamical Instability", "comment": "20 pages, 11 figures + Appendix", "summary": "Binaries in which a massive donor star undergoes an extended ($\\gtrsim$ kyr)\nphase of stable mass transfer onto a black hole (BH) accretor offer a promising\nchannel for creating LIGO gravitational wave sources. However, in many systems\nthe mass transfer terminates prematurely in a dynamical instability at orbital\nperiods of a few days, culminating in the BH plunging into the donor and\npotentially disrupting and accreting its helium core at highly super-Eddington\nrates. Combining a suite of binary evolution models with analytic estimates and\npopulation synthesis, we predict the population of luminous transients from\ndelayed dynamical instability (DDI) and attribute them to the \"luminous\" class\nof fast blue optical transients (LFBOTs). The initial plunge of the BH into the\npartially stripped envelope typically ejects $\\sim 10M_{\\odot}$ of\nH/He-enriched material at speeds $\\sim 10^{2}-10^{3}$ km s$^{-1}$, generating a\ncompact circumstellar medium (CSM) of radius $\\lesssim 1000R_{\\odot}$ by the\ntime the BH meets and tidally disrupts the HeC. Rapid BH accretion generates a\nhighly aspherical wind-driven explosion into the environment, powering\nUV/optical emission via CSM interaction and X-ray reprocessing that rises over\na few days to a luminosity $\\sim 10^{44}-10^{45}$ erg s$^{-1}$ before fading as\nthe disk spreads outwards and accretion rate drops. Luminous radio/sub-mm\nemission is generated over several months as the jet collides with the slow\nquasi-spherical binary outflow, generated by the stable mass transfer preceding\nDDI, extending to radii $\\sim 10^{17}$ cm, in agreement with the inferred CSM\nenvironments of LFBOTs. We estimate local rates of DDI merger transients\n$5-300$ Gpc$^{-3}$ yr$^{-1}$, with a preference for low-metallicities, in\nagreement with LFBOT demographics. Taken together, our results support LFBOTs\nas being luminous signposts of \"failed\" gravitational wave sources."}
{"id": "2510.09797", "categories": ["astro-ph.IM", "astro-ph.EP", "physics.chem-ph"], "pdf": "https://arxiv.org/pdf/2510.09797", "abs": "https://arxiv.org/abs/2510.09797", "authors": ["Elettra L. Piacentino", "Aurelia Balkanski", "Jenny Calahan", "Anna Fitzsimmons", "Mahesh Rajappan", "Karin I. Oberg"], "title": "The survival of aromatic molecules in protoplanetary disks", "comment": null, "summary": "Aromaticity is a common chemical functionalities in bioactive molecules. In\ninterstellar and circumstellar environments benzene and other small aromatics\nare considered the precursor for more complex prebiotic molecules and they have\nshown to potentially have rich ice-phase photochemistry. The availability of\nsmall organic molecules in prebiotic networks depends on their photostability\nin astrophysical environments preceding planet formation, particularly during\nthe protoplanetary disk stage, as the disk composition is linked to the\nchemical make-up of planets and planetesimals. We study the ultraviolet (UV)\nphotodestruction (120-160 nm) of five aromatic molecules in undiluted ices and,\nfor selected cases, in astrophysically relevant ice matrices (H2O, CO, CO2).\nFor each ice, we measure the destruction cross sections as a function of photon\nexposure. In undiluted ices, aromatic molecules exhibit substantially lower\nphotodestruction cross sections (sigma < 10-19 cm2) than aliphatic\nhydrocarbons, including cyclohexane, (sigma = 2.8-4x10-18 cm2). Furthermore,\nneither substituent nature nor size affects the aromatic stability in pure\nices, suggesting that the strong intermolecular interactions among aromatic\nmolecules provide protection against VUV exposure, even with small to mid-sized\nring substituents. In mixed ices, the photodestruction and reactivity of\naromatic molecules (sigma = 2.5-6.1x10-18 cm2) increases by more than an order\nof magnitude, but are still lower than in the gas-phase. We attribute this to a\nweaker cage effect and matrix-specific interactions. We use the experimental\nphotodestruction cross sections to estimate the lifetime of aromatic molecules\nin protoplanetary disks, denileating the disks regions in which aromatic\nphotochemistry is expected to be the most active."}
{"id": "2510.09746", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.09746", "abs": "https://arxiv.org/abs/2510.09746", "authors": ["Pravita Hallur", "Lia Medeiros", "Pierre Christian", "George N. Wong"], "title": "Characterizing Power Spectra of Density Fluctuations in GRMHD Simulations of Black Hole Accretion Using Taylor's Frozen-in Hypothesis", "comment": "12 pages, 7 figures. Submitted to ApJ", "summary": "We characterize the spatial power spectrum of density fluctuations in\nmagnetohydrodynamic flows in a suite of high-resolution, long-time-span general\nrelativistic magnetohydrodynamic (GRMHD) simulations. Extracting the local\nspatial power spectrum in curved spacetime directly from GRMHD simulations can\nbe challenging for several conceptual and mechanical reasons, including choices\nof the reference frame, the non-uniform co-ordinate grid of the outputs and\nlimited resolution. Taylor's frozen-in hypothesis describes a mapping between\nthe temporal and spatial power spectrum of turbulence, which we apply to\ndensity fluctuations. We explore the validity of the assumptions underlying\nTaylor's hypothesis and evaluate its applicability in extracting spatial power\nspectra of density fluctuations of black hole accretion flows. Using outputs\nfrom the GRMHD code KORAL, we explore models with strong and ordered magnetic\nfields (MAD, Magnetically Arrested Disks) as well as weak and disordered\nmagnetic fields (SANE, Standard and Normal Evolution). We explore the effects\nof black hole spin on the power spectra and characterize their spectral\nproperties as a function of distance from the black hole. The observed power\nspectra follow a broken power law with two slopes separated by a break\nfrequency. Our analysis shows a decrease in break frequency with increasing\nradius, with distinct trends between SANE and MAD flows. We also observe the\nfirst slope to be steeper for SANE flows and some notable distinctions between\nprograde and retrograde spins."}
{"id": "2510.09806", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2510.09806", "abs": "https://arxiv.org/abs/2510.09806", "authors": ["Louis Desdoigts", "Benjamin Pope", "Max Charles", "Peter Tuthill", "Dori Blakely", "Doug Johnstone", "Shrishmoy Ray", "Anand Sivaramakrishnan", "Jens Kammerer", "Deepashri Thatte", "Rachel Cooper"], "title": "AMIGO: a Data-Driven Calibration of the JWST Interferometer", "comment": "35 pages, 21 figures", "summary": "The James Webb Space Telescope (JWST) hosts a non-redundant Aperture Masking\nInterferometer (AMI) in its Near Infrared Imager and Slitless Spectrograph\n(NIRISS) instrument, providing the only dedicated interferometric facility\naboard - magnitudes more precise than any interferometric experiment previously\nflown. However, the performance of AMI (and other high resolution approaches\nsuch as kernel phase) in recovery of structure at high contrasts has not met\ndesign expectations. A major contributing factor has been the presence of\nuncorrected detector systematics, notably charge migration effects in the H2RG\nsensor, and insufficiently accurate mask metrology. Here we present Amigo, a\ndata-driven calibration framework and analysis pipeline that forward-models the\nfull JWST AMI system - including its optics, detector physics, and readout\nelectronics - using an end-to-end differentiable architecture implemented in\nthe Jax framework and in particular exploiting the dLux optical modelling\npackage. Amigo directly models the generation of up-the-ramp detector reads,\nusing an embedded neural sub-module to capture non-linear charge redistribution\neffects, enabling the optimal extraction of robust observables, for example\nkernel amplitudes and phases, while mitigating systematics such as the\nbrighter-fatter effect. We demonstrate Amigo's capabilities by recovering the\nABDor AC binary from commissioning data with high-precision astrometry, and\ndetecting both HD206893B and the inner substellar companion HD206893c: a\nbenchmark requiring contrasts approaching 10 magnitudes at separations of only\n100 mas. These results exceed outcomes from all published pipelines, and\nre-establish AMI as a viable competitor for imaging at high contrast at the\ndiffraction limit. Amigo is publicly available as open-source software\ncommunity resource."}
{"id": "2510.09760", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.09760", "abs": "https://arxiv.org/abs/2510.09760", "authors": ["Lindsey A. Kwok", "Chang Liu", "Saurabh W. Jha", "Stéphane Blondin", "Conor Larison", "Adam A. Miller", "Mi Dai", "Ryan J. Foley", "Alexei V. Filippenko", "Moira Andrews", "Jennifer E. Andrews", "Katie Auchettl", "Carles Badenes", "Thomas G. Brink", "Kyle W. Davis", "Andreas Flörs", "Lluís Galbany", "Estefania Padilla Gonzalez", "D. Andrew Howell", "Sahana Kumar", "Réka Könyves-Tóth", "Natalie LeBaron", "Colin W. Macrie", "Keiichi Maeda", "Kate Maguire", "Curtis McCully", "Nicolas E. Meza-Retamal", "Rüdiger Pakmor", "Jeniveve Pearson", "Anthony L. Piro", "Abigail Polin", "Nabeel Rehemtulla", "César Rojas-Bravo", "David J. Sand", "Chita Sangkachan", "Huei Sears", "Mridweeka Singh", "Bhagya M. Subrayan", "Kirsty Taggart", "Tea Temim", "Jacco H. Terwel", "Samaporn Tinyanont", "József Vinkó", "Xiaofeng Wang", "J. Craig Wheeler", "Yi Yang"], "title": "JWST Spectroscopy of SN Ia 2022aaiq and 2024gy: Evidence for Enhanced Central Stable Ni Abundance and a Deflagration-to-Detonation Transition", "comment": "30 pages, 17 figures, 2 tables, submitted to AAS Journals", "summary": "We present optical + near-infrared (NIR) + mid-infrared (MIR) observations of\nthe normal Type~Ia supernovae (SN Ia) 2022aaiq and 2024gy in the nebular phase,\ncontinuously spanning 0.35--28 microns. Medium-resolution JWST spectroscopy\nreveals novel narrow ($v_{\\mathrm{FWHM}}<1500$ km s$^{-1}$) [Ni II] 1.94 and\n6.64 micron cores in both events. The MIR [Ni II] 6.64 micron line exhibits a\ndistinct narrow core atop a broader base, indicating a central enhancement of\nstable Ni. This structure points to high central densities consistent with a\nnear-Chandrasekhar-mass ($M_{Ch}$) progenitor or a high-metallicity\nsub-$M_{Ch}$ progenitor. From detailed line-profile inversions of SN 2024gy, we\nderive emissivity profiles for stable iron-group elements (IGEs), radioactive\nmaterial, and intermediate-mass elements (IMEs), revealing spatially distinct\nejecta zones. The [Ni III] 7.35 micron line shows a shallow-to-steep slope\ntransition - a \"broken-slope\" morphology - that matches predictions for delayed\ndetonation explosions with separated deflagration and detonation ashes. We also\nreanalyze and compare to archival JWST spectra of SN 2021aefx and the\nsubluminous SN 2022xkq. We estimate a stable $^{58}$Ni mass of $\\sim0.1$\nM$_\\odot$ for SN 2024gy, consistent with delayed detonation models, and\n$\\sim0.01$ M$_\\odot$ for SN 2022xkq, favoring sub-$M_{Ch}$ scenarios. These\nresults demonstrate that resolved line profiles, now accessible with JWST,\nprovide powerful diagnostics of explosion geometry, central density, and\nprogenitor mass in SN Ia."}
{"id": "2510.09990", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.09990", "abs": "https://arxiv.org/abs/2510.09990", "authors": ["Moonzarin Reza", "Lifan Wang", "Lei Hu"], "title": "An FPCA-Enhanced Ensemble Learning Framework for Photometric Identification of Type Ia Supernovae", "comment": "Submitted to The Astrophysical Journal (ApJ) 24 pages, 16 figures", "summary": "Type Ia supernovae (SNe Ia) are essential tools for addressing key cosmic\nquestions, including the Hubble tension and the nature of dark energy. Modern\nsurveys are predominantly photometry-based, making the construction of a clean\nphotometric SNe Ia sample crucial. In this study, we investigate whether\nfunctional principal component analysis (FPCA) scores derived from photometric\nlight curves, combined with ensemble learning, can reliably distinguish SNe Ia\nfrom other transients using the PLAsTiCC dataset. FPCA provides a data-driven,\nflexible characterization of light curves without relying on rigid theoretical\nmodel assumptions. Light curves are fitted by minimizing residuals with penalty\nterms from clean samples, making the method robust to outliers or poorly\nsampled bands. The first two FPCA scores and peak magnitudes across the five\nLSST bands are used as classification features. We implement two complementary\nbinary classifiers: an ensemble boosting model (CatBoost) and a statistical\nprobabilistic method based on Euclidean distances. CatBoost slightly\noutperforms the statistical method, achieving 98.5% accuracy and 97.8%\nprecision. Performance remains robust (>90%) under typical photometric redshift\nuncertainties ({\\sigma} = 0.1). On the spectroscopic DES Y5 sample, both\nmethods reach approximately 90% accuracy and 95% precision, demonstrating\nstrong out-of-domain generalization compared to state-of-the-art methods with\nlimited cross-survey applicability. Applied to DECam DDF and DESIRT transients,\nthe predictions strongly agree, and their intersection provides a\nhigh-confidence SNe Ia sample for cosmological analyses. Overall, this\nFPCA-based framework offers a powerful, flexible tool for classifying\ntransients in upcoming large-scale surveys such as LSST and Roman."}
{"id": "2510.09978", "categories": ["astro-ph.HE", "physics.plasm-ph"], "pdf": "https://arxiv.org/pdf/2510.09978", "abs": "https://arxiv.org/abs/2510.09978", "authors": ["Shi-Min Liang", "Jian-Fu Zhang", "Na-Na Gao", "Nian-Yu Yi"], "title": "Studying the properties of reconnection-driven turbulence", "comment": "9 pages, 6 figures and 1 table. Accepted for publication in A&A", "summary": "Magnetic reconnection, often accompanied by turbulence interaction, is a\nubiquitous phenomenon in astrophysical environments. However, the current\nunderstanding of the nature of turbulent magnetic reconnection remains\ninsufficient. We investigate the statistical properties of reconnection\nturbulence in the framework of the self-driven reconnection. Using the\nopen-source software package AMUN, we first perform numerical simulations of\nturbulent magnetic reconnection. We then obtain the statistical results of\nreconnection turbulence by traditional statistical methods such as the power\nspectrum and structure function. Our numerical results demonstrate: (1) the\nvelocity spectrum of reconnection turbulence follows the classical Kolmogorov\ntype of $E\\propto k^{-5/3}$, while the magnetic field spectrum is steeper than\nthe Kolmogorov spectrum, which are independent of limited resistivity, guide\nfield, and isothermal or adiabatic fluid states; (2) most of the simulations\nshow the anisotropy cascade, except that the presence of a guide field leads to\nan isotropic cascade; (3) reconnection turbulence is incompressible in the\nadiabatic state, with energy distribution dominated by the velocity solenoidal\ncomponent; (4) different from pure magnetohydrodynamic (MHD) turbulence, the\nintermittency of the velocity field is stronger than that of the magnetic field\nin reconnection turbulence. The steep magnetic field spectrum, together with\nthe velocity spectrum of Kolmogorov type, can characterize the feature of the\nreconnection turbulence. In the case of the presence of the guide field, the\nisotropy of the reconnection turbulence cascade is also different from the\ncascade mode of pure MHD turbulence. Our experimental results provide new\ninsights into the properties of reconnection turbulence, which will contribute\nto advancing the self-driven reconnection theory."}
{"id": "2510.10032", "categories": ["astro-ph.IM", "astro-ph.CO"], "pdf": "https://arxiv.org/pdf/2510.10032", "abs": "https://arxiv.org/abs/2510.10032", "authors": ["Yiming Ren", "Kwan Chuen Chan", "Le Zhang", "Yin Li", "Haolin Zhang", "Ruiyu Song", "Yan Gong", "Xian-Min Meng", "Xingchen Zhou"], "title": "Photo-$z$ Estimation with Normalizing Flow", "comment": "19 pages, 14 figures", "summary": "Accurate photometric redshift (photo-$z$) estimation is a key challenge in\ncosmology, as uncertainties in photo-$z$ directly limit the scientific return\nof large-scale structure and weak lensing studies, especially in upcoming Stage\nIV surveys. The problem is particularly severe for faint galaxies with sparse\nspectroscopic training data. In this work, we introduce nflow-$z$, a novel\nphoto-$z$ estimation method using the powerful machine learning technique of\nnormalizing flow (NF). nflow-$z$ explicitly models the redshift probability\ndistribution conditioned on the observables such as fluxes and colors. We build\ntwo nflow-$z$ implementations, dubbed cINN and cNSF, and compare their\nperformance. We demonstrate the effectiveness of nflow-$z$ on several datasets,\nincluding a CSST mock, the COSMOS2020 catalog, and samples from DES Y1, SDSS,\nand DESCaLS. Our evaluation against state-of-the-art algorithms shows that\nnflow-$z$ performs favorably. For instance, cNSF surpasses Random Forest,\nMulti-Layer Perceptron, and Convolutional Neutral Network on the CSST mock\ntest. We also achieve a ~30\\% improvement over official results for the faint\nDESCaLS sample and outperform conditional Generative Adversarial Network and\nMixture Density Network methods on the DES Y1 dataset test. Furthermore,\nnflow-$z$ is computationally efficient, requiring only a fraction of the\ncomputing time of some of the competing algorithms. Our algorithm is\nparticularly effective for the faint sample with sparse training data, making\nit highly suitable for upcoming Stage IV surveys."}
{"id": "2510.09986", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.09986", "abs": "https://arxiv.org/abs/2510.09986", "authors": ["Zi-Yi Zhou", "Long Ji", "Ling-Da Kong", "Sergey S. Tsygankov", "Qing-Cang Shui", "Lian Tao"], "title": "QPOs in a highly magnetized ultra-compact X-ray binary 4U 1626-67", "comment": "Accepted for publication in APJ", "summary": "We report the detection of mHz quasi-periodic oscillations (QPOs) in four\nNuSTAR observations of 4U 1626-67 during its recent spin-down episode. By using\na novel method based on the Hilbert-Huang Transform (HHT), we present the first\nQPO-phase-resolved timing and spectral analysis of accreting X-ray pulsars in\nlow mass X-ray binaries. Broadband QPO waveforms have been reconstructed and\nexhibit approximately sinusoidal shapes, with fractional amplitudes that vary\nwith energy. In addition, we find that spin pulse profiles exhibit stable\nshapes between different QPO phases with different instantaneous fluxes, while\nthe fractional root-mean-square (rms) is distinct for different observations.\nIn this source, both QPO-phase-resolved and averaged spectra can be modeled\nwith a negative and positive powerlaws exponential (NPEX) model, and their\nspectral evolutions show a similar trend, suggesting that the QPO modulation is\ncaused by accretion rate variability instead of a geometric obscuration. These\nresults provide new constraints on accretion physics in strongly magnetized\nneutron stars and the underlying mechanisms of QPOs."}
{"id": "2510.10067", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2510.10067", "abs": "https://arxiv.org/abs/2510.10067", "authors": ["Yingfeng Liu", "Shijie Sun", "Kaifeng Yu", "Furen Deng", "Shifan Zuo", "Jixia Li", "Yougang Wang", "Fengquan Wu", "Xuelei Chen"], "title": "Beamforming in Interferometer Arrays with Cross-couplings", "comment": "18 pages, 12 figures, RAA accepted", "summary": "For an interferometric array, an image of the sky can be synthesized from\ninterferometric visibilities, which are the cross-correlations of the received\nelectric voltages of pairs of array elements. However, to search for transient\ntargets such as the fast radio burst (FRB), it is more convenient to use the\nbeam-forming technique, where the real-time voltage outputs of the array\nelements are used to generate data streams (beams) which are sensitive to a\nspecific direction. This is usually achieved by a weighted sum of the array\nelement voltages, with the complex weight adjusted so that all outputs have the\nsame phase for that direction. Alternatively, beams can also be formed from the\nweighted sum of the short time averaged correlation (visibility) data. We shall\ncall these two approaches the electric voltage beam forming (EBF) and\ncross-correlation beam forming (XBF), respectively. All beams formed with the\nEBF can also be formed by the XBF method, but the latter can also generate\nbeams which can not be generated by the former. We discuss the properties of\nthese two kinds of beams, and the amount of computation required in each case.\nFor an array with large number of elements, the XBF would require much more\ncomputation resource, although this is partly compensated by the fact that it\nallows integration over time. We study the impact of cross-coupling between\narray elements on the beamforming, first using a toy model, then for the case\nof the Tianlai Cylinder Pathfinder Array. In both cases, we find that the\nimpact of the cross-coupling on the beam profile is relatively small. The\nunderstanding gained in this study is helpful in designing and understanding\nthe beam-forming FRB digital backend for compact arrays such as the Tianlai\narray."}
{"id": "2510.10017", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.10017", "abs": "https://arxiv.org/abs/2510.10017", "authors": ["Xiao Chen", "Weiping Liu", "Wei Wang"], "title": "Comprehensive X-ray Spectral-timing Analysis of GRS 1915+105 Based on Insight-HXMT Observations", "comment": "12 pages, 12 figures, accepted by MNRAS", "summary": "GRS 1915+105 has been well studied since its discovery, and is well-known for\nits complex light curve variability. Using the full currently available\nInsight-HXMT dataset from July 2017 to June 2023, we make a comprehensive\nspectral-timing analysis of this source and report four main findings. First,\nwe uncover a QPO frequency rising branch between MJD 58206 and 58230, where the\ncentroid frequency increases from $\\sim$2 Hz to $\\sim$6 Hz, consistent with a\nspectral state transition from the hard to intermediate state. This rising\nbranch completes the full QPO frequency evolution cycle when combined with the\nsubsequent frequency decay phase, and had been missed in prior NICER and\nInsight-HXMT studies. Second, we identify a previously unreported Flare 3\nduring the obscured state, which shows distinct spectral and timing properties\ncompared to the earlier flares. Third, we detect sub-Hz QPOs (<1 Hz) in all\nthree flares, specifically at $\\sim$0.01 Hz in Flare 1 and $\\sim$0.2 Hz in both\nFlares 2 and 3. In particular, the weak $\\sim$0.2 Hz signals observed in Flare\n3 indicate ongoing coronal activity despite strong obscuration. Finally, a\ncomparison between QPOs above and below 1 Hz suggests distinct origins, with\nthe former likely arising from Lense-Thirring precession of the inner hot flow\nand the latter from magnetic perturbations driving a failed disk wind. These\nfindings offer new insights into the unique accretion geometry and variability\nbehaviors of GRS 1915+105."}
{"id": "2510.10070", "categories": ["astro-ph.IM", "math-ph", "math.MP", "physics.comp-ph"], "pdf": "https://arxiv.org/pdf/2510.10070", "abs": "https://arxiv.org/abs/2510.10070", "authors": ["S. Rendon Restrepo", "O. Gressel"], "title": "An efficient spectral Poisson solver for the nirvana-III code: the shearing-box case with vertical vacuum boundary conditions", "comment": null, "summary": "The stability of a differentially rotating fluid subject to its own gravity\nis a problem with applications across wide areas of astrophysics--from\nprotoplanetary discs (PPDs) to entire galaxies. The shearing box formalism\noffers a conceptually simple framework for studying differential rotation in\nthe local approximation. Aimed at self-gravitating, and importantly, vertically\nstratified PPDs, we develop two novel methods for solving Poisson's equation in\nthe framework of the shearing box with vertical vacuum boundary conditions\n(BCs). Both approaches naturally make use of multi-dimensional fast Fourier\ntransforms for computational efficiency. While the first one exploits the\nlinearity properties of the Poisson equation, the second, which is slightly\nmore accurate, consists of finding the adequate discrete Green's function (in\nFourier space) adapted to the problem at hand. To this end, we have revisited\nthe method proposed by Vico et al. (2016) and have derived an analytical\nGreen's function satisfying the shear-periodic BCs in the plane as well as\nvacuum BCs, vertically. Our spectral method demonstrates excellent accuracy,\neven with a modest number of grid points, and exhibits third-order convergence.\nIt has been implemented in the NIRVANA-III code, where it exhibits good\nscalability up to 4096 CPU cores, consuming less than 6% of the total runtime.\nThis was achieved through the use of P3DFFT, a fast Fourier Transform library\nthat employs pencil decomposition, overcoming the scalability limitations\ninherent in libraries using slab decomposition. We have introduced two novel\nspectral Poisson solvers that guarantees high accuracy, performance, and\nintrinsically support vertical vacuum boundary conditions in the shearing-box\nframework. Our solvers enable high-resolution local studies involving\nself-gravity, such as MHD simulations of gravito-turbulence or gravitational\nfragmentation."}
{"id": "2510.10043", "categories": ["astro-ph.HE", "gr-qc"], "pdf": "https://arxiv.org/pdf/2510.10043", "abs": "https://arxiv.org/abs/2510.10043", "authors": ["Tomasz Krajewski", "Włodek Kluźniak"], "title": "Accretion onto Reissner-Nordström naked singularities", "comment": "29 pages, 49 figures", "summary": "Nearly every galactic core contains a supermassive compact object,\nhypothesized to be a Kerr black hole. It was only with the advent of Event\nHorizon Telescope observations that the predictions of this hypothesis could be\nobservationally tested for our own Galaxy, and the nearby elliptical M87, on\nspatial scales comparable to the gravitational radius. At the same time it\nbecame possible to test whether alternatives such as naked singularities in\ngeneral relativity, or similar objects in alternative theories of gravity, are\nexcluded by the data. These and other observational developments renewed\ninterest in non-Kerr spacetime metrics, also in the context of active galactic\nnuclei at cosmological distances. Recently, we have shown that accreting naked\nsingularities in the Reissner-Nordstr\\\"{o}m metric of general relativity tend\nto produce strong outflows. The geometry and origin of these winds is studied\nhere, and their parameter dependence is investigated. To this end we performed\nnumerical GR hydrodynamical simulations of accretion of electrically neutral\nmatter in the Reissner-Nordstr\\\"{o}m metric and discussed the results in the\ncontext of analytic predictions of fluid motion in this spacetime."}
{"id": "2510.10713", "categories": ["astro-ph.IM", "astro-ph.CO", "astro-ph.EP", "astro-ph.GA", "astro-ph.HE", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.10713", "abs": "https://arxiv.org/abs/2510.10713", "authors": ["Yuan-Sen Ting"], "title": "Deep Learning in Astrophysics", "comment": "Manuscript submitted to Annual Review of Astronomy and Astrophysics\n  for Volume 64. This is the authors' version. Revisions and the final version\n  will be available at https://www.annualreviews.org/content/journals/astro", "summary": "Deep learning has generated diverse perspectives in astronomy, with ongoing\ndiscussions between proponents and skeptics motivating this review. We examine\nhow neural networks complement classical statistics, extending our data\nanalytical toolkit for modern surveys. Astronomy offers unique opportunities\nthrough encoding physical symmetries, conservation laws, and differential\nequations directly into architectures, creating models that generalize beyond\ntraining data. Yet challenges persist as unlabeled observations number in\nbillions while confirmed examples with known properties remain scarce and\nexpensive. This review demonstrates how deep learning incorporates domain\nknowledge through architectural design, with built-in assumptions guiding\nmodels toward physically meaningful solutions. We evaluate where these methods\noffer genuine advances versus claims requiring careful scrutiny. - Neural\narchitectures overcome trade-offs between scalability, expressivity, and data\nefficiency by encoding physical symmetries and conservation laws into network\nstructure, enabling learning from limited labeled data. - Simulation-based\ninference and anomaly detection extract information from complex, non-Gaussian\ndistributions where analytical likelihoods fail, enabling field-level\ncosmological analysis and systematic discovery of rare phenomena. - Multi-scale\nneural modeling bridges resolution gaps in astronomical simulations, learning\neffective subgrid physics from expensive high-fidelity runs to enhance\nlarge-volume calculations where direct computation remains prohibitive. -\nEmerging paradigms-reinforcement learning for telescope operations, foundation\nmodels learning from minimal examples, and large language model agents for\nresearch automation-show promise though are still developing in astronomical\napplications."}
{"id": "2510.10139", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.10139", "abs": "https://arxiv.org/abs/2510.10139", "authors": ["Fei-Fan Song", "Jirong Mao"], "title": "Possible Quasi-Period Oscillation Signals in the Unique Event of GRB 250702DBE/EP250702a?", "comment": "ApJ accepted", "summary": "GRB 250702DBE was time-consequently triggered by GBM onboard the Fermi\nsatellite. It is uncertain which celestial catalog is suitable for this special\nultra-long event to belong to. In this paper, we comprehensively investigate\nthe lightcurves obtained by Fermi-GBM detectors. In the energy band of 8-1000\nkeV, no Quasi-Period Oscillation (QPO) signals are found in the lightcurve of\nthe first burst 250702D, a possible QPO signal of 0.046 Hz corresponding to a\nperiod of 21.7 s is found in the lightcurve of the second burst 250702B, and a\npossible QPO signal of 0.024 Hz corresponding to a period of 41.7 s is found in\nthe lightcurve of last burst 250702E. The significance level of the possible\nQPO signals is comprehensively examined. In addition, we examine the spectral\nproperties of the sources. In general, a broken power law is suitable for\nmodeling the spectral data from 8 keV to 40 MeV. We qualitatively suggest some\nkinds of celestial object with the periodic characteristic that might be the\nprogenitors of this unique event."}
{"id": "2510.10783", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2510.10783", "abs": "https://arxiv.org/abs/2510.10783", "authors": ["Mikhail Zotov", "Andrei Trusov"], "title": "Reconstruction of Energy of Ultra-High-Energy Cosmic Rays Registered with a Fluorescence Telescope: One Time Frame Might Be Enough", "comment": "To appear in the proceedings of The 9th International Conference in\n  Deep Learning in Computational Physics (DLCP2025) July, 2-4, 2025, Moscow", "summary": "We address the challenge of reconstructing the energy of three\nultra-high-energy cosmic rays registered with a small fluorescence telescope\nEUSO-TA that operated in 2015 at the site of the Telescope Array experiment in\nUtah, USA. Each of these events was recorded within one time frame.\nConventional methods of energy reconstruction are not applicable in this case\nbecause the events do not have light curves but a single data point. As an\nalternative, we consider a number of approaches based on artificial neural\nnetworks. We demonstrate that a signal recorded by a fluorescence telescope\nwithin one time frame might be enough to reconstruct the energy of a primary\nparticle with reasonable accuracy using an ensemble of simple convolutional\nneural networks. Contrary to the conventional approach, reconstruction of the\nshower geometry is not needed for this. More than this, preliminary estimates\ncan be obtained even without recognizing the shower track. However, there\nremain some problems that do not allow us to claim that the suggested method is\nuniversal and always works. We discuss difficulties that we faced and possible\nways of improving the method."}
{"id": "2510.10267", "categories": ["astro-ph.HE", "hep-ph"], "pdf": "https://arxiv.org/pdf/2510.10267", "abs": "https://arxiv.org/abs/2510.10267", "authors": ["Qin-Mei Li", "Qi-Bin Sun", "Sheng-Bang Qian", "Fu-Xing Li"], "title": "New Evidence for Extragalactic Einstein Probe Transients associated with Long Gamma-ray Bursts", "comment": "8 pages,3 figures and 1 table", "summary": "The origin of extragalactic fast X-ray transients (EFXTs) remains a\nfundamental open question in high-energy astrophysics. The Einstein Probe (EP)\nmission provides a transformative opportunity to investigate their nature.\nWhile mounting observations of EP-discovered EFXTs (EP-EFXTs) suggest a\npossible connection to long gamma-ray bursts (lGRBs), an in-depth comparative\nanalysis between them remains lacking. Here, we present a comparative analysis\nof their cosmic formation histories, revealing that EP-EFXTs and lGRBs share a\nsimilar evolutionary trend-showing a marked decline at $z<1.0$ and a plateau\nbeyond $1.0<z<5$-which clearly distinguishes them from short GRBs. This result\nis derived from a rigorously selected sample of EP-EFXTs, using Lynden-Bell's\n$c^{-}$ method to reconstruct, for the first time, the luminosity function and\nformation rate of EP-EFXTs without any assumptions. Our findings provide\nindependent evidence that EP-EFXTs and lGRBs may originate from a common\nprogenitor channel."}
{"id": "2510.10789", "categories": ["astro-ph.IM", "physics.ins-det"], "pdf": "https://arxiv.org/pdf/2510.10789", "abs": "https://arxiv.org/abs/2510.10789", "authors": ["Cheukyu Edward Tong", "Keara Carter", "Paul Grimes", "Eugene Lauria", "Dan Marrone", "Gabriella Montano", "Matthew Morgan", "Yoshirnori Uzawa", "Lingzhen Zeng"], "title": "Dual Band Receiver Design for the Black Hole Explorer (BHEX) Mission", "comment": "34th IEEE International Symposium on Space THz Technology (ISSTT\n  2025), Berlin Germany, April 6-10, 2025", "summary": "A dual band receiver has been designed for the Black Hole Explorer (BHEX)\nmission, which is a space Very-Long Baseline Interferometry (VLBI) mission\nconcept, aimed at unveiling the photon ring of black holes. The cryogenic\nreceiver comprises a 228-320 GHz Superconductor-Insulator Superconductor (SIS)\nreceiver, paired with a 76-106.7 GHz HEMT receiver. The details of the design\nare described in this talk. A novel comb generator, which will be used for\ndelay tracking, has been designed and tested."}
{"id": "2510.10353", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.10353", "abs": "https://arxiv.org/abs/2510.10353", "authors": ["Pei Jin", "Mariano Méndez", "Federico García", "Diego Altamirano", "Federico M. Vincentelli"], "title": "Black-hole X-ray binary Swift J1727.8$-$1613 shows Type-B quasi-periodic oscillations across the hard-intermediate and soft-intermediate states", "comment": "14 pages, 14 figures, under the third round of review for A&A", "summary": "We present a timing analysis of \\textit{Insight}-HXMT observations of the\nblack-hole X-ray binary Swift J1727.8$-$1613 across a bright soft X-ray flare\non 2023 September 19 (MJD 60206). At the peak of the flare, the source\nundergoes a brief transition from the hard-intermediate state (HIMS) into the\nsoft-intermediate state (SIMS), marked by the simultaneous appearance of three\ndiscrete radio jet ejections, a drop in broadband noise in the 2$-$10 keV band,\nand the presence of a narrow quasi-periodic oscillation (QPO) with a\ncharacteristic ``U''-shaped phase-lag spectrum and a quality factor of $Q \\geq\n6$, features that robustly identify it as a Type-B QPO. The Type-C QPO, which\nwas clearly detected in the HIMS prior to the flare, is not observed at the\nflare's peak and only reappears afterward. Most notably, we find that the\nType-B QPO is not restricted to the SIMS: it is present throughout all our\nobservations, including those taken in the HIMS, where it appears as a broad\nshoulder of the Type-C QPO. During the flare, the Type-B and Type-C QPOs\nexhibit distinct evolutionary trends in frequency, fractional rms amplitude,\nand phase lag. These results challenge the traditional view that Type-B QPOs\nare exclusive to the SIMS, a state that is, in fact, defined by their\nappearance in the power spectrum, and directly linked to discrete jet\nejections. Instead, our findings suggest that the physical conditions giving\nrise to Type-B QPOs occur more broadly within the inner accretion flow."}
{"id": "2510.10922", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2510.10922", "abs": "https://arxiv.org/abs/2510.10922", "authors": ["Xiaohan Chen", "Man I Lam", "Yingying Zhou", "Hongrui Gu", "Jinzhi Lai", "Zhou Fan", "Jing Li", "Xin Zhang", "Hao Tian"], "title": "Slitless Spectroscopy Source Detection Using YOLO Deep Neural Network", "comment": "22 pages, 11 figures, 7 tables. PASP accepted", "summary": "Slitless spectroscopy eliminates the need for slits, allowing light to pass\ndirectly through a prism or grism to generate a spectral dispersion image that\nencompasses all celestial objects within a specified area. This technique\nenables highly efficient spectral acquisition. However, when processing CSST\nslitless spectroscopy data, the unique design of its focal plane introduces a\nchallenge: photometric and slitless spectroscopic images do not have a\none-to-one correspondence. As a result, it becomes essential to first identify\nand count the sources in the slitless spectroscopic images before extracting\nspectra. To address this challenge, we employed the You Only Look Once (YOLO)\nobject detection algorithm to develop a model for detecting targets in slitless\nspectroscopy images. This model was trained on 1,560 simulated CSST slitless\nspectroscopic images. These simulations were generated from the CSST Cycle 6\nand Cycle 9 main survey data products, representing the Galactic and nearby\ngalaxy regions and the high galactic latitude regions, respectively. On the\nvalidation set, the model achieved a precision of 88.6% and recall of 90.4% for\nspectral lines, and 87.0% and 80.8% for zeroth-order images. In testing, it\nmaintained a detection rate >80% for targets brighter than 21 mag\n(medium-density regions) and 20 mag (low-density regions) in the Galactic and\nnearby galaxies regions, and >70% for targets brighter than 18 mag in high\ngalactic latitude regions."}
{"id": "2510.10443", "categories": ["astro-ph.HE", "gr-qc"], "pdf": "https://arxiv.org/pdf/2510.10443", "abs": "https://arxiv.org/abs/2510.10443", "authors": ["Hong-Bo Li", "Yacheng Kang", "Ren-Xin Xu"], "title": "Thermal Deformations in Super-Eddington Magnetized Neutron Stars: Implications for Continuous Gravitational-Wave Detectability", "comment": "11 pages, 3 figures, and 1 table", "summary": "Rapidly rotating neutron stars (NSs) are promising targets for continuous\ngravitational-wave (CGW) searches with current and next-generation ground-based\nGW detectors. In this Letter, we present the first study of thermal\ndeformations in super-Eddington magnetized NSs with column accretion, where\nmagnetic fields induce anisotropic heat conduction that leads to crustal\ntemperature asymmetries. We compute the resulting mass quadrupole moments and\nestimate the associated CGW strain amplitudes. Our results show that Galactic\nmagnetized NSs undergoing super-Eddington column accretion can emit detectable\nCGWs in upcoming observatories. Assuming a 2-yr coherent integration, the\nEinstein Telescope and Cosmic Explorer could detect such CGW signals from\nrapidly spinning NSs with spin periods $P \\lesssim 20\\,\\rm ms$, while the LIGO\nO5 run may detect systems with $P \\lesssim 6 \\,{\\rm ms}$. These findings\nsuggest that super-Eddington magnetized NSs could represent a new class of CGW\nsources, providing a unique opportunity to probe the NS crust and bridge\naccretion physics with GW astronomy."}
{"id": "2510.10924", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2510.10924", "abs": "https://arxiv.org/abs/2510.10924", "authors": ["Max Charles", "Louis Desdoigts", "Benjamin Pope", "Peter Tuthill", "Dori Blakely", "Doug Johnstone", "Shrishmoy Ray", "K. E. Saavik Ford", "Barry McKernan", "Anand Sivaramakrishnan"], "title": "Image reconstruction with the JWST Interferometer", "comment": "15 pages, 7 figures", "summary": "Flying on board the James Webb Space Telescope (JWST) above Earth's turbulent\natmosphere, the Aperture Masking Interferometer (AMI) on the NIRISS instrument\nis the highest-resolution infrared interferometer ever placed in space.\nHowever, its performance was found to be limited by non-linear detector\nsystematics, particularly charge migration - or the Brighter-Fatter Effect.\nConventional interferometric Fourier observables are degraded by non-linear\ntransformations in the image plane, with the consequence that the inner working\nangle and contrast limits of AMI were seriously compromised. Building on the\nend-to-end differentiable model & calibration code amigo, we here present a\nregularised maximum-likelihood image reconstruction framework dorito which can\ndeconvolve AMI images either in the image plane or from calibrated Fourier\nobservables, achieving high angular resolution and contrast over a wider field\nof view than conventional interferometric limits. This modular code by default\nincludes regularisation by maximum entropy, and total variation defined with\n$l_1$ or $l_2$ metrics. We present imaging results from dorito for three\nbenchmark imaging datasets: the volcanoes of Jupiter's moon Io, the\ncolliding-wind binary dust nebula WR 137 and the archetypal Seyfert 2 active\ngalactic nucleus NGC 1068. In all three cases we recover images consistent with\nthe literature at diffraction-limited resolutions. The performance,\nlimitations, and future opportunities enabled by amigo for AMI imaging (and\nbeyond) are discussed."}
{"id": "2510.10485", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.10485", "abs": "https://arxiv.org/abs/2510.10485", "authors": ["Yanee Tangjai", "Agnieszka Leszczynska", "Tatphicha Promfu", "Achara Seripienlert", "Serap Tilav"], "title": "Characterizing IceTop Response to Low-Energy Air Showers", "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC2025)", "summary": "This study evaluates the response of the IceTop tanks to low-energy air\nshowers in the GeV to TeV energy range based on simulated and measured count\nrates. Correlating this response with primary cosmic rays provides a tool to\nstudy Galactic and solar cosmic-ray flux modulations, particularly for solar\nparticle events. We present long-term behavior of the IceTop scaler rates for a\nrange of discriminator thresholds to better understand and calibrate the\ndetector's response to changing environmental conditions."}
{"id": "2510.10941", "categories": ["astro-ph.IM", "astro-ph.EP"], "pdf": "https://arxiv.org/pdf/2510.10941", "abs": "https://arxiv.org/abs/2510.10941", "authors": ["Jason E. Williams", "Nicholas P. Konidaris"], "title": "Using chromatic covariance to correct for scintillation noise in ground-based spectrophotometry", "comment": "14 pages, 10 figures, Appendix", "summary": "Atmospheric scintillation is one of the largest sources of error in\nground-based spectrophotometry, reducing the precision of astrophysical signals\nextracted from the time-series of bright objects to that of much fainter\nobjects. Relative to the fundamental Poisson noise, scintillation is not\neffectively reduced by observing with larger telescopes, and alternative\nsolutions are needed to maximize the spectrophotometric precision of large\ntelescopes. If the chromatic covariance of the scintillation is known, it can\nbe used to reduce the scintillation noise in spectrophotometry. This paper\nderives analytical solutions for the chromatic covariance of stellar\nscintillation on a large telescope for a given atmospheric turbulence profile,\nwind speed, wind direction, and airmass at optical/near-infrared wavelengths.\nTo demonstrate how scintillation noise is isolated, scintillation-limited\nexoplanet transit spectroscopy is simulated. Then, a procedure is developed to\nremove scintillation noise and produce Poisson-noise limited light curves. The\nefficacy and limits of this technique will be tested with on sky observations\nof a new, high spectrophotometric precision, low resolution spectrograph."}
{"id": "2510.10514", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.10514", "abs": "https://arxiv.org/abs/2510.10514", "authors": ["Jiaxin Liu", "Haoyu Yuan", "Xiangli Lei", "Wenlong Xu", "Jumpei Takata", "Weihua Lei"], "title": "Investigation for binary characteristics of LS I+61303 with optical polarization", "comment": "20 pages, 12 figures", "summary": "We investigate the optical linear polarization caused by Thomson scattering\nof the stellar radiation for gamma-ray binary \\lsi61, which likely contains a\nyoung pulsar. Based on the pulsar binary scenario, we model the interaction\nbetween the pulsar wind and stellar wind from the massive companion star, which\ncreates a shock. To accurately compute the resulting polarization of the\nstellar wind, we develop a method for the Thomson scattering that accounts for\nthe finite size of the companion star. By fitting the optical polarization\ndata, we constrain the system parameters, such as eccentricity, the momentum\nratio of the two winds, and mass-loss rate from the companion star. We find\nthat (i) the predicted eccentricity $e\\sim 0.1$ is smaller than the values\nderived from the radial velocity curve and (ii) the orbital phase of the\nperiastron is $\\nu_{\\rm p}=0.5-0.6$, which is consistent with the previous\npolarization study of Kravtsov et al. Additionally, we estimate the mass-loss\nrate from the companion star and the momentum ratio of two winds as\n$\\dot{M}\\sim 2\\times 10^{-6}\\rm M_{\\odot}~{\\rm year^{-1}}$ and $\\eta>0.1$,\nrespectively. Assuming that the pulsar wind carries the spin-down energy, the\nspin-down magnetic field of the putative pulsar inferred from these parameters\nis of the order of $B\\sim 10^{14}\\mathrm{G}$, which may support the highly-B\npulsar or magnetar scenario for the compact object of $\\rm{LS\\ I}\n+61^{\\circ}303$. We also discuss the dispersion measure under the predicted\norbital geometry and provide a corresponding interpretation of the pulsed radio\nsignal detected by FAST."}
{"id": "2510.11077", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2510.11077", "abs": "https://arxiv.org/abs/2510.11077", "authors": ["Tom Kimpson", "Nicholas J. O'Neill", "Patrick M. Meyers", "Andrew Melatos"], "title": "Argus: JAX state-space filtering for gravitational wave detection with a pulsar timing array", "comment": "Submitted to the Journal of Open Source Software. Review at\n  github.com/openjournals/joss-reviews/issues/9179. Repository at\n  github.com/tomkimpson/Argus", "summary": "Argus is a high-performance Python package for detecting and characterising\nnanohertz gravitational waves in pulsar timing array data. The package provides\na complete Bayesian inference framework based on state-space models, using\nKalman filtering for efficient likelihood evaluation. Argus leverages JAX for\njust-in-time compilation, GPU acceleration, and automatic differentiation,\nfacilitating rapid Bayesian inference with gradient-based samplers. The\nstate-space approach provides a computationally efficient alternative to\ntraditional frequency-domain methods, offering linear scaling with the number\nof pulse times-of-arrival, and natural handling of non-stationary processes."}
{"id": "2510.10548", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.10548", "abs": "https://arxiv.org/abs/2510.10548", "authors": ["Katsunori Kusakabe", "Yoshiyuki Inoue", "Daisuke Toyouchi"], "title": "Coherence of Supermassive Black Hole Binary Demographics with the nHz Stochastic Gravitational Wave Background", "comment": null, "summary": "We present a refined estimation of the stochastic gravitational wave\nbackground (SGWB) based on observed dual active galactic nuclei (AGNs) together\nwith AGN X-ray luminosity functions, in light of recent Pulsar Timing Array\ndetections of an nHz SGWB. We identify a characteristic luminosity dependence\nin dual AGN fractions by compiling recent observational datasets, providing\ncrucial constraints on supermassive black hole binary (SMBHB) populations. Our\nAGN-based model reproduces the current SGWB measurements within PTA\nobservational uncertainties of $2 - 4 \\sigma$ uncertainties, demonstrating\nconsistency between electromagnetic and gravitational wave observations. These\nfindings establish SMBHBs as the dominant source of the nHz gravitational wave\nsignal, providing crucial insights into their demographics and evolution."}
{"id": "2510.11145", "categories": ["astro-ph.IM", "astro-ph.CO", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2510.11145", "abs": "https://arxiv.org/abs/2510.11145", "authors": ["Nikhel Gupta"], "title": "Machine Learning Frameworks for Large-Scale Radio Surveys: A Summary of Recent Studies", "comment": "7 pages, 1 figure, URSI AP-RASC 2025", "summary": "The rapid growth of large-scale radio surveys, generating over 100 petabytes\nof data annually, has created a pressing need for automated data analysis\nmethods. Recent research has explored the application of machine learning\ntechniques to address the challenges associated with detecting and classifying\nradio galaxies, as well as discovering peculiar radio sources. This paper\nprovides an overview of our investigations with the Evolutionary Map of the\nUniverse (EMU) survey, detailing the methodologies employed-including\nsupervised, unsupervised, self-supervised, and weakly supervised learning\napproaches -- and their implications for ongoing and future radio astronomical\nsurveys."}
{"id": "2510.10746", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.10746", "abs": "https://arxiv.org/abs/2510.10746", "authors": ["Kshitij Duraphe", "Kartik Mandar", "Chooda Khanal", "Abha Pareek", "Tejaswi Kondhiya", "V Sree Suswara", "Deeksha Dinesh", "Vidyasagar Bhat", "Gopal Bhatta"], "title": "State-Dependent X-ray Variability in Cygnus X-1: A 12-Year NuSTAR Timing Study of Accretion Flow Geometry", "comment": "18 pages, 8 figures, 2 tables", "summary": "We present a comprehensive timing analysis of the black hole X-ray binary\nCygnus X-1 using 26 NuSTAR observations spanning 2012-2024, providing the most\ndetailed characterization to date of its accretion flow variability across\nspectral states. Our analysis reveals fundamental insights into the physics\ngoverning state transitions in stellar-mass black holes. We discover distinct\nbimodal flux distributions in the 8-79 keV band with well-separated peaks,\ncontrasting with overlapping distributions in the 3-8 keV band. This\nenergy-dependent bimodality establishes hard X-rays as the optimal diagnostic\nfor state classification, directly tracing the geometric transformation between\ncorona-dominated and disk-dominated configurations. Power spectral analysis\nuncovers state-dependent characteristic frequencies shifting from 0.050 Hz\n(hard) to 0.074 Hz (intermediate), with featureless red noise in soft states.\nThese frequencies correspond to disk truncation radii evolving from $\\sim$5.5\n$R_g$ to $\\sim$2 $R_g$, providing direct observational evidence for the inward\nprogression of the accretion disk during state transitions. Frequency-dependent\ntime lags evolve systematically from $\\sim$50 ms hard lags at 0.1 Hz in hard\nstates to near-zero in soft states, quantifying the collapse of the\nComptonizing corona. Linear rms-flux relations persist across all states with\nparameters that precisely track the relative contributions of thermal versus\nnon-thermal emission components. Most remarkably, we identify a failed state\ntransition (observation 30302019006) exhibiting anticorrelated band behavior,\nsuppressed variability ($F_{var}$ < 1.38\\%), and apparent sub-ISCO truncation.\nThis discovery challenges standard transition models and suggests new pathways\nfor accretion flow evolution in wind-fed systems."}
{"id": "2510.11030", "categories": ["astro-ph.HE", "hep-ph"], "pdf": "https://arxiv.org/pdf/2510.11030", "abs": "https://arxiv.org/abs/2510.11030", "authors": ["J. -H. Ha", "I. Alikhanov"], "title": "Resonant W and Z Boson Production in FSRQ Jets: Implications for Diffuse Neutrino Fluxes", "comment": "7 figures, 1 table, submitted to JCAP", "summary": "Blazars, particularly Flat Spectrum Radio Quasars (FSRQs), are well-known for\ntheir ability to accelerate a substantial population of electrons and\npositrons, as inferred from multiwavelength radiation observations. Therefore,\nthese astrophysical objects are promising candidates for studying high-energy\nelectron--positron interactions, such as the production of $W^{\\pm}$ and $Z$\nbosons. In this work, we explore the implications of electron--positron\nannihilation processes in the jet environments of FSRQs, focusing on the\nresonant production of electroweak bosons and their potential contribution to\nthe diffuse neutrino flux. By modeling the electron distribution in the jet of\nthe FSRQ 3C~279 during a flaring state, we calculate the reaction rates for\n$W^{\\pm}$ and $Z$ bosons and estimate the resulting diffuse fluxes from the\ncosmological population of FSRQs.We incorporate the FSRQ luminosity function\nand its redshift evolution to account for the population distribution across\ncosmic time, finding that the differential flux contribution exhibits a\npronounced peak at redshift $z \\sim 1$. While the expected fluxes remain well\nbelow the detection thresholds of current neutrino observatories such as\nIceCube, KM3NeT, or Baikal-GVD, the expected flux from the $Z$ boson production\ncould account for approximately $10^{-3}$ of the total diffuse astrophysical\nneutrino flux. These results provide a theoretical benchmark for the role of\nStandard Model electroweak processes in extreme astrophysical environments and\nemphasize the interplay between particle physics and astrophysics, illustrating\nthat even rare high-energy interactions can leave a subtle but quantifiable\nimprint on the diffuse astrophysical neutrinos."}
{"id": "2510.11136", "categories": ["astro-ph.HE", "astro-ph.CO"], "pdf": "https://arxiv.org/pdf/2510.11136", "abs": "https://arxiv.org/abs/2510.11136", "authors": ["Mariusz Tarnopolski"], "title": "Quasi-Periodic Oscillations in Gamma-Ray Bursts' Prompt Light Curves", "comment": "Published https://www.pta.edu.pl/proc/v13p87", "summary": "I report on the discovery of 34 new quasi-periodic oscillations (QPOs) in the\nprompt light curves of long gamma-ray bursts (GRBs) from the Swift/BAT catalog:\nwith one or more constant leading periods, as well as several chirping signals.\nThis is the largest homogenously identified sample or GRB QPOs to date. The\npresence of QPOs suggests the existence of characteristic time scales that at\nleast in some GRBs might be related to the dynamical properties of plasma\ntrajectories in the accretion disks powering the relativistic jets. Several\nscenarios for their origin were examined. We identify non-planar orbits around\nKerr black holes, the Lense-Thirring effect, and shock oscillations as\nplausible mechanisms for the QPO generation."}
{"id": "2510.11215", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.11215", "abs": "https://arxiv.org/abs/2510.11215", "authors": ["Jiwon Shin", "C. Y. Hui", "Sangin Kim", "Kwangmin Oh", "Ellis R. Owen"], "title": "Second Discovery of GeV-TeV Connection from the Globular Cluster UKS 1", "comment": "To appear in the proceedings of IAU symposium 398 & MODEST-25:\n  Compact objects and Binaries in Dense Stellar Systems", "summary": "Using 16 years of data collected by Fermi Large Area Telescope and 1523 days\nof survey data from High Altitude Water Cherenkov (HAWC) Observatory, we\ndiscovered the long-sought second GeV-TeV connection towards the globular\ncluster (GC) UKS 1 (Shin et al. 2025). Gamma-ray spectroscopy suggests that the\nGeV emission can be attributed to both the pulsar magnetosphere and inverse\nCompton scattering (ICS) by the pulsar wind. In particular, the TeV peak is\ndisplaced from the cluster center by several tidal radii in the trailing\ndirection of the proper motion of UKS 1. This alignment supports a scenario in\nwhich relativistic leptons, likely driven by a millisecond pulsar population,\nproduce very-high-energy (VHE) gamma-rays via ICS within a bow shock tail. Our\nfindings not only highlights GCs as potential sources of VHE gamma-rays, but\nalso offers a rare opportunity to probe cosmic ray transport in the Milky Way\nby studying particle propagation and anisotropic gamma-ray production\nassociated with the extended, offset TeV feature of UKS 1."}
{"id": "2510.11231", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.11231", "abs": "https://arxiv.org/abs/2510.11231", "authors": ["Judhajeet Basu", "G. C. Anupama", "Jan-Uwe Ness", "Kulinder Pal Singh", "Sudhanshu Barway", "Shatakshi Chamoli"], "title": "Survival of the accretion disk in LMC Recurrent Nova 1968-12a: UV--X-ray case study of the 2024 eruption", "comment": "10 pages, 4 figures, 1 table. Accepted for publication in ApJ", "summary": "We report on UV and X-ray observations of the 2024 eruption of the recurrent\nnova LMCN 1968-12a, a rapidly recurring extragalactic system with a $\\sim$4.3\nyear recurrence period and a massive white dwarf (WD). The eruption was\ndiscovered on 2024 August 1.8 by \\textit{Swift}, and subsequently monitored\nusing \\textit{AstroSat}'s UVIT and SXT, along with Swift/UVOT and XRT. The\nmulti-wavelength light curves reveal a rapid UV-optical decline, followed by a\nplateau phase exhibiting 1.26-day modulations consistent with the orbital\nperiod. The Supersoft (SSS) X-ray emission, that emerged by day 5, exhibited a\ndouble peak, suggesting variable obscuration that could be due to an\ninhomogeneous nova ejecta or due to a nova super-remnant along the line of\nsight. Time-resolved X-ray spectroscopy shows a blackbody component with T\n$\\approx 10^6$ K. The SEDs obtained concurrently in the UV, peaking at T\n$\\approx$ 20,000 K and with a source radius $\\sim$2-3 R$_\\odot$, are\ninconsistent with emission from the secondary star or nova photosphere alone.\nInstead, the UV emission is attributed to an irradiated accretion disk that\nsurvived the eruption. The persistent UV plateau and its temperature suggest\nthat the accretion disk was not completely disrupted and resumed activity\nwithin days, consistent with recent findings in other rapidly recurring novae\nsuch as U~Sco and M31N~2008-12a."}
{"id": "2510.11352", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.11352", "abs": "https://arxiv.org/abs/2510.11352", "authors": ["M. P. Snelders", "J. W. T. Hessels", "J. Huang", "N. Sridhar", "B. Marcote", "A. M. Moroianu", "O. S. Ould-Boukattine", "F. Kirsten", "S. Bhandari", "D. M. Hewitt", "D. Pelliciari", "L. Rhodes", "R. Anna-Thomas", "U. Bach", "E. K. Bempong-Manful", "V. Bezrukovs", "J. D. Bray", "S. Buttaccio", "I. Cognard", "A. Corongiu", "R. Feiler", "M. P. Gawroński", "M. Giroletti", "L. Guillemot", "R. Karuppusamy", "M. Lindqvist", "K. Nimmo", "A. Possenti", "W. Puchalska", "D. Williams-Baldwin"], "title": "Revisiting FRB 20121102A: milliarcsecond localisation and a decreasing dispersion measure", "comment": "Submitted. Comments welcome", "summary": "FRB 20121102A is the original repeating fast radio burst (FRB) source and\nalso the first to be localised to milliarcsecond precision using\nvery-long-baseline interferometry (VLBI). It has been active for over 13 years\nand resides in an extreme magneto-ionic environment in a dwarf host galaxy at a\ndistance of ~1 Gpc. In this work, we use the European VLBI Network (EVN) to\n(re-)localise FRB 20121102A and its associated persistent radio source (PRS).\nWe confirm that the two are co-located -- improving on previous results by a\nfactor of ~4 and constraining the FRB and PRS co-location to ~12 pc transverse\noffset. Over a decade, the PRS luminosity on milliarcsecond scales remains\nconsistent with measurements on larger angular scales, showing that the PRS is\nstill compact. We also present the detection of 18 bursts with the Nancay Radio\nTelescope (NRT) as part of our \\'ECLAT monitoring program. These bursts,\ntogether with previously published results, show that the observed dispersion\nmeasure (DM) of FRB 20121102A has dropped by ~25 pc/cc in the past five years,\nhighlighting a fractional decrease in the local DM contribution of >15%. We\ndiscuss potential physical scenarios and highlight possible future observations\nthat will help reveal the nature of FRB 20121102A, which is one of only a few\nknown FRBs with a luminous PRS."}
{"id": "2510.11365", "categories": ["astro-ph.HE", "physics.plasm-ph"], "pdf": "https://arxiv.org/pdf/2510.11365", "abs": "https://arxiv.org/abs/2510.11365", "authors": ["Vedant Dhruv", "Ben Prather", "Mani Chandra", "Abhishek V. Joshi", "Charles F. Gammie"], "title": "Electromagnetic Observables of Weakly Collisional Black Hole Accretion", "comment": "13 pages, 9 figures. Accepted", "summary": "The black holes in the Event Horizon Telescope sources Messier 87* and\nSagittarius A* (SgrA*) are embedded in a hot, collisionless plasma that is\nfully described in kinetic theory yet is usually modeled as an ideal,\nmagnetized fluid. In this Letter, we present results from a new set of weakly\ncollisional fluid simulations in which leading order kinetic effects are\nmodeled as viscosity and heat conduction. Consistent with earlier,\nlower-resolution studies, we find that overall flow dynamics remain very\nsimilar between ideal and non-ideal models. For the first time, we synthesize\nimages and spectra of SgrA* from weakly collisional models -- assuming an\nisotropic, thermal population of electrons -- and find that these remain\nlargely indistinguishable from ideal fluid predictions. However, most weakly\ncollisional models exhibit lower light curve variability, with all magnetically\ndominated models showing a small but systematic decrease in variability."}
{"id": "2510.11385", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.11385", "abs": "https://arxiv.org/abs/2510.11385", "authors": ["Yue Wang", "Chen-Wei Wang", "Shaolin Xiong", "Xiao Xiao", "Yanqiu Zhang", "Sheng-Lun Xie", "Lin Lin", "Yuan-Pei Yang", "Haoxuan Guo", "Ce Cai", "Yue Huang", "Cheng-Kui Li", "Bing Li", "Xiaobo Li", "Jiacong Liu", "Xiang Ma", "Liming Song", "Wen-Jun Tan", "Ping Wang", "Wang-Chen Xue", "Shu-Xu Yi", "Yun-Wei Yu", "Zheng-Hang Yu", "Jin-Peng Zhang", "Peng Zhang", "Shuang-Nan Zhang", "Wen-Long Zhang", "Zhen Zhang", "Xiao-Yun Zhao", "Chao Zheng", "S. J. Zheng"], "title": "Unveil A Peculiar Light Curve Pattern of Magnetar Burst with GECAM observations of SGR J1935+2154", "comment": "13 pages, 5 figures, accepted to publication on ApJ", "summary": "Magnetar X-ray Burst (MXB) is usually composed of a single pulse or multiple\npulses with rapid rise and brief duration mostly observed in hard X-ray (soft\ngamma-ray) band. Previous work studied the temporal behavior of some magnetar\nbursts and employed the Fast Rise Exponential Decay (FRED) model to fit pulses\nof MXB. However, whether there is other kind of pulse shape has not been\nexplored. In this study, we systematically examined light curve of MXBs from\nSGR J1935+2154 detected by GECAM between 2021 and 2022. We find that there are\ndifferent light curve morphologies. Especially, we discover a peculiar and new\npattern, Exponential Rise and Cut-Off Decay (ERCOD), which is significantly\ndifferent from FRED and could be well described by a mathematical function we\nproposed. We find that MXBs with ERCOD shape are generally longer in duration,\nbrighter in the peak flux, and harder in spectrum. We note that the ERCOD shape\nis not unique to SGR J1935+2154 but also present in other magnetars. This new\nlight curve pattern may imply a special burst and radiation mechanism of\nmagnetar."}
{"id": "2510.11415", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.11415", "abs": "https://arxiv.org/abs/2510.11415", "authors": ["Tarang Vashisht", "Aru Beri", "Tanuman Ghosh", "Aman Upadhyay", "Vikram Rana"], "title": "Probing spectral variability in NGC 4490 ULX-8 over 24 years of XMM-Newton, Chandra and Swift-XRT observations", "comment": null, "summary": "We present comprehensive spectral and timing results of 14 Chandra, 6\nXMM-Newton and 19 Swift-XRT observations of the ultraluminous X-ray source NGC\n4490 ULX-8, spanning from 2000 to 2024. We model the source spectra using\nabsorbed power-law and absorbed multicolour disc blackbody models. The best-fit\nphoton indices span 0.92-2.68, with typical uncertainties ranging from $\\pm$0.1\nto $\\pm$1 depending on data quality. The inner disk temperature range from 0.97\nto 1.69 keV, consistent with blackbody emission from an accretion disk. Our\nresults reveal significant long-term variability in intrinsic X-ray source\nfluxes while the source remains relatively stable within individual\nobservations. A Hardness-Intensity Diagram of the source shows no clear\ntransition between hard and soft states, but an increase in brightness during\ntwo recent observations taken on 2022 December 1 and 2024 May 4. We find a\npositive correlation of X-ray luminosity and photon index that persists even\nwhen the hydrogen column density is tied across observations, suggesting a\nphysical origin. The X-ray luminosity-inner disk temperature relation yields a\nweakly constrained slope owing to large temperature uncertainties, but a\nsimpler fixed-slope test indicates consistency with a standard thin-disk. Using\nthe derived disk parameters, we estimate the black hole mass to lie in the\nrange of 16-75 $M_{\\odot}$, under the assumption of a geometrically thin\naccretion flow, where the lower and upper bounds correspond to a Schwarzchild\nand a Kerr black hole respectively. Alternatively, we consider the scenario of\nULX-8 hosting an accreting neutron star and estimate the corresponding magnetic\nfield strength required to explain the observed properties."}
{"id": "2510.11467", "categories": ["astro-ph.HE", "astro-ph.SR", "nucl-th"], "pdf": "https://arxiv.org/pdf/2510.11467", "abs": "https://arxiv.org/abs/2510.11467", "authors": ["Xilu Wang", "Amol V. Patwardhan", "Yangming Lin", "Junbo Zheng", "Michael J. Cervia", "Yanwen Deng", "A. Baha Balantekin", "Haining Li", "Ian U. Roederer", "Rebecca Surman"], "title": "Proton-rich production of lanthanides: the νi process", "comment": "14 pages, 5 figures", "summary": "The astrophysical origin of the lanthanides is an open question in nuclear\nastrophysics. Besides the widely studied $s$, $i$, and $r$ processes in\nmoderately-to-strongly neutron-rich environments, an intriguing alternative\nsite for lanthanide production could in fact be robustly $\\textit{proton-rich}$\nmatter outflows from core-collapse supernovae under specific conditions -- in\nparticular, high-entropy winds with enhanced neutrino luminosity and fast\ndynamical timescales. In this environment, excess protons present after charged\nparticle reactions have ceased can continue to be converted to neutrons by\n(anti-)neutrino interactions, producing a neutron capture reaction flow up to\nA~200. This scenario, christened the $\\nu i$ process in a recent paper, has\npreviously been discussed as a possibility. Here, we examine the prospects for\n$\\nu i$ process through the lens of stellar abundance patterns, bolometric\nlightcurves, and galactic chemical evolution models, with a particular focus on\nhypernovae as candidate sites. We identify specific lanthanide signatures for\nwhich the $\\nu i$ process can provide a credible alternative to $r$/$i$\nprocesses."}
{"id": "2510.11699", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.11699", "abs": "https://arxiv.org/abs/2510.11699", "authors": ["Maksat Satybaldiev", "Manuel Linares", "Vittoria Vecchiotti"], "title": "Gamma-ray Orbital Modulation in Spider Pulsars: Three Discoveries and a Universal Modulated Fraction", "comment": "23 pages, 15 figures, 4 tables. Submitted to ApJ", "summary": "Compact binary millisecond pulsars (also known as spiders) allow us to probe\npulsar winds in their innermost regions, between the light cylinder (radius\n$\\sim10^{7}$ cm) and the companion star (at $\\sim10^{11}$ cm). Their flux is\nknown to vary along the orbit, from radio to X-rays. During the past decade,\ngamma-ray orbital modulation (GOM) has been discovered in a handful of spiders,\nbut its origin remains largely unknown. We present the results of a systematic\nsearch for GOM among 43 systems, selecting pulsed 0.1-1 GeV photons and using\nspin and orbital ephemeris from Fermi's Third Pulsar Catalog. We discover GOM\nfrom three spiders - PSR J1124-3653, PSR J1946-5403 and PSR J2215+5135 - and\nconfirm four previous detections. In all seven cases so far, the GOM peaks near\nthe pulsar's superior conjunction. The X-ray orbital light curves are usually\nin anti-phase, peaking when the pulsar is at inferior conjunction, but we find\none case where both gamma-rays and X-rays peak around superior conjunction: PSR\nJ1946-5403. We measure the modulated fractions of the GOM and find consistent\nvalues for all seven spiders, with an average $22.0\\pm2.6\\%$. Including\neclipsing systems seen edge-on, we find no clear dependence of the modulated\nfraction on the orbital inclination (within $\\simeq$45-90$^\\circ$). Our results\nchallenge previous models proposed to explain GOM in spiders, based on inverse\nCompton and synchrotron emission close to the companion, since these predict a\nclear dependence with orbital inclination (stronger modulation at high\ninclinations). We nearly double the number of GOM detections in spiders,\nshowing that it is more common than previously thought."}
{"id": "2510.09756", "categories": ["astro-ph.IM", "astro-ph.GA", "astro-ph.HE", "astro-ph.SR", "physics.comp-ph"], "pdf": "https://arxiv.org/pdf/2510.09756", "abs": "https://arxiv.org/abs/2510.09756", "authors": ["Philip F. Hopkins", "Elias R. Most"], "title": "Time-Dilation Methods for Extreme Multiscale Timestepping Problems", "comment": "15 pages, 4 figures, 3 appendices. Submitted to the Open Journal of\n  Astrophysics. Comments welcome. Example implementation in the public GIZMO\n  code at: http://www.tapir.caltech.edu/~phopkins/Site/GIZMO.html", "summary": "Many astrophysical simulations involve extreme dynamic range of timescales\naround 'special points' in the domain (e.g. black holes, stars, planets, disks,\ngalaxies, shocks, mixing interfaces), where processes on small scales couple\nstrongly to those on large scales. Adaptive resolution, multi-physics, and\nhybrid numerical methods have enabled tremendous progress on the spatial,\nphysics, and numerical challenges involved. But often the limiter for following\nthe long timescales of global evolution is the extremely short numerical\ntimestep required in some subdomains (which leads to their dominating\nsimulation costs). Recently several approaches have been developed for tackling\nthis in problems where the short timescale solution is sampled and then\nprojected as an effective subgrid model over longer timescales (e.g. 'zooming\nin and out'). We generalize these to a family of models where time evolution is\nmodulated by a variable but continuous in space-and-time dilation/stretch\nfactor $a({\\bf x},\\,t)$. This extends previous well-studied approaches\n(including reduced-speed-of-light and binary orbital dynamics methods), and\nensures that the system comes to correct local steady-state solutions, and\nderive criteria that the dilation factor/timesteps/resolution must obey to\nensure good behavior. We present a variety of generalizations to different\nphysics or coupling scales. Compared to previous approaches, this method makes\nit possible to avoid imprinting arbitrary scales where there is no clear\nscale-separation, and couples well to Lagrangian or Eulerian methods. It is\nflexible and easily-implemented and we demonstrate its validity (and\nlimitations) in test problems. We discuss the relationship between these\nmethods and physical time dilation in GRMHD. We demonstrate how this can be\nused to obtain effective speedup factors exceeding $\\gtrsim 10^{4}$ in\nmultiphysics simulations."}
{"id": "2510.09990", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.09990", "abs": "https://arxiv.org/abs/2510.09990", "authors": ["Moonzarin Reza", "Lifan Wang", "Lei Hu"], "title": "An FPCA-Enhanced Ensemble Learning Framework for Photometric Identification of Type Ia Supernovae", "comment": "Submitted to The Astrophysical Journal (ApJ) 24 pages, 16 figures", "summary": "Type Ia supernovae (SNe Ia) are essential tools for addressing key cosmic\nquestions, including the Hubble tension and the nature of dark energy. Modern\nsurveys are predominantly photometry-based, making the construction of a clean\nphotometric SNe Ia sample crucial. In this study, we investigate whether\nfunctional principal component analysis (FPCA) scores derived from photometric\nlight curves, combined with ensemble learning, can reliably distinguish SNe Ia\nfrom other transients using the PLAsTiCC dataset. FPCA provides a data-driven,\nflexible characterization of light curves without relying on rigid theoretical\nmodel assumptions. Light curves are fitted by minimizing residuals with penalty\nterms from clean samples, making the method robust to outliers or poorly\nsampled bands. The first two FPCA scores and peak magnitudes across the five\nLSST bands are used as classification features. We implement two complementary\nbinary classifiers: an ensemble boosting model (CatBoost) and a statistical\nprobabilistic method based on Euclidean distances. CatBoost slightly\noutperforms the statistical method, achieving 98.5% accuracy and 97.8%\nprecision. Performance remains robust (>90%) under typical photometric redshift\nuncertainties ({\\sigma} = 0.1). On the spectroscopic DES Y5 sample, both\nmethods reach approximately 90% accuracy and 95% precision, demonstrating\nstrong out-of-domain generalization compared to state-of-the-art methods with\nlimited cross-survey applicability. Applied to DECam DDF and DESIRT transients,\nthe predictions strongly agree, and their intersection provides a\nhigh-confidence SNe Ia sample for cosmological analyses. Overall, this\nFPCA-based framework offers a powerful, flexible tool for classifying\ntransients in upcoming large-scale surveys such as LSST and Roman."}
{"id": "2510.10713", "categories": ["astro-ph.IM", "astro-ph.CO", "astro-ph.EP", "astro-ph.GA", "astro-ph.HE", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.10713", "abs": "https://arxiv.org/abs/2510.10713", "authors": ["Yuan-Sen Ting"], "title": "Deep Learning in Astrophysics", "comment": "Manuscript submitted to Annual Review of Astronomy and Astrophysics\n  for Volume 64. This is the authors' version. Revisions and the final version\n  will be available at https://www.annualreviews.org/content/journals/astro", "summary": "Deep learning has generated diverse perspectives in astronomy, with ongoing\ndiscussions between proponents and skeptics motivating this review. We examine\nhow neural networks complement classical statistics, extending our data\nanalytical toolkit for modern surveys. Astronomy offers unique opportunities\nthrough encoding physical symmetries, conservation laws, and differential\nequations directly into architectures, creating models that generalize beyond\ntraining data. Yet challenges persist as unlabeled observations number in\nbillions while confirmed examples with known properties remain scarce and\nexpensive. This review demonstrates how deep learning incorporates domain\nknowledge through architectural design, with built-in assumptions guiding\nmodels toward physically meaningful solutions. We evaluate where these methods\noffer genuine advances versus claims requiring careful scrutiny. - Neural\narchitectures overcome trade-offs between scalability, expressivity, and data\nefficiency by encoding physical symmetries and conservation laws into network\nstructure, enabling learning from limited labeled data. - Simulation-based\ninference and anomaly detection extract information from complex, non-Gaussian\ndistributions where analytical likelihoods fail, enabling field-level\ncosmological analysis and systematic discovery of rare phenomena. - Multi-scale\nneural modeling bridges resolution gaps in astronomical simulations, learning\neffective subgrid physics from expensive high-fidelity runs to enhance\nlarge-volume calculations where direct computation remains prohibitive. -\nEmerging paradigms-reinforcement learning for telescope operations, foundation\nmodels learning from minimal examples, and large language model agents for\nresearch automation-show promise though are still developing in astronomical\napplications."}
