{"id": "2509.02679", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.02679", "abs": "https://arxiv.org/abs/2509.02679", "authors": ["Paarmita Pandey", "Stephen C. Lenker II", "Laura A. Lopez", "Anna L. Rosen", "Tim Linden", "Todd A. Thompson", "Stella S. R. Offner", "Katie Auchettl", "Christopher M. Hirata"], "title": "Explosive Dispersal Outflows as a New Class of Fermi Gamma-Ray Sources: The Case of DR21", "comment": "Submitted to ApJ, 11 pages, 6 figures", "summary": "We report the first detection of gamma-ray emission from an explosive\ndispersal outflow in the Milky Way, revealing a new source class of high-energy\nemission. Using 15 years of Fermi-LAT data in the 0.2 $-$ 500 GeV range, we\ndetect a significant ($ > 35\\sigma $) $\\gamma$-ray emission spatially\ncoincident with the DR21 outflow, located at a distance of 1.5 kpc in the\nCygnus-X star-forming region. The spectrum follows a power-law plus an\nexponential cutoff model with a spectral index $\\Gamma = 2.08\\pm0.02$ and\n$E_{\\rm c} = 10089 \\pm 2963$~MeV, integrating which we estimate a total\n$\\gamma$-ray luminosity $L_{\\gamma} \\simeq (2.17\\pm 0.15) \\times 10^{35}$ erg\ns$^{-1}$ in the $0.1-500$ GeV band. This $\\gamma$-ray emission is spatially\ncoincident with additional multiwavelength data, including allWISE mid-IR and\nregions of dense gas. By comparing the observed $\\gamma$-ray luminosity to the\nestimated kinetic energy of the outflow inferred from prior studies of DR21, we\nfind that $\\leq 15\\%$ of the kinetic power of the outflow goes into particle\nacceleration. Our findings demonstrate that explosive dispersal outflows can\ncontribute significantly to the diffuse $\\gamma$-ray background of the Galaxy,\nhighlighting their importance as particle accelerators in star-forming\nenvironments."}
{"id": "2509.02685", "categories": ["astro-ph.HE", "astro-ph.EP", "astro-ph.GA", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2509.02685", "abs": "https://arxiv.org/abs/2509.02685", "authors": ["Yonadav Barry Ginat", "Jakob Stegmann", "Johan Samsing"], "title": "Dynamical Evolution of Quasi-Hierarchical Triples", "comment": "Submitted, comments welcome", "summary": "We study the gravitational dynamics of quasi-hierarchical triple systems,\nwhere the outer orbital period is significantly longer than the inner one, but\nthe outer orbit is extremely eccentric, rendering the time at pericentre\ncomparable to the inner period. Such systems are not amenable to the standard\ntechniques of perturbation theory and orbit-averaging. Modelling the evolution\nof these triples as a sequence of impulses at the outer pericentre, we show\nthat such triples lend themselves to a description as a correlated random walk\nof the inner binary's eccentricity and angular-momentum vector, going beyond\nthe von Zeipel-Lidov-Kozai mechanism. The outer orbit is seen to excite the\ninner eccentricity arbitrarily close to unity, eventually. These\nquasi-hierarchical triples constitute, therefore, a natural mechanism for\ncreating highly eccentric binaries. We discuss applications for\ngravitational-wave mergers engendered by this process, and show that for a\nlarge portion of the parameter space, the time-to-coalescence is significantly\nreduced."}
{"id": "2509.02713", "categories": ["astro-ph.HE", "hep-ph"], "pdf": "https://arxiv.org/pdf/2509.02713", "abs": "https://arxiv.org/abs/2509.02713", "authors": ["Tugba Boztepe", "Tolga Guver", "Elif Ece Devecioglu", "Julia Speicher", "Motoko Serino", "David R. Ballantyne", "Diego Altamirano", "Gaurava K. Jaisawal", "Mason Ng", "Andrea Sanna", "Can Gungor", "Wataru Iwakiri"], "title": "The 2020 Superburst of 4U 1608-522 and its impact on the accretion disk", "comment": "Accepted for publication in MNRAS", "summary": "Superbursts are rare events observed from bursting neutron star low mass\nX-ray binaries. They are thought to originate from unstable burning of the\nthick layer of Carbon on the surface of the neutron star, causing the observed\nX-ray flashes to last several hours. Given their fluence it has long been\nthought that superbursts may have significant effects on the accretion flow\naround the neutron star. In this paper, we first present evidence for a new\nsuperburst observed from 4U 1608-522 by MAXI during the 2020 outburst, around\n00:45 UTC on 16 July 2020. We compare some of the properties of this superburst\nand the underlying outburst with the events recorded on May 5 2005 by RXTE and\nmost recently in 2025 by MAXI. We then present our spectral analysis of NICER\nand Insight-HXMT data obtained before and after the 2020 superburst event. Our\nresults indicate that the inner disk temperature and the radius show a\nsystematic evolution in the following few days, which may be related to the\nsuperburst. We show that the timescale of the observed evolution can not be\ngoverned by viscous timescales unless the viscosity parameter is\nunrealistically low."}
{"id": "2509.02769", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.02769", "abs": "https://arxiv.org/abs/2509.02769", "authors": ["Vishwajeet Swain", "Tomás Ahumada", "Sameer K. Patil", "Yogesh Wagh", "Varun Bhalerao", "Mansi Kasliwal", "Ehud Nakar", "Shreya Anand", "Igor Andreoni", "G. C. Anupama", "Anuraag Arya", "Arvind Balasubramanian", "Sudhanshu Barway", "Malte Busmann", "Jonathan Carney", "Michael Coughlin", "Deepak Eappachen", "Daniel Gruen", "Xander J. Hall", "Viraj Karambelkar", "Tanishk Mohan", "Brendan O'Connor", "Antonella Palmese", "Utkarsh Pathak", "D. K. Sahu", "Aditya Pawan Saikia", "Nikhil Sarin", "Gokul Srinivasaragavan", "Hitesh Tanenia"], "title": "GRB 250704B: An Off-axis Short GRB with a Long-Lived Afterglow Plateau", "comment": "submitted", "summary": "We present a detailed multi-wavelength afterglow study of the short GRB\n250704B, extensively monitored in optical and near-infrared bands. Its\nafterglow displays an unusually long-duration plateau followed by an achromatic\nbreak and a steep decline, deviating from canonical GRB afterglows. While long\nplateaus are often explained by central engine activity, we find that for GRB\n250704B, an energy injection model requires unreasonable parameters. The\nafterglow is better explained by an off-axis power-law structured jet with a\nnarrow core ($\\theta_c \\approx 0.7^{\\circ}$) viewed at a modest angle\n($\\theta_v \\approx 1.9^{\\circ}$). A comparison with GRB 170817A shows that both\nevents are consistent with the off-axis structured jet scenario, where the\nshape of the light curve is governed primarily by the geometry of the jet and\nthe viewing angle rather than the energetics, microphysical parameters, or\nexternal density. Our results underscore the importance of incorporating the\njet structure in GRB modeling."}
{"id": "2509.02615", "categories": ["astro-ph.IM", "cs.AI"], "pdf": "https://arxiv.org/pdf/2509.02615", "abs": "https://arxiv.org/abs/2509.02615", "authors": ["Mariia Drozdova", "Erica Lastufka", "Vitaliy Kinakh", "Taras Holotyak", "Daniel Schaerer", "Slava Voloshynovskiy"], "title": "Radio Astronomy in the Era of Vision-Language Models: Prompt Sensitivity and Adaptation", "comment": null, "summary": "Vision-Language Models (VLMs), such as recent Qwen and Gemini models, are\npositioned as general-purpose AI systems capable of reasoning across domains.\nYet their capabilities in scientific imaging, especially on unfamiliar and\npotentially previously unseen data distributions, remain poorly understood. In\nthis work, we assess whether generic VLMs, presumed to lack exposure to\nastronomical corpora, can perform morphology-based classification of radio\ngalaxies using the MiraBest FR-I/FR-II dataset. We explore prompting strategies\nusing natural language and schematic diagrams, and, to the best of our\nknowledge, we are the first to introduce visual in-context examples within\nprompts in astronomy. Additionally, we evaluate lightweight supervised\nadaptation via LoRA fine-tuning. Our findings reveal three trends: (i) even\nprompt-based approaches can achieve good performance, suggesting that VLMs\nencode useful priors for unfamiliar scientific domains; (ii) however, outputs\nare highly unstable, i.e. varying sharply with superficial prompt changes such\nas layout, ordering, or decoding temperature, even when semantic content is\nheld constant; and (iii) with just 15M trainable parameters and no\nastronomy-specific pretraining, fine-tuned Qwen-VL achieves near\nstate-of-the-art performance (3% Error rate), rivaling domain-specific models.\nThese results suggest that the apparent \"reasoning\" of VLMs often reflects\nprompt sensitivity rather than genuine inference, raising caution for their use\nin scientific domains. At the same time, with minimal adaptation, generic VLMs\ncan rival specialized models, offering a promising but fragile tool for\nscientific discovery."}
{"id": "2509.02842", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2509.02842", "abs": "https://arxiv.org/abs/2509.02842", "authors": ["M. Salvato", "J. Wolf", "T. Dwelly", "H. Starck", "J. Buchner", "R. Shirley", "A. Merloni", "A. Georgakakis", "F. Balzer", "M. Brusa", "A. Rau", "S. Freund", "D. Lang", "T. Liu", "G. Lamer", "A. Schwope", "W. Roster", "S. Waddell", "M. Scialpi", "Z. Igo", "M. Kluge", "F. Mannucci", "S. Tiwari", "D. Homan", "M. Krumpe", "A. Zenteno", "D. Hernandez-Lang", "J. Comparat", "M. Fabricius", "J. Snigula", "D. Schlegel", "B. A. Weaver", "R. Zhou", "A. Dey", "F. Valdes", "A. Myers", "S. Juneau", "H. Winkler", "I. Marquez", "F. di Mille", "S. Ciroi", "M. Schramm", "D. A. H. Buckley", "J. Brink", "M. Gromadzki", "J. Robrade", "K. Nandra"], "title": "Counterpart identification and classification for eRASS1 and characterisation of the AGN content", "comment": "Paper resubmitted to A&A after taking into account the comments of\n  the referee. The associated 7 catalogues will be released via the eROSITA\n  pages and Vizier as soon as the paper is accepted for publication", "summary": "[abridged] Accurately accounting for the AGN phase in galaxy evolution\nrequires a large, clean AGN sample. This is now possible with SRG/eROSITA. The\npublic Data Release 1 (DR1, Jan 31, 2024) includes 930,203 sources from the\nWestern Galactic Hemisphere. The data enable the selection of a large AGN\nsample and the discovery of rare sources. However, scientific return depends on\naccurate characterisation of the X-ray emitters, requiring high-quality\nmultiwavelength data. This paper presents the identification and classification\nof optical and infrared counterparts to eRASS1 sources using Gaia DR3,\nCatWISE2020, and Legacy Survey DR10 (LS10) with the Bayesian NWAY algorithm and\ntrained priors. Sources were classified as Galactic or extragalactic via a\nMachine Learning model combining optical/IR and X-ray properties, trained on a\nreference sample. For extragalactic LS10 sources, photometric redshifts were\ncomputed using Circlez. Within the LS10 footprint, all 656,614 eROSITA/DR1\nsources have at least one possible optical counterpart; about 570,000 are\nextragalactic and likely AGN. Half are new detections compared to AllWISE,\nGaia, and Quaia AGN catalogues. Gaia and CatWISE2020 counterparts are less\nreliable, due to the surveys shallowness and the limited amount of features\navailable to assess the probability of being an X-ray emitter. In the Galactic\nPlane, where the overdensity of stellar sources also increases the chance of\nassociations, using conservative reliability cuts, we identify approximately\n18,000 Gaia and 55,000 CatWISE2020 extragalactic sources. We release three\nhigh-quality counterpart catalogues, plus the training and validation sets, as\na benchmark for the field. These datasets have many applications, but in\nparticular empower researchers to build AGN samples tailored for completeness\nand purity, accelerating the hunt for the Universe most energetic engines."}
{"id": "2509.02644", "categories": ["astro-ph.IM", "astro-ph.CO"], "pdf": "https://arxiv.org/pdf/2509.02644", "abs": "https://arxiv.org/abs/2509.02644", "authors": ["Bianca De Caro", "Isabella P. Carucci", "Stefano Camera", "Mathieu Remazeilles", "Carmelita Carbone"], "title": "Needlets and foreground removal for SKAO hydrogen intensity maps", "comment": "28 pages, 17 figures, 1 table", "summary": "Intensity Mapping (IM) of the 21-cm line of the neutral hydrogen\n(\\textsc{Hi}) has become a compelling new technique to map the large-scale\nstructure of the Universe. One of the main challenges is the presence of strong\nforeground emissions of several orders of magnitude larger than the\n\\textsc{Hi}~signal. Here, we implement a version of the Principal Component\nAnalysis, a blind component-separation technique, based on a kind of spherical\nwavelets called needlets. These functions exploit double localization both in\nreal and in harmonic space. We test Need-PCA performances on a set of maps that\nsimulates the SKA MID radio telescope in the AA4 configuration. We compare our\nresults with other component separation methods such as Generalised\nMorphological Component Analysis (GMCA) and Generalized Needlet Internal Linear\nCombination (GNILC). All the methods have comparable results, recovering the\n\\textsc{Hi}~signal within 10\\% accuracy across the frequency channels, in the\nmultipole range 30 $\\lesssim \\ell \\lesssim$ 136. We also test our pipeline in\nthe presence of systematics such as polarization leakage. We find that the\ncleaning methods are insensitive to the presence of such systematic, yielding\nthe same results as in the leakage-free case."}
{"id": "2509.02935", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.02935", "abs": "https://arxiv.org/abs/2509.02935", "authors": ["Khwahish Kushwah", "Gabriel S. Denicol"], "title": "Relativistic Dissipative Magnetohydrodynamics for accretion disks", "comment": "4 pages", "summary": "We derive a relativistic magnetohydrodynamics (RMHD) theory for a dilute\nelectron-ion gas governed by the Boltzmann-Vlasov equation, using the method of\nmoments. This yields an extended MHD framework beyond standard astrophysical\nformulations, which typically include only the shear-stress component parllel\nto the magnetic field. We analyze our framework in the linear regime and show\nthat it leads to the firehose instability when the bakground longitudinal\npressure becomes large. In these extreme scenario, the transverse and\nsemi-transverse shear-stress components become large and may play a role in\naccretion disk dynamics."}
{"id": "2509.02645", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.02645", "abs": "https://arxiv.org/abs/2509.02645", "authors": ["Liang Liu", "Hai-Nan Lin", "Li Tang"], "title": "Revised classification of the CHIME fast radio bursts with machine learning", "comment": "13 pages, 7 figures, 2 tables", "summary": "Fast radio bursts (FRBs) are short-duration and energetic radio transients of\nunknown origin. Observationally, they are commonly categorized into repeaters\nand non-repeaters. However, this binary classification may be influenced by\nobservational limitations such as sensitivity and time coverage of telescopes.\nIn this work, we employ unsupervised machine learning techniques to re-examine\nthe CHIME/FRB catalog, with the goal of identifying intrinsic groupings in the\nFRB population without relying on preassigned labels. Using t-distributed\nstochastic neighbor embedding (t-SNE) for dimensionality reduction and\nhierarchical density-based spatial clustering of applications with noise\n(HDBSCAN) for clustering, we find that the FRB sample separates naturally into\ntwo major clusters. One cluster contains nearly all known repeaters but is\ncontaminated by some apparently non-repeaters, while the other cluster is\ndominated by non-repeaters. This suggests that certain FRBs previously labeled\nas non-repeaters may share intrinsic similarities with repeaters. The mutual\ninformation analysis reveals that rest-frame frequency width and peak frequency\nare the most informative features governing the clustering structure. Even when\nreducing the input space to just these two features, the classification remains\nrobust."}
{"id": "2509.02995", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.02995", "abs": "https://arxiv.org/abs/2509.02995", "authors": ["Ce Cai", "Shao-Lin Xiong", "Yan-Qiu Zhang", "Jin-Peng Zhang", "Ping Wang", "Yao-Guang Zheng", "Shi-Jie Zheng", "Shuo Xiao", "Hao-Xuan Guo", "Jia-Cong Liu", "Yang-Zhao Ren", "Wen-Jun Tan", "Chen-Wei Wang", "Yue Wang", "Sheng-Lun Xie", "Wang-Chen Xue", "Zheng-Hang Yu", "Peng Zhang", "Wen-Long Zhang", "Chao Zheng", "Jia-Wei Luo", "Shuai Zhang", "Li-Ming Song", "Shuang-Nan Zhang"], "title": "Extending the short gamma-ray burst population from sub-threshold triggers in Fermi/GBM and GECAM data and its implications", "comment": "13 pages, 8 figures", "summary": "Detection of short gamma-ray bursts (SGRBs) is critically important for the\nresearch of compact object mergers and multi-messenger astrophysics, but a\nsignificant part of SGRBs fall below the trigger threshold of GRB detectors,\nand thus are often missed. Here we present a systematic search for and\nverification of missed SGRBs using Fermi/GBM subthreshold triggers, jointly\nanalyzing data from GBM, GECAM-B, and GECAM-C. Among 466 Fermi/GBM\nsub-threshold events (with reliability >= 5) from 2021 to 2024, 181 are within\nGECAM's field of view. We find that 49 out of 181 are confirmed astrophysical\ntransients, and 41 can be classified as SGRBs. Thus, the SGRB detection rate of\nFermi/GBM is increased to about 50 per year. Additionally, a complete\nmulti-instrument monitoring and systematic verification of GBM sub-threshold\nevents is expected to further increase the SGRB rate to about 80 per year,\nwhich is about 100% improvement relative to the GBM-triggered SGRBs. These\nresults may have important implications on the local formation rate of SGRBs\nand the binary neutron star merger rate. We also searched for potential\ntemporal coincidences between these SGRBs and gravitational waves from the\nLIGO-Virgo-KAGRA O4 run resulting in no detection."}
{"id": "2509.02657", "categories": ["astro-ph.IM", "astro-ph.EP"], "pdf": "https://arxiv.org/pdf/2509.02657", "abs": "https://arxiv.org/abs/2509.02657", "authors": ["Quentin Changeat", "Pierre-Olivier Lagage", "Giovanna Tinetti", "Benjamin Charnay", "Nicolas B. Cowan", "Camilla Danielski", "Elsa Ducrot", "Achrene Dyrek", "Billy Edwards", "Theresa Lueftinger", "Giuseppina Micela", "Giuseppe Morello", "Enzo Pascale", "Severine Robert", "Olivia Venot", "Joanna K. Barstow", "Andrea Bocchieri", "James Y-K. Cho", "Ryan Cloutier", "Athena Coustenis", "Panayotis Lavvas", "Yamila Miguel", "Kay Hou Yip"], "title": "On the synergetic use of Ariel and JWST for exoplanet atmospheric science", "comment": "White paper authored by the Ariel-JWST synergy working group,\n  community feedback are welcomed, 18 pages", "summary": "This white paper explores the potential for strategic synergies between the\nJWST and the Ariel telescopes, two flagship observatories poised to\nrevolutionise the study of exoplanet atmospheres. Both telescopes have the\npotential to address common fundamental questions about exoplanets-especially\nconcerning their nature and origins-and serve a growing scientific community.\nWith their operations now anticipated to overlap, starting from 2030, there is\na unique opportunity to enhance the scientific outputs of both observatories\nthrough coordinated efforts.\n  In this report, authored by the Ariel-JWST Synergy Working Group, part of the\nAriel Consortium Science Team, we summarise the capabilities of JWST and Ariel;\nwe highlight their key differences, similarities, synergies, and distinctive\nstrengths. Ariel is designed to conduct a broad survey of exoplanet atmospheres\nbut remains highly flexible, allowing the mission to integrate insights from\nJWST's discoveries. Findings from JWST, including data from initiatives shaped\nby NASA's decadal survey priorities and community-driven research themes, will\ninform the development of Ariel's core survey strategy. Conversely, Ariel's\nability to perform broad-wavelength coverage observations for bright targets\nprovides complementary avenues for exoplanet researchers, particularly those\ninterested in time-domain observations and large-scale atmospheric studies.\n  This paper identifies key pathways for fostering JWST-Ariel synergies, many\nof which can be initiated even before Ariel's launch. Leveraging their\ncomplementary designs and scopes, JWST and Ariel can jointly address\nfundamental questions about the nature, formation, and evolution of exoplanets.\nSuch strategic collaboration has the potential to maximise the scientific\nreturns of both observatories and lay the foundation for future facilities in\nthe roadmap to exoplanet exploration."}
{"id": "2509.03001", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.03001", "abs": "https://arxiv.org/abs/2509.03001", "authors": ["Elena Brylyakova", "Marina Afonina", "Gayane Tyul'basheva", "Sergei B. Popov", "Sergei Tyul'bashev"], "title": "Low-frequency observations of low-mass binary systems with neutron star candidates", "comment": "12 pages, submitted to New Astronomy", "summary": "Recently, astrometric and spectroscopic observations resulted in the\ndiscovery of several low-mass binaries with invisible components, which are\nexpected to be compact objects. In about two dozen cases, the masses of these\ncomponents are consistent with neutron stars. We use low-frequency archival\ndata obtained with the Large Phased Array in Pushchino to search for radio\nemission from five of these systems. For all the systems, we do not detect\npersistent or periodic emission. In one case (2MASS J1527+3536), we identify a\nsingle radio burst with a flux of 13 Jy and a duration of 0.13 s. However, the\ndispersion measure of the burst does not correspond to an expected value for\nthe source. We discuss several possibilities to explain the properties of this\nburst."}
{"id": "2509.02681", "categories": ["astro-ph.IM", "astro-ph.EP"], "pdf": "https://arxiv.org/pdf/2509.02681", "abs": "https://arxiv.org/abs/2509.02681", "authors": ["Thayne Currie", "Kellen Lawson", "Erica Dykes", "Mona El Morsy"], "title": "A Striking First Impression: CGI Commissioning Observations of the AB Aurigae Protoplanetary System", "comment": "7pgs, 2 figures, 3 tables; slightly reformatted and clarified Roman\n  Coronagraph White Paper", "summary": "For one of the first set of Roman Coronagraph project images, we propose to\ntarget AB Aurigae. AB Aurigae is a complex and visually stunning system,\nsurrounded by a gas rich protoplanetary disk showing numerous spiral arms, an\nenigmatic embedded protoplanet (AB Aurigae b) at 0\\farcs{}6 separation, and\nhints of potential additional sites of planet formation. Even a\nmarginally-successful dark hole generation (e.g. 10$^{-5}$--10$^{-6}$ contrast)\nwith CGI would yield a vastly improved view of AB Aur b at optical wavelengths\nwhere current ground-based and HST data struggle to yield a high SNR detection\nand parameters (astrometry, photometry) unbiased by processing artifacts. Total\nintensity imaging and polarimetry together will provide new constraints on the\ndisk's dust properties and the range of emission sources for AB Aur b. AB Aur\nimages with the Roman Coronagraph will provide a striking, inspiring\ndemonstrations of the instrument's power and promise for detecting fainter\nplanets and disks."}
{"id": "2509.03003", "categories": ["astro-ph.HE", "nucl-th"], "pdf": "https://arxiv.org/pdf/2509.03003", "abs": "https://arxiv.org/abs/2509.03003", "authors": ["Marko Ristić", "Brandon L. Barker", "Samuel Cupp", "Axel Gross", "Nicole Lloyd-Ronning", "Oleg Korobkin", "Jonah M. Miller", "Matthew R. Mumpower"], "title": "Kilonovae and Long-duration Gamma-ray Bursts", "comment": "Submitted to ApJL; comments welcome!", "summary": "Recent detections of kilonova-like emission following long-duration gamma-ray\nbursts GRB211211A and GRB230307A have been interpreted as originating from the\nmerger of two neutron stars. In this work, we demonstrate that these\nobservations are also consistent with nucleosynthesis originating from a\ncollapsar scenario. Our model accurately predicts the observed optical and\ninfrared light curves using a single weak $r$-process component. The absence of\nlanthanide-rich material in our model, consistent with the data, challenges the\nprevailing interpretation that a red evolution in such transients necessarily\nindicates the presence of heavy $r$-process elements."}
{"id": "2509.02858", "categories": ["astro-ph.IM", "astro-ph.HE", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2509.02858", "abs": "https://arxiv.org/abs/2509.02858", "authors": ["Austen G. W. Wallis", "Christian Knigge", "James H. Matthews", "Knox S. Long", "Stuart A. Sim"], "title": "A Diagnostic Kit for Optical Emission Lines Shaped by Accretion Disc Winds", "comment": "20 pages, 14 figures. Published in MNRAS", "summary": "Blueshifted absorption is the classic spectroscopic signature of an accretion\ndisc wind in X-ray binaries and cataclysmic variables (CVs). However, outflows\ncan also create pure emission lines, especially at optical wavelengths.\nTherefore, developing other outflow diagnostics for these types of lines is\nworthwhile. With this in mind, we construct a systematic grid of 3645 synthetic\nwind-formed H-alpha line profiles for CVs with the radiative transfer code\nSIROCCO. Our grid yields a variety of line shapes: symmetric, asymmetric,\nsingle- to quadruple-peaked, and even P-Cygni profiles. About 20% of these\nlines -- our `Gold' sample -- have strengths and widths consistent with\nobservations. We use this grid to test a recently proposed method for\nidentifying wind-formed emission lines based on deviations in the wing profile\nshape: the `excess equivalent width diagnostic diagram'. We find that our\n`Gold' sample can preferentially populate the suggested `wind regions' of this\ndiagram. However, the method is highly sensitive to the adopted definition of\nthe line profile `wing'. Hence, we propose a refined definition based on the\nfull-width at half maximum to improve the interpretability of the diagnostic\ndiagram. Furthermore, we define an approximate scaling relation for the\nstrengths of wind-formed CV emission lines in terms of the outflow parameters.\nThis relation provides a fast way to assess whether -- and what kind of --\noutflow can produce an observed emission line. All our wind-based models are\nopen-source and we provide an easy-to-use web-based tool to browse our full set\nof H-alpha spectral profiles."}
{"id": "2509.03090", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.03090", "abs": "https://arxiv.org/abs/2509.03090", "authors": ["K. Kovlakas", "D. De Grandis", "N. Rea"], "title": "Neutron star envelopes with machine learning: a single-hidden-layer neural network application", "comment": "8 pages, 9 figures, accepted for publication in A&A; see also De\n  Grandis, Kovlakas & Rea in press (10.1051/0004-6361/202554666)", "summary": "Thermal and magneto-thermal simulations are an important tool for advancing\nunderstanding of neutron stars, as they allow us to compare models of their\ninternal structure and physical processes against observations constraining\nmacroscopic properties such as the surface temperature. A major challenge in\nthe simulations is in modelling of the outermost layers, known as the envelope,\nexhibiting a drop of many orders of magnitude in temperature and density in a\ngeometrically thin shell. This is often addressed by constructing a separate\nenvelope model in plane-parallel approximation that produces a relation between\nthe temperature at the bottom of the envelope, $T_b$, and the surface\ntemperature, $T_s$. Our aim is to construct a general framework for\napproximating the $T_b$-$T_s$ relation that is able to include the dependencies\nfrom the strength and orientation of the magnetic field. We used standard\nprescriptions to calculate a large number of magnetised envelope models to be\nused as a training sample and employed single-hidden-layer feedforward neural\nnetworks as approximators, providing the flexibility, high accuracy, and fast\nevaluation necessary in neutron star simulations. We explored the optimal\nnetwork architecture and hyperparameter choices and used a special holdout set\ndesigned to avoid overfitting to the structure of the input data. We find that\nrelatively simple neural networks are sufficient for the approximation of the\n$T_b$-$T_s$ relation with an accuracy $\\sim 3\\%$. The presented workflow can be\nused in a wide range of problems where simulations are used to construct\napproximating formulae."}
{"id": "2509.02877", "categories": ["astro-ph.IM", "physics.optics"], "pdf": "https://arxiv.org/pdf/2509.02877", "abs": "https://arxiv.org/abs/2509.02877", "authors": ["Kevin Derby", "Kian Milani", "Grace C. Hathaway", "Joshua Liberman", "Kyle Van Gorkom", "Ramya Anche", "Adam Schilperoort", "Corey Fucetola", "Brandon Chalifoux", "Kuravi Hewawasam", "Christopher Mendillo", "Sebastiaan Y. Haffert", "Ewan S. Douglas"], "title": "The Space Coronagraph Optical Bench (SCoOB): 7. design, fabrication, and first light for a self-coherent camera", "comment": "8 pages, 7 figures, to be published in Techniques and Instrumentation\n  for Detection of Exoplanets XII", "summary": "The 2020 Decadal Survey on Astronomy and Astrophysics tasked future space\nobservatories with the goal of detecting and characterizing a large sample of\nEarth-like exoplanets. To achieve this, these observatories will require\ncoronagraphs and wavefront control algorithms in order to achieve $10^{-10}$ or\nbetter starlight suppression. The Space Coronagraph Optical Bench (SCoOB) is a\nvacuum compatible testbed at the University of Arizona which aims to advance\nand mature starlight suppression technologies in a space-like environment. In\nits current configuration, SCoOB is a charge-6 vector vortex coronagraph\noutfitted with a Kilo-C microelectromechanical systems deformable mirror\ncapable of achieving sub-$10^{-8}$ dark hole contrast at visible wavelengths\nusing implicit electric field conjugation (iEFC). In this work, we demonstrate\nthe use of a self-coherent camera (SCC) for dark hole digging and maintenance\non SCoOB. The SCC introduces a small off-axis pinhole in the Lyot plane which\nallows some starlight to reach the focal plane and interfere with residual\nspeckles. This enables high-order focal-plane wavefront sensing which can be\ncombined with active wavefront control to null the speckles in a specified\nregion of high contrast known as the dark hole. We discuss considerations for\nimplementation, potential limitations, and provide a performance comparison\nwith iEFC. We also discuss the design optimization and fabrication process for\nour SCC Lyot stops."}
{"id": "2509.03091", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.03091", "abs": "https://arxiv.org/abs/2509.03091", "authors": ["A. A. Lagutin"], "title": "Diffusive shock acceleration: non-classical model of cosmic ray transport", "comment": "17 pages, the 5th International Symposium on Cosmic Rays and\n  Astrophysics (ISCRA-2025)", "summary": "In this work the theory of diffusive shock acceleration is extended to the\ncase of non-classical particle transport with L\\'{e}vy flights and L\\'{e}vy\ntraps, when the mean square displacement grows nonlinearly with time. In this\napproach the Green function is not a Gaussian but it exhibits power-law tails.\nBy using the propagator appropriate for non-classical diffusion, it is found\nfor the first time that energy spectral index of particles accelerated at shock\nfront is $\\gamma = [\\alpha (\\mathrm{r} + 5) - 6 \\beta]/[\\alpha(\\mathrm{r}-1)]$,\nwhere $0 < \\alpha < 2$ and $0 <\\beta < 1$ are the exponents of power-law\nbehavior of L\\'{e}vy flights and L\\'{e}vy traps, respectively.\n  We note that this result coincides with standard slope at $\\alpha=2, \\beta=1$\n(normal diffusion), and also includes those obtained earlier for the\nsubdiffusion ($\\alpha=2, \\beta<1$) and superdiffusion ($\\alpha<2, \\beta=1$)\nregimes."}
{"id": "2509.02887", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.02887", "abs": "https://arxiv.org/abs/2509.02887", "authors": ["Ramya M Anche", "Kyle Van Gorkom", "Kian Milani", "Kevin Derby", "Emory Jenkins", "Jaren Ashcraft", "Saraswathi Kalyani Subramanian", "Patrick Ingraham", "Daewook Kim", "Heejoo Choi", "Olivier Durney", "Ewan Douglas"], "title": "The Space Coronagraph Optical Bench (SCoOB): 8. end-to-end numerical modeling of the testbed to estimate the contrast limits", "comment": "7 pages, 5 figures, SPIE Optics and Photonics Conference 2025, San\n  Diego", "summary": "The space coronagraph optical bench (SCoOB) at the University of Arizona is a\nhigh-contrast imaging testbed designed to operate in a vacuum to obtain a\ncontrast better than 1e-8 in optical wavelengths using vector vortex\ncoronagraph (VVC) masks. The testbed performance in a half-sided D-shaped dark\nhole is 2.2e-9 in a << 1% BW, 4e-9 in a 2% BW, and 2.5e-8 in a 15% BW. While\nthe testbed has met the design specification contrast requirements in\nmonochromatic wavelengths, comprehensive end-to-end numerical modeling to\nassess contrast limits across different bandpasses has yet to be conducted. In\nthis work, we discuss the results of numerical modeling for the SCoOB testbed\nin both monochromatic and 10% bandwidths at 525 nm and 630 nm. This modeling\nincorporates measured VVC retardance, modeled polarization aberrations,\nmeasured surface and reflectivity errors, and diffuse and surface reflectivity.\nWe explore and discuss the various factors contributing to the contrast limits."}
{"id": "2509.03159", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2509.03159", "abs": "https://arxiv.org/abs/2509.03159", "authors": ["M. Papoutsis", "I. E. Papadakis", "C. Panagiotou", "E. Kammoun", "M. Dovciak"], "title": "X-ray reverberation modelling of the observed UV/optical power spectra of quasars", "comment": "13 pages, 7 figures, Accepted for publication in Astronomy &\n  Astrophysics", "summary": "Over the past decade, a significant amount of effort has been put into\ninvestigating the ultraviolet (UV) and optical variability of active galactic\nnuclei (AGNs). Comprehensive studies of intensive multi-wavelength monitoring\nand surveys of local and high-redshift AGNs have shown that X-ray illumination\nof AGN accretion discs is a potential explanation for the observed variability.\nOur main objective is to study the UV/optical power spectra of AGNs under the\nassumption of X-ray reverberation and to test whether this model can explain\nthe observed power spectra of distant quasars. To do this, we computed the disc\ntransfer function in the case of X-ray reverberation using a recent physical\nmodel and studied its dependence on the parameters of the model. This model\nallows us to explore the variability of X-ray illuminated discs under the\nscenario in which the X-ray corona is powered by the accretion process or by an\nexternal source. We then calculated UV/optical power spectra using the disc\ntransfer function and assuming a bending power law for the X-ray power\nspectrum. We fitted our models to the observed power spectra of quasars\ndetermined by a recent power spectrum analysis of the SDSS Stripe-82 light\ncurves. We demonstrate that X-ray reverberation can fit the power spectra of\nquasars in our sample well at all wavelengths, from $\\sim 1300$\\AA\\ up to\n$4000$\\AA. Our best-fit models imply that the X-ray corona is powered by the\naccretion disc, and that the black hole spin is probably lower than 0.7, while\nthe X-ray corona height is in the range of $20 - 60 R_{g}$. This is in\nagreement with previous findings from the application of the X-ray\nreverberation model to the quasar micro-lensing disc size problem, as well as\nrecent time-lag measurements."}
{"id": "2509.02994", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.02994", "abs": "https://arxiv.org/abs/2509.02994", "authors": ["Ramya M Anche", "Hyukmo Kang", "Kyle Van Gorkom", "Dan Vargas", "Haeun Chung", "Ellie Spitzer", "Meredith Kupinski", "B-G Andersson", "Geoff Clayton", "Ewan S. Douglas", "Luca Fossati", "Victor Gasho", "Sreejith Aickara Gopinathan", "Erika Hamden", "Thiem Hoang", "Marcus Klupar", "Ryan Lau", "Alexandre Lazarian", "Tram N Le", "Joanna Rosenbluth", "Ambily Suresh", "Carlos J. Vargas"], "title": "Optical design and polarimetric performance of a SmallSat UV polarimeter to study interstellar dust: PUFFINS", "comment": "11 pages, 7 figures, Polarization Science and Remote Sensing XII,\n  SPIE Optics and Photonics, San Diego, 2025", "summary": "The Polarimetry in the Ultraviolet to Find Features in INterStellar dust\n(PUFFINS) is a SmallSat mission concept designed to obtain ultraviolet (UV)\nspectropolarimetric observations to probe the interstellar dust grain\nproperties and to understand wavelength-dependent extinction and star\nformation. PUFFINS plans to observe 70 UV bright target stars at varying\ndistances within a 180-320 nm wavelength range with 0.02% polarimetric\naccuracy. PUFFINS uses a simple telescope design with all reflective optics\ncoated with protected aluminum to enhance reflectivity in the UV. The telescope\nand the spectropolarimeter, which consists of a Wollaston prism and a half-wave\nretarder, have been carefully selected to be greater than Technology Readiness\nLevel 6 (TRL6). The telescope is designed to exhibit negligible instrumental\npolarization and crosstalk, significantly reducing the time needed for\npolarimetric calibration in orbit. The optimum and careful selection of the\ntarget stars will enable PUFFINS to observe an expanded and well-defined sample\nto test the predictions by interstellar grain alignment theory in the\nobservation phase of 9 months. This paper outlines the details of the optical\nand optomechanical design and evaluates the polarimetric performance of\nPUFFINS."}
{"id": "2509.03189", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.03189", "abs": "https://arxiv.org/abs/2509.03189", "authors": ["Georg Schwefer"], "title": "Dissecting the Diffuse Emission of the Galaxy with the HAWC Observatory", "comment": "Proceedings of the 39th International Cosmic Ray Conference\n  (ICRC2025)", "summary": "Galactic diffuse gamma-ray emission is produced by the interaction of\nhigh-energy cosmic rays propagating through the Milky Way with interstellar gas\nand radiation fields. Its measurement can provide crucial insights into the\nacceleration and transport of cosmic rays throughout our Galaxy. Here, we\npresent a new analysis of the TeV Galactic diffuse gamma-ray emission using 8\nyears of HAWC data. This data was processed with the updated Pass 5 processing,\nenhancing the sensitivity and resolution of the instrument. For the analysis,\nwe make use of Gammapy, an open-source package for gamma-ray astronomy, and\nrecent models of the Galactic diffuse emission at TeV energies. After\nsubtracting the emission from sources using an algorithm akin to that developed\nfor the foreseen CTAO Galactic plane survey, we find significant remaining\nemission throughout the Galactic plane. We show the latitudinal and\nlongitudinal flux profiles of the emission in multiple parts of the galaxy\ntaking into account various sources of uncertainty and compare to existing\nmodels. We find significant emission beyond 3 degree latitude, consistent in\nshape with the prediction for the interaction of cosmic rays with the\ninterstellar gas. We also demonstrate that our results are consistent with\nrecent LHAASO results when equivalent analysis methods are used."}
{"id": "2509.03005", "categories": ["astro-ph.IM", "astro-ph.EP", "physics.space-ph"], "pdf": "https://arxiv.org/pdf/2509.03005", "abs": "https://arxiv.org/abs/2509.03005", "authors": ["Kai-Tian Yuan", "Hou-Yuan Lin"], "title": "Introduction to the Sky Survey Schedule (SSS) framework", "comment": "9 pages, 9 figures; Submitted to 76th International Astronautical\n  Congress (IAC 2025), A6 Symposium on Space Debris", "summary": "To fulfill the requirements of space object cataloging and enable automated\nintelligent responses to anomalous events, we designed a novel observation\nscheduling system named Sky Survey Schedule (SSS). This framework facilitates\ncoordinated operations across multi-site observational networks comprising\ndozens of instruments, while simultaneously supporting asteroid monitoring and\ntime-domain astronomy studies. The system implements two principal observation\nmodes: fixed sky regions and target-centered tracking. The former is used for\nsidereal or static observation, while the latter provides dedicated follow-up\ncapabilities for transient targets. The sky regions are divided into latitude\nbands, each of which is subdivided into sectors to ensure minimal overlap and\ncomprehensive coverage. These sectors are mapped to high-level HEALPix sky\ngrids, enabling rapid cross-referencing and correlation between instruments. At\nthe core of SSS lies an adaptive weighting architecture that integrates\nmultiple parameters. Initial target priorities are determined from orbital\ncatalogs containing both known and uncorrelated objects according to cataloging\nrequirements. The system implements dynamic weight adjustments through feedback\nmechanisms: confirmed stable objects receive decaying weights, long-unobserved\ntargets experience weight recovery, while anomalies (e.g., newly detected or\nlost objects) trigger priority escalation. These target-specific weights\ncombine with observational factors - including phase angle constraints, lunar\ninterference, Earth shadowing, and elevation limits - to generate space-time\npriority matrices. This quantitative framework systematically incorporates\noperator-defined priorities for specific regions/targets through configurable\nweight modifiers. Observation plans are dynamically optimized considering:...."}
{"id": "2509.03272", "categories": ["astro-ph.HE", "gr-qc", "hep-ph"], "pdf": "https://arxiv.org/pdf/2509.03272", "abs": "https://arxiv.org/abs/2509.03272", "authors": ["János Takátsy", "Lorenz Zwick", "David O'Neill", "Johan Samsing"], "title": "Amplified capture rate of dark matter in compact binaries and constraints on bosonic dark matter from GW170817", "comment": "14 pages, 5 figures", "summary": "The accretion of dark matter (DM) onto compact objects and the potential\ngravitational collapse of neutron stars due to this accretion has become a\npromising indirect probe of DM properties, complementing terrestrial\nexperiments. We show that the accretion flux of DM on stellar objects is\namplified in binary systems due to the complex gravitational interaction of\nsaid particles with the binary. We perform few-body Monte Carlo simulations to\nshow that this amplification factor is $\\sim4-5$ for circular binaries, small\nDM velocity dispersions and mass ratios $q\\gtrsim0.3$. We use this factor to\nimprove previous constraints on the scattering cross section of\nnon-annihilating bosonic DM with baryonic matter, and derive upper bounds on\nthis cross section from the observation of the binary NS merger associated with\nGW170817. We also show that the maximally accretable mass fraction of DM by\nbinary NSs is $\\lesssim10^{-3}$, even for extreme DM densities only possible in\nDM spikes, due to the dynamical friction exerted by the ambient DM."}
{"id": "2509.03075", "categories": ["astro-ph.IM", "cs.DC"], "pdf": "https://arxiv.org/pdf/2509.03075", "abs": "https://arxiv.org/abs/2509.03075", "authors": ["Mathis Certenais", "François Bodin", "Laurent Morin"], "title": "A description of the radio astronomy data processing tool DDF Pipeline", "comment": null, "summary": "This paper presents the DDF Pipeline, a radio astronomy data processing tool\ninitially designed for the LOw-Frequency ARray (LO- FAR) radio-telescope and a\ncandidate for processing data from the Square Kilometre Array (SKA). This work\ndescribes the DDF Pipeline software and presents a coarse-grain profiling\nexecution to characterize its performance."}
{"id": "2509.03298", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.03298", "abs": "https://arxiv.org/abs/2509.03298", "authors": ["J. Jaimes", "T. Capistrán", "I. Torres"], "title": "Machine learning reconstruction of cosmic ray parameters in EAS at HAWC", "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC2025),\n  Geneva, Switzerland", "summary": "The High-Altitude Water Cherenkov (HAWC) Observatory comprises 300 water\nCherenkov detectors, each equipped with four photomultipliers, located on the\nVolc\\'{a}n Sierra Negra in Mexico at 4,100 masl. This observatory can detect\ngamma rays in an energy range from 300 GeV to 100 TeV and cosmic rays from 100\nGeV to 1 PeV. One of HAWC's primary challenges is characterizing air showers\nand estimate their physical parameters, a highly complex task due to the nature\nof the data and the processes involved. Currently, HAWC employs two energy\nestimators for gamma rays: the ground parameter method and a neural\nnetwork-based approach. However, for cosmic rays, only the likelihood-based\nestimator is available. In this work, we leverage machine learning techniques\nto achieve more accurate estimation of the physical parameters of cosmic rays.\nThese techniques are explored as an alternative for reconstructing the physical\nproperties of extensive air showers using simulated data aligned with the\nobservatory's configuration. Various models were trained and evaluated through\nan optimized pipeline and the most effective one was selected as the final\nimplementation after a comprehensive comparison. This approach improves the\naccuracy of physical parameter estimation, contributing significantly to the\ndetailed characterization of cosmic ray events."}
{"id": "2509.03090", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.03090", "abs": "https://arxiv.org/abs/2509.03090", "authors": ["K. Kovlakas", "D. De Grandis", "N. Rea"], "title": "Neutron star envelopes with machine learning: a single-hidden-layer neural network application", "comment": "8 pages, 9 figures, accepted for publication in A&A; see also De\n  Grandis, Kovlakas & Rea in press (10.1051/0004-6361/202554666)", "summary": "Thermal and magneto-thermal simulations are an important tool for advancing\nunderstanding of neutron stars, as they allow us to compare models of their\ninternal structure and physical processes against observations constraining\nmacroscopic properties such as the surface temperature. A major challenge in\nthe simulations is in modelling of the outermost layers, known as the envelope,\nexhibiting a drop of many orders of magnitude in temperature and density in a\ngeometrically thin shell. This is often addressed by constructing a separate\nenvelope model in plane-parallel approximation that produces a relation between\nthe temperature at the bottom of the envelope, $T_b$, and the surface\ntemperature, $T_s$. Our aim is to construct a general framework for\napproximating the $T_b$-$T_s$ relation that is able to include the dependencies\nfrom the strength and orientation of the magnetic field. We used standard\nprescriptions to calculate a large number of magnetised envelope models to be\nused as a training sample and employed single-hidden-layer feedforward neural\nnetworks as approximators, providing the flexibility, high accuracy, and fast\nevaluation necessary in neutron star simulations. We explored the optimal\nnetwork architecture and hyperparameter choices and used a special holdout set\ndesigned to avoid overfitting to the structure of the input data. We find that\nrelatively simple neural networks are sufficient for the approximation of the\n$T_b$-$T_s$ relation with an accuracy $\\sim 3\\%$. The presented workflow can be\nused in a wide range of problems where simulations are used to construct\napproximating formulae."}
{"id": "2509.03326", "categories": ["astro-ph.HE", "astro-ph.IM", "astro-ph.SR", "physics.comp-ph", "physics.plasm-ph"], "pdf": "https://arxiv.org/pdf/2509.03326", "abs": "https://arxiv.org/abs/2509.03326", "authors": ["D. A. Shestakov", "V. V. Izmodenov"], "title": "Numerical Modeling of Galactic Cosmic Ray Modulation in the Heliosphere", "comment": "Submitted to Lobachevskii Journal of Mathematics", "summary": "Numerical modeling of galactic cosmic rays (GCRs) penetration through the\nheliosphere to the vicinity of the Sun is considered. Galactic cosmic rays are\ncharged particles with energies exceeding 10 MeV/nucl., originating from far\nbeyond the boundaries of our Solar System. As they penetrate through the\nheliosphere - the region of space filled by the solar wind - they interact\nstrongly with the interplanetary magnetic field. In this paper, we present\nnumerical approaches to solving the so-called Parker transport equation for the\nisotropic velocity distribution function of GCRs. This equation includes a\nconvective term, anisotropic diffusion, adiabatic cooling, and drifts.\nAdditionally, the diffusion coefficient is spatially and energy-dependent,\nvarying by several orders of magnitude. Our numerical approaches are based on\nthe finite-difference method (Crank-Nicolson scheme) and the stochastic\ndifferential equations (SDE) method. The numerical methods were validated\nagainst a known analytical solution under simplified conditions. For the\ngeneral problem formulation, which involves anisotropic diffusion and the\nParker spiral interplanetary magnetic field configuration, we used the most\nefficient and flexible SDE method and compared the numerical results with the\ndata from the works of Kota & Jokipii (1983) and Burger (2012). Special\nattention was devoted to incorporating drift along the heliospheric current\nsheet in the model."}
{"id": "2509.03298", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.03298", "abs": "https://arxiv.org/abs/2509.03298", "authors": ["J. Jaimes", "T. Capistrán", "I. Torres"], "title": "Machine learning reconstruction of cosmic ray parameters in EAS at HAWC", "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC2025),\n  Geneva, Switzerland", "summary": "The High-Altitude Water Cherenkov (HAWC) Observatory comprises 300 water\nCherenkov detectors, each equipped with four photomultipliers, located on the\nVolc\\'{a}n Sierra Negra in Mexico at 4,100 masl. This observatory can detect\ngamma rays in an energy range from 300 GeV to 100 TeV and cosmic rays from 100\nGeV to 1 PeV. One of HAWC's primary challenges is characterizing air showers\nand estimate their physical parameters, a highly complex task due to the nature\nof the data and the processes involved. Currently, HAWC employs two energy\nestimators for gamma rays: the ground parameter method and a neural\nnetwork-based approach. However, for cosmic rays, only the likelihood-based\nestimator is available. In this work, we leverage machine learning techniques\nto achieve more accurate estimation of the physical parameters of cosmic rays.\nThese techniques are explored as an alternative for reconstructing the physical\nproperties of extensive air showers using simulated data aligned with the\nobservatory's configuration. Various models were trained and evaluated through\nan optimized pipeline and the most effective one was selected as the final\nimplementation after a comprehensive comparison. This approach improves the\naccuracy of physical parameter estimation, contributing significantly to the\ndetailed characterization of cosmic ray events."}
{"id": "2509.02645", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.02645", "abs": "https://arxiv.org/abs/2509.02645", "authors": ["Liang Liu", "Hai-Nan Lin", "Li Tang"], "title": "Revised classification of the CHIME fast radio bursts with machine learning", "comment": "13 pages, 7 figures, 2 tables", "summary": "Fast radio bursts (FRBs) are short-duration and energetic radio transients of\nunknown origin. Observationally, they are commonly categorized into repeaters\nand non-repeaters. However, this binary classification may be influenced by\nobservational limitations such as sensitivity and time coverage of telescopes.\nIn this work, we employ unsupervised machine learning techniques to re-examine\nthe CHIME/FRB catalog, with the goal of identifying intrinsic groupings in the\nFRB population without relying on preassigned labels. Using t-distributed\nstochastic neighbor embedding (t-SNE) for dimensionality reduction and\nhierarchical density-based spatial clustering of applications with noise\n(HDBSCAN) for clustering, we find that the FRB sample separates naturally into\ntwo major clusters. One cluster contains nearly all known repeaters but is\ncontaminated by some apparently non-repeaters, while the other cluster is\ndominated by non-repeaters. This suggests that certain FRBs previously labeled\nas non-repeaters may share intrinsic similarities with repeaters. The mutual\ninformation analysis reveals that rest-frame frequency width and peak frequency\nare the most informative features governing the clustering structure. Even when\nreducing the input space to just these two features, the classification remains\nrobust."}
{"id": "2509.03326", "categories": ["astro-ph.HE", "astro-ph.IM", "astro-ph.SR", "physics.comp-ph", "physics.plasm-ph"], "pdf": "https://arxiv.org/pdf/2509.03326", "abs": "https://arxiv.org/abs/2509.03326", "authors": ["D. A. Shestakov", "V. V. Izmodenov"], "title": "Numerical Modeling of Galactic Cosmic Ray Modulation in the Heliosphere", "comment": "Submitted to Lobachevskii Journal of Mathematics", "summary": "Numerical modeling of galactic cosmic rays (GCRs) penetration through the\nheliosphere to the vicinity of the Sun is considered. Galactic cosmic rays are\ncharged particles with energies exceeding 10 MeV/nucl., originating from far\nbeyond the boundaries of our Solar System. As they penetrate through the\nheliosphere - the region of space filled by the solar wind - they interact\nstrongly with the interplanetary magnetic field. In this paper, we present\nnumerical approaches to solving the so-called Parker transport equation for the\nisotropic velocity distribution function of GCRs. This equation includes a\nconvective term, anisotropic diffusion, adiabatic cooling, and drifts.\nAdditionally, the diffusion coefficient is spatially and energy-dependent,\nvarying by several orders of magnitude. Our numerical approaches are based on\nthe finite-difference method (Crank-Nicolson scheme) and the stochastic\ndifferential equations (SDE) method. The numerical methods were validated\nagainst a known analytical solution under simplified conditions. For the\ngeneral problem formulation, which involves anisotropic diffusion and the\nParker spiral interplanetary magnetic field configuration, we used the most\nefficient and flexible SDE method and compared the numerical results with the\ndata from the works of Kota & Jokipii (1983) and Burger (2012). Special\nattention was devoted to incorporating drift along the heliospheric current\nsheet in the model."}
{"id": "2509.02858", "categories": ["astro-ph.IM", "astro-ph.HE", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2509.02858", "abs": "https://arxiv.org/abs/2509.02858", "authors": ["Austen G. W. Wallis", "Christian Knigge", "James H. Matthews", "Knox S. Long", "Stuart A. Sim"], "title": "A Diagnostic Kit for Optical Emission Lines Shaped by Accretion Disc Winds", "comment": "20 pages, 14 figures. Published in MNRAS", "summary": "Blueshifted absorption is the classic spectroscopic signature of an accretion\ndisc wind in X-ray binaries and cataclysmic variables (CVs). However, outflows\ncan also create pure emission lines, especially at optical wavelengths.\nTherefore, developing other outflow diagnostics for these types of lines is\nworthwhile. With this in mind, we construct a systematic grid of 3645 synthetic\nwind-formed H-alpha line profiles for CVs with the radiative transfer code\nSIROCCO. Our grid yields a variety of line shapes: symmetric, asymmetric,\nsingle- to quadruple-peaked, and even P-Cygni profiles. About 20% of these\nlines -- our `Gold' sample -- have strengths and widths consistent with\nobservations. We use this grid to test a recently proposed method for\nidentifying wind-formed emission lines based on deviations in the wing profile\nshape: the `excess equivalent width diagnostic diagram'. We find that our\n`Gold' sample can preferentially populate the suggested `wind regions' of this\ndiagram. However, the method is highly sensitive to the adopted definition of\nthe line profile `wing'. Hence, we propose a refined definition based on the\nfull-width at half maximum to improve the interpretability of the diagnostic\ndiagram. Furthermore, we define an approximate scaling relation for the\nstrengths of wind-formed CV emission lines in terms of the outflow parameters.\nThis relation provides a fast way to assess whether -- and what kind of --\noutflow can produce an observed emission line. All our wind-based models are\nopen-source and we provide an easy-to-use web-based tool to browse our full set\nof H-alpha spectral profiles."}
