{"id": "2511.10700", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.10700", "abs": "https://arxiv.org/abs/2511.10700", "authors": ["Sabrina DeSoto", "JenniferL. Hoffman", "G. Grant Williams", "Christopher Bilinski", "Douglas C. Leonard", "Peter A. Milne", "Christopher Pickens", "Manisha Shrestha", "Nathan Smith", "Paul S. Smith"], "title": "Spectropolarimetric Evolution Reveals Dual-Axis Ejecta in the Atypical Magnetar-Powered SN 2012au", "comment": null, "summary": "We present six epochs of optical spectropolarimetric observations of the unique and slow-evolving Type Ib supernova (SN) 2012au, between 0 and 295 days post R-band maximum. The polarization levels seen throughout our observations are on average 0.87% +/- 0.05% higher than those of any Type Ib SN~yet studied, suggesting either that it is the most asymmetric of the sample, or if all SNe Ib have similar asymmetry, that it is viewed at a more optimum angle. Significant continuum polarization indicates that the photosphere exhibited a global departure from spherical symmetry at the level of 10%-40% at the earliest times (days 0--40), which decreased to 0%-20% by days 57--90. During the early photospheric phase, the ejecta maintained a near-constant orientation of 12°-20° on the sky, as shown by the dominant axis in the Stokes q-u plane. Polarization signatures in the Fe II λλλ4924, 5018, 5169 lines shared this axis. Meanwhile, high levels of polarization associated with the He I lines traced distinct q-u loops with a dramatic rotation away from the dominant axis, indicating that the early-time ejecta were also characterized by hot, fast, helium-rich material concentrated near the poles. At day 295, during the transition to the nebular phase, a new, highly elongated structure became prominent in the ejecta, with an axis orthogonal to the dominant axis that defined the photospheric phase. This dual-axis geometry may link SN 2012au's high luminosity and asymmetric structure to a magnetar powering mechanism."}
{"id": "2511.10728", "categories": ["astro-ph.HE", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2511.10728", "abs": "https://arxiv.org/abs/2511.10728", "authors": ["Aleksandra Olejak", "Jakub Klencki", "Alejandro Vigna-Gomez", "Selma E. de Mink", "Lieke van Son", "Jakob Stegmann", "Taeho Ryu", "David D. Hendriks"], "title": "Widening of Binaries via Non-conservative Mass Transfer as a Formation Channel for Gaia Black Hole System", "comment": "12 pages, comments are very welcome", "summary": "The detected Gaia systems hosting compact objects challenge standard models of binary star evolution. In particular, if the observed black hole (BH) systems evolved in isolation, it is expected that they underwent a mass transfer phase. Given their highly unequal mass ratios, such mass transfer is dynamically unstable within standard models, leading to either a stellar merger or a final binary with a very short orbital period. In contrast, the observed systems have much wider orbits than predicted, making their formation within conventional evolutionary frameworks difficult to reconcile. With the aid of detailed binary evolution calculations, we test whether fully non-conservative mass transfer, where mass is lost from the system carrying the specific angular momentum of the donor's center of mass, can explain the properties of two of the Gaia BH systems. This mass-loss geometry differs from the standard isotropic re-emission model, which assumes mass loss from the accretor's vicinity. We find that our mass-loss model, without the need for fine-tuning, reproduces the observed orbital periods of the two Gaia BH systems remarkably well across a wide range of initial conditions. This scenario, therefore, offers a plausible formation pathway for these systems. We speculate that orbital widening during mass loss could result from the unequal Roche-lobe sizes of the components and eruptive mass loss driven by the donor's high-opacity subsurface layers. Similar mass loss may also be relevant for all other classes of post-mass-transfer binaries that face analogous evolutionary challenges, including Gaia neutron star and white dwarf systems, binaries hosting stripped-envelope Wolf-Rayet stars, and low-mass X-ray binaries."}
{"id": "2511.10736", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.10736", "abs": "https://arxiv.org/abs/2511.10736", "authors": ["Aristeidis Polychronakis", "Ioannis Liodakis", "Anastasia Glykopoulou", "Dmitry Blinov", "Ivan Agudo", "Svetlana G. Jorstad", "Beatriz Agis-Gonzalez", "Sara Capecchiacci", "Alberto Floris", "Sebastian Kielhmann", "John A. Kypriotakis", "Dimitrios A. Langis", "Nikos Mandarakas", "Karan Pal", "Francisco J. Aceituno", "Giacomo Bonnoli", "Victor Casanova", "Gabriel Emery", "Juan Escudero Pedrosa", "Jorge Otero-Santos", "Daniel Morcuende", "Alfredo Sota", "Vilppu Piirola"], "title": "Intra-night optical polarization monitoring of blazars", "comment": "Accepted for publication in A&A, comments welcome, 7 pages, 5 figures", "summary": "Blazars are known for their extreme variability across the electromagnetic spectrum. Variability at very short timescales can push the boundaries between competing models offering us much needed discriminating power. This is particularly true for polarization variability that allows us to probe particle acceleration and high-energy emission models in blazars. Here we present results from the first pilot study of intra-night optical polarization monitoring conducted using RoboPol at the Skinakas Observatory and supplemented by observations from the Calar Alto, Perkins, and Sierra Nevada observatories. Our results show that while variability patterns can widely vary between sources, variability on timescales as short as minutes is prevalent in blazar jets. The amplitude of variations are typically small, a few percent for the polarization degree and less than 20 degrees for the polarization angle, pointing to a significant contribution to the optical emission from a turbulent magnetic field component, while the overall stability of the polarization angle over time points to a preferred magnetic field orientation."}
{"id": "2511.10739", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.10739", "abs": "https://arxiv.org/abs/2511.10739", "authors": ["Naixin Liang", "Damiano Caprioli"], "title": "Hybrid Simulations of Supersonic Shear Flows: I) Particle Acceleration", "comment": "13 pages, 12 figures", "summary": "Supersonic flows are ubiquitous in warm and cool media; their dissipation leads to heating, generation of nonthermal particles, and amplification of background magnetic fields. We present 2D hybrid (kinetic ions - fluid electrons) simulations of decaying shear flows across the subsonic-to-supersonic transition, finding that the canonical Kelvin-Helmholtz instability in subsonic cases gives way to the formation of shocklets in supersonic shears, where dissipation is faster and nonthermal particles are produced. We discuss the dependence on the flow Mach number of particle acceleration, the viscosity induced by kinetic effects, and the production of magnetic turbulence. We outline the potential impact of these findings for turbulence in the warm interstellar medium, for molecular clouds, and for accretion disks, leaving to a companion paper the discussion of the effects on the shear of self-generated and pre-existing energetic particles."}
{"id": "2511.10722", "categories": ["astro-ph.IM", "cs.DL", "physics.soc-ph"], "pdf": "https://arxiv.org/pdf/2511.10722", "abs": "https://arxiv.org/abs/2511.10722", "authors": ["Vicente Amado Olivo", "Wolfgang Kerzendorf", "Bangjing Lu", "Joshua V. Shields", "Andreas Flörs", "Nutan Chen"], "title": "Practical Author Name Disambiguation under Metadata Constraints: A Contrastive Learning Approach for Astronomy Literature", "comment": null, "summary": "The ability to distinctly and properly collate an individual researcher's publications is crucial for ensuring appropriate recognition, guiding the allocation of research funding and informing hiring decisions. However, accurately grouping and linking a researcher's entire body of work with their individual identity is challenging because of widespread name ambiguity across the growing literature. Algorithmic author name disambiguation provides a scalable approach to disambiguating author identities, yet existing methods have limitations. Many modern author name disambiguation methods rely on comprehensive metadata features such as venue or affiliation. Despite advancements in digitally indexing publications, metadata is often unavailable or inconsistent in large digital libraries(e.g. NASA/ADS). We introduce the Neural Author Name Disambiguator, a method that disambiguates author identities in large digital libraries despite limited metadata availability. We formulate the disambiguation task as a similarity learning problem by employing a Siamese neural network to disambiguate author names across publications relying solely on widely available publication metadata-author names, titles and abstracts. We construct the Large-Scale Physics ORCiD Linked dataset to evaluate the Neural Author Name Disambiguator by cross-matching NASA/ADS publications ORCiD. By leveraging foundation models to embed metadata into features, our model achieves up to 94% accuracy in pairwise disambiguation and over 95% F1 in clustering publications into their researcher identities. We release the testing dataset as a benchmark for physics and astronomy, providing realistic evaluation conditions for future disambiguation methods. The Neural Author Name Disambiguator algorithm demonstrates effective disambiguation with minimal metadata, offering a scalable solution for name ambiguity in large digital libraries."}
{"id": "2511.10740", "categories": ["astro-ph.HE", "astro-ph.CO", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2511.10740", "abs": "https://arxiv.org/abs/2511.10740", "authors": ["E. Gatuzz", "J. Sanders", "A. Liu", "A. Fabian", "C. Pinto", "D. Eckert", "S. Walker"], "title": "The Quiescent Merging Nature of the Coma Cluster Revealed by ICM Velocity Structure", "comment": "5 pages, 4 figures, letter submitted to A&A", "summary": "The hot gas permeating galaxy clusters-the intracluster medium (ICM)-is a key tracer of their assembly history and internal dynamics. Understanding the motion of this gas provides critical insight into processes such as mergers, turbulence, and energy dissipation in the largest gravitationally bound structures in the Universe. The Coma cluster is a nearby, massive system long suspected to be dynamically disturbed. Previous high-resolution X-ray spectroscopy with the XRISM mission revealed bulk motions in the cluster core and southern regions. Here we present new XRISM Resolve observations of a northern region in Coma, which reveal a coherent velocity gradient of nearly $530 km/s across the cluster from south to north. We find that the hot gas in this northern region exhibits modest line-of-sight motions and uniform thermodynamic properties, indicating relatively mild local disturbances. The consistent levels of turbulence throughout the cluster suggest that the energy from a past merger has been distributed on large scales. These findings provide compelling evidence for an off-axis merger event and demonstrate how high-resolution X-ray spectroscopy can uncover subtle dynamical signatures in the ICM, offering important constraints for simulations of cluster evolution."}
{"id": "2511.10773", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2511.10773", "abs": "https://arxiv.org/abs/2511.10773", "authors": ["Sumit Dahal", "Thomas R. Stevenson", "Nicholas P. Costen", "Nat DeNigris", "Jason Glenn", "Gang Hu", "Christine A. Jhabvala", "Ricardo Morales-Sanchez", "Jessica B. Patel", "Manuel A. Quijada", "Ian Schrock", "Frederick H. Wang", "Edward J. Wollack"], "title": "Optimization of lenslet arrays for PRIMA Kinetic Inductance Detectors", "comment": "5 pages, 5 figures, submitted to IEEE Transactions on Applied Superconductivity", "summary": "The PRobe far-Infrared Mission for Astrophysics (PRIMA) is a cryogenically cooled 1.8-m space telescope designed to address fundamental questions about the evolution of galactic ecosystems, the origins of planetary atmospheres, and the buildup of dust and metals over cosmic time. PRIMA will achieve unprecedented sensitivity in the 24 - 261 $μ$m wavelength range, enabled by background-limited kinetic inductance detectors (KIDs) cooled to 120 mK. For PRIMA's Far-InfraRed Enhanced Survey Spectrometer (FIRESS) instrument, we have developed monolithic kilopixel silicon lenslet arrays to efficiently couple incident radiation from the telescope's fore-optics onto the KID absorber elements. These three-dimensional lenslet arrays are fabricated using grayscale lithography, followed by deep reactive ion etching (DRIE), and are anti-reflection (AR) coated with a quarter-wavelength thick deposition of Parylene-C. The lenslet arrays are aligned and bonded to the KID arrays using a thin layer of epoxy through a flip-chip bonder. In this work, we report on the optimized fabrication, lens design, AR coating, and bonding processes developed for the FIRESS lenslet arrays. We characterize brassboard lenslet arrays fabricated to meet the specifications of the FIRESS low and high spectral bands, demonstrate stepped-thickness AR-coatings to achieve high efficiency across broad wavelength ranges, and present spectral transmission measurements of the AR coating and the epoxy bonding layers."}
{"id": "2511.10744", "categories": ["astro-ph.HE", "astro-ph.IM", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2511.10744", "abs": "https://arxiv.org/abs/2511.10744", "authors": ["Ferdinand", "W. V. Jacobson-Galán", "M. M. Kasliwal", "Erez A. Zimmerman"], "title": "XSNAP: An X-ray Supernova Analysis Pipeline with Application to the Type II Supernova 2024ggi", "comment": "12 pages, 4 figures, submitted to ApJ. Software code is available at https://xsnap.org or https://pypi.org/p/xsnap/", "summary": "X-ray observations of Type II supernovae (SNe II) probe the physics of supernova (SN) shocks and the mass-loss histories of their progenitor stars. We present multi-epoch, X-ray observations of SN II 2024ggi ($D \\approx 7.2 \\ \\rm Mpc$) from ${\\it Swift}$-XRT, ${\\it Chandra}$ and ${\\it XMM}$, which cover $\\sim 1 - 344$ days since first light. We analyze these observations using a new open-source Python package called $\\texttt{XSNAP}$, which standardizes a unified command-line interface for instrument-specific reduction and spectral extraction. $\\texttt{XSNAP}$ introduces application programming interfaces for per-epoch spectral modeling through $\\texttt{PyXspec}$ and $\\texttt{emcee}$ Markov chain Monte Carlo fitting. We employ ${\\tt XSNAP}$ to model the multi-epoch X-ray spectra of SN 2024ggi with an absorbed thermal bremsstrahlung model and calculate a steady progenitor mass-loss rate of $(6.2\\pm0.2)\\times10^{-5}\\,M_{\\odot}\\,\\mathrm{yr^{-1}}$ $(v_{\\rm wind} = 20 \\ \\rm km \\ s^{-1})$, for which the detected X-ray emission traces the final 117 years before explosion. The software is publicly available on GitHub, with a released package on the Python Package Index (PyPI)."}
{"id": "2511.10805", "categories": ["astro-ph.IM", "astro-ph.CO", "astro-ph.GA", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2511.10805", "abs": "https://arxiv.org/abs/2511.10805", "authors": ["Cheng-Liang Wei", "Yu Luo", "Hao Tian", "Ming Li", "Yi-Sheng Qiu", "Guo-Liang Li", "Yue-Dong Fang", "Xin Zhang", "De-Zi Liu", "Nan Li", "Ran Li", "Huan-Yuan Shan", "Lin Nie", "Zizhao He", "Lei Wang", "Xi Kang", "Dongwei Fan", "Yang Chen", "Xiaoting Fu", "Chao Liu"], "title": "Mock Observations for the CSST Mission: Main Surveys -- the Mock Catalogue", "comment": "17 pages, 17 figures, accepted in RAA. Our mock catalog is available upon request", "summary": "The Chinese Space Station Survey Telescope (CSST) is a flagship space mission, designed to carry out a large-area sky survey to explore the nature of dark matter and dark energy in the Universe. The onboard multi-band imaging and slitless spectroscopic modules will enable us to obtain photometric data for billions of galaxies and stars, as well as hundreds of millions of spectroscopic measurements, advancing various scientific analyses such as galaxy clustering and weak gravitational lensing. To support the image simulations for the main survey of the CSST mission, we present a mock catalogue of stars and galaxies. For stars, the mock catalogue is generated using either Galaxia or TRILEGAL, both of which provide a range of stellar properties to meet the requirements of CSST image simulations. For galaxies, we built a mock light-cone up to redshift z~3.5 from the cosmological Nbody simulation and populated the mock galaxy catalogue from the dark mater haloes using a semi-analytical galaxy formation model. We then performed a full-sky ray-tracing simulation of weak gravitational lensing to obtain lensing shear at the position of each galaxy in the light-cone. To support both multi-band imaging and slitless spectroscopic simulations, we computed the spectral energy distribution (SED) for each galaxy based on its star formation history using a supervised deep-learning model and determined the magnitudes in each band using the CSST throughputs. Finally, the properties of our mock galaxies include positions, redshifts, stellar masses, shapes, sizes, SEDs, lensing shears and magnifications. We have validated our mock catalogue against observational data and theoretical models, with results showing good overall agreement. The catalogue provides a flexible dataset for the development of CSST image processing and can support a wide range of cosmological analyses within the CSST mission."}
{"id": "2511.10747", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.10747", "abs": "https://arxiv.org/abs/2511.10747", "authors": ["Peter K. Blanchard", "Edo Berger", "Sebastian Gomez", "Matt Nicholl", "Ryan Chornock", "Harsh Kumar", "Raffaella Margutti", "Daichi Hiramatsu", "Huei Sears"], "title": "Hydrogen-Poor Superluminous Supernovae in the Nebular Phase: Spectral Diversity Due to Ejecta Ionization as a Probe of the Power Source", "comment": "24 pages, 17 figures, submitted to ApJ", "summary": "We present a large sample of 39 nebular-phase optical spectra of 25 hydrogen-poor superluminous supernovae (SLSNe-I) and jointly analyze them with previously published spectra of 12 events. We measure the properties of key emission features, namely those at 6300, 7300, and 7774 angstroms (associated with [O I], [Ca II]/[O II], and O I, respectively), and find that SLSNe exhibit much wider spectral diversity than normal SNe Ic, primarily in the line ratio $L_{7300}/L_{6300}$, which is highly sensitive to ejecta ionization. Some events exhibit weak [O I] and a clear [O II] contribution to the 7300 angstrom feature, enhancing the ratio, along with [O III] lines at 4363 and 5007 angstroms. Other SLSNe show weak or no lines of ionized oxygen. Moreover, we find that the population exhibits decreasing $L_{7300}/L_{6300}$ over time, while a few outliers instead display sustained high or increasing ratios for extended periods. The ratio $L_{7300}/L_{6300}$ is also correlated with the rise and decline times of the light curves, with slower events exhibiting higher ionization, the first robust connection between early light curve and late-time spectral properties, likely due to the magnetar's impact: slower-evolving SLSNe are generally powered by engines with longer spin-down timescales, which deposit more energy at later phases. Among the events with decreasing $L_{7300}/L_{6300}$, SLSNe with high ionization are on average powered by magnetars with higher thermalized spin-down power, a correlation that is most significant for events with $M_{\\rm ej}\\lesssim12$ M$_{\\odot}$. The ionization in the outliers with increasing $L_{7300}/L_{6300}$ may be due to late CSM interaction. $L_{7300}/L_{6300}$ and its evolution are therefore key diagnostics of SLSN engines and progenitor mass loss."}
{"id": "2511.10886", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2511.10886", "abs": "https://arxiv.org/abs/2511.10886", "authors": ["A. Ahmad", "S. Dai", "E. Lenc", "M. D. Filipović", "B. S. Koribalski", "S. Johnston", "G. Hobbs", "S. W. Duchesne", "S. Lazarević", "J. T. Bai", "L. Toomey", "N. D. R. Bhat", "D. A. Leahy", "A. M. Hopkins", "T. Zafar", "S. F. Rahman"], "title": "Evolutionary Map of the Universe: A pilot survey to detect high Galactic latitude pulsars in variance images with ASKAP", "comment": null, "summary": "It has been proposed that radio pulsars can be distinguished from other point-like radio sources in continuum images by their unique interstellar scintillation signatures. Using data from the Australian Square Kilometre Array Pathfinder (ASKAP) Evolutionary Map of the Universe (EMU) survey, we conducted a pilot survey of radio pulsars at high Galactic latitude regions via the variance imaging method. Out of approximately 59,800 compact radio sources detected in a ~480 square degree survey area, we identified 20 highly variable sources. Among them, 9 are known pulsars, 1 is a known radio star, 1 is an ultra-long period source, 3 are radio star candidates, and the remaining 6 are pulsar candidates. Notably, we discovered two strongly scintillating pulsars: one with a period of 85.707 ms and a dispersion measure (DM) of 19.4 pc/cm^3, and another with a period of 5.492 ms and a DM of 29.5 pc/cm^3. In addition, a third pulsar was discovered in the variance images, with a period of 14.82 ms and a DM of 39.0 pc/cm^3. This source shows a steep radio spectrum and a high degree of circular polarisation. These results underscore the strong potential of variance imaging for pulsar detection in full EMU and future radio continuum surveys planned with Square Kilometre Array (SKA)."}
{"id": "2511.10944", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.10944", "abs": "https://arxiv.org/abs/2511.10944", "authors": ["Tobias Heibges", "Diksha Garg", "Claire Guépin", "Julia Burton-Heibges", "John F. Krizmanic", "Mary Hall Reno", "Tonia M. Venters", "Lawrence Wiencke"], "title": "EUSO-SPB2 Cherenkov Telescope: Overview and First Neutrino Constraints", "comment": "11 pages, 4 figures, 39th International Cosmic Ray Conference (ICRC 2025)", "summary": "Earth-skimming tau neutrinos with energies above $\\sim 10$ PeV can convert to tau leptons that decay in the atmosphere and initiate upward-going extensive air showers that generate optical Cherenkov signals. On a curtailed NASA balloon flight in May 2023, the Cherenkov telescope (CT) on the Extreme Universe Space Observatory on a Super Pressure Balloon 2 (EUSO-SPB2) was launched and had a short flight at $\\sim 30$ km altitude. With some time pointing below the Earth's limb, EUSO-SPB2 CT data allow searches for neutrino events that yield optical flashes from the forward-beamed Cherenkov light. We present an overview of the CT and provide upper limits for the diffuse astrophysical neutrino flux from flight data as a proof-of-principle demonstration. We also briefly describe how the methodology is extended to potential transient neutrino point sources."}
{"id": "2511.10927", "categories": ["astro-ph.IM", "astro-ph.EP", "astro-ph.GA", "astro-ph.HE", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2511.10927", "abs": "https://arxiv.org/abs/2511.10927", "authors": ["A. Moullet", "D. Burgarella", "T. Kataria", "H. Beuther", "C. Battersby", "M. Cheng", "T. Essinger-Hileman", "H. Inami", "E. Mills", "T. Nagao", "S. Unwin"], "title": "PRIMA General Observer Science Book Volume 2", "comment": "A. Moullet, D. Burgarella, T. Kataria, H. Beuther, C. Battersby, M. Cheng, T. Essinger-Hileman, H. Inami, E. Mills, T. Nagao, S. Unwin are the editors of the GO Science Book. 664 pages", "summary": "This PRobe far-Infrared Mission for Astrophysics (PRIMA) mission concept is a proposed mission to NASA's Astrophysics Probe Explorer (APEX) call. The concept features a cryogenically cooled 1.8 m diameter telescope, and is designed to carry two science instruments covering the 24 to 264 $μ$m wavelength range: an imaging polarimeter (PRIMAger) and a spectrometer (FIRESS). The majority of PRIMA's time (75%) will be open to observations proposed by the community (General Observer science / GO), and all of data will be publicly available for archival research (Guest Investigator science / GI). Following up on the successful community engagement created by the first volume of the GO PRIMA Science Book (arXiv:2310.20572), Volume 2 gathers 120 new and updated contributed science cases which could be performed within the context of the PRIMA GO/GI program. This volume reflects the strong development of the community interest, awareness and involvement in PRIMA, and further develops how PRIMA's unprecedented capabilities can be leveraged for an impactful and innovative GO/GI program covering most areas of astrophysics and over 90% of the scientific questions and discovery areas in the Astro2020 decadal survey."}
{"id": "2511.10968", "categories": ["astro-ph.HE", "astro-ph.CO", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2511.10968", "abs": "https://arxiv.org/abs/2511.10968", "authors": ["Chong Yang", "Nobuhiro Okabe", "Yasushi Fukazawa"], "title": "Discovery of an X-ray bridge between the comma-shaped gas and the main cluster in MCXC J0157.4-0550", "comment": "Accepted for publication in PASJ, 8 pages, 5 figures, 2 tables", "summary": "We report the discovery of a faint X-ray bridge connecting between the comma-shaped gas and the main cluster in MCXC J0157.4-0550, using {\\it XMM-Newton} image. The filamentary structure is found in a model-independent manner in both topological features and Gaussian Gradient Magnitude filtering. The X-ray surface brightness profile perpendicular to the filament is detected at a $5.5σ$ level. Weak-lensing (WL) analysis using the Subaru/HSC-SSP Survey archive data strongly supports the two mass components. Given a prior from the stellar masses, we obtain $M_{200}^{\\rm main}=2.68_{-0.92}^{+1.11}\\times 10^{14}\\,h_{70}^{-1}M_\\odot$ and $M_{200}^{\\rm sub}=0.46_{-0.22}^{+0.38}\\times 10^{14}\\,h_{70}^{-1}M_\\odot$. The main axis of the projected halo distribution is more likely to align with the direction of the main cluster than to be oriented perpendicularly. Similar X-ray distributions have been identified in the literature on numerical simulations. The filamentary structure forms in the following manner: as the gas is stripped by ram pressure near the pericenter, it gets dragged by tidal rotation. Once free from this rotation, the gas moves inertially in a direction parallel to the tangential velocity at the pericenter. The comma-shaped gas, with tails pointing in the opposite direction to the main cluster, is also formed by the current tidal rotation as it moves away from the main cluster. This warrants us that, although it is sometimes thought based on the X-ray morphology alone that the tail is pointing in the opposite direction to the merger motion, this is not necessarily the case. The information of the X-ray filamentary remnant from the cluster merger, together with the 2D WL shear data, provides constraints on the merger parameters, indicating an infalling velocity of approximately $1000\\, {\\rm km\\, s^{-1}}$ and an impact parameter of $0.9$ Mpc."}
{"id": "2511.11049", "categories": ["astro-ph.IM", "physics.optics"], "pdf": "https://arxiv.org/pdf/2511.11049", "abs": "https://arxiv.org/abs/2511.11049", "authors": ["Xin Yan", "Zhi-Kang Zhuang", "Fu-Jia Du", "Wen Duan", "Peilin Yin", "Mo-Nong Yu", "Guang Yang"], "title": "Surface figure metrology for reflective membrane mirrors based on phase-measuring deflectometry", "comment": "16 pages and 14 figures. Front. Astron. Space Sci. in press", "summary": "Reflective membrane mirrors provide a lightweight, low-cost alternative to traditional optics for next-generation large-aperture telescopes, but their non-rigid, thin structure poses challenges for surface metrology. We present a phase-measuring deflectometry (PMD) system enhanced with tailored ray-tracing and iterative reconstruction to enable non-contact measurement of large membrane optics. The system successfully characterizes the surface figure and evaluates the dynamic stability of a 1-meter Hencky-type membrane mirror. Our results demonstrate the effectiveness of PMD as a practical metrology tool for future membrane-based telescope systems."}
{"id": "2511.10996", "categories": ["astro-ph.HE", "astro-ph.SR", "gr-qc", "nucl-th"], "pdf": "https://arxiv.org/pdf/2511.10996", "abs": "https://arxiv.org/abs/2511.10996", "authors": ["Hyukjin Kwon", "Kenta Yoshimura", "Tsuyoshi Miyatsu", "Kazuyuki Sekizawa", "Myung-Ki Cheoun"], "title": "Accuracy and Applicability of the Hartle-Thorne and Komatsu-Eriguchi-Hachisu Methods for Modeling Rotating Neutron Stars", "comment": "10 pages, 4 figures, 3 tables", "summary": "Neutron stars, which are composed of extremely dense nuclear matter, serve as natural laboratories to study nuclear interactions beyond the terrestrial experiments. Recent researches have actively explored how the equation of state (EoS) can be constrained by observed neutron star masses and radii, and how nuclear interactions affect their macroscopic properties. Most of these studies, however, rely on the Tolman-Oppenheimer-Volkoff (TOV) equations, which assumed static, spherically symmetric neutron stars. Since neutron stars are rotating objects and thus axisymmetrically deformed, the TOV calculation may be insufficient to capture their realistic structure. In this work, we investigate the influence of nuclear matter properties on the physical quantities of rotating neutron stars using two approaches: the perturbative Hartle-Thorne (HT) method and fully general relativistic Komatsu-Eriguchi-Hachisu (KEH) method. For nuclear EoS parameter sets, we emamine the OMEG series, in which the slope of the symmetry energy $L$ is systematically varied. We find that rotational effects lead to a noticeable increase in the stellar radius, which depends sensitively on values of $L$. Additionally, focusing on the rotational deformation, we show that the results obtained by these two methods deviate each other even for the slowly rotating case such as $Ω=200$ Hz. These results reveal that, for detailed discussions on the internal structure and stability of rotating neutron stars, the fully general relativistic method such as KEH is indispensable."}
{"id": "2511.11121", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2511.11121", "abs": "https://arxiv.org/abs/2511.11121", "authors": ["E. Tahtali", "C. Kreuzig", "G. Meier", "J. Blum", "L. Overmeyer", "C. Lotz"], "title": "A Simulation Platform for Small Solar System Bodies using the Einstein-Elevator", "comment": "The following article has been submitted to Review of Scientific Instruments. After it is published, it will be found at https://pubs.aip.org/aip/rsi", "summary": "Small solar system bodies are becoming increasingly important as missions like NASA's OSIRIS-REx show. However, the study of the characteristics and behavior of these objects on Earth is a challenge as the simulation of their environmental conditions is difficult. We present in this paper an approach to enable the simulation of SSSB conditions in a drop tower facility on Earth, which is being addressed as part of the AKUS (\"Activity of Comets under Partial Gravity\") project. This especially concerns their prevailing gravity levels, which range between 10^-2 g and 10^-4 g. In order to simulate the conditions of SSSB as accurately as possible, an acceleration system based on servo motors and spindle axes has been developed. The accelerations are transferred from the motors to the spindle axes containing a comet-like sample. These are together placed inside a vacuum chamber providing a vacuum quality of 10^-6 mbar. The whole setup is installed inside the Einstein-Elevator. Our results show that, with the current setup, we are able to generate conditions from 10^-2 g down to 10^-3 g. The maximum deviations under these conditions are +/-5x10^-4 g. Additionally, this setup offers the opportunity to conduct different kinds of experiments in which the described gravity levels and vacuum conditions are needed."}
{"id": "2511.11050", "categories": ["astro-ph.HE", "astro-ph.IM", "physics.ins-det"], "pdf": "https://arxiv.org/pdf/2511.11050", "abs": "https://arxiv.org/abs/2511.11050", "authors": ["P. Zhang", "H. Ma", "W. Dai", "M. Jing", "L. Yang", "Q. Yue", "Z. Zeng", "J. Cheng"], "title": "Measurement of cosmic-ray muon flux at CJPL-II", "comment": "6 pages, 9 figures", "summary": "In China Jinping Underground Laboratory (CJPL), the deepest and largest underground laboratory globally, the cosmic-ray muon flux is significantly reduced due to the substantial shielding provided by the overlying mountain. From 2016 to 2020, we measured the muon flux in the second phase of CJPL (CJPL-II) with a plastic scintillator muon telescope system, detecting 161 muon events over an effective live time of 1098 days. The detection efficiency was obtained by simulating the underground muon energy and angular distributions and the telescope system's response to underground muons. The cosmic-ray muon flux is determined to be (3.03 $\\pm$ 0.24 (stat) $\\pm$ 0.18 (sys)) $\\times$ 10$^{-10}$ cm$^{-2}$s$^{-1}$, which is the lowest among underground laboratories worldwide."}
{"id": "2511.10744", "categories": ["astro-ph.HE", "astro-ph.IM", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2511.10744", "abs": "https://arxiv.org/abs/2511.10744", "authors": ["Ferdinand", "W. V. Jacobson-Galán", "M. M. Kasliwal", "Erez A. Zimmerman"], "title": "XSNAP: An X-ray Supernova Analysis Pipeline with Application to the Type II Supernova 2024ggi", "comment": "12 pages, 4 figures, submitted to ApJ. Software code is available at https://xsnap.org or https://pypi.org/p/xsnap/", "summary": "X-ray observations of Type II supernovae (SNe II) probe the physics of supernova (SN) shocks and the mass-loss histories of their progenitor stars. We present multi-epoch, X-ray observations of SN II 2024ggi ($D \\approx 7.2 \\ \\rm Mpc$) from ${\\it Swift}$-XRT, ${\\it Chandra}$ and ${\\it XMM}$, which cover $\\sim 1 - 344$ days since first light. We analyze these observations using a new open-source Python package called $\\texttt{XSNAP}$, which standardizes a unified command-line interface for instrument-specific reduction and spectral extraction. $\\texttt{XSNAP}$ introduces application programming interfaces for per-epoch spectral modeling through $\\texttt{PyXspec}$ and $\\texttt{emcee}$ Markov chain Monte Carlo fitting. We employ ${\\tt XSNAP}$ to model the multi-epoch X-ray spectra of SN 2024ggi with an absorbed thermal bremsstrahlung model and calculate a steady progenitor mass-loss rate of $(6.2\\pm0.2)\\times10^{-5}\\,M_{\\odot}\\,\\mathrm{yr^{-1}}$ $(v_{\\rm wind} = 20 \\ \\rm km \\ s^{-1})$, for which the detected X-ray emission traces the final 117 years before explosion. The software is publicly available on GitHub, with a released package on the Python Package Index (PyPI)."}
{"id": "2511.11075", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.11075", "abs": "https://arxiv.org/abs/2511.11075", "authors": ["WanYun Wu", "Fei Xie", "Long Ji", "Mingyu Ge", "Fabio La Monaca"], "title": "Highly Polarized Intrinsic Emission and its Orthogonal Counterpart in Vela X-1", "comment": "14 pages, 8 figures. Accepted for publication in APJ", "summary": "Vela X-1 is one of the most archetypal wind-fed X-ray pulsars (XRPs), and the emergence of its orthogonal polarization states reveals distinctive polarimetric properties. Using data from Imaging X-ray Polarimetry Explorer (IXPE) observations of Vela X-1, we perform a polarization analysis of Vela X-1 using a triple power-law spectral model absorbed by varying column densities, successfully isolating two physically distinct orthogonal polarized components. The first polarized component corresponds to emission from the accretion mound surface that is not obscured by the wind clumps, with its polarization degree (PD) exceeding 30\\%. In specific phase intervals, the PD reaches \\(50.9 \\pm 10.7\\%\\). This marks the first detection of such highly polarized neutron star emission in an XRP. The second polarized component likely originates from complex physical processes within or near the accretion mound, with its PD showing a potential negative correlation with column density. Furthermore, by rotating the predicted polarization angle (PA) of the first polarized component by 90$^\\circ$, we successfully achieve separate fitting and simultaneous fitting of the two orthogonal polarization states using the rotating vector model (RVM)."}
{"id": "2511.11050", "categories": ["astro-ph.HE", "astro-ph.IM", "physics.ins-det"], "pdf": "https://arxiv.org/pdf/2511.11050", "abs": "https://arxiv.org/abs/2511.11050", "authors": ["P. Zhang", "H. Ma", "W. Dai", "M. Jing", "L. Yang", "Q. Yue", "Z. Zeng", "J. Cheng"], "title": "Measurement of cosmic-ray muon flux at CJPL-II", "comment": "6 pages, 9 figures", "summary": "In China Jinping Underground Laboratory (CJPL), the deepest and largest underground laboratory globally, the cosmic-ray muon flux is significantly reduced due to the substantial shielding provided by the overlying mountain. From 2016 to 2020, we measured the muon flux in the second phase of CJPL (CJPL-II) with a plastic scintillator muon telescope system, detecting 161 muon events over an effective live time of 1098 days. The detection efficiency was obtained by simulating the underground muon energy and angular distributions and the telescope system's response to underground muons. The cosmic-ray muon flux is determined to be (3.03 $\\pm$ 0.24 (stat) $\\pm$ 0.18 (sys)) $\\times$ 10$^{-10}$ cm$^{-2}$s$^{-1}$, which is the lowest among underground laboratories worldwide."}
{"id": "2511.11336", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.11336", "abs": "https://arxiv.org/abs/2511.11336", "authors": ["Bhavnesh Bhat", "Michael J. Keith", "Ismaël Cognard", "Lucas Guillemot", "Marcus E. Lower", "Matthew T. Miles", "Daniel J. Reardon", "Golam Shaifullah", "Ryan M. Shannon", "Benjamin W. Stappers", "Gilles Theureau", "Shuangqiang Wang", "Andrew Zic", "Benjamin Shaw"], "title": "A glitch in the millisecond pulsar J0900$-$3144", "comment": "Accepted for Publication in MNRAS", "summary": "We report the detection of a glitch in the millisecond pulsar (MSP) PSR J0900$-$3144, which is included in the European, MeerKAT and Parkes pulsar timing array experiments. The dataset combines observations from the MeerKAT, Nançay, Lovell, and Murriyang telescopes, spanning a total baseline of approximately 14 years. The glitch occurred on MJD~59942(17), with a measured fractional spin frequency step of $Δν_g / ν=1.15(13) \\times 10^{-12}$. This event represents the third glitch detected in a MSP, following those in PSRs B1821$-$24A and J0613$-$0200. Although smaller in amplitude than the previous two, the glitch in PSR J0900$-$3144 is of a comparable order of magnitude. The updated MSP glitch rate is $2.5(1)\\times 10^{-3}$ glitches per pulsar per year, which suggests it is likely current PTAs will detect another MSP glitch within five years. Using simulations, we demonstrate that such small glitches can go undetected, especially in short datasets such as those from new PTAs, and can bias the inferred achromatic noise model parameters, potentially leading to the down-weighting of the pulsar in gravitational wave background searches."}
{"id": "2511.11396", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.11396", "abs": "https://arxiv.org/abs/2511.11396", "authors": ["Chen Deng", "Yong-Feng Huang", "Abdusattar Kurban", "Jin-Jun Geng", "Fan Xu", "Xiao-Fei Dong", "Hao-Xuan Gao", "En-Wei Liang", "Liang Li"], "title": "Modeling the Multi-Wavelength Afterglow of Short Gamma-Ray Bursts with a Plateau Phase", "comment": "19 pages, 6 figures, 1 table", "summary": "Short gamma-ray bursts (GRBs) exhibiting a plateau phase provide valuable insights into the post-merger activity of their central engines. Although the physical origin of the plateau remains uncertain, the magnetar energy injection model offers a compelling explanation that reproduces the observed temporal and luminosity features. However, previous studies relying solely on X-ray data have suffered from strong parameter degeneracies when constraining the magnetar parameters. Here we perform broadband afterglow modeling on seven short GRBs with plateau features by combining X-ray, optical, and radio observations within the framework of the magnetar energy injection model. Key model parameters are derived by using the Markov Chain Monte Carlo method. It is found that the energy injection substantially modifies the afterglow dynamics in most events. Compared with X-ray--only analyses, our broadband modeling yields systematically a lower magnetic field strength and a shorter spin period for the central magnetar, corresponding to a higher injection luminosity. The study clearly shows that incorporating multi-wavelength data effectively alleviates the degeneracy between the magnetar parameters and X-ray radiative efficiency. In addition, the distribution of our short GRBs differs markedly from long GRBs when they are plotted on the initial Lorentz factor versus gamma-ray energy plane. This offset, consistent with the observed harder spectrum of short GRBs, may serve as a useful diagnostic for investigating the progenitor as larger samples are available."}
{"id": "2511.11432", "categories": ["astro-ph.HE", "astro-ph.GA", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2511.11432", "abs": "https://arxiv.org/abs/2511.11432", "authors": ["Giada Peron"], "title": "Star clusters in the gamma-ray sky", "comment": "Plenary highlight talk presented at the 39th International Cosmic Ray Conference 2025", "summary": "Massive Star Clusters (SCs) have been proposed as additional contributors to Galactic Cosmic rays (CRs), to overcome the limitations of supernova remnants (SNRs) to reach the highest energy end of the CR spectrum. Thanks to fast mass losses due to the collective stellar winds, the environment around SCs is potentially suitable for particle acceleration up to PeV energies, and their energetics is enough to account for a non-negligible fraction of the Galactic CRs. Anyhow, the theoretical expectations need to be corroborated by clear observations. Despite the increasing number of detections at different energies, the contamination of other sources often makes it difficult to constrain the contribution arising from stellar winds only, unless one selects objects younger than a few million years, namely before stars start to explode inside clusters. I will review the results obtained with gamma-ray data towards a few massive young star clusters and discuss what implications these result have, especially concerning their contribution to the bulk of Galactic CRs."}
{"id": "2511.10927", "categories": ["astro-ph.IM", "astro-ph.EP", "astro-ph.GA", "astro-ph.HE", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2511.10927", "abs": "https://arxiv.org/abs/2511.10927", "authors": ["A. Moullet", "D. Burgarella", "T. Kataria", "H. Beuther", "C. Battersby", "M. Cheng", "T. Essinger-Hileman", "H. Inami", "E. Mills", "T. Nagao", "S. Unwin"], "title": "PRIMA General Observer Science Book Volume 2", "comment": "A. Moullet, D. Burgarella, T. Kataria, H. Beuther, C. Battersby, M. Cheng, T. Essinger-Hileman, H. Inami, E. Mills, T. Nagao, S. Unwin are the editors of the GO Science Book. 664 pages", "summary": "This PRobe far-Infrared Mission for Astrophysics (PRIMA) mission concept is a proposed mission to NASA's Astrophysics Probe Explorer (APEX) call. The concept features a cryogenically cooled 1.8 m diameter telescope, and is designed to carry two science instruments covering the 24 to 264 $μ$m wavelength range: an imaging polarimeter (PRIMAger) and a spectrometer (FIRESS). The majority of PRIMA's time (75%) will be open to observations proposed by the community (General Observer science / GO), and all of data will be publicly available for archival research (Guest Investigator science / GI). Following up on the successful community engagement created by the first volume of the GO PRIMA Science Book (arXiv:2310.20572), Volume 2 gathers 120 new and updated contributed science cases which could be performed within the context of the PRIMA GO/GI program. This volume reflects the strong development of the community interest, awareness and involvement in PRIMA, and further develops how PRIMA's unprecedented capabilities can be leveraged for an impactful and innovative GO/GI program covering most areas of astrophysics and over 90% of the scientific questions and discovery areas in the Astro2020 decadal survey."}
