{"id": "2510.05105", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2510.05105", "abs": "https://arxiv.org/abs/2510.05105", "authors": ["Kai Pong Tong"], "title": "Land use and anisotropy of artificial light observed by night time satellite", "comment": null, "summary": "Upward emission of artificial light has been investigated by researchers\nsince the commissioning of the Visible/Infrared Imaging Radiometer Suite\n(VIIRS) Day/Night Band (DNB) in 2011, with applications ranging from night time\nlight mapping to quantifying socio-economical development. The wide swath of\nthe VIIRS-DNB sensor enables detection of artificial light at multiple angles\nand was utilized to study emission of artificial light from cities at different\nangles as well as atmospheric properties. Existing studies of the relationship\nbetween the directionality and land surface features are not available for most\nof the Earth's surface due to the use of space-borne LiDAR as a source of\nproxy. To solve this problem, we compared the land use data published under the\nCoordination of Information on the Environment (CORINE) against the fit\nparameters of radiance of upward artificial light. In general, the quadratic\nterm of the fit, which quantifies how the brightness changes when viewing\ncloser from the horizon at a point on the Earth, is negative when the area is\n\"Continuous urban fabric\" or \"Sparsely vegetated areas\", and vice versa for all\nother investigated land use classes. However the quadratic term shifts towards\nnegative values for brighter areas. These results indicate that while densely\nbuilt areas emit more light towards the zenith than sideways, the VIIRS-DNB is\nunable to distinguish small densely built areas scattered around larger unbuilt\nareas. Therefore, sensors with higher spatial resolution will be required to\nresolve the light emission patterns of areas with complicated combinations of\nland uses."}
{"id": "2510.05210", "categories": ["astro-ph.IM", "astro-ph.CO", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2510.05210", "abs": "https://arxiv.org/abs/2510.05210", "authors": ["Michael Zemcov", "James J. Bock", "Asantha Cooray", "Shuji Matsuura", "Dae-Hee Lee", "Candice Fazar", "Richard M. Feder", "Grigory Heaton", "Ryo Hashimoto", "Phillip Korngut", "Toshio Matsumoto", "Chi H. Nguyen", "Kazuma Noda", "Won-Kee Park", "Kei Sano", "Kohji Takimoto", "Toshiaki Arai", "Seung-Cheol Bang", "Priyadarshini Bangale", "Masaki Furutani", "Viktor Hristov", "Yuya Kawano", "Arisa Kida", "Tomoya Kojima", "Alicia Lanz", "Chika Matsumi", "Dale Mercado", "Shunsuke Nakagawa", "Tomoya Nakagawa", "Shuta Nakahata", "Ryo Ohta", "Dorin Patru", "Mai Shirahata", "Hiroko Suzuki", "Aoi Takahashi", "Momoko Tamai", "Serena Tramm", "Kohji Tsumura", "Yasuhiro Yamada", "Shiang-Yu Wang"], "title": "The Cosmic Infrared Background Experiment-2: An Intensity Mapping Optimized Sounding-rocket Payload to Understand the Near-IR Extragalactic Background Light", "comment": null, "summary": "The background light produced by emission from all sources over cosmic\nhistory is a powerful diagnostic of structure formation and evolution. At\nnear-infrared wavelengths, this extragalactic background light (EBL) is\ncomprised of emission from galaxies stretching all the way back to the\nfirst-light objects present during the Epoch of Reionization. The Cosmic\nInfrared Background Experiment 2 (CIBER-2) is a sounding-rocket experiment\ndesigned to measure both the absolute photometric brightness of the EBL over\n0.5 - 2.0 microns and perform an intensity mapping measurement of EBL spatial\nfluctuations in six broad bands over the same wavelength range. CIBER-2\ncomprises a 28.5 cm, 80K telescope that images several square degrees to three\nseparate cameras. Each camera is equipped with an HAWAII-2RG detector covered\nby an assembly that combines two broadband filters and a linear-variable\nfilter, which perform the intensity mapping and absolute photometric\nmeasurements, respectively. CIBER-2 has flown three times: an engineering\nflight in 2021; a terminated launch in 2023; and a successful science flight in\n2024. In this paper, we review the science case for the experiment; describe\nthe factors motivating the instrument design; review the optical, mechanical,\nand electronic implementation of the instrument; present preflight laboratory\ncharacterization measurements; and finally assess the instrument's performance\nin flight."}
{"id": "2510.05235", "categories": ["astro-ph.IM", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2510.05235", "abs": "https://arxiv.org/abs/2510.05235", "authors": ["Edgar Ortiz Manrique", "Médéric Boquien"], "title": "Interpreting anomaly detection of SDSS spectra", "comment": "15 pages, 14 figures, accepted for publication in Astronomy &\n  Astrophysics. The software is publicly available at\n  https://github.com/ed-ortizm/Interpreting-Anomaly-Detection-in-SDSS-Spectra", "summary": "The increasing use of ML in astronomy introduces important questions about\ninterpretability. Due to their complexity and non-linear nature, it can be\nchallenging to understand their decision-making process. While these models can\neffectively identify unusual spectra, interpreting the physical nature of the\nflagged outliers remains a major challenge. We aim to bridge the gap between\nanomaly detection and physical understanding by combining deep learning with\ninterpretable ML (iML) techniques to identify and explain anomalous galaxy\nspectra from SDSS data. We present a flexible framework that uses a variational\nautoencoder to compute multiple anomaly scores, including physically-motivated\nvariants of the mean squared error. We adapt the iML LIME algorithm to\nspectroscopic data, systematically explore segmentation and perturbation\nstrategies, and compute explanation weights that identify the features most\nresponsible for each detection. To uncover population-level trends, we\nnormalize the LIME weights and apply clustering to the top 1\\% most anomalous\nspectra. Our approach successfully separates instrumental artifacts from\nphysically meaningful outliers and groups anomalous spectra into\nastrophysically coherent categories. These include dusty, metal-rich\nstarbursts; chemically-enriched H\\,II regions with moderate excitation; and\nextreme emission-line galaxies with low metallicity and hard ionizing spectra.\nThe explanation weights align with established emission-line diagnostics,\nenabling a physically-grounded taxonomy of spectroscopic anomalies. Our work\nshows that interpretable anomaly detection provides a scalable, transparent,\nand physically meaningful approach to exploring large spectroscopic datasets.\nOur framework opens the door for incorporating interpretability tools into\nquality control, follow-up targeting, and discovery pipelines in current and\nfuture surveys."}
{"id": "2510.05308", "categories": ["astro-ph.IM", "astro-ph.EP"], "pdf": "https://arxiv.org/pdf/2510.05308", "abs": "https://arxiv.org/abs/2510.05308", "authors": ["Matthew De Furio", "Marie Ygouf", "Alexandra Greenbaum", "Graça Rocha", "Michael Meyer", "Charles Beichman", "Jorge Llop-Sayson", "Gael Roudier", "Steph Sallum", "Jarron Leisenring", "Anand Sivaramakrishnan"], "title": "Wavefront Error Recovery and Companion Identification with the James Webb Space Telescope", "comment": "24 pages, 15 figures, 1 table", "summary": "The James Webb Space Telescope is orders of magnitude more sensitive than any\nother facility across the near to mid-infrared wavelengths. Many approved\nprograms take advantage of its highly stable point spread function (PSF) to\ndirectly detect faint companions using diverse high-contrast imaging (HCI)\ntechniques. However, periodic re-phasing of the Optical Telescope Element (OTE)\nis required due to slow thermal drifts distorting to the primary mirror\nbackplane along with stochastic tilt events on individual mirror segments. Many\nprograms utilize observations of a reference star to remove the stellar\ncontribution within an image which can typically take half of the total\nallocated time. We present a high-contrast imaging technique for the NIRISS\ninstrument that uses the measured wavefront error (WFE) from a phase\ncalibration observation (performed roughly every 48 hours) as prior information\nin a Bayesian analysis with nested sampling. This technique estimates the WFE\nof a given observation and simultaneously searches for faint companions,\nwithout using a reference star. We estimate the wavefront error for both full\naperture and aperture masking interferometry (AMI) imaging modes using three\nlow order Zernike coefficients per mirror segment, using the Hexike basis, to\ngenerate synthetic PSFs and compare to simulations. We compare our technique to\ntraditional interferometric analysis in realistic NIRISS F430M simulations both\nrelative to the photon noise limit, and through recovering an injected\ncompanion with $\\Delta$F430M= 8 mag at 0.2''. With future testing, this\ntechnique may save significant amounts of observing time given the results of\nour current implementation on NIRISS simulations."}
{"id": "2510.05239", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.05239", "abs": "https://arxiv.org/abs/2510.05239", "authors": ["P. Tiwari", "B. Banerjee", "D. Miceli", "G. Oganesyan", "A. Ierardi", "S. Macera", "M. Branchesi", "L. Nava", "S. Mohnani", "S. Agarwal", "A. Shukla"], "title": "From X-rays to High-Energy Gamma-rays: A Comprehensive Multi-Wavelength Study of Early Gamma-Ray Burst Afterglows", "comment": "Comments are welcome, to be submitted soon", "summary": "Gamma-ray Bursts (GRBs) generate powerful relativistic jets that inject a\nlarge amount of energy into their surrounding environment, producing blast\nwaves that accelerate particles to high energies. The GRB afterglow radiation\nprovides a powerful means to investigate the microphysics of relativistic\nshocks and to probe the medium surrounding the progenitor of the burst. In this\nstudy, we present a comprehensive multiwavelength analysis of 31 GRBs observed\nbetween 2008 and 2024 from the Neil Gehrels Swift Observatory (X-ray Telescope\nand Burst Alert Telescope) and the Fermi Large Area Telescope, covering photon\nenergies from 0.3 keV to 300 GeV. Our goal is to characterize the broadband\nspectral properties of GRB afterglows in soft X-rays, hard X-rays, and\nhigh-energy gamma rays. We investigate correlations between spectral shape and\nenergy output across different parts of the spectrum. The observed emission is\nmodeled using a forward shock scenario that includes both synchrotron and\nsynchrotron self-Compton (SSC) radiation losses. The results favor an\nSSC-dominated radiation model in a wind-like medium, consistent with\nexpectations for long-duration GRBs. Crucially, this work provides new\nbenchmarks for the microphysical parameters governing the emission,\nparticularly indicating a notably low magnetic energy fraction, which refines\nprevious estimates. By modeling broadband data, this study offers one of the\nmost detailed SSC analyses in a wind-like environment to date. Notably, our\nresults naturally account for the comparable energy output observed in both the\nsoft X-ray and TeV bands, consistent with the previously detected TeV-GRBs."}
{"id": "2510.05284", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.05284", "abs": "https://arxiv.org/abs/2510.05284", "authors": ["Unnati Kashyap", "Thomas J. Maccarone", "Eliot C. Pattie", "Mason Ng", "Swati Ravi", "Alexandra J. Tetarenko", "Pau Bosch Cabot", "Herman L. Marshall"], "title": "First X-ray and radio polarimetry of the neutron star low-mass X-ray binary GX 17+2", "comment": "13 pages, 5 Figures, 6 Tables, Accepted for publication in APJ", "summary": "We report the first polarimetric results of the neutron star (NS) low-mass\nX-ray binary (LMXB) Z-source GX 17+2 using the Imaging X-ray Polarimetry\nExplorer (IXPE) and the Very Large Array (VLA). We find that the X-ray source\nwas polarized at PD = 1.9 +/- 0.3 % (1-sigma errors) with a polarization angle\nof PA = 11 +/- 4 degree (1-sigma errors). Simultaneous Nuclear Spectroscopic\nTelescope Array (NuSTAR) observations show that the source was in the normal\nbranch (NB) during our IXPE observations. The X-ray spectro-polarimetry results\nsuggest a source geometry comprising an accretion disk component, a\nComptonization component, and a reflection component. The VLA radio\npolarization study shows a PD = 2.2 +/- 0.2 % with a Faraday-corrected\nintrinsic polarization angle of 1 +/- 5 degree, which is an indication of the\njet axis. Thus, we find the estimated X-ray PA from the source is consistent\nwith the radio PA. We discuss the accretion geometry of the Z-source in light\nof our X-ray spectro-polarimetry and radio findings."}
{"id": "2510.05297", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.05297", "abs": "https://arxiv.org/abs/2510.05297", "authors": ["Andrew J. Levan"], "title": "Gamma-ray Bursts", "comment": "22 pages, 6 figures. Article for the Encyclopedia of Astronomy and\n  Astrophysics, Editor Ilya Mandel, Section Editor Jeff Andrews", "summary": "Gamma-ray bursts are flashes of high-energy radiation lasting from a fraction\nof a second to several hours. Military satellites made the first detections of\nGRBs in the late 1960s. The $\\gamma$-ray emission forms from shocks in a\nrelativistic jet launched from a compact central engine. In addition to the\nemission of $\\gamma$-rays, the interaction of the jet with the surrounding\nmedium yields afterglow emission that can be observed across the\nelectromagnetic spectrum. Redshift measurements from these afterglows place\nGRBs from the local to the distant Universe. The central engines of GRBs are\nthought to be either a hyperaccreting black hole or a highly magnetized neutron\nstar (magnetar). There is now strong observational evidence that this central\nengine is created either in the core collapse of a rapidly rotating massive\nstar or via the merger of two compact objects (neutron stars or a neutron star\nwith a black hole). The combination of stellar scale events with extreme\nenergies and luminosities makes GRBs powerful probes of the extreme physics\ninvolved in their production and of other areas of astrophysics and cosmology.\nThese include as the electromagnetic counterparts of gravitational wave\nsources, the production and acceleration of relativistic jets, the synthesis of\nheavy elements, the study of the interstellar and intergalactic medium, and the\nidentification of the collapse of early generations of stars."}
{"id": "2510.05302", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.05302", "abs": "https://arxiv.org/abs/2510.05302", "authors": ["Fahimeh Rahimi", "Zeinab Rezaei", "Adamu Issifu"], "title": "Scalarized Hot Neutron Stars Containing Hyperons and $Δ$-Resonances in Different Evolution Regimes", "comment": "37 pages, 8 figures. Accepted for publication in Physical Review D", "summary": "Scalar-tensor gravity models are among the prime candidates to explain cosmic\nacceleration, and compact stars provide unique laboratories for testing such\ntheories. Predictions of scalar-tensor gravity in compact stars can be examined\nduring the evolution of neutron stars. Spontaneous scalarization in\nrelativistic stars is influenced by different properties of stellar matter in\nvarious evolution regimes. In the present study, we investigate the\nscalarization of neutron stars in different stages of the evolvement. For this\naim, we apply the isentropic equations of state for the neutron star matter\nincluding nucleons, hyperons, and $\\Delta$- resonances in neutrino-trapped,\nneutrino diffusion, and neutrino-transparent stages as well as cold-catalyzed\nneutron star. Our equations of state are based on the relativistic model within\nthe mean-field approximation. To emphasize the role of scalar-tensor theories\nin exploring the properties and structure of compact stars, we calculate the\nstructure of neutron stars with hyperons and $\\Delta$-resonances in different\nsnapshots of the neutron star evolution in the scalar-tensor gravity. Our\ncalculations confirm that the neutron star scalarization is affected by the\nhyperons as well as the $\\Delta$-resonances. Moreover, the properties of\nscalarized neutron stars depend on the stage of the star evolution."}
{"id": "2510.05324", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.05324", "abs": "https://arxiv.org/abs/2510.05324", "authors": ["Andrea Tramacere"], "title": "On the statistical characterization of the synchrotron multi-zone polarization of blazars", "comment": "accepted for publication in A&A", "summary": "Multiwavelength polarimetric observations of blazars reveal complex,\nenergy-dependent polarization behavior, including a decrease in polarization\nfraction from X-rays to millimeter bands and significant variability in the\nelectric vector position angle (EVPA). These trends challenge simple\nsingle-zone synchrotron models and suggest a more intricate, turbulent jet\nstructure with multiple emission zones. We develop a statistical framework to\nmodel the observed energy-dependent polarization patterns in blazars, focusing\non the behavior captured by IXPE in the X-ray band and RoboPol in the optical.\nThe goal is to statistically characterize multi-zone models in terms of the\ndistributions of cell size and the physical parameters of the electron energy\ndistribution (EED). A Monte Carlo approach, implemented with the JetSeT code,\nis used to generate synthetic multi-zone synchrotron emission from a spherical\nregion filled with turbulent cells with randomly distributed physical\nproperties. Simulations explore scenarios ranging from identical cells to\npower-law distributions of cell sizes and EED parameters with variable cutoff\nand low-energy slopes. The results show that a purely turbulent, multi-zone\nmodel can reproduce the observed energy-dependent polarization without\nrequiring correlations between cell size and EED parameters. The polarization\ndegree is primarily determined by the effective, flux-weighted, number of\nemitting cells, modulated by the dispersion in cell properties, particularly\nthe EED cutoff energy at high frequencies and the low-energy spectral index at\nlow frequencies. With a fractional dispersion in cutoff energy of about 90% and\na low-energy spectral index dispersion of ~0.5-1.5, the model reproduces the\nchromatic mm-to-X-ray polarization trends seen by IXPE and the optical\npolarization limiting envelope observed in the RoboPol dataset."}
{"id": "2510.05426", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.05426", "abs": "https://arxiv.org/abs/2510.05426", "authors": ["R. Dastidar", "G. Pignata", "N. Dukiya", "K. Misra", "D. A. Howell", "M. Singh", "C. P. Gutiérrez", "C. Pellegrino", "A. Kumar", "B. Ayala", "A. Gangopadhyay", "M. Newsome", "E. Padilla Gonzalez", "K. A. Bostroem", "D. Hiramatsu", "G. Terreran", "C. McCully"], "title": "SN 2021tsz: A luminous, short photospheric phase Type II supernova in a low-metallicity host", "comment": "17 pages, 12 figures, accepted for publication in A&A", "summary": "We present the analysis of the luminous Type II Supernova (SN) 2021tsz, which\nexploded in a low-luminosity galaxy. It reached a peak magnitude of -18.88\n$\\pm$ 0.13 mag in the $r$ band and exhibited an initial rapid decline of 4.05\n$\\pm$ 0.14 mag (100 d)$^{-1}$ from peak luminosity till $\\sim$30 d. The\nphotospheric phase is short, with the SN displaying bluer colours and a weak\nH$\\alpha$ absorption component--features consistent with other luminous,\nshort-photospheric phase Type II SNe. A distinct transition from the\nphotospheric to the radioactive tail phase in the $V$ band--as is common in\nhydrogen-rich Type II SNe--is not visible in SN 2021tsz, although a modest\n$\\sim$1 mag drop is apparent in the redder filters. Hydrodynamic modelling\nsuggests the luminosity is powered by ejecta-circumstellar material (CSM)\ninteraction during the early phases (<30 days). Interaction with 0.6 M$_\\odot$\nof dense CSM extending to 3100 R$_\\odot$ reproduces the observed luminosity,\nwith an explosion energy of 1.3$\\times$10$^{51}$ erg. The modelling indicates a\npre-SN mass of 9 M$_\\odot$, which includes a hydrogen envelope of 4 M$_\\odot$,\nand a radius of $\\sim$1000 R$_\\odot$. Spectral energy distribution analysis and\nstrong-line diagnostics reveal that the host galaxy of SN 2021tsz is a\nlow-metallicity, dwarf galaxy. The low-metallicity environment and the derived\nhigh mass loss from the hydrodynamical modelling strongly support a binary\nprogenitor system for SN 2021tsz."}
{"id": "2510.05515", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.05515", "abs": "https://arxiv.org/abs/2510.05515", "authors": ["Garima Rajguru", "Lea Marcotulli", "Marco Ajello", "Mattia Di Mauro", "Meg Urry"], "title": "The Gamma-ray Luminosity Function of Flat-Spectrum Radio Quasars", "comment": "Accepted for publication in The Astrophysical Journal (ApJ). 18\n  pages, 12 figures", "summary": "We have utilized the largest sample of $\\gamma$-ray selected Fermi\nflat-spectrum radio quasars (FSRQs) ever used (519 sources) to construct the\nluminosity function and its evolution through the cosmic history. In addition\nto spanning large redshift ($0<z\\lesssim 4$) and luminosity ranges\n($2.9\\times10^{43}$ erg s$^{-1}$ - $7.3\\times10^{48}$ erg s$^{-1}$), this\nsample also has a robust calculation of the detection efficiency associated\nwith its observation, making its selection effects and biases well understood.\nWe confirm that the local luminosity function is best explained by a double\npower law. The evolution of the luminosity function of FSRQs follows a\nluminosity-dependent density evolution. FSRQs experience positive evolution\nwith their space density growing with increasing redshift up to a maximum\nredshift, after which the numbers decrease. This peak in redshift occurs at\nlarger redshifts for higher luminosity sources and at lower redshifts for lower\nluminosity sources. We find an unexpected similarity between the luminosity\nfunction of FSRQs and that of BL Lacertae objects at intermediate luminosity.\nThis could be a sign of a strong genetic link between the two blazar\nsub-classes or that BL Lac samples are contaminated by large amounts of FSRQs\nwith their jets nearly perfectly aligned with our line of sight."}
{"id": "2510.05587", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.05587", "abs": "https://arxiv.org/abs/2510.05587", "authors": ["Yiran Wang", "Ruican Ma", "Haiyun Zhang", "Dahai Yan"], "title": "Gaussian process analysis of type-B quasiperiodic oscillations in the black hole X-ray binary MAXI J1348-630", "comment": "Accepted for publication in A&A, 10 pages, 8 figures", "summary": "We analyzed Insight-HXMT data of the black hole X-ray binary MAXI J1348-630\nduring the type-B QPO phase of its 2019 outburst. Using the Gaussian process\nmethod, we applied an additive composite kernel model consisting of an SHO, a\nDRW, and an additional white noise (AWN) to data from three energy bands: LE\n(1-10 keV), ME (10-30 keV), and HE (30-150 keV). We find that for the DRW\ncomponent, correlations on the timescale of $\\tau_{\\rm DRW}\\sim10$ s are absent\nin the LE band, while they persist in the ME and HE bands over the full\nduration of the light curves. This energy-dependent behavior may reflect\nthermal instabilities, with the shorter correlation timescale in the disk\ncompared to the corona. Alternatively, it may reflect variable Comptonizations\nof seed photons from different disk regions. Inner-disk photons are scattered\nby a small inner corona, producing soft X-rays. Outer-disk photons interact\nwith an extended, jet-like corona, resulting in harder emission. The QPO is\ncaptured by an SHO component with a stable period of $\\sim 0.2$ s and a high\nquality factor of $\\sim 10$. The absence of significant evolution with energy\nor time of the SHO component suggests a connection between the accretion disk\nand the corona, which may be built by coherent oscillations of disk-corona\ndriven by magnetorotational instability. The AWN components are present in all\nthe three-band data and dominate over the DRW and SHO components. We interpret\nthe AWN as another fast DRW with its $\\tau_{\\rm DRW} < 0.01$ s. It may trace\nhigh-frequency fluctuations that occur in both the inner region of the\naccretion disk and the corona. Overall, our work reveals a timescale hierarchy\nin the coupled disk-corona scenario: fast DRW < SHO < disk DRW < corona DRW."}
{"id": "2510.05599", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.05599", "abs": "https://arxiv.org/abs/2510.05599", "authors": ["Narendranath Layek", "Prantik Nandi", "Sachindra Naik", "Birendra Chhotaray", "Arghajit Jana", "Priyadarshee P. Dash", "Neeraj Kumari", "C. S. Stalin", "Srikanth Bandari", "S. Muneer"], "title": "Discovery of Changing-Look behavior in AGN NGC 3822: A long-term multiwavelength study", "comment": "26 pages,11 figures,Accepted for publication in APJ", "summary": "We present a comprehensive long-term multi-wavelength study of the active\ngalactic nucleus (AGN) NGC 3822, based on 17 years (2008 to 2025) of X-ray,\nultraviolet (UV), and optical observations.The dataset includes observations\nfrom Swift, XMM-Newton, and NuSTAR, the Very Large Telescope, and the Himalayan\nChandra Telescope. Our multiwavelength light curve analysis reveals flux\nvariations across X-ray to optical/UV bands, with an increased variability\namplitude at shorter wavelengths. X-ray spectral analysis indicates the\npresence of intrinsic absorption during the 2016 and 2022 observations;\nhowever, this absorption disappeared before and after these epochs. The\npresence and absence of the absorber are attributed to clouds moving in and out\nof the line of sight. During the long-term monitoring period, the bolometric\nluminosity of the source varies between ($1.32-17)\\times10^{43}$ erg s$^{-1}$.\nOptical spectroscopic monitoring reveals changing-look (CL) behaviour in\nNGC~3822, characterized by the appearance and disappearance of broad emission\nlines (BELs). These CL transitions are associated with changes in the Eddington\nratio rather than changes in the obscuration. The BELs appear only when the\nEddington ratio is relatively high ($\\sim 3.8\\times10^{-3}$) and disappear when\nit drops to a lower value ($\\sim 0.9\\times10^{-3}$)."}
{"id": "2510.05654", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.05654", "abs": "https://arxiv.org/abs/2510.05654", "authors": ["C. W. James", "J. Hoffmann", "J. X. Prochaska", "M. Glowacki"], "title": "Estimation of intrinsic fast radio burst width and scattering distributions from CRAFT data", "comment": "12 pages, 6 figures, 3 tables, submitted to PASA", "summary": "The intrinsic width and scattering distributions of fast radio bursts (FRBs)\ninform on their emission mechanism and local environment, and act as a source\nof detection bias and, hence, an obfuscating factor when performing FRB\npopulation and cosmological studies. Here, we utilise a sample of 29 FRBs with\nmeasured high-time-resolution properties and known redshift, which were\ndetected using the Australian Square Kilometre Array Pathfinder (ASKAP) by the\nCommensal Real-time ASKAP Fast Transients Survey (CRAFT), to model these\ndistributions. Using this sample, we estimate the completeness bias of\nintrinsic width and scattering measurements, and fit the underlying, de-biased\ndistributions in the host rest-frame. We find no evidence for a down-turn\ntowards high values of the intrinsic distributions of either parameter in the\n0.01-40 ms range probed by the data. Rather, the intrinsic scattering\ndistribution at 1 GHz is consistent with a log-uniform distribution above 0.04\nms, while the intrinsic width distribution rises as a Gaussian in log-space in\nthe 0.03-0.3 ms range, and is then log-uniform above that. This is inconsistent\nwith previous works, which assumed that these parameters have lognormal\ndistributions. This confirms that FRB observations are currently strongly\nwidth- and scattering-limited, and we encourage FRB searches to be extended to\nhigher values of time-width. It also implies a bias in FRB host galaxy studies,\nalthough the form of that bias is uncertain. Finally, we find that our updated\nwidth and scattering model - when implemented in the zDM code - produces 10%\nmore FRBs at redshift $z=1$ than at $z=0$ when compared to alternative\nwidth/scattering models, highlighting that these factors are important to\nunderstand when performing FRB population modelling."}
{"id": "2510.05727", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.05727", "abs": "https://arxiv.org/abs/2510.05727", "authors": ["L. Foffano", "C. Arcaro", "A. Arbet-Engels", "F. D'Ammando", "P. Da Vela", "J. Jormanainen", "D. Linder", "S. Menon", "E. Prandini", "S. Ventura", "E. Visentin"], "title": "Exploring the Most Extreme Blazars: New Insights from MAGIC", "comment": "Proceedings of the 39th International Cosmic Ray Conference\n  (ICRC2025), Geneva, Switzerland", "summary": "Extremely high-peaked BL Lac objects (or extreme blazars) are unique\nextragalactic laboratories where particle acceleration processes are pushed at\ntheir physical limits. In these blazars, synchrotron emission peaking above keV\nenergies is reprocessed to very-high-energy (VHE, energies > 100 GeV) gamma\nrays, often resulting in very hard TeV spectra. Over the past two decades, they\nhave attracted a growing interest from the scientific community, both\nexperimentally and theoretically, as crucial targets for understanding the\ndiversity within the blazar class. On the experimental side, new sources have\nbeen detected and characterized, populating the extreme blazars class. Notably,\nVHE campaigns have revealed evidence of emerging spectral differences in this\nenergy band, suggesting inhomogeneity within this class of sources. Recent\nstudies have also unveiled intriguing differences in the temporal evolution of\ntheir spectral emission. On the theoretical side, these spectral differences\nare challenging the current standard emission and acceleration models for\nblazars, suggesting the need for more complex theoretical frameworks. In this\ncontribution, we present the latest results from recent MAGIC Collaboration\nobserving campaigns aimed to enlarge the extreme blazars population at VHE and\nunderstand the origin of their extreme properties. Furthermore, we will present\nthe results of the most recent observations, discussing analogies and\ndifferences with well-known sources such as the archetypal 1ES 0229+200, as\nwell as interpretations of their non-conventional spectral emission."}
{"id": "2510.05736", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.05736", "abs": "https://arxiv.org/abs/2510.05736", "authors": ["Abhay Mehta", "Dan Parsons", "Tim Lukas Holch", "David Berge", "Matthias Weidlich"], "title": "Convolution and Graph-based Deep Learning Approaches for Gamma/Hadron Separation in Imaging Atmospheric Cherenkov Telescopes", "comment": "PoS(ICRC2025)752", "summary": "The identification of $\\gamma$-rays from the predominant hadronic-background\nis a key aspect in their ground-based detection using Imaging Atmospheric\nCherenkov Telescopes (IACTs). While current methods are limited in their\nability to exploit correlations in complex data, deep learning-based models\noffer a promising alternative by directly leveraging image-level information.\nHowever, several challenges involving the robustness and applicability of such\nmodels remain. Designing model architectures with inductive biases relevant for\nthe task can help mitigate the problem. Three such deep learning-based models\nare proposed, trained, and evaluated on simulated data: (1) a hybrid\nconvolutional and graph neural network model (CNN-GNN) using both image and\ngraph data; (2) an enhanced CNN-GNN variant that incorporates additional\nreconstructed information within the graph construction; and (3) a graph neural\nnetwork (GNN) model using image moments serving as a baseline. The new combined\nconvolution and graph-based approach demonstrates improved performance over\ntraditional methods, and the inclusion of reconstructed information offers\nfurther potential in generalization capabilities on real observational data."}
{"id": "2510.05778", "categories": ["astro-ph.HE", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2510.05778", "abs": "https://arxiv.org/abs/2510.05778", "authors": ["Michael Kramer", "Simon Johnston"], "title": "Radio emission from beyond the light cylinder in millisecond pulsars", "comment": "Submitted to MNRAS", "summary": "A striking aspect of the radio profiles of many millisecond pulsars (MSPs) is\nthat they consist of components separated from each other by regions lacking in\nemission. We devise a technique for determining \"disjoint\" from \"contiguous\"\ncomponents and show that 35% of MSPs have disjoint components as opposed to\nonly 3% of the slow pulsar population. We surmise that the pulsars with these\ndisjoint components show evidence for both emission above the polar cap and\nfrom the current sheet beyond the light cylinder, co-located with gamma-ray\nemission. For a sub-class of radio MSPs only the light cylinder emission is\nbeing observed. It is our contention that almost all of the current population\nof gamma-ray MSPs show evidence for co-located radio emission. A simple\ngeometric explanation allows the presence (or not) of light cylinder emission\nand the relationship (or not) between the gamma-ray and radio profiles to be\ndetermined. The light-cylinder components have frequently very high\npolarization and typically flat position-angle traverses thus helping to\nexplain the difficulties in determining the geometry of MSPs. In cases where\nthe geometry can be determined the values broadly align with expectations. If\nour picture is correct, the beaming fraction of radio MSPs is higher than\npreviously thought and a mechanism is required to produce coherent radio\nemission far from the stellar surface. This has implications for our\nunderstanding of the populations of radio-loud and radio-quiet rotation-powered\nmillisecond pulsars, and could relate to the timing stability of some of these\nsources."}
{"id": "2510.06017", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.06017", "abs": "https://arxiv.org/abs/2510.06017", "authors": ["Sushmita Agarwal", "Vaidehi S. Paliya"], "title": "Hunting Very High-Energy ($>$100 GeV) Emitting High-Synchrotron Peaked Blazars", "comment": "12 pages, 6 figures, 5 table, Accepted for publication in ApJS. DOI\n  for catalog: https://doi.org/10.5281/zenodo.17219533", "summary": "Very-high energy (VHE; $>$100 GeV) $\\gamma$-ray emission originates via some\nof the most extreme particle acceleration processes in the universe.\nConsidering beamed active galactic nuclei, i.e., blazars, only a small\nfraction, mainly high synchrotron peak BL Lacs, have been detected in the VHE\nband with the ground-based Cherenkov telescopes. We utilized $\\sim$16 years of\nFermi-Large Area Telescope (LAT) observations in the 0.1$-$2 TeV energy range\nto systematically search for potential VHE emitters in a sample of high\nsynchrotron peaked ($\\nu^{\\rm peak}_{\\rm syn}>10^{15}$ Hz) BL Lac sources. We\nidentified, for the first time, 92 VHE emitting blazars at $\\geq 5\\sigma$\nconfidence level. A significant VHE emission was also detected from 52 objects,\nwhich have been previously reported to be a VHE blazar. Comparing with the\ngeneral blazar population, these VHE emitting blazars are found to be located\nat low redshifts (mean $z=0.2 \\pm 0.1$) and exhibit bright synchrotron emission\n($\\log F^{\\rm peak}_{\\rm syn}=-11.2 \\pm 0.4$, in erg cm$^{-2}$ s$^{-1}$). We\nalso investigated the coincidence of VHE photon arrivals with the source\nactivity states and found that Fermi-LAT has detected VHE photons during both\nquiescent and elevated activity epochs. These VHE emitting blazars represent\npromising targets for current and next-generation ground-based Cherenkov\ntelescopes, and provide valuable laboratories for probing particle acceleration\nin relativistic jets, testing multi-messenger connections, and constraining\nextragalactic background light models."}
{"id": "2510.06047", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.06047", "abs": "https://arxiv.org/abs/2510.06047", "authors": ["A. Circiello", "A. McDaniel", "M. Di Mauro", "C. Karwin", "N. Khatiya", "M. Ajello", "F. Donato", "D. Hartmann", "A. Strong"], "title": "The gamma-ray emission from Radio Galaxies and their contribution to the Isotropic Gamma-Ray Background", "comment": null, "summary": "We evaluate the contribution to the Isotropic Gamma-Ray Background (IGRB)\ncoming from Radio Galaxies (RGs), the subclass of radio-loud Active Galactic\nNuclei (AGN) with the highest misalignment from the line of sight (l.o.s.).\nSince only a small number of RGs are detected in gamma rays compared to the\nlargest known radio population, the correlation between radio and gamma-ray\nemission serves as a crucial tool to characterize the gamma-ray properties of\nthese sources. We analyse the population of RGs using two samples. The first\nsample contains 26 sources individually detected by the Large Area Telescope\n(LAT) on board the Fermi Gamma-ray Space Telescope at gamma rays. The second\nsample contains 210 RGs for which the gamma-ray emission is not significantly\ndetected by the LAT. We use a stacking analysis to characterize the average\nproperties of the gamma-ray emission of the two samples, separately at first\nand then combined. We then evaluate the correlation between their gamma-ray\nemission and the emission from their radio core at 5 GHz, and we use it to\ndetermine their contribution to the IGRB. Due to the limited number of RGs\ndetected at the gamma-rays, information on the gamma-ray luminosity function is\nlimited. The correlation between the gamma-ray emission and the emission of the\nradio core allows us to characterize it starting from the luminosity function\nof the radio cores, which is modeled with greater accuracy due to the larger\nnumber of sources detected at these frequencies. We find that the diffuse\nemission as extrapolated from the properties of the subthreshold RGs is lower\nthan the one inferred from detected RGs, showing that the contribution of the\npopulation of RGs to the IGRB is lower than the previous estimates and it is\naround the 30% level of the IGRB intensity."}
{"id": "2510.06193", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.06193", "abs": "https://arxiv.org/abs/2510.06193", "authors": ["Imre Bartos", "Marek Kowalski"], "title": "Rare Transients in Nearby Galaxies Explain Ultra-high-energy Cosmic Rays", "comment": "9 pages, 8 figures", "summary": "The origin of ultra-high-energy cosmic rays remains one of the central open\nquestions in astroparticle physics. Recent measurements reveal anisotropies in\narrival directions, a rigidity-dependent composition dominated by\nintermediate-mass nuclei, and striking hemispheric differences in the energy\nspectra. Here we show that rare transients in nearby galaxies can naturally\naccount for these features. In our fiducial neutron-star merger model, the\ncosmic ray flux above $25$ EeV is dominated by ten nearby galaxies within\n$8\\,$Mpc. This accounts for the observed hotspots: seven of the ten brightest\ngalaxies coincide with reported excess regions, a chance probability of\n$p\\simeq0.003$. Nearby transients also explain the spectral excess of TA over\nAuger; link their angular sizes to extragalactic magnetic fields at $\\sim$1 nG;\nexplain the dominance of individual species over narrow energy ranges; and the\nrigidity-aligned succession of isotopes."}
