{"id": "2512.00155", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.00155", "abs": "https://arxiv.org/abs/2512.00155", "authors": ["Shunke Ai", "Irene Tamborra"], "title": "Magnetized Shocks Mediated by Radiation from Leptonic and Hadronic Processes", "comment": "19 pages, 10 figures; comments are welcome", "summary": "Shocks in astrophysical transients are key sites of particle acceleration. If the shock upstream is optically thick, radiation smoothens the velocity discontinuity at the shock (radiation-mediated shocks). However, in mildly magnetized outflows, a collisionless subshock can form, enhancing the efficiency of particle acceleration. We solve the hydrodynamic equations of a steady-state, radiation-mediated shock together with the radiative transfer equations accounting for electron and proton acceleration. Our goal is to explore the impact of the magnetic field and non-thermal radiation on the shock structure and the resulting spectral distribution of photons. To this purpose, we assume a relativistic upstream fluid velocity ($Γ_u = 10$) and investigate shock configurations with variable upstream magnetization ($σ_u = 0$, $10^{-8}$, $10^{-4}$, $0.1$, and $0.3$). We find that synchrotron self-absorption alters the shock profile for $σ_u \\gtrsim 10^{-8}$, with resulting changes up to $100\\%$ in the bulk Lorentz factor at the shock; for $σ_u \\gtrsim 0.1$, a prominent subshock forms. The spectral energy distributions of upstream- and downstream-going photons are also altered. Radiative processes linked to accelerated protons are responsible for a high-energy ($\\gtrsim 10$ GeV) tail in the photon spectrum; however, the radiation flux and pressure are negligibly affected with consequent minor impact on the shock structure. Our work highlights the importance of coupling the shock hydrodynamics to the transport of photons, electrons, protons, and intermediate particles to forecast the multi-messenger emission from astrophysical transients."}
{"id": "2512.00474", "categories": ["astro-ph.HE", "astro-ph.GA", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2512.00474", "abs": "https://arxiv.org/abs/2512.00474", "authors": ["Marco Padovani", "Daniele Galli", "Corey T. Plowman", "Liam H. Scarlett", "Mark C. Zammit", "Igor Bray", "Dmitry V. Fursa"], "title": "Excitation of molecular hydrogen by cosmic-ray protons", "comment": "Accepted by ACS Earth and Space Chemistry (Eric Herbst Festschrift)", "summary": "Low-energy cosmic rays ($E\\lesssim 1$ GeV) are responsible for the ionisation and heating of molecular clouds. While the role of supra-thermal electrons produced in the ionisation process in inducing excitation of the ambient gas (mostly molecular hydrogen) has been studied in detail, the role of primary cosmic-ray nuclei (protons and heavier nuclei) has been generally neglected. Here, we introduce, for the first time, cross sections for proton impact on H$_2$, calculated using the semi-classical implementation of the molecular convergent close-coupling method. Our findings show that proton-induced H$_2$ excitation is comparable in magnitude to that caused by electrons. We discuss the possible implications on the estimate of the cosmic-ray ionisation rate from observations in the near-infrared domain and on the cosmic-ray-induced H$_2$ ultraviolet luminescence. We also derive a new approximated analytical parameterisation of the spectrum of secondary electrons that can be easily incorporated in numerical codes."}
{"id": "2512.00555", "categories": ["astro-ph.HE", "astro-ph.CO", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2512.00555", "abs": "https://arxiv.org/abs/2512.00555", "authors": ["L. Izzo", "C. Gall", "N. Khetan", "N. Earl", "J. Hjorth", "W. B. Hoogendam", "Y. Q. Ni", "A. Sedgewick", "S. M. Ward", "Y. Zenati", "K. Auchettl", "S. Bhattacharjee", "S. Benetti", "M. Branchesi", "E. Cappellaro", "A. Catapano", "K. C. Chambers", "D. A. Coulter", "K. W. Davis", "M. Della Valle", "S. Dhawan", "T. de Boer", "G. Dimitriadis", "R. J. Foley", "M. Fulton", "H. Gao", "W. J. Hon", "M. E. Huber", "D. O. Jones", "C. D. Kilpatrick", "C. C. Lin", "T. B. Lowe", "E. A. Magnier", "K. S. Mandel", "R. Margutti", "G. Narayan", "P. Ochner", "Y. C. Pan", "A. Reguitti", "C. Rojas-Bravo", "M. Siebert", "S. J. Smartt", "K. W. Smith", "S. Srivastav", "J. J. Swift", "K. Taggart", "G. Terreran", "S. Thorp", "L. Tomasella", "R. J. Wainscoat"], "title": "Normal or transitional? The evolution and properties of two type Ia supernovae in the Virgo cluster", "comment": "24 pages, 21 figures, 7 tables. Accepted for publication in A&A", "summary": "Type Ia supernovae (SNe Ia) are among the most precise cosmological distance indicators used to study the expansion history of the Universe. The vast increase of SN Ia data due to large-scale astrophysical surveys has led to the discovery of a wide variety of SN Ia sub-classes, such as transitional and fast-declining SNe Ia. However, their distinct photometric and spectroscopic properties differentiate them from the population of normal SNe Ia such that their use as cosmological tools remains challenged. Here, we present a high-cadenced photometric and spectroscopic dataset of two SNe Ia, SNe 2020ue and 2020nlb, which were discovered in the nearby Virgo cluster of galaxies. Our study shows that SN 2020nlb is a normal SN Ia whose unusually red color is intrinsic, arising from a lower photospheric temperature rather than interstellar reddening, providing clear evidence that color diversity among normal SNe Ia can have a physical origin. In contrast, SN 2020ue has photometric properties, such as color evolution and light-curve decay rate, similar to those of transitional SNe, spectroscopically it is more aligned with normal SNe Ia. This is evident from spectroscopic indicators such as the pseudo-equivalent width of \\ion{Si}{II} lines. Thus, such SNe Ia that are photometrically at the edge of the standard normal SNe Ia range may be missed in cosmological SNe Ia samples. Our results highlight that spectroscopic analysis of SNe Ia around peak brightness is crucial for identifying intrinsic color variations and constructing a more complete and physically homogeneous SN Ia sample for precision cosmology."}
{"id": "2512.00589", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.00589", "abs": "https://arxiv.org/abs/2512.00589", "authors": ["Misaki Mizumoto", "Hiromitsu Takahashi", "Ehud Behar", "Rozenn Boissay-Malaquin", "Lia Corrales", "Elisa Costantini", "Maria Diaz-Trigo", "Eric D. Miller", "Jon M. Miller"], "title": "XRISM Observations of Accretion Disk Corona in Cyg X-2", "comment": "10 pages, 8 figures, Accepted for publication in ApJ", "summary": "We present the high-resolution X-ray spectrum of the Z-source Cygnus X-2, obtained with X-Ray Imaging and Spectroscopy Mission (XRISM). The observations have enabled a precise characterization of the Fe-K emission lines from the accretion disk corona (ADC) and a possible detection of an ultra-fast outflow (UFO). The ADC component has at least two distinct regions. The Fe-K emission lines are remarkably broad, with a velocity dispersion of $σ_v=2300^{+900}_{-700}$~km~s$^{-1}$. This can be larger than what was observed in previous Chandra observations ($1120\\pm870$~km~s$^{-1}$) and recent XRISM observations of the similar Z-source GX 340+0 (360--800~km~s$^{-1}$). Furthermore, we marginally detect a blueshifted absorption feature, which we identify as either \\ion{Fe}{26} or \\ion{Fe}{25}, with outflow velocities of $-0.29c$ or $-0.26c$, respectively. The mass loss rate is $\\dot{M}\\sim10^{-8}M_\\odot\\,\\mathrm{yr}^{-1}$. Our findings suggest that the ADC in Cyg X-2 has a kinematically active environment with a high degree of turbulence and kinetic energy."}
{"id": "2512.00054", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2512.00054", "abs": "https://arxiv.org/abs/2512.00054", "authors": ["G. K. Skinner", "J. F. Krizmanic"], "title": "Comment on 'Color astrophotography with a 100 mm-diameter f/2 polymer flat lens', Appl. Phys. Lett. 126, 051701 (2025)", "comment": "This is a comment on a paper published in Applied Physics Letters, doi = 10.1063/5.0242208. It has been approved for publication in that same journal", "summary": "It is argued that the lens described in the paper commented upon has a focussing efficiency of less than 0.03% and an angular resolution for broadband radiation that is an order of magnitude worse that the diffraction limit. Furthermore incident radiation that is not focussed will lead to background fog in the image plane."}
{"id": "2512.00660", "categories": ["astro-ph.HE", "hep-ph"], "pdf": "https://arxiv.org/pdf/2512.00660", "abs": "https://arxiv.org/abs/2512.00660", "authors": ["Ke Fang", "Kohta Murase"], "title": "Particle Astrophysics with High and Ultrahigh Energy Neutrinos", "comment": "15 pages, 4 figures. Review chapter for Encyclopedia of Particle Physics, Editor-in-Chief Christian S. Fischer, Section Editor Baha Balantekin", "summary": "We summarize recent results of the observations of high (1 TeV-100 PeV) and ultrahigh ($\\geq 100$ PeV) energy neutrinos, including the detection of a diffuse cosmic high-energy neutrino background, the identification of the first neutrino source candidates, and the observation of high-energy neutrinos from the Galactic plane. These findings open a new window to the universe by enabling the use of neutrinos to probe the cosmos that are otherwise inaccessible via photons. Although the origins of most detected neutrinos remain uncertain, we highlight several distinctive features of their sources that have emerged from current observations."}
{"id": "2512.00116", "categories": ["astro-ph.IM", "astro-ph.EP", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2512.00116", "abs": "https://arxiv.org/abs/2512.00116", "authors": ["A. Claret", "G. Torres"], "title": "Gravity-darkening exponents for MESA stellar evolution models", "comment": "2 pages, 1 table. Accepted for publication in RNAAS", "summary": "In this Research Note we present new gravity-darkening exponents ($β$) for several stellar evolution models from the ZAMS up to the giant phase. The models were computed using the MESA code (version 7385) for the composition $X = 0.70$ and $Z = 0.02$, adopting A09 opacities and a mixing length parameter of $α_{\\rm MLT} = 1.84$. Results were calculated using the triangle strategy, for initial stellar masses of 1.0, 1.5, 2.0, 2.5, 3.0, 5.0, 7.0, 10.0, 15.0, and 20.0 $M_{\\odot}$, and provide an update on previously available $β$ values that used older models."}
{"id": "2512.00750", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2512.00750", "abs": "https://arxiv.org/abs/2512.00750", "authors": ["Kishor Chaudhury", "Abhradeep Roy", "Varsha R. Chitnis", "Prajval Shastri", "Rajat K. Dey"], "title": "Broadband Spectral Analysis of 1ES2344+514: A Multi-epoch study", "comment": "Accepted for publication in the research in astronomy and astrophysics journal", "summary": "We present the results of the multi-epoch broadband spectral study of 1ES 2344+514 and study the evolution of physical parameters. We used nearly simultaneous data obtained from 2017 June 6 to 2022 August 6 (MJD 57910 -- 59797) in optical, UV, X-ray and $γ$-ray wavebands from various instruments including Swift-UVOT, Swift-XRT, NuSTAR, AstroSat (SXT and LAXPC), Fermi-LAT, and TeV flux from MAGIC. During 2017 July, 1ES 2344+514 appeared to be in the highest flaring state compared to other periods. We used the 0.5 -- 7.0 keV and 3.0 -- 20.0 keV data, respectively, from SXT and LAXPC of AstroSat and also 0.3 -- 8.0 keV and 3.0 -- 79.0 keV data, respectively, from Swift-XRT and NuSTAR. A joint fit between SXT and LAXPC, and between Swift-XRT and NuSTAR has been done for constraining the synchrotron peak. A clear shift in the synchrotron peak has been observed, which included 1ES 2344+514 in the HSP BL Lac family. A `harder-when-brighter' trend is observed in X-rays, and the opposite trend, i.e., `softer-when-brighter', is seen in the $γ$-rays. The multi-epoch broad-band spectral energy distributions (SEDs) of this source were built and studied to get an idea of the radiation processes. The SEDs were fitted using a steady-state leptonic one-zone synchrotron+SSC model, and the fitted parameters of the emission region are consistent with those of other TeV BL Lacs. In this study, we found a weak correlation tendency between bolometric luminosity and magnetic field (B), as well as between bolometric luminosity and the break Lorentz factor ($γ_{break}$)."}
{"id": "2512.00442", "categories": ["astro-ph.IM", "astro-ph.EP"], "pdf": "https://arxiv.org/pdf/2512.00442", "abs": "https://arxiv.org/abs/2512.00442", "authors": ["Suvinay Goyal", "Yinzi Xin", "Nemanja Jovanovic", "Dimitri Mawet", "Michael P. Fitzgerald"], "title": "Analysis of Angular-Differential Post-Processing Algorithms for Exoplanet Direct Detection with a Photonic Lantern Nuller", "comment": "Submitted at JATIS. 36 pages, 12 figures", "summary": "Exoplanet research is essential for understanding planetary formation and the potential for life beyond our solar system. The direct imaging method captures exoplanet light while minimizing light from the host star. This is conventionally achieved with a coronagraph, which allows detailed characterization of planetary atmospheres and features. The Photonic Lantern Nuller (PLN) is an innovative instrument designed for the direct detection of closely orbiting exoplanets within the inner working angle of standard coronagraphs. Unlike traditional coronagraphs, where the planet's signal is usually rotationally invariant, with the same point-spread-function at different position angles, and which also overlaps minimally with the residual stellar signal, data from a PLN consist of a one-dimensional collection of points that do not have rotational invariance and overlap significantly with the residual starlight arising from wavefront errors. Exploiting angular diversity to subtract these stellar residuals with the PLN thus requires adapting the Angular Differential Imaging (ADI) technique for use with non-rotationally invariant planet signals at close separations, where strong self-subtraction effects occur. We reformulate ADI using principal component analysis to develop a method to extract spatial parameters of exoplanets from simulated one-dimensional PLN data. We test two variations of ADI on simulated data and show that injecting an antiplanet signal before stellar estimation helps localize the planet due to self-subtraction at lower separations."}
{"id": "2512.00784", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2512.00784", "abs": "https://arxiv.org/abs/2512.00784", "authors": ["Sanjith A.", "Shantanu Desai"], "title": "Can the Efron-Petrosian Method Recover the Inverse-Square Distance Law for Simulated Radio Pulsar Fluxes?", "comment": "16 pages, 8 figures", "summary": "We test whether the Efron-Petrosian (E-P) method can recover the inverse-square law dependence of the radio pulsar flux, using a synthetic catalog generated according to the specifications of the Parkes multi-beam survey using the {\\tt PsrPopPy} software. We find that the E-P method cannot reproduce the inverse-square law, except over a narrow range of flux thresholds and even here we don't get pristine agreement. The main reason for the deviation is that the synthetic radio pulsar catalog is truncated based on a cut on the pulsar signal to noise ratio (SNR), which has a non-linear dependence on the flux along with plenty of scatter. We show that the disagreement is exacerbated as we raise the SNR threshold. We then demonstrate that if we create a synthetic catalog based on a flux cut (instead of an SNR-based threshold), we can recover the true distance exponent, with an accuracy ranging from pristine agreement to within $\\pm 1 σ$ depending on the chosen flux threshold."}
{"id": "2512.00492", "categories": ["astro-ph.IM", "astro-ph.EP"], "pdf": "https://arxiv.org/pdf/2512.00492", "abs": "https://arxiv.org/abs/2512.00492", "authors": ["Colin Snodgrass", "Marina Galand", "Arnaud Beth", "Charlotte Goetz", "Abbie Donaldson", "Cyrielle Opitom"], "title": "Intercepting Interstellar Objects", "comment": "White paper submitted to the UK Space Frontiers 2035 prioritisation exercise", "summary": "We describe how the ESA Comet Interceptor mission, which is due to launch in 2028/29 to a yet-to-be-discovered target, can provide a conceptual basis for a future mission to visit an Interstellar Object. Comet Interceptor will wait in space until a suitable long period comet is discovered, allowing rapid response to perform a fast flyby of an object that will be in the inner Solar System for only a few years; an enhanced version of this concept could realistically provide the first in situ investigation of a visitor from another star system."}
{"id": "2512.00808", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.00808", "abs": "https://arxiv.org/abs/2512.00808", "authors": ["Wen-Han Zhou", "Yun Zhang", "Jiamu Huang", "Douglas N. C. Lin"], "title": "Tidal disruption and evaporation of rubble-pile and monolithic bodies as a source of flaring activity in Sgr A^\\star$", "comment": "Accepted to A&A. 9 pages, 3 figures", "summary": "Sgr A*, the supermassive black hole at the center of the Milky Way, exhibits frequent short-duration flares with luminosity greater than 1e34 erg/s across multiple wavelengths. The origin of the flares is still unknown. We revisited the role of small planetary bodies, originally from the stellar disk, and their tidally disrupted fragments as a source of flaring activity in Sgr A*. We refined previous models by incorporating material strength constraints on the tidal disruption limit and by evaluating the evaporation dynamics of the resulting fragments. We analyzed the tidal fragmentation and gas-induced fragmentation of small planetary bodies with rubble-pile and monolithic structures. Using constraints from recent space missions (e.g., NASA OSIRIS-REx and JAXA Hayabusa2), we estimated the survivability of fragments under aerodynamic heating and computed their expected luminosity from ablation, modeled as fireball flares analogous to meteor events.\n  We find that planetary fragments can approach as close as 8 gravitational radii, consistent with observed flare locations. The fireball model yields luminosities from 1e34 to 1e36 erg/s for fragments whose parent bodies are a few kilometers in size. The derived flare frequency vs. luminosity distribution follows a power law with index 1.83, in agreement with observed values (1.65 - 1.9), while the flare duration scales as L^(-1/3), consistent with observations. We consider the young stars around Sgr A* as the planetary reservoir. Given a small-body population analogous in mass to the primordial Kuiper belt and the common existence of close-in super-Earths and long-period Neptunes, we show that this planetary reservoir can supply the observed flares."}
{"id": "2512.00941", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2512.00941", "abs": "https://arxiv.org/abs/2512.00941", "authors": ["Gregory Hellbourg"], "title": "Quiet Skies Report: A Primer on Protecting Radio Astronomy in the Age of Satellite Mega-Constellations", "comment": "39 pages, 8 figures, report dedicated to raise awareness about the impact of satellites to the radio astronomy service", "summary": "The rapid expansion of satellite constellations is transforming the radio-frequency environment around the Earth. At the same time, radio astronomy is entering a new era of sensitivity and survey capability, requiring unprecedented control of interference. This primer introduces satellite operators, engineers, spectrum managers and policy makers to the basic concepts of radio astronomy, explains why the discipline is uniquely vulnerable to interference, and outlines the regulatory and practical tools available to manage coexistence."}
{"id": "2512.00824", "categories": ["astro-ph.HE", "gr-qc"], "pdf": "https://arxiv.org/pdf/2512.00824", "abs": "https://arxiv.org/abs/2512.00824", "authors": ["Haiyuan Feng", "Ziqiang Cai", "Hao-Peng Yan", "Rong-Jia Yang", "Jinjun Zhang"], "title": "Images of shadow and thin accretion disk around Bardeen black hole surrounded by perfect fluid dark matter", "comment": "44 pages, 86 figures", "summary": "We investigated the shadow and optical appearance of Bardeen black hole (BH) immersed in perfect-fluid dark matter (PFDM). Using the EHT data, we find that the DM parameter is restricted to a narrow allowed range, confined to values of $\\mathcal{O}(10^{-1}-10^{-2})$. Additionally, we observed that increasing the DM parameter substantially enlarges the photon sphere, the critical impact parameter, and thus the shadow radius, whereas the magnetic charge $g$ produces only negligible corrections. The DM component also modifies the optical appearance of the accretion disk: higher $b$ systematically suppresses the observed radiation intensity and reduces image brightness, while changes in $g$ yield only marginal effects. Subsequently, using the Novikov-Thorne thin disk model, we analyze primary and secondary images, observed flux, and redshift patterns, showing that PFDM noticeably alters image size and brightness whereas magnetic charge has a negligible influence. No blueshifted regions appear in any configuration. These results highlight several promising observational signatures for testing DM environments and nonlinear electrodynamic effects around BHs."}
{"id": "2512.01075", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2512.01075", "abs": "https://arxiv.org/abs/2512.01075", "authors": ["Euclid Collaboration", "A. Anselmi", "R. Laureijs", "G. D. Racca", "G. Costa", "L. Courcould Mifsud", "J. -C. Cuillandre", "M. Gottero", "H. Hoekstra", "K. Kuijken", "V. Mareschi", "L. Miller", "S. Mottini", "D. Stramaccioni", "B. Altieri", "A. Amara", "S. Andreon", "N. Auricchio", "C. Baccigalupi", "M. Baldi", "A. Balestra", "S. Bardelli", "R. Bender", "A. Biviano", "E. Branchini", "M. Brescia", "S. Camera", "G. Canas-Herrera", "V. Capobianco", "C. Carbone", "J. Carretero", "M. Castellano", "G. Castignani", "S. Cavuoti", "A. Cimatti", "C. Colodro-Conde", "G. Congedo", "C. J. Conselice", "L. Conversi", "Y. Copin", "F. Courbin", "H. M. Courtois", "M. Cropper", "A. Da Silva", "H. Degaudenzi", "G. De Lucia", "H. Dole", "F. Dubath", "F. Ducret", "C. A. J. Duncan", "X. Dupac", "S. Dusini", "S. Escoffier", "M. Fabricius M. Farina", "R. Farinelli", "F. Faustini", "S. Ferriol", "F. Finelli", "N. Fourmanoit", "M. Frailis", "E. Franceschi", "M. Fumana", "S. Galeotta", "K. George", "B. Gillis", "C. Giocoli", "J. Gracia-Carpio", "A. Grazian", "F. Grupp", "S. V. H. Haugan", "J. Hoar", "W. Holmes", "F. Hormuth", "A. Hornstrup", "K. Jahnke", "M. Jhabvala", "E. Keihanen", "S. Kermiche", "A. Kiessling", "R. Kohley", "B. Kubik", "M. Kunz", "H. Kurki-Suonio", "A. M. C. Le Brun", "S. Ligori", "P. B. Lilje", "V. Lindholm", "I. Lloro", "G. Mainetti", "D. Maino", "E. Maiorano", "O. Mansutti", "O. Marggraf", "M. Martinelli", "N. Martinet", "F. Marulli", "R. J. Massey", "E. Medinaceli", "S. Mei", "Y. Mellier", "M. Meneghetti", "E. Merlin", "G. Meylan", "A. Mora", "M. Moresco", "L. Moscardini", "R. Nakajima", "C. Neissner", "R. C. Nichol", "S. -M. Niemi C. Padilla", "S. Paltani", "F. Pasian", "K. Pedersen", "W. J. Percival", "V. Pettorino", "S. Pires", "G. Polenta", "M. Poncet", "L. A. Popa", "F. Raison", "R. Rebolo", "A. Renzi", "J. Rhodes", "G. Riccio", "E. Romelli", "M. Roncarelli", "C. Rosset", "E. Rossetti", "R. Saglia", "Z. Sakr", "J. -C. Salvignol", "A. G. Sanchez", "D. Sapone", "B. Sartoris", "M. Schirmer", "P. Schneider", "T. Schrabback", "A. Secroun", "G. Seidel", "S. Serrano", "C. Sirignano", "G. Sirri", "J. Skottfelt", "L. Stanco", "J. Steinwagner", "P. Tallada-Cresp", "D. Tavagnacco", "A. N. Taylor", "H. I. Teplitz", "I. Tereno", "N. Tessore", "S. Toft", "R. Toledo-Moreo", "F. Torradeflot", "I. Tutusaus", "E. A. Valentijn", "L. Valenziano", "J. Valiviita", "T. Vassallo", "G. Verdoes Kleijn", "A. Veropalumbo", "Y. Wang", "J. Weller", "A. Zacchei", "G. Zamorani", "E. Zucca", "M. Ballardini", "M. Bolzonella", "E. Bozzo", "C. Burigana", "R. Cabanac", "A. Cappi", "J. A. Escartin Vigo", "L. Gabarra W. G. Hartley", "J. Martin Fleitas", "S. Matthew", "N. Mauri", "R. B. Metcalf", "A. Pezzotta", "M. Pontinen", "I. Risso", "V. Scottez", "M. Sereno", "M. Tenti", "M. Viel", "M. Wiesmann", "Y. Akrami", "I. T. Andika", "S. Anselmi", "M. Archidiacono", "F. Atrio-Barandela", "D. Bertacca", "M. Bethermin", "A. Blanchard", "L. Blot", "M. Bonici", "S. Borgani", "M. L. Brown", "S. Bruton", "A. Calabro", "B. Camacho Quevedo", "F. Caro", "C. S. Carvalho", "T. Castro", "F. Cogato", "S. Conseil", "A. R. Cooray", "O. Cucciati", "S. Davini", "G. Desprez", "A. Diaz-Sanchez", "J. J. Diaz", "S. Di Domizio", "J. M. Diego M. Y. Elkhashab", "A. Enia", "Y. Fang", "A. G. Ferrari", "A. Finoguenov", "A. Franco", "K. Ganga", "J. Garcia-Bellido", "T. Gasparetto", "E. Gaztanaga", "F. Giacomini", "F. Gianotti", "G. Gozaliasl", "M. Guidi", "C. M. Gutierrez", "A. Hall", "H. Hildebrandt", "J. Hjorth", "J. J. E. Kajava", "Y. Kang", "V. Kansal", "D. Karagiannis", "K. Kiiveri", "J. Kim", "C. C. Kirkpatrick", "S. Kruk", "J. Le Graet", "L. Legrand", "M. Lembo", "F. Lepori", "G. Leroy", "G. F. Lesci", "J. Lesgourgues", "L. Leuzzi", "T. I. Liaudat", "S. J. Liu", "A. Loureiro", "J. Macias-Perez", "M. Magliocchetti", "F. Mannucci", "R. Maoli", "C. J. A. P. Martins", "L. Maurin", "M. Miluzio", "P. Monaco", "A. Montoro", "C. Moretti", "G. Morgante", "S. Nadathur", "K. Naidoo", "A. Navarro-Alsina", "S. Nesseris", "D. Paoletti", "F. Passalacqua", "K. Paterson", "L. Patrizii", "A. Pisani", "D. Potter", "S. Quai", "M. Radovich", "S. Sacquegna", "M. Sahlen", "D. B. Sanders", "E. Sarpa", "A. Schneider", "D. Sciotti", "E. Sellentin", "L. C. Smith", "K. Tanidis", "G. Testera", "R. Teyssier", "S. Tosi", "A. Troja", "M. Tucci", "C. Valieri", "A. Venhola", "D. Vergani", "G. Verza", "P. Vielzeuf", "N. A. Walton"], "title": "Euclid Structural-Thermal-Optical Performance", "comment": "21 pages, 15 figures, submitted to A&A", "summary": "The Euclid system performance is defined in terms of image quality metrics tuned to the weak gravitational lensing (WL) cosmological probe. WL induces stringent requirements on the shape and stability of the VIS instrument system point spread function (PSF). The PSF is affected by error contributions from the telescope, the focal plane and image motion, and is controlled by a global error budget with error allocations to each contributor. Aims. During spacecraft development, we verified through a structural-thermal-optical performance (STOP) analysis that the built and verified telescope with its spacecraft interface meets the in-orbit steady-state and transient image quality requirements. Methods. For the purposes of the STOP analysis, a detailed finite-element mathematical model was set up and a standard set of test cases, both steady-state and transient, was defined, comprising combinations of worst-case boundary conditions. Results. The STOP analysis addressed the interaction of all spacecraft components in transmitting temperature-induced loads that lead to optical train deformation. The results of the prelaunch analysis demonstrated that temperature-induced optical perturbations will be well below the allowable limits for all permitted observing conditions. During the first year in orbit, we used the STOP analysis predictions to help interpret the measured performance as a function of environmental variables. Unpredicted disturbances were discovered and unexpected sensitivities were revealed. In-orbit temperature variations are small (<300 mK) and so are their effects on the telescope structure, but they are detected in the time histories of the image quality metrics and are a non-negligible factor in the PSF stability budget demanded by the WL science. Taking everything into account, our analysis confirms the excellent overall performance of the telescope."}
{"id": "2512.00874", "categories": ["astro-ph.HE", "astro-ph.SR", "nucl-th"], "pdf": "https://arxiv.org/pdf/2512.00874", "abs": "https://arxiv.org/abs/2512.00874", "authors": ["Henrik Danielyan", "Arus Harutyunyan", "Armen Sedrakian"], "title": "Thermal conduction and thermopower of inner crusts of magnetized neutron stars", "comment": "19 pages, 20 figures", "summary": "We compute the thermal conductivity and thermoelectric power (thermopower) of the inner crust of compact stars across a broad temperature-density domain relevant for proto-neutron stars, binary neutron-star mergers, and accreting neutron stars. The analysis covers the transition from a semi-degenerate to a highly degenerate electron gas and assumes temperatures above the melting threshold of the nuclear lattice, such that nuclei form a liquid. The transport coefficients are obtained by solving the Boltzmann kinetic equation in the relaxation-time approximation, fully incorporating the anisotropies generated by non-quantizing magnetic fields. Electron scattering rates include (i) dynamical screening of the electron-ion interaction in the hard-thermal-loop approximation of QED, (ii) ion-ion correlations within a one-component plasma, and (iii) finite nuclear-size effects. As an additional refinement, we evaluate electron-neutron scattering induced by the coupling of electrons to the anomalous magnetic moment of free neutrons; this contribution is found to be subdominant throughout the parameter range explored. To assess the sensitivity of transport coefficients to the underlying microphysics, we perform calculations for several inner-crust compositions obtained from different nuclear interactions and many-body methods. Across most of the crust, variations in relaxation times and in the components of the anisotropic thermal-conductivity and thermopower tensors reach up to factors 3-4 and 1.5-2, respectively, with the exception of the region where pasta phases are expected. These results provide updated, composition-dependent microphysical inputs for dissipative magneto-hydrodynamic simulations of warm neutron stars and post-merger remnants, where anisotropic heat and charge transport are of critical importance."}
{"id": "2512.01270", "categories": ["astro-ph.IM", "astro-ph.GA", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2512.01270", "abs": "https://arxiv.org/abs/2512.01270", "authors": ["Yuan-Sen Ting", "Serat Mahmud Saad", "Fan Liu", "Yuting Shen"], "title": "Egent: An Autonomous Agent for Equivalent Width Measurement", "comment": "23 pages, 14 figures, 5 tables. To be submitted. Comments welcome. Code available at https://github.com/tingyuansen/Egent", "summary": "We present Egent, an autonomous agent that combines classical multi-Voigt profile fitting with large language model (LLM) visual inspection and iterative refinement. The fitting engine is built from scratch with minimal dependencies, creating an ecosystem where the LLM can reason about fits through function calls-adjusting wavelength windows, adding blend components, modifying continuum treatment, and flagging problematic cases. Egent operates directly on raw flux spectra without requiring pre-normalized continua. We validate against manual measurements from human experts using 18,615 lines from the C3PO program across 84 Magellan/MIKE spectra at SNR~50-250. We find per-spectrum systematic offsets between Egent and expert measurements, likely arising from differences in global continuum placement prior to manual fitting; after accounting for these offsets, the agreement is 5-7 milliangstrom. The LLM's primary role is quality control: it confirms good fits (~60-65% of lines are LLM-refined and accepted), flags problematic cases (~10-20%), and occasionally rescues edge cases where tool use improves fits. Agreement between GPT-5 and GPT-5-mini confirms reproducibility, with GPT-5-mini enabling low-cost analysis at ~200 lines per US dollar. Every fit stores complete Voigt parameters, continuum coefficients, and LLM reasoning chains, enabling exact reconstruction without re-running. Egent compresses what traditionally requires months of expert effort into days of automated analysis, enabling survey-scale EW measurement. We provide open-source code at https://github.com/tingyuansen/Egent, including a web interface for drag-and-drop analysis and a local LLM backend for fully offline operation on consumer hardware."}
{"id": "2512.00963", "categories": ["astro-ph.HE", "gr-qc"], "pdf": "https://arxiv.org/pdf/2512.00963", "abs": "https://arxiv.org/abs/2512.00963", "authors": ["Emmanuel Fonseca"], "title": "Nonlinear Orbital Variations in Binary Radio Pulsars from Lense-Thirring Precession", "comment": "7 pages, 2 figures, 1 table. Submitted; comments welcome!", "summary": "A future measurement of Lense-Thirring (LT) precession using a binary radio pulsar is expected to yield the pulsar's moment of inertia ($I_{\\rm p}$). However, most of the known pulsar-binary systems expected to provide this opportunity will exhibit linear variations in the orbital elements due to LT precession that are difficult to separate from variations induced by other mechanisms. In this work, we demonstrate that the pulsar-timing signature of LT precession for an arbitrary orbital orientation produces nonlinear orbital variations; if detected, these nonlinear variations provide a means to constrain $I_{\\rm p}$ without the need for timing-independent measurements of orbital geometry or distance. We show through simulations that these signatures are indeed detectable in pulsar-binary systems with an appropriate combination of timing precision and orbital geometry. Our simulations also show that nonlinear orbital variations from LT precession are expected to be detectable in PSR J1757$-$1854 after only 15 yr of dedicated timing."}
{"id": "2512.01283", "categories": ["astro-ph.IM", "astro-ph.EP", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2512.01283", "abs": "https://arxiv.org/abs/2512.01283", "authors": ["Haifeng Yang", "Lile Wang"], "title": "Kratos-polrad: Novel GPU system for Monte-Carlo simulations with consistent polarization calculations", "comment": "13 pages, 7 figures, submitted to ApJ", "summary": "Polarized radiation serves as a vital diagnostic tool in astrophysics, providing unique insights into magnetic field geometries, scattering processes, and three-dimensional structures in diverse astrophysical scenarios. To address these applications, we present Kratos-polrad, a novel GPU-accelerated Monte Carlo Radiative Transfer code built upon the heterogeneous computing framework of Kratos, designed for self-consistent and efficient polarization calculations. It utlizes comprehensive treatment of Stokes parameters throughout photon propagation, featuring transforms the grain-lab frame transforms using quaternion algebra and consistent non-linear polarization extinction in cells, which are useful in modeling radiative transfer processes with scatterings by aligned dust grains. The code implements two-step polarimetry imaging that decouples Monte Carlo sampling of scattering physics from imaging geometry, enabling efficient synthesis maximizing the utilization of photon packets. Extensive validation against analytical solutions and established codes demonstrates accurate treatment of diverse polarization phenomena, including self-scattering polarization, dichroic extinction in aligned dust grains, and complex polarization patterns in twisted magnetic field configurations. By leveraging massive GPU parallelism, optimized memory access patterns, and analytical approaches for optically thick cells, Kratos-polrad achieves performance improvements of $\\sim 10^{2}$ times compared to CPU-based methods, enabling previously prohibitive studies in polarimetric astrophysics."}
{"id": "2512.01044", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.01044", "abs": "https://arxiv.org/abs/2512.01044", "authors": ["Tigran Petrosyan", "Arus Harutyunyan", "Armen Sedrakian"], "title": "Impact of positrons on electrical conductivity of hot and dense astrophysical plasma", "comment": "17 pages, 8 figures", "summary": "We study the influence of positrons on the outer crusts of neutron stars and the interiors of white dwarfs, introducing them as a novel component in both the composition of matter and in transport processes. We solve a system of coupled Boltzmann kinetic equations for the electron and positron distribution functions in the relaxation-time approximation, taking into account electron-ion, positron-ion, and electron-positron collisions. The relevant scattering matrix elements are calculated from one-plasmon exchange diagrams, with in-medium polarization tensors derived within hard-thermal-loop effective theory. Numerical results are obtained for matter composed of carbon nuclei. We find that the conductivity rises with temperature, following a power law sigma proportional to the 4th power of T in the semi-degenerate regime and sigma proportional to T in the nondegenerate regime, due to the intense creation of thermal electron-positron pairs and the resulting collisions among them. These results highlight the importance of including positrons in the transport properties of heated, dense astrophysical plasmas."}
{"id": "2512.01288", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.01288", "abs": "https://arxiv.org/abs/2512.01288", "authors": ["Abhimanyu Susobhanan", "Avinash Kumar Paladi", "Réka Desmecht", "Amarnath", "Manjari Bagchi", "Manoneeta Chakraborty", "Shaswata Chowdhury", "Suruj Jyoti Das", "Debabrata Deb", "Shantanu Desai", "Churchil Dwivedi", "Himanshu Grover", "Jibin Jose", "Bhal Chandra Joshi", "Shubham Kala", "Fazal Kareem", "Kuldeep Meena", "Sushovan Mondal", "K Nobleson", "Arul Pandian B", "Kaustubh Rai", "Adya Shukla", "Manpreet Singh", "Aman Srivastava", "Mayuresh Surnis", "Hemanga Tahbildar", "Keitaro Takahashi", "Pratik Tarafdar", "Kunjal Vara", "Vaishnavi Vyasraj", "Zenia Zuraiq"], "title": "Revisiting wideband pulsar timing measurement", "comment": "Submitted to MNRAS", "summary": "In the wideband paradigm of pulsar timing, the time of arrival of a pulsar pulse is measured simultaneously with the corresponding dispersion measure from a frequency-resolved integrated pulse profile. We present a new method for performing wideband measurements that rigorously accounts for measurement noise. We demonstrate this method using observations of PSR J2124$-$3358 made as part of the Indian Pulsar Timing Array experiment using the upgraded Giant Metre-wave Radio Telescope, and show that our method produces more realistic measurement uncertainty estimates compared to the existing wideband measurement method."}
{"id": "2512.01053", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.01053", "abs": "https://arxiv.org/abs/2512.01053", "authors": ["Luigi Foschini"], "title": "The jetted NLS1 1H 0323+342: the Rosetta stone for accretion/ejection in AGN", "comment": "13 pages, 8 figures. Presented at: \"Highly accreting supermassive black holes across all cosmic times: from the local Universe to cosmic dawn\", December 1-5, 2025, European Southern Observatory, Vitacura, Santiago (Chile)", "summary": "1H 0323+342 is the nearest gamma-ray narrow-line Seyfert 1 galaxy (z=0.063). Its X-ray spectrum (0.3-10 keV) is characterised by significant spectral variability observed by many authors, with a backbone with photon index ~2 occasionally superimposed by a hard tail. This spectral variability has been interpreted as the interplay between the X-ray corona and the relativistic jet. The X-ray fluxes in the 0.3-10 keV energy band are generally around ~10^-11 erg cm^-2 s^-1, making it easier to get sufficient statistics even with short exposures. Here I present a reanalysis of all the available X-ray observations with Swift (181 obs), XMM-Newton (7 obs), Chandra (1 obs), and Suzaku (2 obs) performed between 2006 and 2025. Possible interpretations are proposed and discussed."}
{"id": "2512.01511", "categories": ["astro-ph.IM", "astro-ph.EP"], "pdf": "https://arxiv.org/pdf/2512.01511", "abs": "https://arxiv.org/abs/2512.01511", "authors": ["Mariam Sabalbal", "Olivier Absil", "Carl-Henrik Dahlqvist", "Philippe Delorme"], "title": "Enhanced detection limits in the SHINE F150 survey through the Regime Switching Model Optimizing thresholds and investigating environmental noise", "comment": null, "summary": "In high-contrast imaging, a novel detection algorithm for angular differential imaging (ADI) sequences has recently been introduced: the Regime Switching Model (RSM). In this study, we apply the RSM algorithm to analyze the F150 sample from the SHINE high-contrast imaging survey carried out with VLT/SPHERE, aiming to enhance detection limits and identify new exoplanet candidates. Additionally, we investigate how environmental conditions influence post-processed noise distributions and detection thresholds. We generate detection maps and contrast curves for 213 observations in the F150 SHINE sample using the RSM algorithm. A clustering approach based on environmental parameters is used to group observations with similar noise characteristics. We propose two methods for defining radial detection thresholds in the RSM maps: fitting a log-normal distribution to the post-processed noise and maximizing the F1 score. We also assess the performance of various combinations of post-processing techniques within the RSM framework to identify optimal configurations. This study demonstrates the utility of clustering based on observational parameters, effectively distinguishing features like wind-driven halos and low-wind effects. Detection thresholds vary significantly across clusters, differing by up to a factor of 10, highlighting the importance of considering observational environments. Log-normal thresholds provide conservative, noise-aware limits, while F1 score-based thresholds offer observation-specific results, both showing compatibility overall. RSM improves detection limits by an average factor of two at 1arcsec and five at inner working angles compared to standard PCA processing. This study reports more than 30 newly detected signals, including one promising candidate awaiting second-epoch confirmation."}
{"id": "2512.01176", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.01176", "abs": "https://arxiv.org/abs/2512.01176", "authors": ["Cole Treyturik", "Chelsea Braun", "Samar Safi-Harb", "Christopher L. Fryer", "Gilles Ferrand"], "title": "Revisiting the Supernova Engines in the 3C 397 and W49B Supernova Remnants", "comment": "47 pages, 16 figures, 7 tables; accepted for publication in the Astrophysical Journal", "summary": "The nature of the supernova remnants (SNRs) 3C 397 and W49B has long been a subject of debate, with prior studies offering conflicting interpretations between thermonuclear and core-collapse scenarios. To help settle this debate, we present a systematic, spatially resolved, spectroscopic analysis of both remnants using XMM-Newton. By applying multi-component thermal models, we derive key physical properties including elemental abundances, ejecta temperatures, ambient densities, and explosion energetics. We compare the inferred metal abundance ratios to a wide range of core-collapse and thermonuclear nucleosynthesis models, including new models whose explosion energies differ from the canonical value of $10^{51}$ ergs. We find that the observed Fe/Si and Ca/Si ratios in both SNRs are best matched by certain thermonuclear models. However, no model fully reproduces the complete set of observed abundance patterns. In 3C 397, high Fe enrichment and spatial abundance variations suggest interaction with a dense progenitor environment, and W49B's composition is overall consistent with a thermonuclear origin; however both require a low energy ($\\sim 10^{50}$ erg) supernova explosion. We additionally map the Fe K$α$ line centroid energies and find a spread, with W49B falling within the core-collapse region -- highlighting both environmental complexity and the limitations of this diagnostic for supernova classification. Our results highlight the need for caution in relying on any single diagnostic or nucleosynthesis model for supernova typing, underscore the need for improved nucleosynthesis models, and motivate future high-resolution, high-throughput observations."}
{"id": "2512.01929", "categories": ["astro-ph.IM", "astro-ph.EP", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2512.01929", "abs": "https://arxiv.org/abs/2512.01929", "authors": ["Ajinkya Naik", "Will Handley"], "title": "Nested Sampling for ARIMA Model Selection in Astronomical Time-Series Analysis", "comment": "14 pages, 18 figures", "summary": "The upcoming era of large scale, high cadence astronomical surveys demands efficient and robust methods for time series analysis. ARIMA models provide a versatile parametric description of stochastic variability in this context. However, their practical use is limited by the challenge of selecting optimal model orders while avoiding overfitting. We present a novel solution to this problem using a Bayesian framework for time series modelling in astronomy by combining Autoregressive Integrated Moving Average (ARIMA) models with the Nested Sampling algorithm. Our method yields Bayesian evidences for model comparison and also incorporates an intrinsic Occam's penalty for unnecessary model complexity. A vectorized ARIMA Nested Sampling framework is implemented allowing us to perform model selection across grids of Autoregressive (AR) and Moving Average (MA) orders, with efficient inference of selected model parameters. The method is validated on simulated and real astronomical time series, including the yearly sunspots number record, Kepler Lightcurves data of the red giant KIC 12008916, and TESS photometry of the exoplanet host star Ross 176. In all cases, the algorithm correctly identified the true or best-fitting model while simultaneously yielding well constrained posterior distributions for the model parameters. Our results demonstrate that Nested Sampling offers a potentially rigorous alternative to autoregressive model selection in astronomical time series analysis."}
{"id": "2512.01221", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.01221", "abs": "https://arxiv.org/abs/2512.01221", "authors": ["M. Ghavam", "Z. J. Smeaton", "M. D. Filipovic", "R. Z. E. Alsaberi", "C. Bordiu", "W. D. Cotton", "E. J. Crawford", "A. M. Hopkins", "R. Kothes", "S. Lazarevic", "D. Leahy", "N. Rajabpour", "S. Ranasinghe", "G. P. Rowell", "H. Sano", "M. Sasaki", "D. Shobhana", "K. Tsuge", "D. Urosevic", "N. F. H. Tothill"], "title": "Multi-frequency radio-continuum study of the LMC SNR N206 (Goat's Eye) and its \"zig-zag\" PWN", "comment": null, "summary": "We present new radio-continuum observations of the Large Magellanic Cloud (LMC) supernova remnant (SNR) N206, which we give the name \"Goat's Eye\". Goat's Eye contains an interior radio structure that is likely a pulsar wind nebula (PWN), which we analyse in further detail. We use new radio observations from the Australia Telescope Compact Array (ATCA) telescope, as well as several archival radio observations, to calculate spectral indices, and find a steep spectral index for the whole SNR ($α= -0.60\\pm0.02$), and a flatter spectral index for the PWN ($α= -0.16\\pm0.03$). We also measure the polarisation and magnetic field properties of the PWN. Previously reported as a linear structure, the new observations show an unusual \"zig-zag\"-like structure, visible in radio-continuum total intensity, linear polarisation, and magnetic field orientations. The origin of this zig-zag structure is unclear, but we propose some origin scenarios that will require further observations to differentiate between."}
{"id": "2512.01951", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2512.01951", "abs": "https://arxiv.org/abs/2512.01951", "authors": ["Sachindev S. Shenoy", "Ky Huynh", "Varun Bajaj", "Jennifer Mack"], "title": "Pixel-Based Non-Linearity Correction for the WFC3 IR Detector", "comment": "16 pages, 6 figures, 3 equations", "summary": "The current non-linearity correction for the Wide Field Camera 3 Infrared (WFC3/IR) channel is based on ground-based data acquired during WFC3's Thermal Vacuum 3 (TV3) testing campaign. In the current reference file, the correction coefficients derived for each pixel are averaged over each of the four detector quadrants. In this work, we compute a new pixel-based non-linearity correction using in-flight calibration observations with the internal tungsten lamp flats acquired between 2011 and 2013. We derive the new correction coefficients by fitting a third-order polynomial to the accumulated signal ``up-the-ramp\" for each pixel. Approximately 2\\% of IR detector pixels are flagged as bad, and a solution cannot be computed. For these, we use the quadrant averages of the new correction coefficients. An accompanying report (\\cite{huynh2025}) provides detailed testing results using both internal flats and external science targets acquired in a variety of observing modes. The report highlights improvements in photometry derived from ``\\_flt.fits\" data products calibrated using the new reference file, with the largest improvement for pixels with fluence levels approaching the full well limit of $\\sim$80,000 $e^- $. A new NLINFILE reference file was delivered in October 2025 and will be used to reprocess all WFC3/IR imaging and grism observations in the MAST archive."}
{"id": "2512.01281", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.01281", "abs": "https://arxiv.org/abs/2512.01281", "authors": ["Xuan Yang", "Songbo Zhang", "Xuefeng Wu"], "title": "Non-detection of FAST and Parkes follow-up observation for 27 Parkes discovered FRBs", "comment": "10 pages, 4 figures, accepted for publication in ApJ", "summary": "To investigate whether apparently non-repeating Fast Radio Bursts (FRBs) are truly one-off transients, we conducted systematic follow-up observations of 27 out of 81 non-repeating FRBs identified in the Parkes Transient Database. Using 59.0 hours of data from the Parkes Ultra-Wideband Low (UWL) receiver and 6.3 hours from the Five-hundred-meter Aperture Spherical Telescope (FAST) 19-beam receiver, we searched for repeated bursts from these sources. No additional bursts were detected from any of the 27 FRBs. Combining these non-detections with prior archival observations, we derived stringent upper limits on their repetition rates above 1 Jy under two statistical models: Poisson process constraints range from $\\sim10^{-3.5}$ to $10^{-1.9}\\,\\mathrm{h^{-1}}$, while Weibull process constraints range from $\\sim10^{-3.4}$ to $10^{-1.5}\\,\\mathrm{h^{-1}}$. These limits are approximately an order of magnitude stricter than those reported in previous studies. By applying consistent observational setups and analytical methodologies across all sources, the derived rate limits converge to a narrow, well-defined range. This suggests that these FRBs form a relatively homogeneous population with extremely low intrinsic activity rates."}
{"id": "2512.01954", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2512.01954", "abs": "https://arxiv.org/abs/2512.01954", "authors": ["Kaushal D. Buch", "Thushara Gunaratne", "Gregory Hellbourg", "Cedric Viou", "Benjamin Winkel"], "title": "Real-time RFI Excision Techniques and Their Limitations", "comment": "22 pages, 8 figures, review chapter submitted as part of the International Astronomical Union General Assembly 2024 Focus Meeting 5 Whitebook on RFI in Radio Astronomy", "summary": "Radio astronomy is facing critical challenges due to an ever-increasing human-made signal density filling up the radio spectrum. With the rise of satellites, mobile networks, and other wireless technologies, radio telescopes are struggling with radio frequency interference (RFI), which can masquerade, block or distort astronomical signals. In this chapter, we explain where RFI comes from, how it affects observations, and discuss different ways to reduce or remove interference. The techniques presented here reflect the state of the art in real-time RFI mitigation at the time of publication and include methods such as filtering, digital processing, and optimal scheduling. The proposed catalogue also explores new ideas like satellite avoidance through scheduling, the use of intelligent surfaces to block interference, and advanced computer algorithms to clean up data. The chapter also highlights the need for strong cooperation between astronomers and spectrum regulators to protect radio frequencies for future discoveries. By combining technical solutions and better policies, we can help ensure that radio astronomy continues to provide important insights into the universe."}
{"id": "2512.01387", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.01387", "abs": "https://arxiv.org/abs/2512.01387", "authors": ["Sanjeeva Rao Prattipati", "Reetanjali Moharana", "Sourav Dutta"], "title": "Similar Fermi-GBM sGRBs to GW/sGRB 170817A in MeV-GeV energies", "comment": null, "summary": "The rate of observed gravitational waves (GWs) from neutron star-neutron star (NS-NS) mergers detected by the Laser Interferometer Gravitational-Wave Observatory (LIGO) indicates the existence of more than one short gamma-ray bursts (sGRBs) similar to GW/sGRB 170817A within the total gamma-ray bursts (GRBs) recorded by satellite detectors such as BATSE, Fermi-Gamma-ray Burst Monitor (Fermi-GBM), and Swift-Burst Alert Telescope (Swift-BAT). We investigated sGRBs in the Fermi-GBM dataset based on their MeV-GeV $γ$-ray emission features, to identify sGRBs similar to sGRB 170817A. Any addition of such events can impact the rate of NS-NS CBC events observed by LIGO. SGRB 170817A exhibits two distinct emission components: a non-thermal peak and a thermal component. We adopted a multifaceted approach to identify analogous sGRBs, which involved computing the hardness ratios $HR_{1}$ and $HR_{2}$ and then clustering them via the K-means algorithm. Our further studies reveal the presence of eight such events in Fermi-GBM data, which will enable us to calculate the rate of electromagnetic (EM) counterparts associated with LIGO GW events (GW+sGRB events) across all observing runs. Giving an estimation, by the end of the $O_4$ LIGO run, there could be nearly 5 GW+sGRB events. Deviation from this number may raise concerns about our understanding of the evolution of such events over distance."}
{"id": "2512.00784", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2512.00784", "abs": "https://arxiv.org/abs/2512.00784", "authors": ["Sanjith A.", "Shantanu Desai"], "title": "Can the Efron-Petrosian Method Recover the Inverse-Square Distance Law for Simulated Radio Pulsar Fluxes?", "comment": "16 pages, 8 figures", "summary": "We test whether the Efron-Petrosian (E-P) method can recover the inverse-square law dependence of the radio pulsar flux, using a synthetic catalog generated according to the specifications of the Parkes multi-beam survey using the {\\tt PsrPopPy} software. We find that the E-P method cannot reproduce the inverse-square law, except over a narrow range of flux thresholds and even here we don't get pristine agreement. The main reason for the deviation is that the synthetic radio pulsar catalog is truncated based on a cut on the pulsar signal to noise ratio (SNR), which has a non-linear dependence on the flux along with plenty of scatter. We show that the disagreement is exacerbated as we raise the SNR threshold. We then demonstrate that if we create a synthetic catalog based on a flux cut (instead of an SNR-based threshold), we can recover the true distance exponent, with an accuracy ranging from pristine agreement to within $\\pm 1 σ$ depending on the chosen flux threshold."}
{"id": "2512.01403", "categories": ["astro-ph.HE", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2512.01403", "abs": "https://arxiv.org/abs/2512.01403", "authors": ["Julien Dörner", "Frederic Effenberger", "Horst Fichtner", "Julia Becker Tjus", "Meng Jin", "Wei Liu", "Vahe' Petrosian"], "title": "The impact of Solar magnetic field configurations on the production of gamma rays at the Solar disk", "comment": null, "summary": "The Sun produces a steady signal of high-energy gamma rays through interactions of Galactic cosmic rays (GCRs) with its atmosphere. Observations with Fermi-LAT and HAWC have revealed a gamma-ray flux significantly higher than early theoretical predictions, with unexpected temporal and spectral features that suggest a crucial role of the solar magnetic field. In this work, we model GCR-induced gamma-ray emission at the solar disk using the CRPropa framework with realistic hadronic interactions, chromospheric density profiles, and several magnetic field configurations over the solar cycle. This allows us to quantify the gamma-ray emission of the entire solar disk for different phases of the solar activity cycle and we present, for the first time, maps of the production locations of gamma rays on the solar surface. We consider both mono-energetic and realistic power-law injection spectra in a simplified dipole-quadrupole current sheet model and potential-field source surface (PFSS) extrapolations for Carrington rotations during solar maximum and minimum. Our results show that magnetic mirroring and large-scale field topology strongly affect the spectral shape and spatial distribution of the emission, with slightly enhanced fluxes predicted at solar minimum. While our simulated baseline fluxes remain below observations, additional effects, such as heavier nuclei, Parker-field mirroring, and deeper atmospheric interactions, could result in further enhancements of fluxes closer to observational values. Hadronic interactions do not only produce gamma rays but also neutrinos. We estimate the expected neutrino flux from the Sun based on our gamma-ray predictions. We find that the expected flux is slightly below current upper limits from IceCube."}
{"id": "2512.01503", "categories": ["astro-ph.HE", "nucl-th"], "pdf": "https://arxiv.org/pdf/2512.01503", "abs": "https://arxiv.org/abs/2512.01503", "authors": ["Guo-Jun Wei", "Jia-Jie Li", "Armen Sedrakian", "Yong-Jia Wang", "Qing-Feng Li", "Fu-Hu Liu"], "title": "Bayesian inferences on covariant density functionals from multimessenger astrophysical data: The influences of parametrizations of density dependent couplings", "comment": "13 pages, 5 figures", "summary": "Covariant density functionals have been successfully applied to the description of finite nuclei and dense nuclear matter. These functionals are often constructed by introducing density dependence into the nucleon-meson couplings, typically through functions that depend only on the vector, i.e., proper baryon density. In this work, we employ a Bayesian framework to investigate how different parametrizations, characterized by distinct functional forms and by their dependencies on vector and scalar densities, affect the properties of dense matter and compact stars. Our analysis demonstrates that although all considered parametrizations yield broadly comparable inferences, the differences in the equation of state and the symmetry energy remain significant at suprasaturation densities, reflecting the sensitivity to the chosen functional form of the density dependence. We find that allowing the nuclear saturation properties in the isoscalar channel, including the skewness coefficient $Q_{sat}$, to be freely adjusted provides adequate flexibility for the current modeling of nuclear and neutron star matter. In contrast, the isovector channel requires further refinement, with freedom extended at least up to the curvature coefficient $K_{sym}$ to capture variations in the symmetry energy and particle composition at high densities. This work advances prior studies by implementing a rational-function parametrization of the density dependence, informed and constrained by multimessenger astrophysical observations."}
{"id": "2512.01552", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.01552", "abs": "https://arxiv.org/abs/2512.01552", "authors": ["V. P. Utrobin", "N. N. Chugai"], "title": "Type IIP SN 2024bch: Hydrodynamic model, shock breakout, and circumstellar interaction", "comment": "13 pages, 9 figures, 3 tables. Accepted for publication in Astrophysics and Space Science", "summary": "The well-observed type IIP SN 2024bch with the short plateau is shown to be an outcome of the red supergiant explosion with the presupernova mass of 14-15 Msun, the explosion energy of 2x10^{51} erg, and presupernova radius of 1250 Rsun. The early gamma-ray escape demonstrated by the radioactive tail is due to the large Ni-56 extension up to 7400 km/s. The early-time spectral evolution indicates the presence of the circumstellar dense confined envelope with the mass of 0.003-0.006 Msun within 6x10^{14} cm. The deceleration of the outermost ejecta implies the wind with the mass-loss rate of about 6x10^{-4} Msun/yr. The inferred mass-loss rate is by one-two order larger compared to most of type IIP supernovae, but comparable to the wind of type IIL SN 1998S. The asymmetry of the broad H-alpha component on day 144 powered by the circumstellar interaction is the outcome of the Thomson scattering and absorption in the Paschen continuum in the unshocked ejecta."}
{"id": "2512.01576", "categories": ["astro-ph.HE", "astro-ph.GA", "cs.AI", "gr-qc"], "pdf": "https://arxiv.org/pdf/2512.01576", "abs": "https://arxiv.org/abs/2512.01576", "authors": ["Nihaal Bhojwani", "Chuwei Wang", "Hai-Yang Wang", "Chang Sun", "Elias R. Most", "Anima Anandkumar"], "title": "From Black Hole to Galaxy: Neural Operator: Framework for Accretion and Feedback Dynamics", "comment": "ML4PS Workshop, Neurips 2025 accepted", "summary": "Modeling how supermassive black holes co-evolve with their host galaxies is notoriously hard because the relevant physics spans nine orders of magnitude in scale-from milliparsecs to megaparsecs--making end-to-end first-principles simulation infeasible. To characterize the feedback from the small scales, existing methods employ a static subgrid scheme or one based on theoretical guesses, which usually struggle to capture the time variability and derive physically faithful results. Neural operators are a class of machine learning models that achieve significant speed-up in simulating complex dynamics. We introduce a neural-operator-based ''subgrid black hole'' that learns the small-scale local dynamics and embeds it within the direct multi-level simulations. Trained on small-domain (general relativistic) magnetohydrodynamic data, the model predicts the unresolved dynamics needed to supply boundary conditions and fluxes at coarser levels across timesteps, enabling stable long-horizon rollouts without hand-crafted closures. Thanks to the great speedup in fine-scale evolution, our approach for the first time captures intrinsic variability in accretion-driven feedback, allowing dynamic coupling between the central black hole and galaxy-scale gas. This work reframes subgrid modeling in computational astrophysics with scale separation and provides a scalable path toward data-driven closures for a broad class of systems with central accretors."}
{"id": "2512.01640", "categories": ["astro-ph.HE", "gr-qc", "hep-ph", "hep-th", "math-ph"], "pdf": "https://arxiv.org/pdf/2512.01640", "abs": "https://arxiv.org/abs/2512.01640", "authors": ["Tian-Shun Chen", "Xiao-Ding Zhou", "Kilar Zhang"], "title": "Equivalence of Stability Criteria for Multi-Fluid Stars", "comment": "8 pages, 5 figures", "summary": "We present a rigorous proof establishing the mathematical equivalence between two independent criteria for the marginal stability of multi-fluid relativistic stars: the dynamical criterion based on the vanishing of the fundamental radial pulsation mode's eigenfrequency, and the static criterion derived from the geometric alignment of mass and particle number gradients in the parameter space. Leveraging this equivalence, we introduce a powerful and computationally efficient framework as an upgraded version of the critical curve method, to systematically map the stability boundaries for multi-fluid mixed stars across the entire parameter space of central pressures. Our analysis, applied to a variety of nuclear and dark matter equations of state, reveals the existence of stable region in the observable mass-radius diagram. By resolving degeneracies with 3-dimensional Mass-Radius-Pressure diagrams, we provide a complete topological view of the ensemble. This work supplies a robust theoretical foundation for interpreting multi-messenger astronomical observations and constraining the properties of dark matter."}
{"id": "2512.01641", "categories": ["astro-ph.HE", "gr-qc", "hep-ph", "hep-th", "math-ph"], "pdf": "https://arxiv.org/pdf/2512.01641", "abs": "https://arxiv.org/abs/2512.01641", "authors": ["Xiao-Ding Zhou", "Tian-Shun Chen", "Si-Man Wu", "Kilar Zhang"], "title": "Stability of Neutron-Dark Matter Mixed Stars and Hybrid Stars", "comment": "23 pages, 10 figures, 1 table", "summary": "Concerning the stability of two-fluid star models, we prove the rigorous equivalence of two independent determining methods for mixed stars, after a brief review of the hybrid star case. Our derivations apply to general multi-fluid cases, and here we take dark matter admixed neutron star models for example, demonstrating a stability boundary distinct from the single-fluid case. Stable configurations form a surface in the three-dimensional parameter space of (either) central pressure, mass, and radius, which yields a group containing stable mixed stars. This group includes twin stars with identical masses and radii but different interior structures. These results can help interpret compact star observations and constrain dark matter properties through astrophysics."}
{"id": "2512.01662", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2512.01662", "abs": "https://arxiv.org/abs/2512.01662", "authors": ["A. Hankla", "A. Philippov", "R. Mbarek", "R. Mushotzky", "G. Musoke", "D. Grošelj", "M. Liska"], "title": "An outflow from the X-ray corona as the origin of millimeter emission from radio-quiet AGN", "comment": "25 pages, 10 figures, accepted in ApJ", "summary": "Recent observations of radio-quiet active galactic nuclei (RQAGN) have shown the presence of millimeter emission, whose origin remains unknown, from within parsec scales of the central black hole. We argue that the mm emission comes from a spatially extended region that is magnetically connected to the compact X-ray corona, in analogy to the solar wind and corona. We present an analytic model scaled to corona values in which non-equipartition electrons from multiple heights along an extended conical outflow shape the mm emission. In this model, the 100 GHz emission originates from within $\\lesssim10^4$ gravitational radii ($r_g$) of the central black hole, though the projected distance from the black hole can be as low as $50r_g$ depending on the line-of-sight. Our model predicts a flat emission spectrum $F_ν\\sim{\\rm const}$ and a mm-to-X-ray luminosity ratio $L_{\\rm mm}/L_X\\sim10^{-4}$, consistent with observations. These quantities depend weakly on the underlying electron power-law distribution function and black hole mass. We demonstrate this model's plausibility using a general relativistic magneto-hydrodynamic (GRMHD) simulation of a thin accretion disc as a case study. Our model highlights the need to study continual dissipation along the outflow to connect the X-ray- and mm-emitting regions."}
{"id": "2512.01747", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.01747", "abs": "https://arxiv.org/abs/2512.01747", "authors": ["Arnau Aguasca-Cabot", "Alessandro Carosi", "Alice Donini", "Susumu Inoue", "Yuri Sato", "Monica Seglar Arroyo", "Kenta Terauchi", "Pol Bordas", "Marc Ribó"], "title": "LST-1 follow-up of the exceptionally bright gamma-ray burst GRB 221009A", "comment": "5 pages, 2 figures. Submitted to Memorie della Società Astronomica Italiana (MemSAIt). Presented at the 8th Heidelberg International Symposium on High-Energy Gamma-Ray Astronomy (Gamma-2024), 2024", "summary": "On 9 October 2022, the brightest gamma-ray burst (GRB) ever recorded (GRB 221009A) was detected. Its remarkably bright emission, partially due to its close distance to Earth ($z\\sim0.15$), makes this GRB a unique event. The outstanding characteristics of GRB 221009A, including the TeV detection by the LHAASO experiment, triggered deep follow-up observations of the source across all wavebands, including very-high-energy gamma rays with the first Large-Sized Telescope (LST-1) of the future Cherenkov Telescope Array Observatory. LST-1 observations started about one day after the onset of the prompt emission, under strong moonlight conditions. This resulted in a hint of a signal with a statistical significance of about 4$σ$. The monitoring of this source continued until the end of November 2022. This constitutes the deepest observation campaign performed on a GRB with LST-1. Here we show the results of this follow-up campaign."}
{"id": "2512.01288", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.01288", "abs": "https://arxiv.org/abs/2512.01288", "authors": ["Abhimanyu Susobhanan", "Avinash Kumar Paladi", "Réka Desmecht", "Amarnath", "Manjari Bagchi", "Manoneeta Chakraborty", "Shaswata Chowdhury", "Suruj Jyoti Das", "Debabrata Deb", "Shantanu Desai", "Churchil Dwivedi", "Himanshu Grover", "Jibin Jose", "Bhal Chandra Joshi", "Shubham Kala", "Fazal Kareem", "Kuldeep Meena", "Sushovan Mondal", "K Nobleson", "Arul Pandian B", "Kaustubh Rai", "Adya Shukla", "Manpreet Singh", "Aman Srivastava", "Mayuresh Surnis", "Hemanga Tahbildar", "Keitaro Takahashi", "Pratik Tarafdar", "Kunjal Vara", "Vaishnavi Vyasraj", "Zenia Zuraiq"], "title": "Revisiting wideband pulsar timing measurement", "comment": "Submitted to MNRAS", "summary": "In the wideband paradigm of pulsar timing, the time of arrival of a pulsar pulse is measured simultaneously with the corresponding dispersion measure from a frequency-resolved integrated pulse profile. We present a new method for performing wideband measurements that rigorously accounts for measurement noise. We demonstrate this method using observations of PSR J2124$-$3358 made as part of the Indian Pulsar Timing Array experiment using the upgraded Giant Metre-wave Radio Telescope, and show that our method produces more realistic measurement uncertainty estimates compared to the existing wideband measurement method."}
