{"id": "2511.04738", "categories": ["astro-ph.HE", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2511.04738", "abs": "https://arxiv.org/abs/2511.04738", "authors": ["V. A. Cúneo", "A. D. Schwope", "J. Kurpas", "A. Avakyan", "J. Brink", "D. A. H. Buckley", "C. Maitra", "M. Veresvarska"], "title": "SRGt 062340.2-265751 confirmed as a nova-like cataclysmic variable with a possible magnetic nature", "comment": "Accepted for publication in A&A", "summary": "SRGt 062340.2-265751, a cataclysmic variable identified by SRG/eROSITA due to\nits significant X-ray variability, remains poorly characterised despite\nmulti-wavelength follow-up. We present spectral and timing analyses from the\nfirst dedicated X-ray and ultraviolet observations with XMM-Newton,\ncomplemented by SRG/eROSITA data from four all-sky surveys (eRASS1-4) and\nASAS-SN optical photometry. Our timing analysis reveals a\n>8$\\sigma$-significant modulation at 3.6 $\\pm$ 0.5 hours, likely representing\nthe orbital period. Long-term ASAS-SN monitoring confirms the source as a VY\nSculptoris-type nova-like system, while short-timescale X-ray and ultraviolet\nvariability, down to a few minutes, suggests a possible underlying magnetic\nwhite dwarf. Two additional significant X-ray modulations at 43 $\\pm$ 1 min and\n36.0 $\\pm$ 0.7 min tentatively point to the spin period of an intermediate\npolar. The best-fit XMM-Newton energy spectra reveal a multi-temperature\nthermal plasma ($kT$ = 0.23, 0.94, and 5.2 keV), while the SRG/eROSITA spectra\nare consistent with a single-temperature thermal plasma of a few keV. We\nestimate unabsorbed X-ray luminosities of $\\gtrsim$$10^{32}$ erg s$^{-1}$\n(0.2-12 keV). Broadband spectral energy distribution modelling, from\nnear-ultraviolet to infrared, indicates a disc-dominated system consistent with\na nova-like classification. We discuss these results in the context of the\nsource's confirmed nova-like classification and its possible magnetic nature, a\nscenario increasingly supported by discoveries of intermediate polars\nexhibiting VY Sculptoris-type nova-like features."}
{"id": "2511.04810", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2511.04810", "abs": "https://arxiv.org/abs/2511.04810", "authors": ["Alexander Lange", "B. B. K"], "title": "FermiPhased: A tool for phase-resolved likelihood analysis of Fermi-LAT data", "comment": "8 pages, 7 figures. To be submitted to the Open Journal of\n  Astrophysics", "summary": "The Fermi Large Area Telescope has enabled detailed studies of high-energy\nastrophysical sources. To support analysis, we present FermiPhased, a flexible,\nopen-source tool for phase-resolved studies of pulsars, binaries, and other\nperiodically variable sources. Built on the Fermipy framework, FermiPhased\noffers three modes: standard, adaptive (fixed counts), and joint phase-resolved\nanalysis, enabling users to flexibly bin data based on phase, count statistics,\nor jointly fit different epochs of interest. FermiPhased is optimized for\nparallel execution and use on computing clusters. It enables parallelized\nextraction of phase-resolved fluxes, spectra, and intermediary data products,\nwith tutorials and documentation available on GitHub."}
{"id": "2511.04896", "categories": ["astro-ph.HE", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2511.04896", "abs": "https://arxiv.org/abs/2511.04896", "authors": ["Tatsushi Shima"], "title": "On the Energetic Role of Forward Neutrino Scattering in Core-Collapse Supernovae", "comment": "3 pages, 2 figures", "summary": "We revisit neutrino-matter coupling in the post-shock region of core-collapse\nsupernovae by restoring nuclear recoil in coherent neutrino-nucleus scattering\n(CEvNS). The resulting local energy transfer (a few keV per ~10 MeV neutrino)\naccumulates across the ~100 km stalled-shock layer, yielding a total heating of\n10^49-10^50 erg, comparable within an order of magnitude to the increment\nrequired to trigger shock revival in current multidimensional simulations. This\nindicates that the long-standing failure of isoenergetic transport schemes to\nrevive the shock originates from their neglect of recoil kinematics. Because\nthe momentum exchange in each scattering is tiny, the emergent neutrino spectra\nand lepton-number balance remain essentially unchanged. The result highlights\nnuclear recoil as a minimal yet physically grounded correction to standard\nneutrino transport, providing a self-consistent route toward reliable explosion\nmodeling."}
{"id": "2511.04966", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2511.04966", "abs": "https://arxiv.org/abs/2511.04966", "authors": ["Mao Yuan", "Jiarui Niu", "Yi Feng", "Xu-ning Lv", "Chenchen Miao", "Lingqi Meng", "Bo Peng", "Li Deng", "Jingye Yan", "Weiwei Zhu"], "title": "Detecting FRB by DANCE: a method based on DEnsity ANalysis and Cluster Extraction", "comment": "12 pages, 12 figures", "summary": "Fast radio bursts (FRBs) are transient signals exhibiting diverse strengths\nand emission bandwidths. Traditional single-pulse search techniques are widely\nemployed for FRB detection; yet weak, narrow-band bursts often remain\nundetectable due to low signal-to-noise ratios (SNR) in integrated profiles. We\ndeveloped DANCE, a detection tool based on cluster analysis of the original\nspectrum. It is specifically designed to detect and isolate weak, narrow-band\nFRBs, providing direct visual identification of their emission properties. This\nmethod performs density clustering on reconstructed, RFI-cleaned observational\ndata, enabling the extraction of targeted clusters in time-frequency domain\nthat correspond to the genuine FRB emission range. Our simulations show that\nDANCE successfully extracts all true signals with SNR~>5 and achieves a\ndetection precision exceeding 93%. Furthermore, through the practical detection\nof FRB 20201124A, DANCE has demonstrated a significant advantage in finding\npreviously undetectable weak bursts, particularly those with distinct\nnarrow-band features or occurring in proximity to stronger bursts."}
{"id": "2511.04730", "categories": ["astro-ph.IM", "gr-qc"], "pdf": "https://arxiv.org/pdf/2511.04730", "abs": "https://arxiv.org/abs/2511.04730", "authors": ["Yun-Jing Huang", "Chad Hanna", "Leo Tsukada", "Amanda Baylor", "Patrick Godwin", "Prathamesh Joshi", "James Kennington", "Cody Messick", "Surabhi Sachdev", "Ron Tapia", "Zach Yarbrough"], "title": "SGNL: Scalable Low-Latency Gravitational Wave Detection Pipeline for Compact Binary Mergers", "comment": null, "summary": "We present SGNL, a scalable, low-latency gravitational-wave search pipeline.\nIt reimplements the core matched-filtering principles of the GstLAL pipeline\nwithin a modernized framework. The Streaming Graph Navigator library, a\nlightweight Python streaming framework, replaces GstLAL's GStreamer\ninfrastructure, simplifying pipeline construction and enabling flexible,\nmodular graph design. The filtering core is reimplemented in PyTorch, allowing\nSGNL to leverage GPU acceleration for improved computational scalability. We\ndescribe the pipeline architecture and introduce a novel implementation of the\nLow-Latency Online Inspiral Detection algorithm in which components are\npre-synchronized to reduce latency. Results from a 40-day Mock Data Challenge\nshow that SGNL's event recovery and sensitivity are consistent with GstLAL's\nwithin statistical and systematic uncertainties. Notably, SGNL achieves a\nmedian latency of 5.4 seconds, a 42\\% reduction compared to GstLAL's 9.3\nseconds."}
{"id": "2511.05013", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.05013", "abs": "https://arxiv.org/abs/2511.05013", "authors": ["LHAASO collaboration"], "title": "Precise Measurement of Cosmic Ray Light and Helium Spectra above 0.1 Peta-electron-Volt", "comment": null, "summary": "We report a measurement of the cosmic ray helium energy spectrum in the\nenergy interval 0.16 -- 13 PeV, derived by subtracting the proton spectrum from\nthe light component (proton and helium) spectrum obtained with observations\nmade by the Large High Altitude Air Shower Observatory (LHAASO) under a\nconsistent energy scale. The helium spectrum shows a significant hardening\ncentered at $E \\simeq$ 1.1 PeV, followed by a softening at $\\sim$ 7 PeV,\nindicating the appearance of a helium `knee'. Comparing the proton and helium\nspectra in the LHAASO energy range reveals some remarkable facts. In the lower\npart of this range, in contrast to the behavior at lower energies, the helium\nspectrum is significantly softer than the proton spectrum. This results in\nprotons overtaking helium nuclei and becoming the largest cosmic ray component\nat $E \\simeq$ 0.7 PeV. A second crossing of the two spectra is observed at $E\n\\simeq$ 5 PeV, above the proton knee, when helium nuclei overtake protons to\nbecome the largest cosmic ray component again. These results have important\nimplications for our understanding of the Galactic cosmic ray sources."}
{"id": "2511.04792", "categories": ["astro-ph.IM", "astro-ph.CO", "cs.LG"], "pdf": "https://arxiv.org/pdf/2511.04792", "abs": "https://arxiv.org/abs/2511.04792", "authors": ["Gabriel Missael Barco", "Ronan Legin", "Connor Stone", "Yashar Hezaveh", "Laurence Perreault-Levasseur"], "title": "Blind Strong Gravitational Lensing Inversion: Joint Inference of Source and Lens Mass with Score-Based Models", "comment": "18 pages, 9 figures, 1 table. Accepted to the NeurIPS 2025 Workshop\n  on Machine Learning and the Physical Sciences", "summary": "Score-based models can serve as expressive, data-driven priors for scientific\ninverse problems. In strong gravitational lensing, they enable posterior\ninference of a background galaxy from its distorted, multiply-imaged\nobservation. Previous work, however, assumes that the lens mass distribution\n(and thus the forward operator) is known. We relax this assumption by jointly\ninferring the source and a parametric lens-mass profile, using a sampler based\non GibbsDDRM but operating in continuous time. The resulting reconstructions\nyield residuals consistent with the observational noise, and the marginal\nposteriors of the lens parameters recover true values without systematic bias.\nTo our knowledge, this is the first successful demonstration of joint\nsource-and-lens inference with a score-based prior."}
{"id": "2511.05015", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.05015", "abs": "https://arxiv.org/abs/2511.05015", "authors": ["The LHAASO Collaboration"], "title": "LHAASO Detection of Ultra-High-Energy Gamma-Ray Emission toward the Giant Molecular Clouds", "comment": null, "summary": "The $\\gamma$-ray from Giant molecular clouds (GMCs) is regarded as the most\nideal tool to perform in-situ measurement of cosmic ray (CR) density and\nspectra in our Galaxy. We report the first detection of $\\gamma$-ray emissions\nin the very-high-energy (VHE) domain from the five nearby GMCs with a stacking\nanalysis based on a 4.5-year $\\gamma$-ray observation with the Large High\nAltitude Air Shower Observatory (LHAASO) experiment. The spectral energy\ndistributions derived from the GMCs are consistent with the expected\n$\\gamma$-ray flux produced via CR interacting with the ISM in the energy\ninterval 1 - 100 $~\\rm$ TeV. In addition, we investigate the presence of the CR\nspectral `knee' by introducing a spectral break in the $\\gamma$-ray data. While\nno significant evidence for the CR knee is found, the current KM2A measurements\nfrom GMCs strongly favor a proton CR knee located above 0.9$~\\rm$ PeV, which is\nconsistent with the latest measurement of the CR spectrum by ground-based\nexperiments."}
{"id": "2511.05309", "categories": ["astro-ph.IM", "physics.optics"], "pdf": "https://arxiv.org/pdf/2511.05309", "abs": "https://arxiv.org/abs/2511.05309", "authors": ["Gaganpreet Singh", "Rustam Balafendiev", "Mahesh Singh Bist", "Thomas J. L. J. Gascard", "Gagandeep Kaur", "Vid Primožič", "Jon E. Gudmundsson"], "title": "Optimizing broadband microwave absorbers for applications in the 70-200 GHz range", "comment": "9 pages, 10 figures to be submitted to Applied Optics", "summary": "We present results of an extensive suite of numerical simulations that probe\nsquare-tiled microwave absorber performance as a function of material\nproperties, frequency, geometry, and unit cell size. The work, which probes\nboth specular reflection and total absorption, highlights the critical\nimportance of the absorber scale size relative to the incidence wavelength\nwhile suggesting that material properties have a comparatively weaker impact on\noverall performance. We show that some absorber designs can achieve 99.5-99.9%\nfrequency-averaged absorption across the 70 to 200 GHz range for normal\nincidence and that low specular reflectance does not necessarily guarantee\noptimal absorption performance. Our results indicate that exponential,\nKlopfenstein, and linear impedance tapers provide comparable performance as\nlong as a unit cell size of 1 to 4 mm is chosen. Simulation results are\nvalidated against measurements of specular reflectance."}
{"id": "2511.05016", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.05016", "abs": "https://arxiv.org/abs/2511.05016", "authors": ["Chin-Ping Hu", "Naoyuki Ota", "Takuya Takahashi", "Tomoshi Takeda", "Teruaki Enoto", "Toru Tamagawa", "Biswajit Paul", "Sota Watanabe", "Wataru Iwakiri", "Tatehiro Mihara", "Amira Aoyama", "Satoko Iwata", "Kaede Yamasaki", "Takayuki Kita", "Soma Tsuchiya", "Mayu Ichibakase"], "title": "Unveiling the Nature of Superorbital Modulation of SMC X-1 using NinjaSat", "comment": "14 pages, 7 figures, accepted for publication in ApJ", "summary": "We report a long-term, high-cadence timing and spectral observation of the\nX-ray pulsar SMC X-1 using NinjaSat, a 6U CubeSat in low-Earth orbit, covering\nnearly a full superorbital cycle. SMC X-1 is a high-mass X-ray binary\nexhibiting a 0.7 s X-ray pulsar and a non-stationary superorbital modulation\nwith periods ranging from approximately 40 to 65 days. Its peak luminosity of\n$1.3\\times10^{39}$~\\lumcgs\\ makes it a local analogue of ultraluminous X-ray\npulsars powered by supercritical accretion. We find that the spin-up rate\nduring the high state remains consistent with the long-term average, with no\nsignificant correlation between spin-up rate and flux. This result indicates\nthat the modulation is primarily geometric rather than accretion-driven. The\nhardness ratio and spectral shape are stable throughout the entire superorbital\ncycle, supporting obscuration by optically thick material or energy-independent\nscattering. In addition, the 2--20 keV pulse profile varies with superorbital\nphase, which may be explained either by variable covering fraction due to\ngeometric obscuration, or by free precession of the neutron star. This\nrepresents the first complete measurement of spin-up rate and spectral\nevolution across a single superorbital cycle in SMC X-1, highlighting the\nscientific capability of CubeSat-based observatories."}
{"id": "2511.05439", "categories": ["astro-ph.IM", "astro-ph.CO"], "pdf": "https://arxiv.org/pdf/2511.05439", "abs": "https://arxiv.org/abs/2511.05439", "authors": ["Aayush Saxena"], "title": "Unsupervised Discovery of High-Redshift Galaxy Populations with Variational Autoencoders", "comment": "5 Pages, 2 Figures, Accepted at the Machine Learning and the Physical\n  Sciences Workshop at Neural Information Processing Systems 2025 (NeurIPS\n  2025)", "summary": "We apply variational autoencoders to automatically discover galaxy\npopulations using publicly available high-redshift \\textit{JWST} spectra\nwithout prior classification knowledge. Our unsupervised method identifies\ndistinct astrophysical classes of unique and exciting galaxy types,\ndemonstrating automated discovery capabilities for large spectroscopic surveys."}
{"id": "2511.05062", "categories": ["astro-ph.HE", "gr-qc", "hep-ph"], "pdf": "https://arxiv.org/pdf/2511.05062", "abs": "https://arxiv.org/abs/2511.05062", "authors": ["Yu-Chen Hua", "Xiao-Jun Bi", "Yu-Ming Yang", "Peng-Fei Yin"], "title": "Probing Lorentz Invariance Violation at High Energies Using LHAASO Observations of GRB221009A via DisCan Algorithm", "comment": "13 pages, 11 figures, 1 table", "summary": "The Lorentz invariance violation (LIV) predicted by some quantum gravity\ntheories would manifest as an energy-dependent speed of light, which may\npotentially distort the observed temporal profile of photons from astrophysical\nsources at cosmological distances. The dispersion cancellation (DisCan)\nalgorithm offers a powerful methodology for investigating such effects by\nemploying quantities such as Shannon entropy, which reflects the initial\ntemporal characteristics. In this study, we apply the DisCan algorithm to\nsearch for LIV effects in the LHAASO observations of GRB 221009A, combining\ndata from both the WCDA and KM2A detectors that collectively span an energy\nrange of $\\sim 0.2-13$ TeV. Our analysis accounts for the uncertainties from\nboth energy resolution and temporal binning. We derive $95\\%$ confidence level\nlower limits on the LIV energy scale of $E_{\\rm{QG}}/10^{19}~\\text{GeV}>21.1$\n(13.8) for the first-order subluminal (superluminal) scenario, and\n$E_{\\rm{QG}}/10^{11}~\\text{GeV}> 14.9$ (13.7) for the second-order subluminal\n(superluminal) scenario."}
{"id": "2511.05470", "categories": ["astro-ph.IM", "astro-ph.CO"], "pdf": "https://arxiv.org/pdf/2511.05470", "abs": "https://arxiv.org/abs/2511.05470", "authors": ["Dily Duan Yi Ong", "Will Handley"], "title": "$\\texttt{unimpeded}$: A Public Nested Sampling Database for Bayesian Cosmology", "comment": null, "summary": "Bayesian inference is central to modern cosmology. While parameter estimation\nis achievable with unnormalised posteriors traditionally obtained via MCMC\nmethods, comprehensive model comparison and tension quantification require\nBayesian evidences and normalised posteriors, which remain computationally\nprohibitive for many researchers. To address this, we present\n$\\texttt{unimpeded}$, a publicly available Python library and data repository\nproviding DiRAC-funded (DP192 and 264) pre-computed nested sampling and MCMC\nchains with their normalised posterior samples, computed using\n$\\texttt{Cobaya}$ and the Boltzmann solver $\\texttt{CAMB}$.\n$\\texttt{unimpeded}$ delivers systematic analysis across a grid of eight\ncosmological models (including $\\Lambda$CDM and seven extensions) and 39 modern\ncosmological datasets (comprising individual probes and their pairwise\ncombinations). The built-in tension statistics calculator enables rapid\ncomputation of six tension quantification metrics. All chains are hosted on\nZenodo with permanent access via the unimpeded API, analogous to the renowned\nPlanck Legacy Archive but utilising nested sampling in addition to traditional\nMCMC methods."}
{"id": "2511.05075", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.05075", "abs": "https://arxiv.org/abs/2511.05075", "authors": ["Zhu-Ling Deng", "Xiang-Dong Li", "Yong Shao", "Ying-Han Mao", "Long Jiang"], "title": "Formation of millisecond pulsar-helium star binaries", "comment": "Accepted by A&A. 12 pages, including 6 figures", "summary": "PSR J1928+1815, the first recycled pulsar-helium (He) star binary discovered\nby the Five-hundred-meter Aperture Spherical radio Telescope, consists of a\n10.55 ms pulsar and a companion star with mass $1-1.6\\,M_{\\sun}$ in a 0.15-day\norbit. Theoretical studies suggest that this system originated from a neutron\nstar (NS) intermediate-mass or high-mass X-ray binary that underwent common\nenvelope (CE) evolution, leading to the successful ejection of the giant\nenvelope. The traditional view is that hypercritical accretion during the CE\nphase may have recycled the NS. However, the specific mechanism responsible for\naccelerating its spin period remains uncertain due to the complex processes\ninvolved in CE evolution.In this study, we investigate the influence of Roche\nlobe overflow (RLO) accretion that takes place prior to the CE phase on the\nspin evolution of NSs. Our primary objective is to clarify how this process\naffects the spin characteristics of pulsars. We utilized the stellar evolution\ncode \\texttt{MESA} and the binary population synthesis code \\texttt{BSE} to\nmodel the formation and evolution of NS-He star binaries. We calculated the\ndistributions of the orbital period, He star mass, NS spin period, and magnetic\nfield for NS + He star systems in the Galaxy. Our results indicate that RLO\naccretion preceding the CE phase could spin up NSs to millisecond periods\nthrough super-Eddington accretion. Considering a range of CE efficiencies\n$\\alpha_{\\rm CE}$ from 0.3 to 3, we estimate the birthrate (total number) of NS\n+ He star systems in our Galaxy to be 9.0$\\times 10^{-5}$ yr$^{-1}$ (626\nsystems) to 1.9$\\times 10^{-4}$ yr$^{-1}$ (2684 systems)."}
{"id": "2511.04810", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2511.04810", "abs": "https://arxiv.org/abs/2511.04810", "authors": ["Alexander Lange", "B. B. K"], "title": "FermiPhased: A tool for phase-resolved likelihood analysis of Fermi-LAT data", "comment": "8 pages, 7 figures. To be submitted to the Open Journal of\n  Astrophysics", "summary": "The Fermi Large Area Telescope has enabled detailed studies of high-energy\nastrophysical sources. To support analysis, we present FermiPhased, a flexible,\nopen-source tool for phase-resolved studies of pulsars, binaries, and other\nperiodically variable sources. Built on the Fermipy framework, FermiPhased\noffers three modes: standard, adaptive (fixed counts), and joint phase-resolved\nanalysis, enabling users to flexibly bin data based on phase, count statistics,\nor jointly fit different epochs of interest. FermiPhased is optimized for\nparallel execution and use on computing clusters. It enables parallelized\nextraction of phase-resolved fluxes, spectra, and intermediary data products,\nwith tutorials and documentation available on GitHub."}
{"id": "2511.05123", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.05123", "abs": "https://arxiv.org/abs/2511.05123", "authors": ["R. Brivio", "S. Covino", "M. Ferro", "A. Saccardi", "A. Martin-Carrillo", "A. Kuwata", "K. Toma", "P. D'Avanzo", "Y. -D. Hu", "L. Izzo", "S. Kobayashi", "T. Laskar", "G. Leloudas", "D. B. Malesani", "M. Pursiainen", "S. Vergani", "K. Wiersema", "S. Bloemen", "S. Campana", "V. D'Elia", "S. de Wet", "M. de Pasquale", "P. J. Groot", "P. Jakobsson", "J. Mao", "A. Melandri", "G. Pugliese", "A. Rossi", "R. Salvaterra", "B. Schneider", "N. R. Tanvir", "J. van Roestel", "P. M. Vreeswijk", "T. Zafar"], "title": "The most distant optically polarised GRB afterglow: GRB 240419A at z = 5.178", "comment": null, "summary": "Gamma-ray bursts (GRBs) are extremely bright phenomena powered by\nrelativistic jets arising from explosive events at cosmological distances. The\nnature of the jet and the configuration of the local magnetic fields are still\nunclear, with the distinction between different models possibly provided by the\ndetection of early-time polarisation. Past observations do not agree on a\nuniversal scenario describing early-time polarisation in GRB afterglows, and\nnew studies are necessary to investigate this open question. We present here\nthe discovery of GRB\\,240419A, its redshift determination of $z=5.178$, its\nearly-time optical polarimetry observations, and the multi-wavelength\nmonitoring of its afterglow. We analysed three epochs of polarimetric data to\nderive the early-time evolution of the polarisation. The multi-wavelength light\ncurve from the X-rays to the near-infrared band was also investigated to give a\nbroader perspective on the whole event. We find a high level of polarisation,\n$P=6.97^{+1.84}_{-1.52}$\\,\\%, at 1740~s after the GRB trigger, followed by a\nslight decrease up to $P=4.81^{+1.87}_{-1.53}$\\,\\% at 3059~s. On the same\ntimescale, the polarisation position angle is nearly constant. The multi-band\nafterglow at the time of the polarisation measurements is consistent with a\nforward shock (FS), while the earlier evolution at $t-t_0\\lesssim700$ s can be\nassociated with the interplay between the forward and the reverse shocks or\nwith energy injection. The detected polarised radiation when the afterglow is\nFS-dominated and the stable position angle are consistent with an ordered\nmagnetic field plus a turbulent component driven by large-scale\nmagnetohydrodynamic instabilities. The lack of a jet break in the light curve\nprevents a comparison of the polarisation temporal evolution with theoretical\nexpectations from magnetic fields amplified by microscopic-scale turbulence,\nlimiting ..."}
{"id": "2511.04966", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2511.04966", "abs": "https://arxiv.org/abs/2511.04966", "authors": ["Mao Yuan", "Jiarui Niu", "Yi Feng", "Xu-ning Lv", "Chenchen Miao", "Lingqi Meng", "Bo Peng", "Li Deng", "Jingye Yan", "Weiwei Zhu"], "title": "Detecting FRB by DANCE: a method based on DEnsity ANalysis and Cluster Extraction", "comment": "12 pages, 12 figures", "summary": "Fast radio bursts (FRBs) are transient signals exhibiting diverse strengths\nand emission bandwidths. Traditional single-pulse search techniques are widely\nemployed for FRB detection; yet weak, narrow-band bursts often remain\nundetectable due to low signal-to-noise ratios (SNR) in integrated profiles. We\ndeveloped DANCE, a detection tool based on cluster analysis of the original\nspectrum. It is specifically designed to detect and isolate weak, narrow-band\nFRBs, providing direct visual identification of their emission properties. This\nmethod performs density clustering on reconstructed, RFI-cleaned observational\ndata, enabling the extraction of targeted clusters in time-frequency domain\nthat correspond to the genuine FRB emission range. Our simulations show that\nDANCE successfully extracts all true signals with SNR~>5 and achieves a\ndetection precision exceeding 93%. Furthermore, through the practical detection\nof FRB 20201124A, DANCE has demonstrated a significant advantage in finding\npreviously undetectable weak bursts, particularly those with distinct\nnarrow-band features or occurring in proximity to stronger bursts."}
{"id": "2511.05144", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.05144", "abs": "https://arxiv.org/abs/2511.05144", "authors": ["Lei He", "Liang-Gui Zhu", "Zheng-Yan Liu", "Rui Niu", "Chao Wei", "Bing-Zhou Gao", "Ming-Shen Zhou", "Run-Duo Liang", "Ken Chen", "Jian-Min Wang", "Ning Jiang", "Zhen-Yi Cai", "Ji-an Jiang", "Zi-Gao Dai", "Ye-Fei Yuan", "Jian Li", "Wen Zhao"], "title": "Searching for Electromagnetic Counterpart Candidates to GW231123", "comment": "10 pages, 3 figures, comments are welcome", "summary": "The detection of GW231123, a gravitational-wave (GW) event with exceptionally\nmassive and rapidly spinning black holes, suggests the possible formation\nwithin an active galactic nucleus (AGN) disk, which provides a favorable\nenvironment for potentially generating an observable electromagnetic (EM)\ncounterpart. We conduct a search for such a counterpart by crossmatching the GW\nlocalization with a comprehensive catalog of AGN flares from the Zwicky\nTransient Facility. Our analysis yields six plausible optical flare candidates\nthat are spatially and temporally coincident with GW231123 and exhibit\nsignificant deviations from their AGN baseline flux. Although these candidates\nrepresent a crucial first step, their true nature remains inconclusive.\nConfirming any one of these flares via future observations would provide a\nlandmark validation of the AGN formation channel and unlock the multi-messenger\npotential of this extraordinary merger."}
{"id": "2511.05268", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.05268", "abs": "https://arxiv.org/abs/2511.05268", "authors": ["Haoyang Zhang", "Shenbang Yang", "Li Zhang", "Benzhong Dai"], "title": "A Mass-Independent Damping Timescale in Black Hole Accretion Systems", "comment": "12 pages, 5 figures", "summary": "The scaling laws reveal the underlying structural similarities shared by\nastrophysical systems across vastly different scales. In black hole accretion\nsystems, the scaling relations between the characteristic damping timescales\n(CDTs) of light curves and black hole mass offer valuable insights into the\nunderlying physical structure of accretion disks. We investigate, for the first\ntime, the long-term hard X-ray variability of black hole and neutron star\naccretion systems using light curves from the \\textit{Swift} Burst Alert\nTelescope 157-month catalog. Applying a damped random walk model, we measure\nCDTs for 39 Seyfert galaxies, 17 blazars, 82 X-ray binaries, and one tidal\ndisruption event. Unexpectedly, these CDTs span months to years but with a\nmass-independent feature, in contrast to well-established scaling laws. This\npuzzling phenomenon can be attributed to conductive timescales arising from\ndisk--corona interactions, instead of the intrinsic accretion disk processes\ncharacterized by scaling laws, and it may further modulate jet emission in\nblazars. This result demonstrates thermal conduction as a key mechanism driving\nhard X-ray variability and offers new observational evidence for the\ndisk--corona--jet connection."}
{"id": "2511.05284", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.05284", "abs": "https://arxiv.org/abs/2511.05284", "authors": ["Julian Saffer"], "title": "Spectrum of PeV Cosmic-Ray Protons and Helium Nuclei with IceCube", "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC2025)", "summary": "The IceCube Observatory comprises a cubic-kilometer particle detector deep in\nthe Antarctic ice and the cosmic-ray air-shower array IceTop at the surface\nabove. Previous analyses of the cosmic-ray composition have used coincident\nevents with IceTop detecting the electromagnetic shower footprint as well as\nGeV muons, while the sensors submerged in the ice measure the TeV muons from\nthe same events. The energy range of previous composition analyses, however,\nhas been limited to 3 PeV primary energy and above, whereas the IceTop\nall-particle energy spectrum has been extended down to 250 TeV. This\ncontribution presents a method to reconstruct the combined spectrum of\ncosmic-ray protons and helium nuclei, starting at 200 TeV primary energy. The\nresulting H+He spectrum closes the gap in the measurements of light cosmic rays\nbetween IceCube as well as KASCADE and experiments measuring in the TeV energy\nrange, such as DAMPE and HAWC."}
{"id": "2511.05316", "categories": ["astro-ph.HE", "gr-qc"], "pdf": "https://arxiv.org/pdf/2511.05316", "abs": "https://arxiv.org/abs/2511.05316", "authors": ["Hui Tong", "Thomas A. Callister", "Maya Fishbach", "Eric Thrane", "Fabio Antonini", "Simon Stevenson", "Isobel M. Romero-Shaw", "Fani Dosopoulou"], "title": "A subpopulation of low-mass, spinning black holes: signatures of dynamical assembly", "comment": null, "summary": "Gravitational-wave observations of massive, rapidly spinning binary black\nholes mergers provide increasing evidence for the dynamical origin of some\nmergers. Previous studies have interpreted the mergers with primary mass\n$\\gtrsim45\\,M_\\odot$ as being dominated by hierarchical, second-generation\nmergers, with rapidly spinning primaries being the products of previous black\nhole mergers assembled in dense stellar clusters. In this work, we reveal\nconfident evidence of another subpopulation with rapid and isotropic spins at\nlow mass containing the two exceptional events GW241011 and GW241110,\nconsistent with a hierarchical merger hypothesis. Our result suggests the mass\ndistribution of the second-generation black holes is peaked at low primary\nmasses of $\\sim16\\,M_\\odot$ rather than $\\gtrsim45\\,M_\\odot$ in the\npair-instability gap. Such low-mass second-generation black holes must be\nformed from the merger of even lighter first-generation black holes, implying\nthat dense, metal-rich stellar environments contribute to the binary black hole\npopulation. By separating the contamination of higher-generation black holes,\nour result reveals the primary mass distribution of first-generation black\nholes formed from stellar collapse, which shows a significant dip between\n$\\sim12\\,M_\\odot$ to $\\sim20\\,M_\\odot$. This may indicate a dearth of black\nholes due to variation in the core compactness of the progenitor."}
{"id": "2511.05409", "categories": ["astro-ph.HE", "hep-ex"], "pdf": "https://arxiv.org/pdf/2511.05409", "abs": "https://arxiv.org/abs/2511.05409", "authors": ["DAMPE Collaboration", "Francesca Alemanno", "Qi An", "Philipp Azzarello", "Felicia-Carla-Tiziana Barbato", "Paolo Bernardini", "Xiao-Jun Bi", "Hugo Valentin Boutin", "Irene Cagnoli", "Ming-Sheng Cai", "Elisabetta Casilli", "Jin Chang", "Deng-Yi Chen", "Jun-Ling Chen", "Zhan-Fang Chen", "Zi-Xuan Chen", "Paul Coppin", "Ming-Yang Cui", "Tian-Shu Cui", "Ivan De Mitri", "Francesco de Palma", "Adriano Di Giovanni", "Tie-Kuang Dong", "Zhen-Xing Dong", "Giacinto Donvito", "Jing-Lai Duan", "Kai-Kai Duan", "Rui-Rui Fan", "Yi-Zhong Fan", "Fang Fang", "Kun Fang", "Chang-Qing Feng", "Lei Feng", "Sara Fogliacco", "Jennifer-Maria Frieden", "Piergiorgio Fusco", "Min Gao", "Fabio Gargano", "Essna Ghose", "Ke Gong", "Yi-Zhong Gong", "Dong-Ya Guo", "Jian-Hua Guo", "Shuang-Xue Han", "Yi-Ming Hu", "Guang-Shun Huang", "Xiao-Yuan Huang", "Yong-Yi Huang", "Maria Ionica", "Lu-Yao Jiang", "Wei Jiang", "Yao-Zu Jiang", "Jie Kong", "Andrii Kotenko", "Dimitrios Kyratzis", "Shi-Jun Lei", "Bo Li", "Manbing Li", "Wei-Liang Li", "Wen-Hao Li", "Xiang Li", "Xian-Qiang Li", "Yao-Ming Liang", "Cheng-Ming Liu", "Hao Liu", "Jie Liu", "Shu-Bin Liu", "Yang Liu", "Francesco Loparco", "Miao Ma", "Peng-Xiong Ma", "Tao Ma", "Xiao-Yong Ma", "Giovanni Marsella", "Mario-Nicola Mazziotta", "Dan Mo", "Yu Nie", "Xiao-Yang Niu", "Andrea Parenti", "Wen-Xi Peng", "Xiao-Yan Peng", "Chiara Perrina", "Enzo Putti-Garcia", "Rui Qiao", "Jia-Ning Rao", "Yi Rong", "Andrea Serpolla", "Ritabrata Sarkar", "Pierpaolo Savina", "Zhi Shangguan", "Wei-Hua Shen", "Zhao-Qiang Shen", "Zhong-Tao Shen", "Leandro Silveri", "Jing-Xing Song", "Hong Su", "Meng Su", "Hao-Ran Sun", "Zhi-Yu Sun", "Antonio Surdo", "Xue-Jian Teng", "Andrii Tykhonov", "Gui-Fu Wang", "Jin-Zhou Wang", "Lian-Guo Wang", "Shen Wang", "Xiao-Lian Wang", "Yan-Fang Wang", "Da-Ming Wei", "Jia-Ju Wei", "Yi-Feng Wei", "Di Wu", "Jian Wu", "Sha-Sha Wu", "Xin Wu", "Zi-Qing Xia", "Zheng Xiong", "En-Heng Xu", "Hai-Tao Xu", "Jing Xu", "Zhi-Hui Xu", "Zi-Zong Xu", "Zun-Lei Xu", "Guo-Feng Xue", "Ming-Yu Yan", "Hai-Bo Yang", "Peng Yang", "Ya-Qing Yang", "Hui-Jun Yao", "Yu-Hong Yu", "Qiang Yuan", "Chuan Yue", "Jing-Jing Zang", "Sheng-Xia Zhang", "Wen-Zhang Zhang", "Yan Zhang", "Ya-Peng Zhang", "Yi Zhang", "Yong-Jie Zhang", "Yong-Qiang Zhang", "Yun-Long Zhang", "Zhe Zhang", "Zhi-Yong Zhang", "Cong Zhao", "Hong-Yun Zhao", "Xun-Feng Zhao", "Chang-Yi Zhou", "Xun Zhu", "Yan Zhu"], "title": "Charge-dependent spectral softenings of primary cosmic-rays from proton to iron below the knee", "comment": null, "summary": "In most particle acceleration mechanisms, the maximum energy of the cosmic\nrays can achieve is charge dependent. However, the observational verification\nof such a fundamental relation is still lack due to the difficulty of measuring\nthe spectra of individual particles from one (kind of) source(s) up to very\nhigh energies. This work reports direct measurements of the carbon, oxygen, and\niron spectra from ~ 20 gigavolts to ~ 100 teravolts (~ 60 teravolts for iron)\nwith 9 years of on-orbit data collected by the Dark Matter Particle Explorer\n(DAMPE). Distinct spectral softenings have been directly detected in these\nspectra for the first time. Combined with the updated proton and helium\nspectra, the spectral softening appears universally at a rigidity of ~ 15\nteravolts. A nuclei mass dependent softening is rejected at a confidence level\nof > 99.999%. Taking into account the correlated structures at similar energies\nin the large-scale anisotropies of cosmic rays, one of the most natural\ninterpretations of the spectral structures is the presence of a nearby cosmic\nray source. In this case, the softening energies correspond to the acceleration\nupper limits of such a source, forming the so-called Peters cycle of the\nspectra. The results thus offer observational verification of the long-standing\nprediction of the charge-dependent energy limit of cosmic ray acceleration."}
{"id": "2511.05419", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.05419", "abs": "https://arxiv.org/abs/2511.05419", "authors": ["A. Pasetto", "O. Vilchis", "A. Bonafede", "E. F. Jiménez-Andrade", "K. Rajpurohit", "E. Murphy"], "title": "Crossing the veil of the brightest radio relic in the sky MACS J0717.6+3745", "comment": "Accepted for publication to MNRAS", "summary": "We present high-frequency, full-polarisation Jansky Very Large Array (VLA)\nradio data at X-band of the radio relic: MACS J0717.5+3745. Radio relics trace\nshock waves in the intracluster medium (ICM) produced during mergers.\nUnderstanding the physical characteristics of relics is important for\ndetermining their nature, whether for example they are thermal ICM electrons\nthat are accelerated, or whether they are fossil electrons re-accelerated by a\nmerger event. Radio spectropolarimetric analysis, such as the Stokes\nQU-fitting, provides a diagnostic of the nature and structure of the magnetized\nplasma internal or external to the source, with important implications for\ntheoretical models. The high-frequency polarisation analysis presented here\nshows, for the first time, a change in the magneto-ionic structure compared to\nthe low-frequency data available in the literature. These high-frequency,\npolarised data could be interpreted also with an internal depolarisation\nbehaviour and this new finding may be used to investigate possible particle\nacceleration mechanism. If that is true, the change in the behaviour of the\npolarised signal could be tracing physical properties of a population of\nnon-thermal particles that are undergoing to a re-acceleration of particles in\nthe relic by large-scale internal shocks of Active Galactic Nuclei jet fossil\nparticles ejected from the central Narrow Angle Tail radio galaxy. New upcoming\nbroad-band VLA X- and Ku-bands data will clarify this. Finally, we conclude\nthat high-frequency, high-sensitive, spectropolarimetric radio data should be\nexplored further, as they can effectively trace shock fronts and thereby\nprovide insights into the intrinsic magneto-ionic properties of radio\ncomponents."}
{"id": "2511.05473", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.05473", "abs": "https://arxiv.org/abs/2511.05473", "authors": ["Agnieszka Janiuk", "Joseph Saji", "Gerardo Urrutia"], "title": "Chemical Evolution and Kilonova Implications of Post-Merger Accretion Disk Winds", "comment": "16 pages, 15 figures; submitted", "summary": "Several gamma ray bursts have recently been associated with a kilonova\nemission. We study the mechanisms which could account for this effect, by means\nof radioactive decay of elements synthesized in accretion disk wind. We model\nthe r-process nucleosynthesis in the accretion disk wind system, asscociated\nwith the prompt GRB phase. We compute the time-dependent GR MHD evolution of a\nGRB central engine where the newly formed black hole is accreting the mass from\npost-merger remnant. We explore the wind properties, for a range of the initial\nparameters of the system, and study representative cases for compact binary\nmerger progenitors. We compute a suite of 2D and 3D time-dependent General\nRelativistic numerical simulations with a tabulated 3-parameter equation of\nstate that allows for evolution of chemical composition evolution of the\naccretion flow. The neutrino emission is accounted for by incorporating the\nleakage scheme, where neutrino optical depth is calculated along the radial\nrays. We parameterize the optically thick and thin tori with different values\nof the pressure maximum and entropy in the disk, while the strength of\nlarge-scale poloidal magnetic fields is parameterized according to the chosen\ngas-to-magnetic pressure ratio. To probe the winds, we follow the particle\ntrajectories. Upon this, we derive the nucleosynthetic yields of heavy elements\nin the outflows, and we map the regions of Lanthanide rich and poor ejecta. We\nfind that the outflow carries high mass of neutron rich material expanding with\nmildly relativistic velocities. Our accretion disks operating under the SANE\nmode can power the GRB jets via neutrino annihilation, if the disk to BH mass\nratio is larger than about 0.01 and the black hole is spinning. Slowly spinning\nblack holes surrounded by massive post-merger disks can power these jets, and\nalso be the sites of efficient nucleosynthesis of Lanthanides."}
