{"id": "2510.23700", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.23700", "abs": "https://arxiv.org/abs/2510.23700", "authors": ["Rebecca Diesing", "Ludwig Böss", "Damiano Caprioli"], "title": "Shock Acceleration in the Intracluster Medium: Implications of Micromirror Confinement", "comment": "10 pages, 5 figures, submitted to ApJ", "summary": "Merging galaxy clusters exhibit strong observational evidence for efficient\nparticle acceleration in the intracluster medium (ICM), particularly in the\nform of synchrotron-emitting radio relics and halos. Cosmic ray (CR) electrons\nare likely accelerated (or re-accelerated) at merger and accretion shocks via\ndiffusive shock acceleration (DSA). However, in the presence of the large\ndiffusion coefficients one would naively expect in the rarefied, relatively\nunmagnetized ICM, this acceleration--in particular, the maximum proton energy\n($E_{\\rm max}$)--is limited by long acceleration times. On the other hand,\nrecent work on CR transport suggests that the diffusion coefficient can be\nsuppressed in ICM-like environments. In this picture, deviations from local\nthermodynamic equilibrium can trigger the mirror instability, creating\nplasma-scale magnetic structures, or \"micromirrors,\" that efficiently scatter\nCRs. In this paper, we investigate the implications of micromirror confinement\nfor shock acceleration in the ICM. We demonstrate that micromirrors enforce a\nminimum value of $E_{\\rm max} \\gtrsim 100$ GeV that does not rely on CR-driven\nmagnetic field amplification. We also discuss micromirror confinement in the\ncontext of cosmological simulations and $\\gamma$-ray observations, and present\na simulation of a Coma-like merging cluster that self-consistently includes CR\nacceleration at shocks, with an effective diffusion coefficient set by\nmicromirrors. We show that the introduction of micromirrors yields simulated\ngalaxy clusters that remain consistent with $\\gamma$-ray observations."}
{"id": "2510.23723", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.23723", "abs": "https://arxiv.org/abs/2510.23723", "authors": ["Xander J. Hall", "Antonella Palmese", "Brendan O'Connor", "Daniel Gruen", "Malte Busmann", "Julius Gassert", "Lei Hu", "Ignacio Magana Hernandez", "Jessica Nicole Aguilar", "Ariel Amsellem", "Steven Ahlen", "John Banovetz", "Segev BenZvi", "Davide Bianchi", "David Brooks", "Francisco Javier Castander", "Todd Claybaugh", "Andrei Cuceu", "Arjun Dey", "Peter Doel", "Jennifer Faba-Moreno", "Simone Ferraro", "Andreu Font-Ribera", "Jaime E. Forero-Romero", "Gaston Gutierrez", "Laurent Le Guillou", "Dick Joyce", "Theodore Kisner", "Anthony Kremin", "Ofer Lahav", "Claire Lamman", "Martin Landriau", "Michael Levi", "Axel de la Macorra", "Marc Manera", "Aaron Meisner", "Ramon Miquel", "John Moustakas", "Seshadri Nadathur", "Francisco Prada", "Ignasi Perez-Rafols", "Graziano Rossi", "Eusebio Sanchez", "David Schlegel", "Michael Schubnell", "David Sprayberry", "Gregory Tarle", "Benjamin Alan Weaver", "Rongpu Zhou", "Hu Zou"], "title": "AT2025ulz and S250818k: Leveraging DESI spectroscopy in the hunt for a kilonova associated with a sub-solar mass gravitational wave candidate", "comment": null, "summary": "On August 18th, 2025, the LIGO--Virgo--KAGRA collaboration reported a\nsub-threshold gravitational wave candidate detection consistent with a\nsub-solar-mass neutron star merger, denoted S250818k. An optical transient,\nAT2025ulz, was discovered within the localization region. AT2025ulz initially\nappeared to meet the expected behavior of kilonova (KN) emission, the telltale\nsignature of a binary neutron star merger. The transient subsequently\nrebrightened after $\\sim$\\,$5$ days and developed spectral features\ncharacteristic of a Type IIb supernova. In this work, we analyze the\nobservations of the host galaxy of AT2025ulz obtained by the Dark Energy\nSpectroscopic Instrument (DESI). From the DESI spectrum, we obtain a secure\nredshift of $z = 0.084840 \\pm 0.000006$, which places the transient within\n$2\\sigma$ of the gravitational wave distance and results in an integral overlap\nbetween the gravitational wave alert and the transient location of\n$\\log_{10}\\mathcal{I} \\approx 3.9-4.2$. Our analysis of the host galaxy's\nspectral energy distribution reveals a star-forming, dusty galaxy with stellar\nmass ${\\sim} 10^{10}~M_\\odot$, broadly consistent with the population of both\nshort gamma-ray bursts and core-collapse supernova host galaxies. We also\npresent our follow-up of DESI-selected candidate host galaxies using the\nFraunhofer Telescope at the Wendelstein Observatory, and show the promise of\nDESI for associating or rejecting candidate electromagnetic counterparts to\ngravitational wave alerts. These results emphasize the value of DESI's\nextensive spectroscopic dataset in rapidly characterizing host galaxies,\nenabling spectroscopic host subtraction, and guiding targeted follow-up."}
{"id": "2510.23724", "categories": ["astro-ph.HE", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2510.23724", "abs": "https://arxiv.org/abs/2510.23724", "authors": ["Mayusree Das", "Banibrata Mukhopadhyay", "Tomasz Bulik"], "title": "Continuous gravitational waves from magnetized white dwarfs: Quantifying the detection plausibility by LISA", "comment": "16 pages including 14 figures and 1 table; accepted for publication\n  in The Astrophysical Journal", "summary": "White dwarfs (WDs) are frequently observed to have strong magnetic fields up\nto $10^9$ G and expected to have a possible internal field as high as $\\sim\n10^{14}$ G. High internal fields can significantly deform a WD's equilibrium\nstructure, generating a quadrupole moment. If the rotation axis is misaligned\nwith the magnetic axis, the deformation can lead to the emission of continuous\ngravitational waves (CGWs). We examine the potential for detecting CGWs from\nmagnetized WDs with future space-based detectors such as LISA, ALIA, DECIGO,\nDeci-Hz, BBO and TianQin. We model the field-induced deformation and compute\nthe resulting GW strain, incorporating amplitude decay due to angular momentum\nloss from electromagnetic and gravitational radiation. This sets a timescale\nfor detection -`active timescale' of $10^{5-6}$ yr, requiring observation while\nthe object remains sufficiently young. Our results suggest that LISA could\ndetect a few dozens of highly magnetized WDs across the Galaxy during its\nmission. As a specific case, we investigate ZTF J1901+1458- a compact, massive,\nfast-rotating, and strongly magnetized WD with spin period $\\sim416$ s and\ninferred surface field $\\sim10^{9}$ G. We find that this object would be\ndetectable by LISA with four years of continuous data. This highlights the\npotential of CGW observations to probe magnetic field structure in WDs and\ntheir role in type Ia supernova progenitors."}
{"id": "2510.23728", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.23728", "abs": "https://arxiv.org/abs/2510.23728", "authors": ["Brendan O'Connor", "Roberto Ricci", "Eleonora Troja", "Antonella Palmese", "Yu-Han Yang", "Geoffrey Ryan", "Hendrik van Eerten", "Muskan Yadav", "Xander J. Hall", "Ariel Amsellem", "Rosa L. Becerra", "Malte Busmann", "Tomas Cabrera", "Simone Dichiara", "Lei Hu", "Ravjit Kaur", "Keerthi Kunnumkai", "Ignacio Magana Hernandez"], "title": "AT2025ulz and S250818k: Deep X-ray and radio limits on off-axis afterglow emission and prospects for future discovery", "comment": "Accepted for publication in ApJL on 10/22/2025", "summary": "The first joint electromagentic (EM) and gravitational wave (GW) detection,\nknown as GW170817, marked a critical juncture in our collective understanding\nof compact object mergers. However, it has now been 8 years since this\ndiscovery, and the search for a second EM-GW detection has yielded no robust\ndiscoveries. Recently, on August 18, 2025, the LIGO-Virgo-KAGRA collaboration\nreported a low-significance (high false alarm rate) binary neutron star merger\ncandidate S250818k. Rapid optical follow-up revealed a single optical candidate\nAT2025ulz ($z=0.08484$) that initially appeared consistent with kilonova\nemission. We quickly initiated a set of observations with \\textit{Swift},\n\\textit{XMM-Newton}, \\textit{Chandra}, and the Very Large Array to search for\nnon-thermal afterglow emission. Our deep X-ray and radio search rules out that\nthe optical rebrightening of AT2025ulz is related to the afterglow onset,\nreinforcing its classification as a stripped-envelope supernova (SN 2025ulz).\nWe derive constraints on the afterglow parameters for a hypothetical binary\nneutron star merger at the distance of AT2025ulz ($\\approx 400$ Mpc) based on\nour X-ray and radio limits. We conclude that our observational campaign could\nexclude a GW170817-like afterglow out to viewing angles of\n$\\theta_\\textrm{v}\\approx 12.5$ degrees. We briefly discuss the prospects for\nthe future discovery of off-axis afterglows."}
{"id": "2510.23694", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2510.23694", "abs": "https://arxiv.org/abs/2510.23694", "authors": ["Luigi \"Rolly'' BEDIN"], "title": "The case for an Astrometric Mission Extension of Euclid. Extending Gaia by 6 magnitudes with Euclid covering one-third of the sky", "comment": "10(+App.2) pages, 3(+App.1) low-res. figures. Accepted for\n  publication on Astronomy & Astrophysics (A&A) on 27th October 2025.\n  Manuscript ID: AA57407-25. Comments are welcome", "summary": "The nominal duration of Euclid's main mission is six years, but current best\nestimates indicate that the observatory has sufficient propellant to operate\nfor up to ~14 years in total. In this work, we advocate dedicating six of these\n~8 additional years to repeating the main survey, covering approximately\none-third of the sky. This repetition would not only improve the sampling,\nsignal-to-noise, quality, and depth of the survey, but -- most importantly --\nwould provide a six-year time baseline between two epochs if executed in the\nsame sequence. The availability of multiple epochs would enable the derivation\nof proper motions for stars as faint as V~27, i.e., more than five magnitudes\nfainter than those measured by the Gaia mission. Although it may seem early to\npropose such a mission extension, in this work we quantitatively illustrate its\nimmense scientific potential. We therefore intend to initiate the technical and\nscientific discussions early to ensure optimal planning. The here proposed\nextension would employ only the VIS channel -- owing to its superior\nastrometric capability and depth -- while simultaneously using NISP in\nslitless-spectroscopy mode to enhance the signal-to-noise ratio of first-epoch\nspectra that would also benefit of proper motions to identify and reject\nobjects within the local Universe."}
{"id": "2510.23729", "categories": ["astro-ph.HE", "physics.comp-ph"], "pdf": "https://arxiv.org/pdf/2510.23729", "abs": "https://arxiv.org/abs/2510.23729", "authors": ["Ian P. A. Johnson", "Taeho Ryu", "Rosalba Perna"], "title": "Hydrodynamic Simulations of Tidal Disruption Encores", "comment": "13 pages", "summary": "We present hydrodynamic simulations with the moving-mesh code AREPO of Tidal\nDisruption Encores (TDEEs) in nuclear star clusters (NSCs). TDEEs arise when a\nstellar-mass black hole (sBH) disrupts a star within the NSC, producing debris\nthat is unbound from the sBH but remains gravitationally bound to the central\nmassive black hole (MBH), leading to a delayed secondary flare. We find that\nthe morphology and thermodynamics of the fallback material depend sensitively\non the disruption geometry, MBH mass, and sBH-MBH separation. We identify two\ndistinct morphological outcomes: ring encores, where debris circularize into a\ntorus, and direct encores, where streams plunge toward the MBH, with encore\nluminosities peaking at times corresponding to the freefall timescale and one\norbital period, respectively. Across all simulated cases, we find these events\nexhibit luminosities of $10^{40}-10^{42}$ erg/s with lightcurves characteristic\nof their morphology. Our work greatly improves the predictions of TDEE\nlightcurves and empowers observations to probe into NSC dynamics and sBH\npopulation while providing possible explanations for anomalous TDE-like flares."}
{"id": "2510.23702", "categories": ["astro-ph.IM", "cs.LG"], "pdf": "https://arxiv.org/pdf/2510.23702", "abs": "https://arxiv.org/abs/2510.23702", "authors": ["Siddharth Chaini", "Federica B. Bianco", "Ashish Mahabal"], "title": "In Search of the Unknown Unknowns: A Multi-Metric Distance Ensemble for Out of Distribution Anomaly Detection in Astronomical Surveys", "comment": "9 pages, 5 figures, Accepted at the 2025 Machine Learning and the\n  Physical Sciences (ML4PS) workshop at NeurIPS", "summary": "Distance-based methods involve the computation of distance values between\nfeatures and are a well-established paradigm in machine learning. In anomaly\ndetection, anomalies are identified by their large distance from normal data\npoints. However, the performance of these methods often hinges on a single,\nuser-selected distance metric (e.g., Euclidean), which may not be optimal for\nthe complex, high-dimensional feature spaces common in astronomy. Here, we\nintroduce a novel anomaly detection method, Distance Multi-Metric Anomaly\nDetection (DiMMAD), which uses an ensemble of distance metrics to find\nnovelties.\n  Using multiple distance metrics is effectively equivalent to using different\ngeometries in the feature space. By using a robust ensemble of diverse distance\nmetrics, we overcome the metric-selection problem, creating an anomaly score\nthat is not reliant on any single definition of distance. We demonstrate this\nmulti-metric approach as a tool for simple, interpretable scientific discovery\non astronomical time series -- (1) with simulated data for the upcoming Vera C.\nRubin Observatory Legacy Survey of Space and Time, and (2) real data from the\nZwicky Transient Facility.\n  We find that DiMMAD excels at out-of-distribution anomaly detection --\nanomalies in the data that might be new classes -- and beats other\nstate-of-the-art methods in the goal of maximizing the diversity of new classes\ndiscovered. For rare in-distribution anomaly detection, DiMMAD performs\nsimilarly to other methods, but may allow for improved interpretability. All\nour code is open source: DiMMAD is implemented within DistClassiPy:\nhttps://github.com/sidchaini/distclassipy/, while all code to reproduce the\nresults of this paper is available here: https://github.com/sidchaini/dimmad/."}
{"id": "2510.23732", "categories": ["astro-ph.HE", "astro-ph.IM", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2510.23732", "abs": "https://arxiv.org/abs/2510.23732", "authors": ["Mansi M. Kasliwal", "Tomas Ahumada", "Robert Stein", "Viraj Karambelkar", "Xander J. Hall", "Avinash Singh", "Christoffer Fremling", "Brian D. Metzger", "Mattia Bulla", "Vishwajeet Swain", "Sarah Antier", "Marion Pillas", "Malte Busmann", "James Freeburn", "Sergey Karpov", "Aleksandra Bochenek", "Brendan O'Connor", "Daniel A. Perley", "Dalya Akl", "Shreya Anand", "Andrew Toivonen", "Sam Rose", "Theophile Jegou du Laz", "Chang Liu", "Kaustav Das", "Sushant Sharma Chaudhary", "Tyler Barna", "Aditya Pawan Saikia", "Igor Andreoni", "Eric C. Bellm", "Varun Bhalerao", "S. Bradley Cenko", "Michael W. Coughlin", "Daniel Gruen", "Daniel Kasen", "Adam A. Miller", "Samaya Nissanke", "Antonella Palmese", "Jesper Sollerman", "Niharika Sravan", "G. C. Anupama", "Smaranika Banerjee", "Sudhanshu Barway", "Joshua S. Bloom", "Tomas Cabrera", "Tracy Chen", "Chris Copperwheat", "Alessandra Corsi", "Richard Dekany", "Nicholas Earley", "Matthew Graham", "Patrice Hello", "George Helou", "Lei Hu", "Yves Kini", "Ashish Mahabal", "Frank Masci", "Tanishk Mohan", "Natalya Pletskova", "Josiah Purdum", "Yu-Jing Qin", "Nabeel Rehemtulla", "Anirudh Salgundi", "Yuankun Wang"], "title": "ZTF25abjmnps (AT2025ulz) and S250818k: A Candidate Superkilonova from a Sub-threshold Sub-Solar Gravitational Wave Trigger", "comment": "Revised for ApJL (submitted on 10/2/25)", "summary": "On August 18, 2025, the LIGO-Virgo-KAGRA collaboration reported gravitational\nwaves from a sub-threshold binary neutron star merger. If astrophysical, this\nevent would have a surprisingly low chirp mass, suggesting that at least one\nneutron star was below a solar mass. The Zwicky Transient Facility mapped the\ncoarse localization and discovered a transient, ZTF25abjmnps (AT2025ulz), that\nwas spatially and temporally coincident with the gravitational wave trigger.\nThe first week of follow-up suggested properties reminiscent of a GW170817-like\nkilonova. Subsequent follow-up suggests properties most similar to a young,\nstripped-envelope, Type IIb supernova. Although we cannot statistically rule\nout chance coincidence, we undertake due diligence analysis to explore the\npossible association between ZTF25abjmnps and S250818k. Theoretical models have\nbeen proposed wherein sub-solar neutron star(s) may form (and subsequently\nmerge) via accretion disk fragmentation or core fission inside a core-collapse\nsupernova i.e. a ``superkilonova\". Here, we qualitatively discuss our\nmulti-wavelength dataset in the context of the superkilonova picture. Future\nhigher significance gravitational wave detections of sub-solar neutron star\nmergers with extensive electromagnetic follow-up would conclusively resolve\nthis tantalizing multi-messenger association."}
{"id": "2510.23733", "categories": ["astro-ph.IM", "astro-ph.EP"], "pdf": "https://arxiv.org/pdf/2510.23733", "abs": "https://arxiv.org/abs/2510.23733", "authors": ["David R. Rice", "Chenliang Huang", "Robert Royer", "Mangesh Daspute", "Krishang Mittal", "Baptiste Journaux", "Jason H. Steffen", "Allona Vazan"], "title": "Magrathea v2: A planetary interior modeling platform in C++", "comment": "5 pages, 1 figure, Submitted to The Journal of Open Source Software\n  (JOSS)", "summary": "Magrathea is an open-source C++ code for modeling the internal structure of\ndifferentiated planets. The initial release, Huang et al. (2022), introduced\nthe base solver, a modular framework for defining equations of state (EOSs)\nused within phase diagrams for each differentiated layer, and outlined a series\nof planned extensions. Many of those updates are now implemented. Magrathea v2\nis a more versatile platform that supports a winder range of compositions, adds\nnew tools for composition retrieval, and makes it easier for users to adapt the\ncode to their own models."}
{"id": "2510.23747", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.23747", "abs": "https://arxiv.org/abs/2510.23747", "authors": ["A. Lemière", "G. Castelletti", "N. L. Maza"], "title": "Unlocking the radio-gamma spectrum of the pulsar wind nebula around PSR J1124-5916 in SNR G292.0+1.8", "comment": "11 pages, 7 figures", "summary": "We present the first detection of GeV $\\gamma$-ray emission potentially\nassociated with the pulsar wind nebula (PWN) hosted by the young core-collapse\nsupernova remnant G292.0+1.8, based on a detailed time-resolved analysis of\n\\textit{Fermi}-LAT data. By isolating the unpulsed component from the dominant\nmagnetospheric radiation of PSR~J1124$-$5916, we successfully disentangle a\ncandidate nebular emission in the GeV range, characterise its morphology and\nextract its spectrum. This identification places G292.0+1.8 among the few\nsystems in which the pulsar and PWN contributions have been spectrally resolved\nat high energies, offering new insight into their respective emission\nmechanisms. We characterise the $\\gamma$-ray spectrum of the pulsar and model\nthe broadband spectral energy distribution (SED) of the PWN using radio, X-ray,\nand GeV data. The emission is well described by a single electron population\nwith two spectral breaks: one intrinsic to the injection spectrum and another\nproduced by synchrotron cooling in a magnetic field of $\\sim$15~$\\mu$G.\nNotably, the inferred magnetic field and the low TeV flux of the nebula\nresemble those of 3C~58, suggesting that similar low-field environments can\narise in young PWNe. The high-energy portion of the SED is now tightly\nconstrained by our GeV detection and existing TeV upper limits. Compared to our\nmodel, earlier predictions tend to underpredict the $\\gamma$-ray flux, while\nothers that succeed in reproducing the GeV component often overpredict the TeV\nemission. This mismatch underscores the challenges in modelling particle\nacceleration and radiation processes in young PWNe and establishes G292.0+1.8\nas a valuable benchmark for testing and refining such models."}
{"id": "2510.23749", "categories": ["astro-ph.IM", "cs.LG"], "pdf": "https://arxiv.org/pdf/2510.23749", "abs": "https://arxiv.org/abs/2510.23749", "authors": ["John F. Wu", "Michael Walmsley"], "title": "Re-envisioning Euclid Galaxy Morphology: Identifying and Interpreting Features with Sparse Autoencoders", "comment": "Accepted to NeurIPS Machine Learning and the Physical Sciences\n  Workshop", "summary": "Sparse Autoencoders (SAEs) can efficiently identify candidate monosemantic\nfeatures from pretrained neural networks for galaxy morphology. We demonstrate\nthis on Euclid Q1 images using both supervised (Zoobot) and new self-supervised\n(MAE) models. Our publicly released MAE achieves superhuman image\nreconstruction performance. While a Principal Component Analysis (PCA) on the\nsupervised model primarily identifies features already aligned with the Galaxy\nZoo decision tree, SAEs can identify interpretable features outside of this\nframework. SAE features also show stronger alignment than PCA with Galaxy Zoo\nlabels. Although challenges in interpretability remain, SAEs provide a powerful\nengine for discovering astrophysical phenomena beyond the confines of\nhuman-defined classification."}
{"id": "2510.23750", "categories": ["astro-ph.HE", "gr-qc", "hep-ph", "nucl-th", "J.2; I.6.3"], "pdf": "https://arxiv.org/pdf/2510.23750", "abs": "https://arxiv.org/abs/2510.23750", "authors": ["Chunran Zhu", "Bolin Li"], "title": "Study of Neutron Star Properties under the Two-Flavor Quark NJL Model", "comment": "22 pages,4 figures", "summary": "The Equation of State (EOS) of matter within neutron stars is a central topic\nin nuclear physics and astrophysics. A precise understanding of the composition\nand phase behavior of matter under such extreme conditions is crucial for\nuncovering the fundamental laws of the strong interaction. This study\ninvestigates hadron-quark hybrid stars using a two-flavor Nambu-Jona-Lasinio\n(NJL) model. As an effective theory, this model can describe the generation of\ndynamical quark masses and chiral symmetry restoration characteristic of dense\nquark matter.\n  We construct the hybrid EOS by joining the BSR6 relativistic mean-field model\nfor hadronic matter with the NJL model for quark matter. A quintic polynomial\ninterpolation ensures a smooth ($C^2$ continuity) and thermodynamically\nconsistent crossover between the phases. Based on this hybrid EOS, we solve the\nTolman-Oppenheimer-Volkoff (TOV) equations to calculate macroscopic properties\nof neutron stars, such as the mass-radius ($M-R$) relationship and the tidal\ndeformability parameter ($\\Lambda$).\n  By exploring key model parameters, we identify a region satisfying a wide\nrange of multi-messenger constraints. Our resulting EOS supports a maximum mass\nconsistent with PSR J0740+6620, while simultaneously predicting radii and tidal\ndeformabilities for a $1.4M_{\\odot}$ star that agree with NICER observations\nand limits from GW170817. This work thus presents a self-consistent model that\nresolves the tension between high-mass pulsars and small tidal deformabilities,\ndeepening our understanding of the hadron-quark crossover."}
{"id": "2510.24040", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2510.24040", "abs": "https://arxiv.org/abs/2510.24040", "authors": ["Silvia Tosi", "Ester Marini", "Felice Cusano", "Andrea Rossi", "Roberto Speziali", "Roberta Carini"], "title": "LBT Italia: Current Achievements and Future Directions", "comment": null, "summary": "The Large Binocular Telescope (LBT) is a world-leading astronomical\nobservatory, where the italian partnership has played an important role in\nincreasing the telescope's productivity, both through an optimized observing\nstrategy and through peer-reviewed publications that are well recognized by the\ninternational astronomical community. This manuscript provides an updated\noverview of the active and past instruments at LBT, together with the key usage\nstatistics. In particular, we analyze the operational performance recorded in\nthe LBT Italia night logs during INAF's observing time and assess the\nscientific impact of each instrument. Between 2014 and 2025 LBT Italia produced\nan average of 14 referred publication per year, based on an annual average of\n311 hours of on-sky time. This corresponds to approximately 2.2 nights of\ntelescope time per publication. The results of this analysis are placed in an\ninternational context to evaluate the competitiveness of LBT, and we outline\nfuture perspective for scientific exploitation."}
{"id": "2510.23814", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2510.23814", "abs": "https://arxiv.org/abs/2510.23814", "authors": ["Tong Bao", "Gabriele Ponti", "Frank Haberl", "Samaresh Mondal", "Mark R. Morris", "Kaya Mori", "Shifra Mandel", "Xiao-jie Xu"], "title": "Unveiling the soft X-ray source population towards the inner Galactic disk with XMM-Newton", "comment": "19 pages, 12 figures, accepted for publication on Astronomy &\n  Astrophysics", "summary": "Across the Galactic disk lies a diverse population of X-ray sources, with the\nfainter end remaining poorly understood due to past survey sensitivity limits.\nWe aim to classify and characterize faint X-ray sources detected in the eROSITA\nAll-Sky Survey (eRASS1) towards the inner Galactic disk ($350^\\circ < l <\n360^\\circ$, $-1^\\circ < b < 1^\\circ$) using deeper XMM-Newton observations\n(typical exposure of $\\sim 20\\,\\text{ks}$). We analyzed 189 eRASS1 sources,\ncombining X-ray spectral fitting ($0.2$--$10\\,\\text{keV}$) with Gaia\nastrometric and photometric data for robust classification. Our results show\nthat the eRASS1 catalog towards the Galactic disk is overwhelmingly dominated\nby coronal sources ($\\sim 74\\%$), primarily active stars and binaries, with\n$\\sim 8\\%$ being wind-powered massive stars and $\\sim 18\\%$ being accreting\ncompact objects. We propose an empirical hardness-ratio cut ($\\text{HR} >\n-0.2$) to efficiently isolate these non-coronal sources. By stacking the\nclassified population and comparing with the Galactic Ridge X-ray Emission\n(GRXE), we estimate that $\\sim 6\\%$ of the GRXE flux in the\n$0.5$--$2.0\\,\\text{keV}$ band is resolved into point sources above the eRASS1\nflux limit ($\\sim 5\\times\n10^{-14}\\,\\text{erg}\\,\\text{cm}^{-2}\\,\\text{s}^{-1}$). This resolved soft-band\nemission is dominated by active stars, while hard-band flux originates\nprimarily from X-ray binaries. We conclude that the eRASS1 catalog retains a\nnon-negligible population of compact objects that can be effectively\ndistinguished using X-ray color selection."}
{"id": "2510.24087", "categories": ["astro-ph.IM", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2510.24087", "abs": "https://arxiv.org/abs/2510.24087", "authors": ["Yingying Zhou", "Chao Liu", "Hao Tian", "Xin Zhang", "Nan Li"], "title": "CSST Slitless Spectra: Target Detection and Classification with YOLO", "comment": "30 pages, 12+6 figures. For high-resolution figures, please see the\n  published version", "summary": "Addressing the spatial uncertainty and spectral blending challenges in CSST\nslitless spectroscopy, we present a deep learning-driven, end-to-end framework\nbased on the You Only Look Once (YOLO) models. This approach directly detects,\nclassifies, and analyzes spectral traces from raw 2D images, bypassing\ntraditional, error-accumulating pipelines. YOLOv5 effectively detects both\ncompact zero-order and extended first-order traces even in highly crowded\nfields. Building on this, YOLO11 integrates source classification (star/galaxy)\nand discrete astrophysical parameter estimation (e.g., redshift bins),\nshowcasing complete spectral trace analysis without other manual preprocessing.\nOur framework processes large images rapidly, learning spectral-spatial\nfeatures holistically to minimize errors. We achieve high trace detection\nprecision (YOLOv5) and demonstrate successful quasar identification and binned\nredshift estimation (YOLO11). This study establishes machine learning as a\nparadigm shift in slitless spectroscopy, unifying detection, classification,\nand preliminary parameter estimation in a scalable system. Future research will\nconcentrate on direct, continuous prediction of astrophysical parameters from\nraw spectral traces."}
{"id": "2510.23917", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.23917", "abs": "https://arxiv.org/abs/2510.23917", "authors": ["Erick Urquilla", "Luke Johns"], "title": "Testing common approximations of neutrino fast flavor conversion", "comment": "10 pages, 4 figures", "summary": "A new chapter is opening in the theory of core-collapse supernovae and\nneutron star mergers as simulations of these events begin to incorporate fast\nflavor conversion (FFC) and other forms of neutrino flavor mixing. Using\nnumerical experiments, we show that the approximations of FFC that have been\nimplemented so far are limited by at least two of three factors: (1)\napproximating continuous evolution as a discrete sequence of instabilities, (2)\nusing spatially homogeneous asymptotic states, and (3) assuming that FFC must\nbe accompanied by instability. The factors we identify in this work will be\nimportant considerations as the research area progresses from initial\nexploratory studies to more quantitatively precise assessments."}
{"id": "2510.24395", "categories": ["astro-ph.IM", "hep-ex"], "pdf": "https://arxiv.org/pdf/2510.24395", "abs": "https://arxiv.org/abs/2510.24395", "authors": ["Iwan Morton-Blake", "Fuyudi Zhang", "Qichao Chang", "Shuhua Hao", "Weilun Huang", "Hualin Mei", "Wei Tian", "Yingwei Wang", "Xin Xiang", "Donglian Xu"], "title": "Optimising Underwater Neutrino Telescopes for All-Flavour Point Source Sensitivity", "comment": "16 pages, 7 figures", "summary": "High-energy neutrino astronomy has advanced rapidly in recent years, with\nIceCube, KM3NeT, and Baikal-GVD establishing a diffuse astrophysical flux and\npointing to promising source candidates. These achievements mark the transition\nfrom first detections to detailed source studies, motivating next-generation\ndetectors with larger volumes, improved angular resolution, and full\nneutrino-flavour sensitivity. We present a performance study of large\nunderwater neutrino telescopes, taking the proposed TRIDENT array in the South\nChina Sea as a case study, with a focus on comparing the performance of various\ndetector configurations against the TRIDENT baseline design. Both track-like\nevents primarily from muon neutrinos, which provide precise directional\ninformation, and cascade events from all flavours, which offer superior energy\nresolution, diffuse-source sensitivity, and all-sky flavour coverage, are\nincluded to achieve a balanced performance across source types. The time to\ndiscover potential astrophysical sources with both track- and cascade-like\nevents is used as the figure of merit to compare a variety of detector design\nchoices. Our results show that, for a fixed number of optical modules, simply\nenlarging the instrumented volume does not inherently lead to improved\nperformance, while taller strings can provide modest gains across all detector\nchannels, within engineering constraints. Distributing dense clusters of\nstrings over a large volume is found to generally worsen discovery potential\ncompared to the baseline layout. Finally, the optical properties of the\nsea-water emerge as the key factor dictating the optimisation of detector\nlayout, highlighting the need for in-situ measurements and early deployment of\noptical modules to guide the final array configuration."}
{"id": "2510.23945", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.23945", "abs": "https://arxiv.org/abs/2510.23945", "authors": ["Sujay Champati", "Vahé Petrosian", "Maria G. Dainotti"], "title": "Cosmological Evolution of Gamma Ray Bursts", "comment": null, "summary": "Gamma Ray Bursts (GRBs) are classified as long (LGRBs) and short (SGRBs) with\ncollapsars and compact object mergers (neutron star (NS)-NS or NS-Black hole)\nas progenitors, respectively. The former are expected to follow the cosmic star\nformation rate (SFR), while the latter follows a delayed version of the SFR.\nHowever, this division has come under question in several ways, the most\nprominent being the observational evidence of a significant excess of LGRBs at\nlow redhifts by several independent investigations, summarized in\narXiv:2305.15081. This could indicate that the progenitors of low-redshift\nLGRBs, whose formation rates are delayed, (similar to that of SGRBs) are\ncompact mergers rather than collapsars. Two recent observations of low-redshift\nLGRBs show associations with kilonovae, a clear feature of compact mergers.\nMost results showing this separation are based on analyses of small (less than\n200) samples of LGRBs with measured redshifts. The aim of this paper is to use\na larger sample of LGRBs. The number of LGRBs with measured redshifts has\nincreased by more than a factor of 2 over the last decade. To this data set we\nadd a sample of LGRBs whose redshifts are estimated using a machine learning\n(ML) method (arXiv:2410.13985). This, in addition to increasing the sample\nsize, reduces the observational selection bias arising from the process of\nredshift measurement. To account for this bias, we use the non-parametric,\nnon-binning Efron-Petrosian method to establish the degree of correlation\nbetween luminosity and redshift, the luminosity evolution, which then allows us\nto use the Lynden-Bell $C^-$ method to obtain a complete description of the\nluminosity function. We find similar low redshift excess for the larger sample\nwith measured redshifts. Adding the sources with ML-estimated redshifts, which\ntend to have more sources in mid-range redshifts, the excess is reduced."}
{"id": "2510.24545", "categories": ["astro-ph.IM", "cs.DC"], "pdf": "https://arxiv.org/pdf/2510.24545", "abs": "https://arxiv.org/abs/2510.24545", "authors": ["Nicola Tuccari", "Eva Sciacca", "Yolanda Becerra", "Enric Sosa Cintero", "Emiliano Tramontana"], "title": "Exascale In-situ visualization for Astronomy & Cosmology", "comment": "8 pages, 3 figures, Conference: ITADATA2025", "summary": "Modern simulations and observations in Astronomy & Cosmology (A&C) produce\nmassively large data volumes, posing significant challenges for storage, access\nand data analysis. A long-standing bottleneck in high-performance computing,\nespecially now in the exascale era, has been the requirement to write these\nlarge datasets to disks, which limits the performance. A promising solution to\nthis challenge is in-situ processing, where analysis and visualization are\nperformed concurrently with the simulation itself, bypassing the storage of the\nsimulation data. In this work, we present new results from an approach for\nin-situ processing based on Hecuba, a framework that provides a highly\ndistributed database for streaming A&C simulation data directly into the\nvisualization pipeline to make possible on-line visualization. By integrating\nHecuba with the high-performance cosmological simulator ChaNGa, we enable\nreal-time, in-situ visualization of N-body simulation results using tools such\nas ParaView and VisIVO."}
{"id": "2510.23979", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2510.23979", "abs": "https://arxiv.org/abs/2510.23979", "authors": ["Ying Chen", "Bin Luo", "Jian Huang"], "title": "Rest-frame Optical Spectroscopy of $z \\sim 2$ Quasars with Steep Hard X-ray Spectral Shapes: X-ray Selection of Super-Eddington Accretion and Verification", "comment": "23 pages, 18 figure, accept for publication in the Astrophysical\n  Journal", "summary": "Super-Eddington accretion is a crucial phase in the growth of supermassive\nblack holes. However, identifying super-Eddington accreting quasars\nobservationally is challenging due to uncertain black-hole mass estimates and\nother complications. The Eddington ratio parameter does not represent\naccurately the accretion rate in the super-Eddington regime. On the other hand,\nsuper-Eddington accreting quasars appear to show large hard X-ray (rest-frame >\n2 keV) power-law photon indices, and they also exhibit distinct optical\nspectral features including weak [O III] $\\lambda 5007$ emission and strong Fe\nII emission. We test steep X-ray photon-index selection of super-Eddington\naccreting quasars by obtaining Palomar 200-inch Hale Telescope near-infrared\nspectra for a pilot sample of nine $\\Gamma=2.0-2.6$ quasars at\n$z\\approx1.4-2.5$. We derive H$\\beta$-based single-epoch virial black-hole\nmasses (median value $\\rm 4.3 \\times 10^{8}~M_{\\odot}$) and Eddington ratios\n(median value 0.6). The Eddington ratio distribution is consistent with that of\nthe comparison sample, which is a flux-limited sample of quasars at\n$z\\approx1.5-3.5$ with near-infrared spectroscopy. But our super-Eddington\ncandidates do show statistically weaker [O III] emission ($P_{\\rm\nnull}=0.0075$) and marginally stronger Fe II emission ($P_{\\rm null}=0.06$). We\nalso find one candidate with broad (width of 1960 km/s) and blueshifted (690\nkm/s) [O III] $\\lambda 4959$ and [O III] $\\lambda 5007$ lines, which probably\noriginate from a strong [O III] outflow driven by super-Eddington accretion.\nOverall, the steep X-ray photon-index selection of super-Eddington accreting\nquasars appears promising. But a larger sample is needed to assess further the\nreliability of the selection."}
{"id": "2510.24547", "categories": ["astro-ph.IM", "cs.DC"], "pdf": "https://arxiv.org/pdf/2510.24547", "abs": "https://arxiv.org/abs/2510.24547", "authors": ["Nicola Tuccari", "Eva Sciacca", "Yolanda Becerra", "Enric Sosa Cintero", "Robert Wissing", "Sijing Shen", "Emiliano Tramontana"], "title": "In-Situ High Performance Visualization for Astronomy & Cosmology", "comment": "4 pages, 1 figure, Conference: Astronomical Data Analysis Software &\n  Systems 2024, Malta", "summary": "The Astronomy & Cosmology (A&C) community is presently witnessing an\nunprecedented growth in the quality and quantity of data coming from\nsimulations and observations. Writing results of numerical simulations to disk\nfiles has long been a bottleneck in high-performance computing. To access\neffectively and extract the scientific content of such large-scale data sets\nappropriate tools and techniques are needed. This is especially true for\nvisualization tools, where petascale data size problems cannot be visualized\nwithout some data filtering, which reduces either the resolution or the amount\nof data volume managed by the visualization tool.\n  A solution to this problem is to run the analysis and visualization\nconcurrently (in-situ) with the simulation and bypass the storage of the full\nresults. In particular we use Hecuba, a framework offering a highly distributed\ndatabase to stream A\\&C simulation data for on-line visualization. We will\ndemonstrate the Hecuba platform integration with the Changa high performant\ncosmological simulator and the in-situ visualization of its N-body results with\nthe ParaView and VisIVO tools."}
{"id": "2510.24071", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2510.24071", "abs": "https://arxiv.org/abs/2510.24071", "authors": ["Jin-Hong Chen", "Lixin Dai", "Kan Cheuk Kwan", "Tom Man Kwan", "Zijian Zhang"], "title": "Diverse Emission Patterns from Precessing Super-Eddington Disks Formed in Tidal Disruption Events", "comment": "18 pages, 9 figures, 1 table. Submitted to ApJ", "summary": "A tidal disruption event (TDE) occurs when a star passes within the tidal\nradius of a supermassive black hole (SMBH). In TDEs it is expected that the\norbital angular momentum of the disrupted star is generally misaligned with the\nSMBH spin axis, which should result in a misaligned super-Eddington disk\nprecessing around the SMBH spin axis due to the Lense-Thirring effect. In this\npaper, we investigate the distinct observational signatures produced from such\nTDE disks, by performing radiative transfer calculations upon previous\nsuper-Eddington disk simulations. We demonstrate that the precession of the\ndisk and wind drive time-dependent obscuration and reprocessing of X-ray\nradiation. Depending on the orientation of the viewing angle of the observer\nand the tilt angle of the disk, four main types of variability are induced: 1)\nThe smooth-TDEs: The emissions from these TDEs show no fluctuations; 2) The\ndimmer: The main emission type (X-ray or optical) stays the same, with small to\nmoderate modulations of brightness; 3) The blinker: X-ray and optical emissions\ntake turns to dominate in one cycle of precession, with dramatic changes in the\nX-ray fluxes. 4) The siren: X-ray and optical emissions take over each other\ntwice per cycle, possibly with two different peak X-ray fluxes within one\ncycle. In all three scenarios, we observe an inverse correlation between X-ray\nand optical emissions. Our model provides a unified physical framework for\ninterpreting TDE multi-wavelength variability through disk precession dynamics\nand gives an alternative interpretation to the interesting case of\nJ045650.3-203750 which was suggested to be a repeated partial TDE previously."}
{"id": "2510.23732", "categories": ["astro-ph.HE", "astro-ph.IM", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2510.23732", "abs": "https://arxiv.org/abs/2510.23732", "authors": ["Mansi M. Kasliwal", "Tomas Ahumada", "Robert Stein", "Viraj Karambelkar", "Xander J. Hall", "Avinash Singh", "Christoffer Fremling", "Brian D. Metzger", "Mattia Bulla", "Vishwajeet Swain", "Sarah Antier", "Marion Pillas", "Malte Busmann", "James Freeburn", "Sergey Karpov", "Aleksandra Bochenek", "Brendan O'Connor", "Daniel A. Perley", "Dalya Akl", "Shreya Anand", "Andrew Toivonen", "Sam Rose", "Theophile Jegou du Laz", "Chang Liu", "Kaustav Das", "Sushant Sharma Chaudhary", "Tyler Barna", "Aditya Pawan Saikia", "Igor Andreoni", "Eric C. Bellm", "Varun Bhalerao", "S. Bradley Cenko", "Michael W. Coughlin", "Daniel Gruen", "Daniel Kasen", "Adam A. Miller", "Samaya Nissanke", "Antonella Palmese", "Jesper Sollerman", "Niharika Sravan", "G. C. Anupama", "Smaranika Banerjee", "Sudhanshu Barway", "Joshua S. Bloom", "Tomas Cabrera", "Tracy Chen", "Chris Copperwheat", "Alessandra Corsi", "Richard Dekany", "Nicholas Earley", "Matthew Graham", "Patrice Hello", "George Helou", "Lei Hu", "Yves Kini", "Ashish Mahabal", "Frank Masci", "Tanishk Mohan", "Natalya Pletskova", "Josiah Purdum", "Yu-Jing Qin", "Nabeel Rehemtulla", "Anirudh Salgundi", "Yuankun Wang"], "title": "ZTF25abjmnps (AT2025ulz) and S250818k: A Candidate Superkilonova from a Sub-threshold Sub-Solar Gravitational Wave Trigger", "comment": "Revised for ApJL (submitted on 10/2/25)", "summary": "On August 18, 2025, the LIGO-Virgo-KAGRA collaboration reported gravitational\nwaves from a sub-threshold binary neutron star merger. If astrophysical, this\nevent would have a surprisingly low chirp mass, suggesting that at least one\nneutron star was below a solar mass. The Zwicky Transient Facility mapped the\ncoarse localization and discovered a transient, ZTF25abjmnps (AT2025ulz), that\nwas spatially and temporally coincident with the gravitational wave trigger.\nThe first week of follow-up suggested properties reminiscent of a GW170817-like\nkilonova. Subsequent follow-up suggests properties most similar to a young,\nstripped-envelope, Type IIb supernova. Although we cannot statistically rule\nout chance coincidence, we undertake due diligence analysis to explore the\npossible association between ZTF25abjmnps and S250818k. Theoretical models have\nbeen proposed wherein sub-solar neutron star(s) may form (and subsequently\nmerge) via accretion disk fragmentation or core fission inside a core-collapse\nsupernova i.e. a ``superkilonova\". Here, we qualitatively discuss our\nmulti-wavelength dataset in the context of the superkilonova picture. Future\nhigher significance gravitational wave detections of sub-solar neutron star\nmergers with extensive electromagnetic follow-up would conclusively resolve\nthis tantalizing multi-messenger association."}
{"id": "2510.24075", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.24075", "abs": "https://arxiv.org/abs/2510.24075", "authors": ["Sheng-Lun Xie", "A-Ming Chen", "Yun-Wei Yu", "Shao-Lin Xiong", "Hua Feng", "Shuang-Nan Zhang", "Zi-Gao Dai", "Wang-Chen Xue", "Ming-Yu Ge", "Xiao-Bo Li", "Liang-Duan Liu", "Jia-Cong Liu", "Wen-Jun Tan", "Chen-Wei Wang", "Shu-Xu Yi", "Peng Zhang", "Yan-Qiu Zhang", "Zhen Zhang", "Chao Zheng", "Xiao-Ping Zheng"], "title": "Eclipsed X-ray Bursts from Magnetar SGR J1935+2154 and the Fireball Measurements", "comment": "Submitted to ApJ", "summary": "X-ray bursts from the magnetar can lead to the formation of fireballs trapped\nby the magnetic field and co-rotating with the star. The fireball emission\ncould occasionally be eclipsed by the magnetar, especially when the burst\nduration is comparable to the magnetar's spin period. In this work, we discover\na peculiar type of burst whose light curve has a plateau-like feature among the\nlong bursts of the magnetar SGR J1935+2154. Based on these bursts, we\nidentified four burst candidates with eclipse-like characteristics. By fitting\ntheir light curves with the eclipse fireball model, the viewing angle of the\nmagnetar relative to its spin axis is estimated to be $17^\\circ \\pm 10^\\circ$.\nThe distances from the fireballs to the magnetar are found to be more than five\ntimes the magnetar's radius, indicating that the fireballs are suspended in the\nmagnetosphere rather than adhering to the magnetar surface. We also find this\nconfiguration is well consistent with the implication of the cyclotron\nresonance scattering feature in their spectra. Our results suggest that some\nintermediate X-ray bursts of SGR 1935+2154 may originate from magnetic\nreconnection within the magnetosphere rather than the starquake."}
{"id": "2510.24549", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2510.24549", "abs": "https://arxiv.org/abs/2510.24549", "authors": ["Nathan Franel", "Vincent Tatischeff", "David Murphy", "Alexey Ulianov", "Caimin McKenna", "Lorraine Hanlon", "Prerna Baranwal", "Christophe Beigbeder", "Arnaud Claret", "Ion Cojocari", "Nicolas de Séréville", "Nicolas Dosme", "Eric Doumayrou", "Mariya Georgieva", "Clarisse Hamadache", "Sally Hankache", "Jimmy Jeglot", "Mózsi Kiss", "Beng-Yun Ky", "Vincent Lafage", "Philippe Laurent", "Christine Le Galliard", "Joseph Mangan", "Aline Meuris", "Mark Pearce", "Jean Peyré", "Arjun Poitaya", "Diana Renaud", "Arnaud Saussac", "Varun Varun", "Matias Vecchio", "Colin Wade"], "title": "Gamma-Ray Burst Polarimetry with the COMCUBE-S CubeSat Swarm", "comment": "13 pages, 6 figures, proceedings of the conference Advances in Space\n  AstroParticle Physics (2025), submitted to (MDPI) Particles for publication\n  in the Special Issue \"Advances in Space AstroParticle Physics: Frontier\n  Technologies for Particle Measurements in Space, 2025 Edition\", Editors:\n  Matteo Duranti and Valerio Vagelli", "summary": "COMCUBE-S (Compton Telescope CubeSat Swarm) is a proposed mission aimed at\nunderstanding the radiation mechanisms of ultra-relativistic jets from\nGamma-Ray Bursts (GRBs). It consists of a swarm of 16U CubeSats carrying a\nstate-of-the-art Compton polarimeter and a BGO spectrometer to perform timing,\nspectroscopic and polarimetric measurements of the prompt emission from GRBs.\nThe mission is currently in a feasibility study phase (Phase A) with the\nEuropean Space Agency to prepare an in-orbit demonstration. Here, we present\nthe simulation work used to optimise the design and operational concept of the\nmicrosatellite constellation, as well as estimate the mission performance in\nterms of GRB detection rate and polarimetry. We used the MEGAlib software to\nsimulate the response function of the gamma-ray instruments, together with a\ndetailed model for the background particle and radiation fluxes in low-Earth\norbit. We also developed a synthetic GRB population model to best estimate the\ndetection rate. These simulations show that COMCUBE-S will detect about 2 GRBs\nper day, which is significantly higher than that of all past and current GRB\nmissions. Furthermore, simulated performance for linear polarisation\nmeasurements shows that COMCUBE-S will be able to uniquely distinguish between\ncompeting models of the GRB prompt emission, thereby shedding new light on some\nof the most fundamental aspects of GRB physics."}
{"id": "2510.24123", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.24123", "abs": "https://arxiv.org/abs/2510.24123", "authors": ["Nao Kominato", "Toshiki Sato", "Yusuke Sakai", "Ryota Hayakawa", "Shinya Yamada"], "title": "Decadal brightening in the northeastern non-thermal filament of Cassiopeia A", "comment": null, "summary": "We present the decadal brightening of non-thermal emission flux in the\nnortheastern filament of the young supernova remnant Cassiopeia A (Cas A),\nwhich highlights dynamic processes in the forward shock. This filament,\ncharacterized by the highest particle acceleration rate among Cas A's outer\nshells, offers an exceptional opportunity to investigate underlying\nastrophysical mechanisms. Since 2000, the non-thermal flux has increased by\nseveral tens of percent before plateauing, while the spectral shape has\nremained largely unchanged. Over the past two decades, the filament's\nmorphology has evolved significantly, splitting into two distinct sections.\nDetailed analysis reveals contrasting behaviors: one section shows a flux\nincrease followed by saturation, while the other maintains a steady flux. These\ndifferences likely arise from nonlinear effects, including magnetohydrodynamic\ninteractions influenced by magnetic field orientation, interactions with\nsurrounding material, and complex fluid dynamics associated with young\nsupernova remnants. The localized evolution of this filament, captured with\nhigh spatial resolution, provides critical insights into the temporal dynamics\nof non-thermal particles and the generation of cosmic rays from asymmetric\nsupernova explosions."}
{"id": "2510.24167", "categories": ["astro-ph.HE", "nucl-th"], "pdf": "https://arxiv.org/pdf/2510.24167", "abs": "https://arxiv.org/abs/2510.24167", "authors": ["Yoonhak Nam", "Kazuyuki Sekizawa"], "title": "Vortex Creep Heating in Neutron Star Cooling: New Insights into Thermal Evolution of Heavy Neutron Stars", "comment": "4 pages, 2 figures, Proceedings of the 29th International Nuclear\n  Physics Conference (INPC2025), Daejeon, Korea, May 25-30, 2025", "summary": "Neutron stars provide unique laboratories for probing physics of dense\nnuclear matter under extreme conditions. Their thermal and luminosity evolution\nreflects key internal properties such as the equation of state (EoS), nucleon\nsuperfluidity and superconductivity, envelope composition, and magnetic field,\nand so on. Recent observations [\\textit{e.g.}, V. Abramkin \\textit{et al.,} ApJ\n\\textbf{924}, 128 (2022)] have revealed unexpectedly warm old neutron stars,\nwhich cannot be explained by standard neutrino-photon cooling models. The\nfailure of the standard cooling models implies the presence of additional\ninternal heating mechanism. Building on the previous study [M. Fujiwara\n\\textit{et al}., JCAP \\textbf{03}, 051 (2024)], which proposed vortex creep\nheating (VCH) from the frictional motion of superfluid vortices as a viable\nmechanism, we extend the cooling framework to include both VCH and direct Urca\n(DUrca) processes. These are implemented in our code to explore their combined\nimpact, particularly for massive neutron stars where DUrca operates. By varying\nrotational parameters ($P$, $\\dot{P}$, $P_0$), EoS models (APR, BSk24), pairing\ngaps, and envelope compositions, we examine how heating-cooling interplay\nshapes the temperature evolution. Our results show that VCH can substantially\nmitigate the rapid cooling driven by DUrca, offering new evolutionary pathways\nfor massive neutron stars."}
{"id": "2510.24341", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.24341", "abs": "https://arxiv.org/abs/2510.24341", "authors": ["Megumi Shidatsu", "Shogo Kobayashi", "Yusuke Sakai", "Toshihiro Takagi", "Yuta Okada", "Shinya Yamada", "Yoshihiro Ueda", "Hideki Uchiyama", "Robert Petre"], "title": "XRISM High-resolution Spectroscopy of SS 433: Evidence of Decreasing Line-of-Sight Velocity Dispersion along the Jet", "comment": "10 pages, 6 figures, 2 tables, accepted for publication in PASJ", "summary": "We report on the jet structure in SS 433 based on X-ray high resolution\nspectroscopy with the XRISM/Resolve. The source was observed over 5 days\ncovering both inside and outside an eclipse of the compact object by the\ncompanion star. Doppler-shifted, ionized Fe and Ni K emission lines were\nresolved, as well as lower-energy lines including Si and S K lines.\nTime-resolved spectral analysis showed that Fe and Ni K line widths were $1020\n\\pm 40$ km s$^{-1}$ (corresponding the 1$\\sigma$ width) in the eclipse phase,\ngradually increased during the egress, and reached $1740 \\pm 30$ km s$^{-1}$\noutside the eclipse. A time-averaged spectrum outside the eclipse confirmed\nthat the Fe and Ni K lines in 5.5-9 keV are significantly broader than the Si\nand S K$\\alpha$ emission lines in 2--4 keV. Specifically, the width in 5.5-9\nkeV was measured to be $1900 \\pm 80$ km s$^{-1}$, whereas the width in 2-4 keV\nis $1300^{+300}_{-400}$ km s$^{-1}$ for the approaching (blueshifted) jet\ncomponent. These results indicate that radial velocity dispersion of the jet\nplasma in SS 433 decreases as it moves outward. We interpret this variation as\nprogressive jet collimation along its axis, as suggested by Namiki et al.\n(2003), or a decrease in turbulence in the jet plasma flow within the X-ray\nemitting region. We also detected a clear difference in velocity dispersion\nbetween the approaching and receding (redshifted) jet components in the 5.5-9\nkeV band outside eclipse. The receding jet exhibited a smaller velocity\ndispersion ($1400 \\pm 200$ km s$^{-1}$) than the approaching jet. Since the\nobservation was conducted when the approaching jet was tilted toward the\nobserver, this may suggest that the receding jet was more extensively occulted\nby the accretion disk."}
{"id": "2510.24516", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.24516", "abs": "https://arxiv.org/abs/2510.24516", "authors": ["Antonio Condorelli", "Jonathan Biteau", "Olivier Deligny", "Remi Adam"], "title": "Multi-messenger constraints on transient accelerators of ultra-high energy cosmic rays", "comment": "8 pages, 5 figures, Proceedings for the 39th International Cosmic Ray\n  Conference (ICRC2025)", "summary": "The origin of ultra-high-energy cosmic rays (UHECRs) remains an open\nquestions in astrophysics. We explore two primary scenarios for the\ndistribution of UHECR sources, assuming that their production rate follows\neither the cosmic star-formation-rate or stellar-mass density. By jointly\nfitting the UHECR energy spectrum and mass composition measured by the Pierre\nAuger Observatory above the ankle (10^{18.7} eV), we derive constraints on the\nacceleration mechanisms, source energetics, and elemental abundances at escape.\nUsing these constraints, we generate sky maps above 40 EeV based on a catalog\nof over 400,000 galaxies out to 350 Mpc, providing a near-infrared flux-limited\nsample that maps the two stellar-activity tracers across the full sky. A\ncrucial factor in understanding UHECR propagation is the influence of\nlarge-scale cosmic structures, particularly galaxy clusters, the largest\ngravitationally bound systems in the Universe, which are filled with magnetized\ndiffuse plasma. Intermittent sources hosted in galaxies within such structures,\ncoupled with cosmic magnetic fields, shape the observed UHECR arrival\ndirections and provide insights into the burst rate of the sources. We show\nthat these environments can significantly impact UHECR transport, making them\nparticularly opaque to heavy nuclei. Additionally, we compute the expected\nsecondary neutrino and photon fluxes from UHECR interactions in these\nenvironments and compare them with current experimental limits, constraining\nthe maximum energy that particles can achieve. Finally, we assess the\ncompatibility of these constraints with astrophysical candidates, identifying\nlong gamma-ray bursts as the most promising sources."}
{"id": "2510.24549", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2510.24549", "abs": "https://arxiv.org/abs/2510.24549", "authors": ["Nathan Franel", "Vincent Tatischeff", "David Murphy", "Alexey Ulianov", "Caimin McKenna", "Lorraine Hanlon", "Prerna Baranwal", "Christophe Beigbeder", "Arnaud Claret", "Ion Cojocari", "Nicolas de Séréville", "Nicolas Dosme", "Eric Doumayrou", "Mariya Georgieva", "Clarisse Hamadache", "Sally Hankache", "Jimmy Jeglot", "Mózsi Kiss", "Beng-Yun Ky", "Vincent Lafage", "Philippe Laurent", "Christine Le Galliard", "Joseph Mangan", "Aline Meuris", "Mark Pearce", "Jean Peyré", "Arjun Poitaya", "Diana Renaud", "Arnaud Saussac", "Varun Varun", "Matias Vecchio", "Colin Wade"], "title": "Gamma-Ray Burst Polarimetry with the COMCUBE-S CubeSat Swarm", "comment": "13 pages, 6 figures, proceedings of the conference Advances in Space\n  AstroParticle Physics (2025), submitted to (MDPI) Particles for publication\n  in the Special Issue \"Advances in Space AstroParticle Physics: Frontier\n  Technologies for Particle Measurements in Space, 2025 Edition\", Editors:\n  Matteo Duranti and Valerio Vagelli", "summary": "COMCUBE-S (Compton Telescope CubeSat Swarm) is a proposed mission aimed at\nunderstanding the radiation mechanisms of ultra-relativistic jets from\nGamma-Ray Bursts (GRBs). It consists of a swarm of 16U CubeSats carrying a\nstate-of-the-art Compton polarimeter and a BGO spectrometer to perform timing,\nspectroscopic and polarimetric measurements of the prompt emission from GRBs.\nThe mission is currently in a feasibility study phase (Phase A) with the\nEuropean Space Agency to prepare an in-orbit demonstration. Here, we present\nthe simulation work used to optimise the design and operational concept of the\nmicrosatellite constellation, as well as estimate the mission performance in\nterms of GRB detection rate and polarimetry. We used the MEGAlib software to\nsimulate the response function of the gamma-ray instruments, together with a\ndetailed model for the background particle and radiation fluxes in low-Earth\norbit. We also developed a synthetic GRB population model to best estimate the\ndetection rate. These simulations show that COMCUBE-S will detect about 2 GRBs\nper day, which is significantly higher than that of all past and current GRB\nmissions. Furthermore, simulated performance for linear polarisation\nmeasurements shows that COMCUBE-S will be able to uniquely distinguish between\ncompeting models of the GRB prompt emission, thereby shedding new light on some\nof the most fundamental aspects of GRB physics."}
{"id": "2510.24560", "categories": ["astro-ph.HE", "hep-ex"], "pdf": "https://arxiv.org/pdf/2510.24560", "abs": "https://arxiv.org/abs/2510.24560", "authors": ["XRISM Collaboration", "Marc Audard", "Hisamitsu Awaki", "Ralf Ballhausen", "Aya Bamba", "Ehud Behar", "Rozenn Boissay-Malaquin", "Laura Brenneman", "Gregory V. Brown", "Lia Corrales", "Elisa Costantini", "Renata Cumbee", "Maria Diaz Trigo", "Chris Done", "Tadayasu Dotani", "Ken Ebisawa", "Megan E. Eckart", "Dominique Eckert", "Satoshi Eguchi", "Teruaki Enoto", "Yuichiro Ezoe", "Adam Foster", "Ryuichi Fujimoto", "Yutaka Fujita", "Yasushi Fukazawa", "Kotaro Fukushima", "Akihiro Furuzawa", "Luigi Gallo", "Javier A. García", "Liyi Gu", "Matteo Guainazzi", "Kouichi Hagino", "Kenji Hamaguchi", "Isamu Hatsukade", "Katsuhiro Hayashi", "Takayuki Hayashi", "Natalie Hell", "Edmund Hodges-Kluck", "Ann Hornschemeier", "Yuto Ichinohe", "Daiki Ishi", "Manabu Ishida", "Kumi Ishikawa", "Yoshitaka Ishisaki", "Jelle Kaastra", "Timothy Kallman", "Erin Kara", "Satoru Katsuda", "Yoshiaki Kanemaru", "Richard Kelley", "Caroline Kilbourne", "Shunji Kitamoto", "Shogo Kobayashi", "Takayoshi Kohmura", "Aya Kubota", "Maurice Leutenegger", "Michael Loewenstein", "Yoshitomo Maeda", "Maxim Markevitch", "Hironori Matsumoto", "Kyoko Matsushita", "Dan McCammon", "Brian McNamara", "François Mernier", "Eric D. Miller", "Jon M. Miller", "Ikuyuki Mitsuishi", "Misaki Mizumoto", "Tsunefumi Mizuno", "Koji Mori", "Koji Mukai", "Hiroshi Murakami", "Richard Mushotzky", "Hiroshi Nakajima", "Kazuhiro Nakazawa", "Jan-Uwe Ness", "Kumiko Nobukawa", "Masayoshi Nobukawa", "Hirofumi Noda", "Hirokazu Odaka", "Shoji Ogawa", "Anna Ogorzałek", "Takashi Okajima", "Naomi Ota", "Stephane Paltani", "Robert Petre", "Paul Plucinsky", "Frederick S. Porter", "Katja Pottschmidt", "Kosuke Sato", "Toshiki Sato", "Makoto Sawada", "Hiromi Seta", "Megumi Shidatsu", "Aurora Simionescu", "Randall Smith", "Hiromasa Suzuki", "Andrew Szymkowiak", "Hiromitsu Takahashi", "Mai Takeo", "Toru Tamagawa", "Keisuke Tamura", "Takaaki Tanaka", "Atsushi Tanimoto", "Makoto Tashiro", "Yukikatsu Terada", "Yuichi Terashima", "Yohko Tsuboi", "Masahiro Tsujimoto", "Hiroshi Tsunemi", "Takeshi Tsuru", "Aysegül Tümer", "Hiroyuki Uchida", "Nagomi Uchida", "Yuusuke Uchida", "Hideki Uchiyama", "Shutaro Ueda", "Yoshihiro Ueda", "Shinichiro Uno", "Jacco Vink", "Shin Watanabe", "Brian J. Williams", "Satoshi Yamada", "Shinya Yamada", "Hiroya Yamaguchi", "Kazutaka Yamaoka", "Noriko Yamasaki", "Makoto Yamauchi", "Shigeo Yamauchi", "Tahir Yaqoob", "Tomokage Yoneyama", "Tessei Yoshida", "Mihoko Yukita", "Irina Zhuravleva", "Jean-Paul Breuer", "Priyanka Chakraborty", "Stefano Ettori", "Andrew Fabian", "Annie Heinrich", "Marie Kondo", "Julie HLavacek-Larrondo", "Hannah McCall", "Paul Nulsen", "Tom Rose", "Helen Russell", "Arnab Sarkar", "Evan Scannapieco", "Kazunori Suda", "Ming Sun", "Prathamesh Tamhane", "Nhut Truong", "Norbert Werner", "Congyao Zhang"], "title": "XRISM constraints on unidentified X-ray emission lines, including the 3.5 keV line, in the stacked spectrum of ten galaxy clusters", "comment": "16 pages, 4 figures, 2 tables, accepted for publication in ApJ\n  Letters", "summary": "We stack 3.75 Megaseconds of early XRISM Resolve observations of ten galaxy\nclusters to search for unidentified spectral lines in the $E=$ 2.5-15 keV band\n(rest frame), including the $E=3.5$ keV line reported in earlier, low spectral\nresolution studies of cluster samples. Such an emission line may originate from\nthe decay of the sterile neutrino, a warm dark matter (DM) candidate. No\nunidentified lines are detected in our stacked cluster spectrum, with the\n$3\\sigma$ upper limit on the $m_{\\rm s}\\sim$ 7.1 keV DM particle decay rate\n(which corresponds to a $E=3.55$ keV emission line) of $\\Gamma \\sim 1.0 \\times\n10^{-27}$ s$^{-1}$. This upper limit is 3-4 times lower than the one derived by\nHitomi Collaboration et al. (2017) from the Perseus observation, but still 5\ntimes higher than the XMM-Newton detection reported by Bulbul et al. (2014) in\nthe stacked cluster sample. XRISM Resolve, with its high spectral resolution\nbut a small field of view, may reach the sensitivity needed to test the\nXMM-Newton cluster sample detection by combining several years worth of future\ncluster observations."}
{"id": "2510.24620", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.24620", "abs": "https://arxiv.org/abs/2510.24620", "authors": ["Xander J. Hall", "Malte Busmann", "Hauke Koehn", "Keerthi Kunnumkai", "Antonella Palmese", "Brendan O'Connor", "James Freeburn", "Lei Hu", "Daniel Gruen", "Tim Dietrich", "Mattia Bulla", "Michael W. Coughlin", "Sarah Antier", "Marion Pillas", "Paul A. Price", "Tomás Ahumada", "Ariel Amsellem", "Igor Andreoni", "Jule Augustin", "Tom'as Cabrera", "Rasika Deshpande", "Jennifer Fabà-Moreno", "Julius Gassert", "Sergey Karpov", "Mansi Kasliwal", "Ignacio Magaña Hernandez", "Rachel Mandelbaum", "Felipe Fontinele Nunes", "Peter T. H. Pang", "Julian Sommer", "Robert Stein", "Constantin Tabor", "Pablo Vega", "Thibeau Wouters", "Xiaoxiong Zuo"], "title": "AT2025ulz and S250818k: Investigating early time observations of a subsolar mass gravitational-wave binary neutron star merger candidate", "comment": null, "summary": "Over the past LIGO--Virgo--KAGRA (LVK) observing runs, it has become\nincreasingly clear that identifying the next electromagnetic counterparts to\ngravitational-wave (GW) neutron star mergers will likely be more challenging\ncompared to the case of GW170817. The rarity of these GW events, and their\nelectromagnetic counterparts, motivates rapid searches of any candidate binary\nneutron star (BNS) merger detected by the LVK. We present our extensive\nphotometric and spectroscopic campaign of the candidate counterpart AT2025ulz\nto the low-significance GW event S250818k, which had a ${\\sim} 29\\%$\nprobability of being a BNS merger. We demonstrate that during the first five\ndays, the luminosity and color evolution of AT2025ulz are consistent with both\nkilonova and shock cooling models, although a Bayesian model comparison shows\npreference for the shock cooling model, underscoring the ambiguity inherent to\nearly data obtained over only a few days. Continued monitoring beyond this\nwindow reveals a rise and color evolution incompatible with kilonova models and\ninstead consistent with a supernova. This event emphasizes the difficulty in\nidentifying the electromagnetic counterparts to BNS mergers and the significant\nallotment of observing time necessary to robustly differentiate kilonovae from\nimpostors."}
{"id": "2510.24696", "categories": ["astro-ph.HE", "gr-qc"], "pdf": "https://arxiv.org/pdf/2510.24696", "abs": "https://arxiv.org/abs/2510.24696", "authors": ["Yael Alush", "Nicholas C. Stone", "Sjoert van Velzen"], "title": "How Flat is a Plateau? Evolution of Late-Time TDE Disks", "comment": "12 pages, 8 figures, 9 tables. Comments are welcome", "summary": "Late-time light curve plateaus in tidal disruption events (TDEs) are often\napproximated as flat and time-independent. This simplification is motivated by\ntheoretical modeling of spreading late time TDE disks, which often predicts\nslow light curve evolution. However, if time evolution can be detected,\nlate-time light curves will yield more information than has been previously\naccessible. In this work, we re-examine late-time TDE data to test how well the\nflat plateau assumption holds. We use Markov Chain Monte Carlo to estimate the\nmaximum likelihood for a family of theory-agnostic models and apply the Akaike\ninformation criterion to find that that roughly one third of our sample favors\nevolving plateaus, one third favors truly flat plateaus, and one third shows no\nstatistically significant evidence for any plateau. Next, we refit the TDEs\nthat exhibit statistically significant plateaus using a magnetically elevated\n$\\alpha$-disk model, motivated by the lack of clear thermal instability in late\ntime TDE light curves. From these model-dependent fits, we obtain estimates for\nthe supermassive black hole (SMBH) mass, the mass of the disrupted star, and\nthe $\\alpha$ parameter itself. Fitted $\\alpha$ values range from $10^{-3}$ to\n0.4 (the mean fitted $\\alpha=10^{-1.8}$, with scatter of 0.6 dex), broadly\nconsistent with results from magnetohydrodynamic simulations. Finally, we\nestimate the timescales of disk precession in magnetically elevated TDE models.\nTheoretically, we find that disk precession times may be orders of magnitude\nshorter than in unmagnetized Shakura-Sunyaev disks, and grow in time as $T_{\\rm\nprec}\\propto t^{35/36}$; empirically, by using fitted $\\alpha$ parameters, we\nestimate that late time disks may experience $\\sim$few-10 precession cycles."}
