{"id": "2509.18236", "categories": ["astro-ph.IM", "astro-ph.GA", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.18236", "abs": "https://arxiv.org/abs/2509.18236", "authors": ["S. Stepanoff", "A. N. Otte", "M. Bagheri", "A. Barletta", "D. Bergmann", "J. Blose", "J. Bogdan", "A. M. Brown", "L. Cedeno", "M. Doro", "M. Fedkevych", "S. Gadamsetty", "F. Giordano", "C. Hao", "V. Iyengar", "D. Kieda", "N. Lew", "M. Mariotti", "Y. Onel", "D. A. Raudales O.", "L. Rojas Castillo", "A. Ronemus", "A. Menon", "A. Mitra", "E. Schapera", "D. Solden", "N. Song", "W. Springer", "I. Taboada", "K. Tran", "A. Wilcox", "A. Zhang"], "title": "Status of the Trinity PeV Neutrino Observatory", "comment": "9 pages, 9 figures, ICRC 2025", "summary": "The Trinity Neutrino Observatory aims to detect tau neutrinos in the energy\nrange of 1 PeV to 10 EeV. We are developing the observatory in three stages.\nThe first stage, known as the Trinity Demonstrator, was deployed in Fall 2023.\nThe Demonstrator serves as a pathfinder for the full observatory and will\ninform the design of the first Trinity Telescope. We discuss the status and\ninitial results of the Trinity Demonstrator. In 346 hours of observations with\nthe Demonstrator, we do not identify a neutrino candidate event."}
{"id": "2509.18261", "categories": ["astro-ph.IM", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2509.18261", "abs": "https://arxiv.org/abs/2509.18261", "authors": ["Chong-Chong He", "Benjamin D. Wibking", "Aditi Vijayan", "Mark R. Krumholz"], "title": "A novel algorithm for GPU-accelerated particle-mesh interactions implemented in the QUOKKA code", "comment": "15 pages, 7 figures, submitted to MNRAS. The QUOKKA code described in\n  this article is fully open-source and can be accessed at:\n  https://github.com/quokka-astro/quokka", "summary": "We present a novel, GPU-optimized algorithm for particle-mesh interactions in\ngrid-based hydrodynamics simulations, designed for massively parallel\narchitectures. This approach overcomes the inefficiency of particle neighbour\nsearches or sorts across multiple GPU nodes by using a new\n``particle-mesh-particle'' interaction scheme, which extends the particle-mesh\nmethod for self-gravity. The algorithm proceeds in two main stages: first,\nquantities exchanged between particles and the mesh -- such as mass, energy,\nand momentum added by stellar feedback or removed by accretion onto a sink --\nare deposited into a buffer mesh equipped with ghost zones, where multiple\ncontributions per cell are accumulated using atomic additions and then\ncommunicated across distributed memory ranks. In the second stage, the buffer\nstates are applied to real mesh states, incorporating cell-wise limiters to\nenforce physical constraints such as positive density. We implement this scheme\nin the GPU-native radiation-magnetohydrodynamics code QUOKKA, demonstrating its\napplication to both supernova feedback and sink particle accretion. We\ndemonstrate that the former scheme converges in the terminal radial momentum\nfrom multiple supernovae across varying spatial resolutions, while for the\nlatter simulations of accretion in several configurations show excellent\nagreement with analytic solutions. This scheme enables efficient, scalable\nparticle-mesh coupling for GPU-optimized simulations."}
{"id": "2509.18286", "categories": ["astro-ph.IM", "astro-ph.CO"], "pdf": "https://arxiv.org/pdf/2509.18286", "abs": "https://arxiv.org/abs/2509.18286", "authors": ["Kaili Cao", "Christopher M. Hirata", "Katherine Laliotis", "Masaya Yamamoto", "Emily Macbeth", "M. A. Troxel"], "title": "Simulating Image Coaddition with the Nancy Grace Roman Space Telescope. IV. Hyperparameter Optimization and Experimental Features", "comment": "24 pages, 10 figures, submitted to AAS Journals", "summary": "For weak gravitational lensing cosmology with the forthcoming Nancy Grace\nRoman Space Telescope, image coaddition, or construction of oversampled images\nfrom undersampled ones, is a critical step in the image processing pipeline. In\nthe previous papers in this series, we have re-implemented the {\\sc Imcom}\nalgorithm, which offers control over point spread functions in coadded images,\nand applied it to state-of-the-art image simulations for Roman. In this work,\nwe systematically investigate the impact of {\\sc Imcom} hyperparameters on the\nquality of measurement results. We re-coadd the same $16$ blocks ($1.75 \\times\n1.75 \\,{\\rm arcmin}^2$, $2688 \\times 2688$ pixels each) from OpenUniverse2024\nsimulations with $26$ different configurations in each of $5$ bands. We then\ncompare the results in terms of $12$ objective evaluation criteria, including\ninternal diagnostics of {\\sc Imcom}, properties of coadded noise frames,\nmeasurements of injected point sources, and time consumption. We demonstrate\nthat: i) the Cholesky kernel is the best known linear algebra strategy for {\\sc\nImcom}, ii) in general, a wide Gaussian target output PSF outperforms a\nsmoothed Airy disk or a narrow Gaussian, iii) kernel-specific settings are\nworth considering for future coaddition, and iv) {\\sc Imcom} experimental\nfeatures studied in this work are either inconsequential or detrimental. We end\nthis paper by discussing current and next steps of {\\sc Imcom}-related studies\nin the context of Roman shear and clustering measurements."}
{"id": "2509.18306", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.18306", "abs": "https://arxiv.org/abs/2509.18306", "authors": ["Matthew C. H. Leung", "Colby Jurgenson", "Andrew Szentgyorgyi", "William Podgorski", "Mark Mueller", "Yahel Sofer Rimalt", "Joseph Zajac", "Cem Onyuksel", "Daniel Durusky", "Peter Doherty"], "title": "Crank-rocker optical fiber mode scrambler prototype for the GMT-Consortium Large Earth Finder (G-CLEF)", "comment": "25 pages, 30 figures, SPIE Optics + Photonics 2025", "summary": "When coherent light propagates through a multimode optical fiber, the modes\ninterfere at the fiber exit boundary, producing a high-contrast speckle\ninterference pattern called modal noise. This non-uniform interference pattern\nintroduces systematic errors in fiber-fed precision radial velocity (RV)\nspectrographs which are detrimental to exoplanet mass measurement. Modal noise\ncan be mitigated by a device called a fiber mode scrambler or fiber agitator,\nwhich dynamically perturbs the fiber to change the interference pattern over\ntime, smoothing it over long exposures. In this paper, we present a prototype\noptical fiber mode scrambler based on a four-bar linkage crank-rocker\nmechanism, developed for the GMT-Consortium Large Earth Finder (G-CLEF). G-CLEF\nis a fiber-fed, high-resolution, precision RV spectrograph for the Magellan\nClay Telescope and Giant Magellan Telescope (GMT). To support this effort, we\ndeveloped a fiber testing setup capable of imaging the near-field and far-field\noutput of fibers and measuring focal ratio degradation. We designed, built, and\ntested the mode scrambler, using our setup, on step-index multimode optical\nfibers with various shapes, including octagonal, square, and rectangular core\ncross-sections. We developed custom software utilizing alpha shapes to identify\nthe boundary of an arbitrarily shaped fiber and to compute a signal-to-noise\nratio metric for quantifying modal noise. We investigated the effects of\ndifferent mode scrambler parameters, such as agitation frequency, on mitigating\nmodal noise. Our results offer valuable insights into optimizing fiber mode\nscrambling for precision RV spectrographs."}
{"id": "2509.18237", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.18237", "abs": "https://arxiv.org/abs/2509.18237", "authors": ["David A. Raudales O.", "A. Nepomuk Otte", "D. R. Bergman", "J. Bogdan", "A. M. Brown", "M. Doro", "M. Fedkevych", "F. Giordano", "C. Hao", "D. Kieda", "M. Mariotti", "Y. Onel", "E. Schapera", "D. Soldin", "W. Springer", "S. Stepanoff", "I. Taboada", "K. Tran"], "title": "The Trinity-One PeV-Neutrino Telescope", "comment": "9 pages, 6 figures, Proceedings of the 37th International Cosmic Ray\n  Conference, PoS(ICRC2025)1136", "summary": "Following the Trinity Demonstrator, Trinity One will be the first of the 18\nCherenkov telescopes that make up the Trinity PeV-Neutrino Observatory. Located\non Frisco Peak in Utah, Trinity One can observe 64\\% of the sky, allowing it to\ndetect potential neutrino point sources with unprecedented sensitivity, ranging\nfrom 1 PeV to 10 EeV. We outline the design of Trinity One, which features a 60\nm$^2$ light-collection surface and the ability to rotate in azimuth. It has a\nfield of view measuring $5^\\circ$ by $60^\\circ$, which is equipped with a\nsilicon photomultiplier camera with a resolution of $0.3^\\circ$. Utilizing the\ndesign of Trinity One, we present performance calculations in relation to\nvarious source classes."}
{"id": "2509.18333", "categories": ["astro-ph.IM", "hep-ex"], "pdf": "https://arxiv.org/pdf/2509.18333", "abs": "https://arxiv.org/abs/2509.18333", "authors": ["Margita Kubátová"], "title": "Estimation of Temporal Muon Signals in Water-Cherenkov Detectors of the Surface Detector of the Pierre Auger Observatory", "comment": "Presented at the 2nd European AI for Fundamental Physics Conference\n  (EuCAIFCon2025). Submission to SciPost Physics Proceedings", "summary": "The Surface Detector (SD) of the Pierre Auger Observatory is a 3000 km$^2$\narray of stations, whose main components are Water-Cherenkov Detectors (WCDs)\nrecording ground-level signals from extensive air showers (EASs) initiated by\nUltra-High-Energy Cosmic Rays (UHECRs). Understanding the physics of UHECRs\nrequires knowledge of their mass composition, for which the number of ground\nmuons is a key probe. Isolating the muon component is difficult, as different\ntypes of particles contribute to the SD signal. We apply a recurrent neural\nnetwork to estimate the muon content of the SD signals, showing small bias in\nsimulations and weak dependence on selected hadronic interaction model."}
{"id": "2509.18239", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2509.18239", "abs": "https://arxiv.org/abs/2509.18239", "authors": ["Milena Crnogorčević", "Tim Linden", "Annika H. G. Peter"], "title": "Are X-Ray Detected Active Galactic Nuclei in Dwarf Galaxies Gamma-Ray Bright?", "comment": "11 pages, 5 figures. Appendices add 3 pages and 3 figures. Comments\n  welcome!", "summary": "The $\\gamma$-ray emission from active galactic nuclei (AGN), including both\nbeamed blazars and misaligned-AGN, dominates the extragalactic $\\gamma$-ray\npoint-source population count and flux. While multi-wavelength studies have\ndetected an increasing number of AGN within dwarf galaxies in the local\nUniverse, $\\gamma$-ray emission has so far only been associated with systems\nhosting supermassive black holes (SMBHs). Dwarf-galaxy AGN are of particular\ninterest because their central black holes fall in the intermediate-mass black\nhole (IMBH) regime, offering insight into the early evolution of SMBHs. Using\n15~years of \\textit{Fermi}-LAT data, we present the first search for\n$\\gamma$-ray emission from dwarf-galaxy AGN. In the sample of 74 X-ray-selected\ndwarf-galaxy AGN, we find no sources that exceed the \\textit{Fermi}-LAT\ndetection threshold. However, a joint-likelihood analysis reveals a modest,\ntrials-corrected population-level excess ($\\sim2\\sigma$) above blank-field\nexpectations at very soft photon indices $\\Gamma \\gtrsim 3.8$ above 500~MeV.\nThis hint is most pronounced when source contributions are weighed by\n$M^\\alpha_{{\\rm IMBH},i}/d_i^2$, with $\\alpha\\simeq1$--$1.5$, suggesting -- but\nnot confirming -- that $\\gamma$-ray emission could scale with the central black\nhole mass or a property correlated with it (e.g., accretion rate), but with a\nmarkedly softer spectrum than in SMBH-hosted AGN."}
{"id": "2509.18368", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.18368", "abs": "https://arxiv.org/abs/2509.18368", "authors": ["Pawan Giri"], "title": "Advancing ARA: the Next-Generation (ARA-Next) DAQ System", "comment": "Pos(ICRC 2025) 1044", "summary": "The Askaryan Radio Array (ARA) has been operating at the South Pole for over\na decade, searching for ultra-high energy astrophysical and cosmogenic\nneutrinos using the Askaryan effect. ARA has consistently served as a testbed\nfor innovative trigger designs and advancing electronic upgrades, with ongoing\ndata acquisition (DAQ) improvements over the past 2-3 years and a long-term\nplan to transition to Radio Frequency System on Chip (RFSoC) technology. This\nupgrade enables real-time data processing and sophisticated triggers, enhancing\nefficiency by identifying double pulses from in-ice neutrino interactions,\nusing templates for cosmic rays, searching for real-time coincidences with the\nIceCube detector observations, and filtering anthropogenic noise through\ndirectional analysis. In 2024, two of the five ARA stations received DAQ\nupgrades, improving the existing electronics, with RFSoC-based DAQ foreseen in\nthe coming years. In this proceedings contribution, recent ARA activities are\npresented, with emphasis on the planned ARA-Next trigger strategies involving\nRFSoC technology and the 2024-2025 season upgrades of the existing ATRI-based\nDAQ system to its revised version."}
{"id": "2509.18241", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.18241", "abs": "https://arxiv.org/abs/2509.18241", "authors": ["Sean M. Ressler", "Luciano Combi", "Bart Ripperda", "Xinyu Li"], "title": "Black Hole Collisions With Thin Accretion Disks: OJ 287 and Small-Mass-Ratio Supermassive Black Hole Binary Candidates", "comment": "23 pages, 13 figures, submitted to ApJL. Animations are available\n  here:\n  https://www.youtube.com/playlist?list=PL3pLmTeUPcqRwbUZrM8qsizgzQllVHFw-", "summary": "OJ 287 is the best-known supermassive black hole binary candidate in the\nnanohertz gravitational wave band. It exhibits periodic flares every $\\sim$ 12\nyears, likely caused by collisions of a smaller-mass secondary with the\naccretion disk surrounding a larger-mass primary. It is therefore an important\nbenchmark for understanding black hole binary accretion in the approaching era\nof space-based gravitational wave detectors and large electromagnetic surveys.\nBecause the electromagnetic emission of the system is determined by a complex\ninterplay of plasma, accretion, and radiation physics in strong gravity,\nnumerical simulations are required for realistic modeling. We present the first\nglobal, three-dimensional, general relativistic magnetohydrodynamic (GRMHD)\nsimulations of OJ 287-like systems; namely, smaller-mass secondaries colliding\nwith a radiatively-cooled (thin) disk surrounding a larger-mass primary. We\nfocus on disks with scale heights that are 10\\% of the distance from the\nprimary and binary mass ratios of $q = 0.1,0.05$, and $0.025$ using an\noptically-thin cooling prescription. We confirm the basic paradigm that impacts\nof the secondary on the disk can generate enough power to outshine the\nquiescent emission. The secondary also causes spiral shocks to form in the\ndisk, enhanced accretion events, overall heating of the flow, and stochastic\ntilting of the disk, though these effects are small for $q<0.05$. Our results\ncan be extrapolated to the parameters of OJ 287 and similar systems, an\nimportant step on the path toward fully realistic simulations of accretion onto\nsmall-mass-ratio black hole binaries and predicting electromagnetic\ncounterparts to low-frequency gravitational wave detections."}
{"id": "2509.18450", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.18450", "abs": "https://arxiv.org/abs/2509.18450", "authors": ["Devika K Divakar", "Phillip MacQueen", "Joseph Strubhar"], "title": "Design overview of the fiber feed for the Hobby-Eberly telescope's HRS", "comment": null, "summary": "We present the redesign of the fiber feed for the High Resolution\nSpectrograph (HRS) at the Hobby Eberly Telescope (HET). The upgrade\nincorporates a static atmospheric dispersion corrector (ADC) using Ohara i-line\nglasses (BAL15Y and S-FPL51Y), carefully selected for high internal\ntransmission (> 99\\%), and optimized to improve throughput and image quality\nacross the 360 - 1000 nm band. The ADC consists of two identical Amici prisms,\nfixed at an orientation optimized for the HET's nominal zenith angle\n(35\\textdegree), correcting dispersion over the HET zenith range of\n26.5\\textdegree to 43.5\\textdegree. Relay optics were optimized to improve blue\nend sensitivity and maintain substantially sub-fiber-core RMS spot radii across\nthe full field of view. Simulations, including atmospheric dispersion modeling\nin ZEMAX show residual dispersion $\\le$ 0.42\" considering the entire range of\nwavelengths and zenith distances, with transmission efficiency of 91 to 94\\%.\nWe also discuss how the mechanical design integrates all optical elements,\nincluding the ADC, in a rigid, modular input head assembly mounted in the HET\nPrime Focus Instrument Package (PFIP). This optimized fiber feed enhances\ncoupling efficiency, improves S/N in the blue, and enables higher radial\nvelocity precision , maintaining HET - HRS as a leading facility for high -\nresolution spectroscopy."}
{"id": "2509.18254", "categories": ["astro-ph.HE", "gr-qc"], "pdf": "https://arxiv.org/pdf/2509.18254", "abs": "https://arxiv.org/abs/2509.18254", "authors": ["Vikram Manikantan", "Vasileios Paschalidis"], "title": "Binary black holes gone MAD: Magnetically arrested minidisks around nonspinning black holes", "comment": "12 pages, 3 figures, submitted to PRD. Comments welcome. Supplemental\n  movie: https://youtube.com/shorts/89F_4GaaXo8?feature=share", "summary": "We demonstrate the formation of magnetically arrested minidisks (MAM) around\nequal-mass, nonspinning binary black holes with magnetohydrodynamic simulations\nof circumbinary disk accretion in full 3+1 general relativity. The initial\nseparation of $d\\sim 30\\,M$ allows the black holes to host large minidisks that\nsuppress the total rest-mass accretion rate variability, which is modulated\nprimarily at $\\sim 1.6 \\, f_{\\rm orb}$. Each black hole horizon saturates with\ndimensionless magnetic flux $\\phi \\sim 30$. Magnetic reconnection near the\nhorizons drives recurrent eruptions which are expected to drive flaring in the\ninfrared and X-ray bands. Our results establish MAMs as a new outcome of\ncircumbinary disk accretion, and a promising source of novel electromagnetic\ncounterparts to gravitational waves from binary black holes."}
{"id": "2509.18511", "categories": ["astro-ph.IM", "astro-ph.EP"], "pdf": "https://arxiv.org/pdf/2509.18511", "abs": "https://arxiv.org/abs/2509.18511", "authors": ["Xu Lu", "Tian-Ning Yang", "Yi Xie"], "title": "Lunar Time Ephemeris $\\texttt{LTE440}$: definitions, algorithm and performance", "comment": "9 pages, 3 figures", "summary": "Robotic and human activities in the cislunar space are expected to rapidly\nincrease in the future. Modeling, jointly analysis and sharing of time\nmeasurements made in the vicinity of the Moon might indispensably demand\ncalculating a lunar time scale and transforming it into other time scales. For\nusers, we present a ready-to-use software package of Lunar Time Ephemeris\n$\\texttt{LTE440}$ that can calculate the Lunar Coordinate Time (TCL) and its\nrelations with the Barycentric Coordinate Time (TCB) and the Barycentric\nDynamical Time (TDB). According to the International Astronomical Union\nResolutions on relativistic time scales, we numerically calculate the\nrelativistic time-dilation integral in the transformation between TCL and\nTCB/TDB with the JPL ephemeris DE440 including the gravitational contributions\nfrom the Sun, all planets, the main belt asteroids and the Kuiper belt objects,\nand export data files in the SPICE format. At a conservative estimate,\n$\\texttt{LTE440}$ has an accuracy better than 0.15 ns before 2050 and a\nnumerical precision at the level of 1 ps over its entire time span. The secular\ndrifts between the coordinate times in $\\texttt{LTE440}$ are respectively\nestimated as $\\langle\n\\mathrm{d}\\,\\mathrm{TCL}/\\mathrm{d}\\,\\mathrm{TCB}\\rangle=1-1.482\\,536\\,216\\,7\\times10^{-8}$\nand $\\langle\n\\mathrm{d}\\,\\mathrm{TCL}/\\mathrm{d}\\,\\mathrm{TDB}\\rangle=1+6.798\\,355\\,24\\times10^{-10}$.\nIts most significant periodic variations are an annual term with amplitude of\n1.65 ms and a monthly term with amplitude of 126 $\\mu$s. $\\texttt{LTE440}$\nmight satisfy most of current needs and is publicly available."}
{"id": "2509.18351", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2509.18351", "abs": "https://arxiv.org/abs/2509.18351", "authors": ["Isabel S. Sands", "Philip F. Hopkins", "Sam B. Ponnada", "Dusan Keres", "Lina Necib", "Yen-Hsing Julius Lin"], "title": "Galactic Center Gamma-Ray Emission in MHD Galaxy Formation Simulations with Full Cosmic Ray Spectra", "comment": "17 pages, 12 figures. Submitted to PRD", "summary": "The Milky Way's galactic center is a highly dynamical, crowded environment.\nGamma ray observations of this region, such as the excess of GeV scale gamma\nrays observed by Fermi LAT, have been of tremendous interest to both the high\nenergy astrophysics and particle physics communities. However, nearly all past\nstudies of gamma ray emission make simplifying assumptions about cosmic ray\n(CR) propagation that may not be valid in the galactic center. Recent numerical\nbreakthroughs now enable fully time dependent dynamical evolution of CRs in\nmagnetohydrodynamic simulations with resolved, multi phase small scale\nstructure in the interstellar medium (ISM), allowing self consistent\ncomparisons to the Milky Way cosmic ray spectrum. We model diffuse gamma ray\nemission from cosmic ray interactions for a set of Feedback in Realistic\nEnvironments (FIRE) simulations of Milky Way mass galaxies run with spectrally\nresolved cosmic ray spectra for multiple species at MeV to TeV energies. We\nfind that the galactic center gamma ray spectrum can vary by order of magnitude\namounts in normalization, and by approx. 10 percent in spectral slope at high\nenergies, driven by both injection from highly variable star formation and\nlosses from variable structure in the turbulent ISM. Gamma ray emission from\ninverse Compton scattering and relativistic nonthermal Bremsstrahlung is\nparticularly variable on Myr timescales. We argue that features of the observed\nMilky Way gamma ray spectrum may arise from such transient phenomena in gamma\nrays produced from CR interactions."}
{"id": "2509.18544", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.18544", "abs": "https://arxiv.org/abs/2509.18544", "authors": ["Lauren Aldoroty", "Lei Hu", "Rob Knop", "Cole Meldorf", "Daniel Scolnic", "Shu Liu", "W. Michael Wood-Vasey", "Marcus Manos", "Lucas Erlandson", "Rebekah Hounsell", "Ben Rose", "Masao Sako", "Michael Troxel", "The Roman Supernova Cosmology Project Infrastructure Team"], "title": "phrosty: A difference imaging pipeline for Roman", "comment": "8 pages, 3 figures", "summary": "NASA's Nancy Grace Roman Space Telescope (Roman) will provide an opportunity\nto study dark energy with unprecedented precision using several techniques,\nincluding measurements of Type Ia Supernovae (SNe Ia). Here, we present\n`phrosty` (PHotometry for ROman with SFFT for tYpe Ia supernovae): a difference\nimaging pipeline for measuring the brightness of transient point sources in the\nsky, primarily SNe Ia, using Roman data. `phrosty` is written in Python. We\nimplement a GPU-accelerated version of the Saccadic Fast Fourier Transform\n(SFFT) method for difference imaging."}
{"id": "2509.18374", "categories": ["astro-ph.HE", "physics.plasm-ph"], "pdf": "https://arxiv.org/pdf/2509.18374", "abs": "https://arxiv.org/abs/2509.18374", "authors": ["Keyan Gootkin", "Colby Haggerty", "Damiano Caprioli", "Zachary Davis"], "title": "Efficient Particle Acceleration in 2.5-Dimensional, Hybrid-Kinetic Simulations of Decaying, Supersonic, Plasma Turbulence", "comment": "submitted to ApJ, 17 pages, 12 figures, 2 tables", "summary": "Collisionless, turbulent plasmas surround the Earth, from the magnetosphere\nto the intergalactic medium, and the fluctuations within them affect nearly\nevery field in the space sciences, from space weather forecasts to theories of\ngalaxy formation. Where turbulent motions become supersonic, their interactions\ncan lead to the formation of shocks, which are known to efficiently energize\nions to cosmic-ray energies. We present 2.5-dimensional, hybrid-kinetic\nsimulations of decaying, supersonic, non-relativistic turbulence in a\ncollisionless plasma using the code dHybridR. Turbulence within these\nsimulations is highly compressible; after accounting for this compression by\ntaking the omni-directional power-spectrum of the density weighted velocity\nfield, we find turbulent spectra with power-law slopes of $\\alpha \\approx\n-\\frac{5}{3}$ for low Mach numbers, in the inertial range, and $\\alpha \\approx\n-2$ for high Mach numbers. Ions embedded in the highly supersonic simulations\nare accelerated to non-thermal energies at efficiencies similar to those seen\nin shocks, despite being in a non-relativistic regime and lacking the large\nscale structure of a shock. We observe that particles are accelerated into a\npower-law spectrum, with a slope of $q \\approx 2.5$ in (non-relativistic)\nenergy. We compare these results to those obtained from the theory and\nsimulations of diffusive shock acceleration, and discuss the astrophysical\nimplications of this theoretical work."}
{"id": "2509.18643", "categories": ["astro-ph.IM", "astro-ph.EP"], "pdf": "https://arxiv.org/pdf/2509.18643", "abs": "https://arxiv.org/abs/2509.18643", "authors": ["Benjamin L. Gerard", "Alex Geringer-Sameth", "Aditya R. Sengupta", "Alexx Perloff", "Michael Messerley", "Dominic F. Sanchez", "P. Waswa", "William Moore", "Matthew Cook", "Eric Strang", "Paul Pax", "Cesar Laguna", "Matthew DeMartino", "Kevin Bundy", "Rebecca Jensen-Clem", "Aaron J. Lemmer", "S. Mark Ammons", "Lisa Poyneer", "Megan Eckart"], "title": "WaveDriver: a Laser Guide Star AO System for HWO", "comment": "submitted as proceeding to HWO25", "summary": "HWO's Tier 1 Contrast Stability Technology Gap presents a key challenge for\ntechnology development in the coming years, requiring to a >100x more stable\nsystem than JWST. WaveDriver is a concept for a laser guide star spacecraft\ncoupled to an adaptive optics (AO) system onboard HWO that would enable HWO to\nreach its picometer-level wavefront stability requirements while relaxing other\nHWO subsystem requirements. At LLNL and UCSC we are revisiting the concept\ninitially proposed by Douglas et al. (2019). We present results from our\nproject's first year, including (1) AO control developments, including with\nLinear Quadratic Gaussian control and machine learning, (2) AO wavefront sensor\n(WFS) trade study simulations, and (3) simulations, fabrication, and testing of\na 133-port photonic lantern WFS/spectrograph. A key finding from our work is\nthat WaveDriver could be needed to enable HWO's primary mirror segment\nstability and/or low order wavefront stability requirements."}
{"id": "2509.18665", "categories": ["astro-ph.HE", "gr-qc", "hep-ph", "nucl-th"], "pdf": "https://arxiv.org/pdf/2509.18665", "abs": "https://arxiv.org/abs/2509.18665", "authors": ["Christian Ecker", "Tyler Gorda", "Aleksi Kurkela", "Luciano Rezzolla"], "title": "Listening to the long ringdown: A novel way to pinpoint the EOS in neutron-star cores", "comment": "4 pages, 2 figures, Quark Matter 2025 Proceedings", "summary": "Gravitational waves (GWs) from binary neutron star (BNS) merger remnants\ncomplement constraints from the inspiral phase, mass-radius measurements, and\nmicroscopic theory by providing information about the neutron-star equation of\nstate (EOS) at extreme densities. We perform general-relativistic simulations\nof BNS mergers using EOS models that span the uncertain high-density regime. We\nfind a robust correlation between the ratio of energy and angular momentum lost\nduring the late-time post-merger GW signal - the long ringdown - and the EOS at\nthe highest densities in neutron star cores. Applying this correlation to\npost-merger GW signals reduces EOS uncertainty at several times saturation\ndensity, where no direct constraints currently exist."}
{"id": "2509.18237", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.18237", "abs": "https://arxiv.org/abs/2509.18237", "authors": ["David A. Raudales O.", "A. Nepomuk Otte", "D. R. Bergman", "J. Bogdan", "A. M. Brown", "M. Doro", "M. Fedkevych", "F. Giordano", "C. Hao", "D. Kieda", "M. Mariotti", "Y. Onel", "E. Schapera", "D. Soldin", "W. Springer", "S. Stepanoff", "I. Taboada", "K. Tran"], "title": "The Trinity-One PeV-Neutrino Telescope", "comment": "9 pages, 6 figures, Proceedings of the 37th International Cosmic Ray\n  Conference, PoS(ICRC2025)1136", "summary": "Following the Trinity Demonstrator, Trinity One will be the first of the 18\nCherenkov telescopes that make up the Trinity PeV-Neutrino Observatory. Located\non Frisco Peak in Utah, Trinity One can observe 64\\% of the sky, allowing it to\ndetect potential neutrino point sources with unprecedented sensitivity, ranging\nfrom 1 PeV to 10 EeV. We outline the design of Trinity One, which features a 60\nm$^2$ light-collection surface and the ability to rotate in azimuth. It has a\nfield of view measuring $5^\\circ$ by $60^\\circ$, which is equipped with a\nsilicon photomultiplier camera with a resolution of $0.3^\\circ$. Utilizing the\ndesign of Trinity One, we present performance calculations in relation to\nvarious source classes."}
{"id": "2509.18720", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.18720", "abs": "https://arxiv.org/abs/2509.18720", "authors": ["Samantha Wong", "Dinah Ibrahim", "Benjamin Shaw"], "title": "Searches for TeV emission from Northern Hemisphere pulsars with VERITAS", "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC\n  2025). 9 pages, 4 figures", "summary": "The discovery of VHE emission from the Crab pulsar and, more recently,\nmulti-TeV emission from the Vela pulsar have challenged our current\nunderstanding of the emission mechanisms of these sources. Studying pulsar\nemission at TeV energies allows us to understand the engines that power some of\nthe most extreme accelerators in the Galaxy. We present recent highlights from\nthe VERITAS pulsar program using nearly two decades of VERITAS data and novel\nhigh energy analysis techniques optimized for emission up to 100 TeV. This work\nbegins to characterize how the emerging population of multi-TeV pulsars can be\npredicted from existing multi-wavelength observations. In particular, we\nhighlight a search for VHE emission above 1 TeV using over 17 years of Crab\npulsar data, which extends the high energy end of the existing VERITAS\nspectrum. Additionally, we search for both optical and multi-TeV emission from\nbright Vela-like pulsars, including analysis of over 200 hours of data on PSR\nJ2229+6114, which powers the Boomerang pulsar wind nebula and is putatively\nassociated with the ultra-high-energy source 1LHAASO J2229+5927u. We discuss\nthese results in the context of the broader pulsar population and their impacts\non the prospects of new pulsar discoveries with next-generation VHE\ninstruments."}
{"id": "2509.18814", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.18814", "abs": "https://arxiv.org/abs/2509.18814", "authors": ["Danelise de Oliveira Franco", "Günter Sigl"], "title": "Lensing effects of ultra-high-energy cosmic rays propagating in the Galactic magnetic field", "comment": "8 pages, 4 figures; to be published in the Proceedings of the\n  ICRC2025", "summary": "Since ultra-high-energy cosmic rays (UHECRs) are electrically charged\nparticles, they are deflected by magnetic fields. Those magnetic fields can act\nas lenses, altering their trajectories and (de)magnifying their apparent source\nimages. These deflections of UHECR trajectories can lead to phenomena such as\nthe appearance of multiple images of an extragalactic source. In this study, we\ninvestigate the influence of the Galactic Magnetic Field (GMF) on the\npropagation of UHECRs, considering four different realistic models for the GMF:\nthe PT11, the JF12, the UF23, and the KST24 models. We investigate how an\nisotropic flux on Earth would have entered the edge of the Galaxy for different\nrigidity values from 1 to 100 EV. In addition, we investigate the appearance of\nmultiple images of astrophysical point sources. Furthermore, we analyze the\nmodification of the cosmic ray flux from a source as a function of the rigidity\nand its dependence on the chosen GMF model. Since the deflection induced by the\nmagnetic field depends on the rigidity of the particle, the effects vary among\ndifferent nuclear species. Consequently, our findings can have implications for\ninterpreting mass-composition and anisotropy observations, as the\nrigidity-dependent deflections directly alter the observed UHECR arrival\ndirection distribution."}
{"id": "2509.18833", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2509.18833", "abs": "https://arxiv.org/abs/2509.18833", "authors": ["Ripon Sk", "Sangita Chatterjee", "Sankhasubhra Nag"], "title": "Effects of galactic environment on accretion dynamics onto a rotating centrally located black hole and on emergent analogue gravity", "comment": null, "summary": "The hydrodynamics of low-angular-momentum, multi-transonic, axisymmetric,\ninviscid accretion flow onto a rotating black hole has been systematically\ninvestigated using three distinct disc geometries and two thermodynamic\nequations of state, within the framework of a pseudo-Kerr potential. To enhance\nastrophysical realism, the study incorporates a multi-component galactic\npotential, modeling the influence of the surrounding stellar distribution, dark\nmatter, and hot gas with the central blackhole. Our analysis reveals that the\ninclusion of the galactic potential induces subtle yet noteworthy shifts in the\nlocations of sonic points. This effect is particularly pronounced in the\nvertical equilibrium disc model, where the region allowing for shock formation\nundergoes significant modification. The nature of critical points is determined\nby analyzing the eigenvalues of the corresponding stability matrix,\nestablishing that multi-transonicity is restricted to a finite range of angular\nmomentum. Shock strength and associated dynamic \\& thermodynamic\nquantities-such as mach number, pressure, density and temperature-are found to\nvary sensitively with galactic parameters, and are illustrated through\ncomprehensive parametric plots. Additionally, a time-dependent linear\nperturbation analysis, demonstrates that the governing perturbation equations\nretain their structural form even in the presence of a galactic potential. The\nflows remain stable under adiabatic, radially propagating perturbations.\nInterestingly, the perturbative framework naturally gives rise to an emergent\nacoustic metric, identifying the system as a classical analogue of gravity. The\ncorresponding acoustic surface gravity is analytically derived and shown to\nexhibit a dependence on both the spin of the black hole and the characteristics\nof the surrounding galactic environment."}
{"id": "2509.18861", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.18861", "abs": "https://arxiv.org/abs/2509.18861", "authors": ["Stefan Fröse", "Dominik Martin Elässer", "Hendrik Hildebrandt", "Elisa Pueschel"], "title": "Three-dimensional Search for Annihilating Dark Matter in CBe dSph with the MAGIC Telescopes", "comment": "8 pages, 4 figures, ICRC25, 39th International Cosmic Ray Conference", "summary": "Dark matter (DM) candidates, such as Weakly Interacting Massive Particles\n(WIMPs), can annihilate to Standard Model particles, subsequently producing\ngamma rays. In this work, we search for DM-induced gamma-ray signals from Coma\nBerenices dwarf spheroidal galaxy (CBe dSph) using approximately 25 hours of\nobservations carried out by the Major Atmospheric Gamma Imaging Cherenkov\n(MAGIC) Telescope, located at Roque de los Muchachos Observatory, La Palma,\nSpain. Building upon preceding analyses in the gamma-ray regime, we extend the\nDM search into three dimensions by incorporating spatial information from the\nassumed DM-density distribution. This approach enhances sensitivity by\nleveraging both energy and spatial characteristics of the expected signal. The\nthree-dimensional search for a faint signal necessitates the construction of a\nbackground model, leading to the proposal of the exclusion-rotation method.\nThis method stacks all observations, excludes the source region, and corrects\nfor the Azimuth-dependent acceptance of the telescopes by rotating the model.\nFurthermore, the open-source Python package TITRATE is presented, introducing\nAsimov datasets to the high-level analysis tool Gammapy for the approximation\nof the test statistic. No evidence of a DM-induced signal for annihilation to\n$b\\bar{b}$, $W^+W^-$, $\\mu^+\\mu^-$, and $\\tau^+\\tau^-$ and DM masses $m_\\chi$\nbetween 0.17 TeV and 100 TeV in CBe dSph is found. Consequently, the first\nupper limits on the thermally averaged cross-section in energy and spatial\ndimensions using TITRATE are set, leading to a sensitivity improvement over\nprevious results by MAGIC with respect to the assumed DM density in the target\nhalo. The development of the Asimov method for DM search reduces the need for\nMonte Carlo simulations, paving the way for computationally efficient and\nscalable large-scale analyses across multiple targets and cosmic messengers."}
{"id": "2509.18863", "categories": ["astro-ph.HE", "hep-ph"], "pdf": "https://arxiv.org/pdf/2509.18863", "abs": "https://arxiv.org/abs/2509.18863", "authors": ["Prashant Thakur", "Aravind Taridalu", "Ishfaq Ahmad Rather", "Tanech Klangburam", "Chakrit Pongkitivanichkul"], "title": "Constraining Axion-Like Particle mediated Dark Matter with Observational Constraints: A Statistical and Machine Learning Approach", "comment": "18 pages, 14 figures, 3 tables", "summary": "We present a comprehensive investigation into the phenomenological\nconsequences of axion-like particle (ALP) mediated dark matter (DM) on neutron\nstar (NS) structure. Using a relativistic mean-field framework with non-linear\nmesonic self-interactions constrained by nuclear data and astrophysical\nobservations, we explore the DM parameter space spanning $m_\\chi \\in [0,\n1000]~\\mathrm{GeV}$ and $q_f \\in [0, 0.06]~\\mathrm{GeV}$, generating over\n30,000 equations of state (EoSs). Two representative hadronic EoSs are\nemployed, a stiff (EoS1) and a soft (EoS18), with explicit inclusion of the\ncrustal EoS. A multi-tiered statistical filtering scheme, combining voting,\nlikelihood, and kernel density estimation scores, is applied using constraints\nfrom radio and X-ray pulsars, GW170817, and the low-mass compact object HESS\nJ1731-347. We find that models satisfying the PSR J0614$-$3329 radius bound\nautomatically comply with HESS, positioning ALP-mediated DM as a viable\nexplanation for low-mass compact objects while still supporting $2\\,M_\\odot$\nNSs. For the stiff EoS, we obtain $m_\\chi \\gtrsim 43~\\mathrm{GeV}$, with\nscore-weighted posteriors favoring $q_f = 0.034^{+0.020}_{-0.012}$ and a broad\nallowed DM mass range $m_\\chi \\in [101, 949]~\\mathrm{GeV}$ (median $\\sim 466$\nGeV). The soft EoS yields no strict lower bound, though large $m_\\chi$--$q_f$\ncombinations are disfavored. A high-precision supervised regression model built\nwith AutoGluon achieves $R^2 > 0.998$ for inferring DM parameters from NS\nobservables. Feature analysis reveals $m_\\chi$ is constrained by structural\nratios such as $R_{1.6}/R_{1.4}$, whereas $q_f$ is set mainly by the tidal\ndeformability $\\Lambda_{1.4}$."}
{"id": "2509.18945", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.18945", "abs": "https://arxiv.org/abs/2509.18945", "authors": ["Gabriele Panebianco", "Nicolò Parmiggiani", "Andrea Bulgarelli", "Ambra Di Piano", "Luca Castaldini", "Valentina Fioretti", "Giovanni De Cesare", "Sami Caroff", "Pierre Aubert", "Gilles Maurin", "Vincent Pollet", "Thomas Vuillaume", "Igor Oya", "Cristian Vignali"], "title": "SAG-SCI: the Real-time, High-level Analysis Software for Array Control and Data Acquisition of the Cherenkov Telescope Array Observatory", "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC\n  2025), 2025", "summary": "The Cherenkov Telescope Array Observatory (CTAO) is going to be the leading\nobservatory for very-high-energy gamma-rays over the next decades. Its unique\nsensitivity, wide field of view, and rapid slewing capability make the CTAO\nespecially suited to study transient astrophysical phenomena. The CTAO will\nanalyse its data in real-time, responding to external science alerts on\ntransient events and issuing its own. The Science Alert Generation (SAG)\nautomated pipeline, a component of the Array Control and Data Acquisition\n(ACADA) software, is designed to detect and issue candidate science alerts. In\nthis work, we present the current development status of SAG-SCI, the SAG\ncomponent responsible for the real-time, high-level analysis of CTAO data. The\nSAG-SCI pipelines receive gamma-ray data from multiple reconstruction lines,\nmerge them, store them in a database, and trigger several parallel scientific\nanalyses on the latest data. These analyses include estimating target\nsignificance and flux, producing sky maps and light curves, and conducting\nblind searches for sources within the field of view. We execute SAG-SCI on a\nset of simulated gamma-ray data, detecting the simulated sources and accurately\nreconstructing their flux and position. We also estimate the systematic errors\nintroduced by the analysis and discuss the results in relation to the\ngeneration of candidate science alerts."}
{"id": "2509.18972", "categories": ["astro-ph.HE", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2509.18972", "abs": "https://arxiv.org/abs/2509.18972", "authors": ["Rami F. Mandow", "Andrew Zic", "J. R. Dawson", "Shuangqiang Wang", "Malgorzata Curylo", "Shi Dai", "Valentina Di Marco", "George Hobbs", "Vivek Gupta", "Agastya Kapur", "M. Kerr", "Marcus E. Lower", "Saurav Mishra", "Daniel Reardon", "Christopher J. Russell", "Ryan M. Shannon", "Lei Zhang", "Xingjiang Zhu"], "title": "Ultra-Wideband Polarimetry of the April 2021 Profile Change Event in PSR J1713+0747", "comment": "Accepted for publication in PASA", "summary": "The millisecond pulsar PSR J1713+0747 is a high-priority target for pulsar\ntiming array experiments due to its long-term timing stability, and bright,\nnarrow pulse profile. In April 2021, PSR~J1713$+$0747 underwent a significant\nprofile change event, observed by several telescopes worldwide. Using the\nbroad-bandwidth and polarimetric fidelity of the Ultra-Wideband Low-frequency\nreceiver on Murriyang, CSIRO's Parkes radio telescope, we investigated the\nlong-term spectro-polarimetric behaviour of this profile change in detail. We\nhighlight the broad-bandwidth nature of the event, which exhibits frequency\ndependence that is inconsistent with cold-plasma propagation effects. We also\nfind that spectral and temporal variations are stronger in one of the\northogonal polarisation modes than the other, and observe mild variations\n($\\sim 3$ - $5\\,\\sigma$ significance) in circular polarisation above 1400 MHz\nfollowing the event. However, the linear polarisation position angle remained\nremarkably stable in the profile leading edge throughout the event. With over\nthree years of data post-event, we find that the profile has not yet recovered\nback to its original state, indicating a long-term asymptotic recovery, or a\npotential reconfiguration of the pulsar's magnetic field. These findings favour\na magnetospheric origin of the profile change event over a line-of-sight\npropagation effect in the interstellar medium."}
{"id": "2509.18996", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.18996", "abs": "https://arxiv.org/abs/2509.18996", "authors": ["C. Guidorzi", "R. Maccary", "M. Maistrello", "S. Kobayashi", "M. Bulla", "F. Frontera"], "title": "GRB X-ray plateaus as evidence that the afterglow begins before the prompt gamma-ray emission", "comment": "8 pages, 4 figures, accepted by A&A", "summary": "Most GRB X-ray afterglow light curves are characterised by a plateau,\nfollowed by a normal power-law decay interpreted as afterglow emission. Despite\nthe numerous alternative interpretations, the origin of the plateau remains\nunclear. In the early years of Swift, it was suggested that the plateau might\nbe afterglow radiation, that started before the prompt gamma-ray emission, and\nits time profile would be an artefact of assuming the start time of the prompt\ngamma-ray emission as zero time (the so-called \"prior activity model\"). We aim\nto test this scenario by leveraging the current Swift sample of early X-ray\nafterglows of GRBs with measured redshifts. We modelled the GRB rest-frame\nX-ray afterglow luminosities assuming a simple power-law with the true\nreference time preceding the prompt gamma-ray emission trigger time by T_0 and\nthe X-ray luminosity L_0 at the trigger time as free parameters. For 90% GRBs\nof our sample, the model provided a successful description. In 10 cases the\nafterglow peak is identified and modelled appropriately. Using the 300 GRBs\nwith accurate parameters' estimates, we confirm the anti-correlation between\nL_0 and T_0 with 0.7 dex scatter. In addition, selecting the subsample of 180\nfrom the literature with reliable estimates of isotropic-equivalent energy\nE_gamma,iso, peak luminosity L_gamma,iso, and intrinsic peak energy E_p,i of\nthe nuFnu spectrum of the prompt gamma-ray emission, we find a correlation\nbetween L_0, T_0, and E_gamma,iso (0.4 dex scatter) over nine decades in L_0\nand common to all kinds of GRBs. The afterglow likely begins in most cases\nbefore the start of the detected prompt gamma-ray emission. As also suggested\nby the recent discoveries of Einstein Probe of X-ray emission starting long\nbefore the prompt gamma-rays, our results suggest that the occurrence of prior\nactivity could be much more frequent than what has tacitly been assumed so far."}
{"id": "2509.19131", "categories": ["astro-ph.HE", "nucl-th"], "pdf": "https://arxiv.org/pdf/2509.19131", "abs": "https://arxiv.org/abs/2509.19131", "authors": ["Jan Kuske", "Takayuki Miyagi", "Almudena Arcones", "Achim Schwenk"], "title": "r-process nucleosynthesis with ab initio nuclear masses around the N=82 shell closure", "comment": "7 pages, 4 figures", "summary": "Our understanding of the origin of heavy elements beyond iron relies on the\nrapid neutron capture process (r-process), which accounts for roughly half of\ntheir cosmic abundance. However, the extreme neutron-rich conditions required\nfor the r-process involve many nuclei that remain experimentally inaccessible,\nmaking theoretical predictions essential. We explore the impact of nuclear\nmasses calculated with the ab initio valence-space in-medium similarity\nrenormalization group, focusing on the region around the N = 82 shell closure.\nWe show that such ab initio mass calculations can refine the r-process\npredictions compared to global, but more phenomenological mass models. With the\nab initio masses, the waiting point of the second r-process peak is\nstrengthened, which leads to an overall slower nucleosynthesis flow, lower\nabundances of nuclei beyond the peak, and a stronger shift of the third\nr-process peak."}
{"id": "2509.19133", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.19133", "abs": "https://arxiv.org/abs/2509.19133", "authors": ["M. Z. Buhariwalla", "J. M. Miller", "L. C. Gallo", "J. Mao", "J. Raymond", "T. Kallman"], "title": "On the Fe xxii Emission in the X-ray spectrum of NGC 1068", "comment": "15 pages plus appendix, 11 figures. Accepted into ApJ", "summary": "The Fe xxii doublet has been previously used to determine the density of\ncollisionally ionized emission from magnetic cataclysmic variable stars. We\ntest how this diagnostic doublet behaves for a photoionized plasma with an\nactive galactic nucleus (AGN) spectral energy distribution (SED). We use the\nphotoionized plasma code pion and ~440 ks of archival Chandra HETG for the\nwell-known Seyfert 2 galaxy NGC 1068 to test the behaviour of the Fe xxii\ndoublet in the context of an AGN. This marks the first time these data have\nbeen examined with pion. We find that in a photoionized plasma, the Fe xxii\ndoublet is dependent on the density, ionization state, and SED used. Thus, this\ndensity diagnostic remains model-dependent. In the context of NGC 1068 the\ndoublet predicts an emission region ~100 rg from the central black hole. This\nwould require a direct line of sight to the central engine, which is at odds\nwith the Seyfert 2 nature of this source. In practice, these results highlight\nthe complexities and challenges of applying photoionized models. With these\ndata, we cannot exclude the possibility of a direct line of sight to the\ncentral engine of NGC 1068, but we cannot confirm it. Future observations with\ninstruments such as Athena are needed to explore the Fe xxii doublet further."}
{"id": "2509.19173", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.19173", "abs": "https://arxiv.org/abs/2509.19173", "authors": ["V. Bosch-Ramon", "M. V. Barkov"], "title": "Magnetar-like flares behind the high-energy emission in LS 5039", "comment": "9 pages, 7 figures, abstract abridged, submitted to Astronomy and\n  Astrophysics", "summary": "LS 5039 hosts a high-mass star, and a compact object that might be a strongly\nmagnetized neutron star (NS). This scenario requires a mechanism to power its\npersistent and strong non-thermal emission. We investigate a mechanism in which\nthe non-steady interaction structure of the stellar and the NS winds can\nregularly excite NS magnetospheric activity, releasing extra energy and fueling\nthe source non-thermal emission. The NS wind shocked by the stellar wind can\nrecurrently touch the NS magnetosphere, triggering magnetic instabilities whose\ngrowth can release extra energy into the NS wind in a cyclic manner. To\nillustrate and study the impact of these cycles on the two-wind interaction\nstructure on different scales, we performed relativistic hydrodynamics\nsimulations in 2D and 3D with periods of an enhanced power in the NS wind along\nthe orbit. We also used analytical tools to characterize processes near the NS\nrelevant for the non-thermal emission. As the NS wind termination shock touches\nthe magnetosphere energy dissipation occurs, but the whole shocked two-wind\nstructure is eventually driven away halting the extra energy injection.\nHowever, due to the corresponding drop in the NS wind ram pressure, the\ntermination shock propagates back towards the magnetosphere, resuming the\nprocess. These activity cycles excite strong waves in the shocked flows,\nintensifying their mixing and the disruption of their spiral-like structure\nproduced by orbital motion. Further downstream, the shocked winds can become a\nquasi-stable, relatively smooth flow. The recurrent interaction between the NS\nmagnetosphere and shocked wind can fuel a relativistic outflow powerful enough\nto explain the non-thermal emission of LS 5039. A magnetospheric multipolar\nmagnetic field much stronger than the dipolar one may provide the required\nenergetics, and help to explain the lack of evidence of a recent supernova\nremnant."}
{"id": "2509.19264", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.19264", "abs": "https://arxiv.org/abs/2509.19264", "authors": ["Noam Soker"], "title": "Jittering jets promote dust formation in core-collapse supernovae", "comment": "This Letter (3 text pages) will be submitted in two days to allow for\n  comments (including missing references)", "summary": "I find that the dust morphologies in some core-collapse supernova (CCSN)\nremnants (CCSNRs) possess jet-shaped morphologies, and propose that the\nproperties of the jets that explode the CCSNe and their interaction with the\ncore and envelope (if it exists) are among the factors that determine the\namount of dust formed and its morphology. I find that some of the dust-rich\nstructures in the CCSNRs Cassiopeia A and the Crab Nebula are distributed in\npoint-symmetric morphologies, and that the dust in SN 1987A follows the bipolar\nmorphology of the inner ejecta. Earlier studies attributed these morphologies\nin these CCSNRs to shaping by jets in the framework of the jittering jets\nexplosion mechanism (JJEM). These dust morphologies suggest, in the framework\nof the JJEM, that exploding jets enhance dust formation in CCSNRs. This study\nadds to the variety of processes that CCSN exploding jets are involved in and\nto the establishment of the JJEM as the explosion mechanism of CCSNe."}
{"id": "2509.18236", "categories": ["astro-ph.IM", "astro-ph.GA", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.18236", "abs": "https://arxiv.org/abs/2509.18236", "authors": ["S. Stepanoff", "A. N. Otte", "M. Bagheri", "A. Barletta", "D. Bergmann", "J. Blose", "J. Bogdan", "A. M. Brown", "L. Cedeno", "M. Doro", "M. Fedkevych", "S. Gadamsetty", "F. Giordano", "C. Hao", "V. Iyengar", "D. Kieda", "N. Lew", "M. Mariotti", "Y. Onel", "D. A. Raudales O.", "L. Rojas Castillo", "A. Ronemus", "A. Menon", "A. Mitra", "E. Schapera", "D. Solden", "N. Song", "W. Springer", "I. Taboada", "K. Tran", "A. Wilcox", "A. Zhang"], "title": "Status of the Trinity PeV Neutrino Observatory", "comment": "9 pages, 9 figures, ICRC 2025", "summary": "The Trinity Neutrino Observatory aims to detect tau neutrinos in the energy\nrange of 1 PeV to 10 EeV. We are developing the observatory in three stages.\nThe first stage, known as the Trinity Demonstrator, was deployed in Fall 2023.\nThe Demonstrator serves as a pathfinder for the full observatory and will\ninform the design of the first Trinity Telescope. We discuss the status and\ninitial results of the Trinity Demonstrator. In 346 hours of observations with\nthe Demonstrator, we do not identify a neutrino candidate event."}
{"id": "2509.18368", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.18368", "abs": "https://arxiv.org/abs/2509.18368", "authors": ["Pawan Giri"], "title": "Advancing ARA: the Next-Generation (ARA-Next) DAQ System", "comment": "Pos(ICRC 2025) 1044", "summary": "The Askaryan Radio Array (ARA) has been operating at the South Pole for over\na decade, searching for ultra-high energy astrophysical and cosmogenic\nneutrinos using the Askaryan effect. ARA has consistently served as a testbed\nfor innovative trigger designs and advancing electronic upgrades, with ongoing\ndata acquisition (DAQ) improvements over the past 2-3 years and a long-term\nplan to transition to Radio Frequency System on Chip (RFSoC) technology. This\nupgrade enables real-time data processing and sophisticated triggers, enhancing\nefficiency by identifying double pulses from in-ice neutrino interactions,\nusing templates for cosmic rays, searching for real-time coincidences with the\nIceCube detector observations, and filtering anthropogenic noise through\ndirectional analysis. In 2024, two of the five ARA stations received DAQ\nupgrades, improving the existing electronics, with RFSoC-based DAQ foreseen in\nthe coming years. In this proceedings contribution, recent ARA activities are\npresented, with emphasis on the planned ARA-Next trigger strategies involving\nRFSoC technology and the 2024-2025 season upgrades of the existing ATRI-based\nDAQ system to its revised version."}
