{"id": "2509.15320", "categories": ["astro-ph.HE", "physics.plasm-ph"], "pdf": "https://arxiv.org/pdf/2509.15320", "abs": "https://arxiv.org/abs/2509.15320", "authors": ["Jeremiah Lübke", "Frederic Effenberger", "Mike Wilbert", "Horst Fichtner", "Rainer Grauer"], "title": "Anisotropic Cosmic Ray Transport resulting from Magnetic Mirroring and Resonant Curvature Scattering", "comment": "17 pages, 6 figures. Comments welcome!", "summary": "The transport of cosmic rays through turbulent astrophysical plasmas still\nconstitutes an open problem. Building on recent progress, we study the combined\neffect of magnetic mirroring and resonant curvature scattering on parallel and\nperpendicular transport. We conduct test particle simulations in snapshots of\nan anisotropic magnetohydrodynamics simulation, and record magnetic moment\nvariation and field line curvature around pitch angle reversals. We find for\nstrongly magnetized particles that (i) pitch angle reversals may occur either\nin coherent regions of the field with small variation of the magnetic moment\nvia magnetic mirroring, or in chaotic regions of the field with strong\nvariation of the magnetic moment via resonant curvature scattering; (ii)\nparallel transport can be modeled as a L\\'evy walk with a truncated power-law\ndistribution based on pitch angle reversal times; and (iii) perpendicular\ntransport is enhanced by resonant curvature scattering in synergy with chaotic\nfield line separation, and diminished by magnetic mirroring due to confinement\nin locally ordered field line bundles. While magnetic mirroring constitutes the\nbulk of reversal events, resonant curvature scattering additionally acts on\ntrajectories which fall in the loss cones of typical mirroring structures and\nthus provides the cut-off for the reversal time distribution. Our results,\nwhich highlight the role of the magnetic field line geometry in cosmic ray\ntransport processes, are consistent with energy-independent diffusion\ncoefficients. We conclude by considering how energy-dependent observations\ncould arise from an intermittently inhomogeneous interstellar medium."}
{"id": "2509.15408", "categories": ["astro-ph.HE", "hep-ph"], "pdf": "https://arxiv.org/pdf/2509.15408", "abs": "https://arxiv.org/abs/2509.15408", "authors": ["Stef Verpoest", "Marisol Catalan Olais", "Frank Schroeder"], "title": "Sensitivity of seasonal variations of the muon energy spectrum in air showers to hadronic interaction models and the cosmic-ray mass composition", "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC2025)", "summary": "The energy spectrum of muons produced in air showers depends not only on the\nproperties of the primary particle, but also on the atmosphere. This is because\nof the competition between decay and interaction of the parent mesons, which\ndepends on the atmospheric density. As a result, the number of muons at ground\nshows a seasonal variation, with the strength of the variation depending on the\nprimary cosmic-ray energy, mass, as well as the energy of the detected muons.\nIn this contribution, we study the variations of the muon energy spectrum in\nair showers using MCEq, a numerical solver of the cascade equations. In\nparticular, we show how the amplitude of the seasonal variations of the number\nof high-energy (O(TeV)) muons in the shower depends on the primary energy,\nmass, as well as the assumed hadronic interaction model. A measurement of these\nvariations is possible with the combination of a surface air-shower array and a\ndeep underground detector, which provide a simultaneous measurement of the\nprimary energy and the high-energy muon multiplicity, and may provide a new way\nto probe the cosmic-ray mass composition and hadronic interactions."}
{"id": "2509.15421", "categories": ["astro-ph.HE", "astro-ph.GA", "hep-ph"], "pdf": "https://arxiv.org/pdf/2509.15421", "abs": "https://arxiv.org/abs/2509.15421", "authors": ["Carlos Blanco", "Dan Hooper", "Tim Linden", "Elena Pinetti"], "title": "The Impact of Muon and Pion Cooling on the Neutrino Spectrum of NGC 1068", "comment": "6 pages, 2 figures", "summary": "The IceCube Neutrino Observatory has detected a flux of $\\sim 1-10 \\, {\\rm\nTeV}$ neutrinos from the active galaxy, NGC 1068. The soft spectral index of\nthese neutrinos has previously been interpreted as an indication that this\nsource accelerates protons only up to energies of several hundred TeV. Here, we\npropose that this source might instead accelerate protons to significantly\nhigher energies, but that the charged pions and muons produced in their\ninteractions undergo significant synchrotron energy losses before they can\ndecay, leading to a cutoff in the neutrino spectrum at TeV-scale energies. This\nscenario would require very strong magnetic fields to be present in the\nacceleration region of NGC 1068, on the order of $B \\sim 10^7 \\, {\\rm G}$. We\npoint out that this synchrotron cooling would impact the flavor ratios of the\nneutrinos from this source, providing a means to test this scenario with future\nvery-large volume neutrino telescopes."}
{"id": "2509.15442", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.15442", "abs": "https://arxiv.org/abs/2509.15442", "authors": ["The CTAO Consortium"], "title": "CTAO Contributions to the 39th International Cosmic Ray Conference (ICRC 2025)", "comment": "61 contributions to ICRC 2025 from the CTAO Consortium", "summary": "This index contains the proceedings submitted to the 39th International\nCosmic Ray Conference (ICRC 2025) on behalf of the CTAO Consortium."}
{"id": "2509.15413", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.15413", "abs": "https://arxiv.org/abs/2509.15413", "authors": ["Andrew Zeolla", "Ingo Allekotte", "Jaime Alvarez-Muñiz", "Sergio Cabana-Freire", "Valentin Decoene", "Luciano Ferreyro", "Arsène Ferrière", "Matias Hampel", "Kumiko Kotera", "Olivier Martineau-Huynh", "Valentin Niess", "Federico Sanchez", "Stephanie Wissel"], "title": "Optimizing HERON for 100 PeV Neutrino Detection", "comment": null, "summary": "The Hybrid Elevated Radio Observatory for Neutrinos (HERON) is designed to\ntarget the astrophysical flux of Earth-skimming tau neutrinos at 100 PeV. HERON\nconsists of multiple compact, phased radio arrays embedded within a larger\nsparse array of antennas, located on the side of a mountain. This hybrid design\nprovides both excellent sensitivity and a sub-degree pointing resolution. To\ndesign HERON, a suite of simulations accounting for tau propagation, shower\ndevelopment, radio emission, and antenna response were used. These simulations\nwere used to discover the array layout which provides maximum sensitivity at\n100 PeV, as well to select the optimal antenna design. Additionally, the event\nreconstruction accuracy has been tested for various designs of the sparse array\nvia simulated interferometry. Here, we present the HERON simulation procedure\nand its results."}
{"id": "2509.15469", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.15469", "abs": "https://arxiv.org/abs/2509.15469", "authors": ["Mary Hall Reno", "John F. Krizmanic"], "title": "$ν$SpaceSim: A Comprehensive Simulation Package for Modeling the Measurement of Cosmic Neutrinos using the Earth as the Neutrino Target and Space-based Detectors", "comment": "Submitted to the Proccedings of the 39th International Cosmic Ray\n  Conference (ICRC 2025) in Geneva, Switzerland", "summary": "$\\nu$SpaceSim is a highly-efficient (e.g., fast) module-based, end-to-end\nsimulation package that models the physical processes of cosmic neutrino\ninteractions that leads to detectable signals for sub-orbital and space-based\ninstruments. Starting with an input flux of neutrinos incident on a\nuser-specified geometry in the Earth, the flux of Earth-emergent leptons are\ncalculated followed by their subsequent extensive air showers (EAS). Next, the\nEAS optical Cherenkov and radio emission, signal attenuation to the detector,\nand the detector response are modeled to determine the sensitivity to both the\ndiffuse cosmic neutrinos and transient neutrino sources. Using the Earth as a\ntau neutrino target and the atmosphere as the signal generator effectively\nforms a detector with a mega-gigaton mass. Furthermore, \\taon decays and\nneutrino neutral-current interactions within the Earth (re)generates a flux of\nlower energy tau neutrinos that can also interact in the Earth thus enhancing\nthe detection probability. $\\nu$SpaceSim provides a tool to both understand the\ndata from recent experiments such as EUSO-SPB2 as well as design/understand the\nperformance the next generation of balloon- and space-based experiments,\nincluding POEMMA Balloon with Radio (PBR) and the Payload for Ultrahigh Energy\nObservations (PUEO). In this paper the $\\nu$SpaceSim software, physics\nmodeling, and the cosmic neutrino measurement capabilities of example\nsub-orbital and space-based experimental configurations are presented as well\nas status of planned modeling upgrades."}
{"id": "2509.15489", "categories": ["astro-ph.IM", "astro-ph.EP"], "pdf": "https://arxiv.org/pdf/2509.15489", "abs": "https://arxiv.org/abs/2509.15489", "authors": ["Athira Unni", "Steph Sallum", "Peyton Benac", "Michael P. Fitzgerald", "Max Brodheim", "Rosalie McGurk", "Andy Skemer", "William T. S. Deich"], "title": "SCALES-DRP : A Data Reduction Pipeline for an Upcoming Keck Thermal Infrared Spectrograph", "comment": null, "summary": "We present the end-to-end data reduction pipeline for SCALES (Slicer Combined\nwith Array of Lenslets for Exoplanet Spectroscopy), the upcoming\nthermal-infrared, diffraction-limited imager, and low and medium-resolution\nintegral field spectrograph (IFS) for the Keck II telescope. The pipeline\nconstructs a ramp from a set of reads and performs optimal extraction and\nchi-square extraction to reconstruct the 3D IFS datacube. To perform spectral\nextraction, wavelength calibration, and sky subtraction, the pipeline utilizes\nrectification matrices produced using position-dependent lenslet point spread\nfunctions (PSFs) derived from calibration exposures. The extracted 3D data\ncubes provide intensity values along with their corresponding uncertainties for\neach spatial and spectral measurement. The SCALES pipeline is under active\ndevelopment, implemented in Python within the Keck data reduction framework,\nand is openly available on GitHub along with dedicated documentation."}
{"id": "2509.15581", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.15581", "abs": "https://arxiv.org/abs/2509.15581", "authors": ["A. Sanna", "G. K. Jaisawal", "T. E. Strohmayer", "G. Illiano", "A. Riggio", "A. Papitto", "T. Di Salvo", "L. Burderi", "J. B. Coley", "D. Altamirano", "C. Malacaria", "A. Anitra", "M. Ng", "D. Chakrabarty", "A. C. Albayati"], "title": "The 2025 outburst of IGR J17511-3057: timing and spectral insights from NICER and NuSTAR", "comment": "16 pages, 11 figures, 2 tables. Accepted for publication in A&A", "summary": "IGR J17511-3057 was observed in a new outburst phase starting in February\n2025 and lasting at least nine days. We investigated the spectral and temporal\nproperties of IGR J17511-3057, aiming to characterise its current status and\nhighlight possible long-term evolution of its properties. We analysed the\navailable NICER and NuSTAR observations performed during the latest outburst of\nthe source. We updated the ephemerides of the neutron star and compared them to\nprevious outbursts to investigate its long-term evolution. We also performed\nspectral analysis of the broadband energy spectrum in different outburst\nphases, and investigated the time-resolved spectrum of the type-I X-ray burst\nevent observed with NuSTAR. We detected X-ray pulsations at a frequency of\naround 245 Hz. The long-term evolution of the neutron star ephemerides suggests\na spin-down derivative of about -2.3e-15 Hz/s, compatible with a\nrotation-powered phase while in quiescence. Moreover, the evolution of the\norbital period and the time of the ascending node suggests a fast orbital\nshrinkage, which challenges the standard evolution scenario for this class of\npulsars involving angular momentum loss via gravitational wave emission. The\nspectral analysis revealed a dominant power-law-like Comptonisation component,\nalong with a thermal blackbody component, consistent with a hard state. Weak\nbroad emission residuals around 6.6 keV suggest the presence of a K-alpha\ntransition of neutral or He-like Fe originating from the inner region of the\naccretion disc. Self-consistent reflection models confirmed a moderate\nionisation of the disc truncated at around (82-370) km from the neutron star.\nFinally, the study of the type-I X-ray burst revealed no signature of\nphotospheric radius expansion. We found marginally significant burst\noscillations during the rise and decay of the event, consistent with the\nneutron star spin frequency."}
{"id": "2509.15586", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.15586", "abs": "https://arxiv.org/abs/2509.15586", "authors": ["M. Iori", "L. Recchia", "F. Ferrarotto", "A. Girardi", "R. Lunadei"], "title": "The optical calibration system for the CTAO North Large Sized Telescope", "comment": "6 pages 6 fugures", "summary": "In 2018, the first prototype of the optical calibration system was installed\nin the Large Sized Telescopes, LST-1 at the Observatorio del Roque de los\nMuchachos, ORM, in La Palma, Canary Islands. We have almost completed the\nconstruction of the three remaining ones that will be mounted by 2026 on\nLST-2-3-4. The main feature of this system is to ensure a stable and constant\nphoton flux over time with the characteristics of a signal produced by\nCherenkov light when a high-energy gamma ray crosses the atmosphere. Test\nresults that show the performance of the optical calibration system have been\nrecently published. In this article, we present in detail the system used to\nmonitor the photon flux."}
{"id": "2509.15619", "categories": ["astro-ph.HE", "gr-qc"], "pdf": "https://arxiv.org/pdf/2509.15619", "abs": "https://arxiv.org/abs/2509.15619", "authors": ["Masaru Shibata", "Sho Fujibayashi"], "title": "Collapse of rotating very massive stellar cores leading to a black hole and a massive disk as a source of gravitational waves", "comment": "11 pages, 8 figures. Submitted to ApJ", "summary": "We derive models of rotating very massive stellar cores with mass $\\approx\n10^2$--$10^4M_\\odot$ which are marginally stable to the pair-unstable collapse,\nassuming that the core is isentropic and composed primarily of oxygen. It is\nshown that the cores with mass $\\lesssim 10^3M_\\odot$ can form a massive disk\nwith the mass more than 10% of the core mass around the formed black hole if\nthe core is rotating with more than 30% of the Keplerian limit. We also\nindicate that the formation of rapidly spinning massive black holes such as the\nblack holes of GW231123 naturally accompanies the massive disk formation. By\nusing the result of our previous study which showed that the massive disk is\nunstable to the non-axisymmetric deformation, we predict the amplitude and\nfrequency of gravitational waves and show that the collapse of rotating very\nmassive stellar cores can be a promising source of gravitational waves for\nEinstein Telescope. The detection of such gravitational waves will provide us\nwith important information about a formation process of intermediate mass black\nholes."}
{"id": "2509.15841", "categories": ["astro-ph.IM", "gr-qc", "hep-ph", "hep-th", "physics.atom-ph"], "pdf": "https://arxiv.org/pdf/2509.15841", "abs": "https://arxiv.org/abs/2509.15841", "authors": ["G. Barontini", "X. Calmet", "V. Guarrera", "A. Smith", "A. Vecchio"], "title": "Detecting milli-Hz gravitational waves with optical resonators", "comment": "to appear in Classical and Quantum Gravity", "summary": "We propose a gravitational wave detector based on ultrastable optical\ncavities enabling the detection of gravitational wave signals in the mostly\nunexplored $10^{-5}-1$ Hz frequency band. We illustrate the working principle\nof the detector and discuss that several classes of gravitational wave sources,\nboth of astrophysical and cosmological origin, may be within the detection\nrange of this instrument. Our work suggests that terrestrial gravitational wave\ndetection in the milli-Hz frequency range is potentially within reach with\ncurrent technology."}
{"id": "2509.15646", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.15646", "abs": "https://arxiv.org/abs/2509.15646", "authors": ["Sharan Banagiri", "Eric Thrane", "Paul D. Lasky"], "title": "Evidence for Three Subpopulations of Merging Binary Black Holes at Different Primary Masses", "comment": null, "summary": "With the release of the fourth LIGO--Virgo--KAGRA gravitational-wave catalog\n(GWTC-4), we are starting to gain a detailed view of the population of merging\nbinary black holes. The formation channels of these black holes is not clearly\nunderstood, but different formation mechanisms may lead to subpopulations with\ndifferent properties visible in gravitational-wave data. Adopting a\nphenomenological approach, we find GWTC-4 data supports the presence of at\nleast three subpopulations, each associated with a different range of black\nhole mass and with sharp transition boundaries between them. Each subpopulation\nis characterized by different distributions for either the mass ratios, the\nblack-hole spin magnitudes or both. Subpopulation A with primary mass $m_1 \\leq\n27.7^{+4.1}_{-3.4} M_{\\odot}$ ($90 \\%$ credibility), is characterized by a\nnearly flat mass ratio distribution $q=m_2/m_1$, and by small spin magnitudes\n($\\chi \\leq 0.5^{+0.1}_{-0.1}$). Subpopulation B with $27.7^{+4.1}_{-3.4}\nM_{\\odot} \\leq m_1 \\leq 40.2^{+4.7}_{-3.2} M_{\\odot}$, has a much sharper\npreference for mass ratio $q \\approx 1$. Subpopulation C, with $m_1 \\geq\n40.2^{+4.7}_{-3.2} M_{\\odot}$, has support for large spin magnitudes, and\ntentative support for mass ratios $q\\approx0.5$. We interpret these transitions\nas evidence for multiple subpopulations, each potentially associated with a\ndifferent formation pathways. We suggest potential formation scenarios for each\nsubpopulations, and suggest that Subpopulation B may be associated with\nchemically homogeneous evolution or population III stars. Our findings for\nSubpopulation C are largely consistent with recent claims of hierarchical\nmergers, but with some curious differences in properties."}
{"id": "2509.15970", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.15970", "abs": "https://arxiv.org/abs/2509.15970", "authors": ["CTAO-ACADA Collaboration", ":", "Luca Castaldini", "Andrea Bulgarelli", "Vincent Pollet", "Gabriele Panebianco", "Pierre Aubert", "Sami Caroff", "Giovanni De Cesare", "Ambra Di Piano", "Valentina Fioretti", "Gilles Maurin", "Thibaut Oprinsen", "Nicolò Parmiggiani", "Thomas Vuillaume", "Igor Oya", "Kathrin Egberts"], "title": "The new architecture design of the Science Alert Generation pipeline of the Cherenkov Telescope Array Observatory", "comment": "8 pages, 2 figures, proceeding of 39th International Cosmic Ray\n  Conference (ICRC2025), Geneva, Switzerland", "summary": "The Cherenkov Telescope Array Observatory (CTAO) represents the\nnext-generation gamma-ray observatory and will operate for several decades. It\nwill be particularly suited to analyse transients and variable phenomena, which\nwill trigger real-time scientific alerts. To support this, the Science Alert\nGeneration (SAG) pipeline within the Array Control and Data Acquisition (ACADA)\nsystem will process data from telescope arrays in real time, using dedicated\npipelines for data reconstruction (SAG-RECO), data quality monitoring (SAG-DQ)\nand science monitoring (SAG-SCI). The Supervisor (SAG-SUP) oversees the dynamic\noperations of SAG and its integration with other ACADA components. SAG is\ndesigned to issue candidate science alerts within 20 s of data availability,\nprocessing events on multiple time scales (seconds to hours) and handling\ntrigger rates of tens of kHz. Meeting these requirements necessitates optimised\nsoftware and hardware architectures. This work presents recent developments in\nSAG's architecture, aimed at two main challenges: (1) selecting data only from\ntelescopes that have entered a stable tracking state, even when they begin\ntracking at different times during multi-telescope observations, and (2)\nincorporating environmental and system monitoring information to ensure high\ndata quality. SAG-SUP can retrieve real-time telescope status and environmental\nconditions from telescope managers and the weather station through the ACADA\nMonitoring system, collect them in a database and then use them to filter out\ndata from slewing phases or degraded conditions. These enhancements are crucial\nto ensure the reliability of science alerts and improve the overall performance\nand responsiveness of the CTAO real-time analysis framework."}
{"id": "2509.15712", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.15712", "abs": "https://arxiv.org/abs/2509.15712", "authors": ["S. Loru", "A. Ingallinera", "A. Pellizzoni", "E. Egron", "C. Bordiu", "G. Umana", "C. Trigilio", "F. Bufano", "M. N. Iacolina", "M. Marongiu", "S. Mulas", "C. Buemi", "F. Cavallaro", "P. Leto", "A. Melis", "P. Reich", "W. Reich", "S. Riggi", "A. C. Ruggeri"], "title": "Broadband radio study of the supernova remnant Kes 73", "comment": "11 pages, 9 figures, 3 tables", "summary": "Strong shocks occurring in supernova remnants (SNRs), and their interaction\nwith an often anisotropic surrounding medium, make SNRs ideal laboratories for\nstudying the production and acceleration of cosmic rays (CRs). Due to their\ncomplex morphology and phenomenology, different CR populations are expected to\nexist throughout the remnants, each characterized by its own energy spectrum. A\ncomprehensive understanding of particle acceleration mechanisms and energetics\nin SNRs requires spatially resolved spectral and morphological studies. We want\nto highlight the crucial role of high-resolution radio images at high\nfrequencies (> 10 GHz) for studying the spectral properties of different\nremnant regions and better constraining the models that describe their\nnon-thermal emission from radio to $\\gamma$-ray wavelengths. We studied the\nintegrated radio spectrum of the SNR Kes 73 using single-dish observations\nperformed with the Sardinia Radio Telescope (SRT) between 6.9 and 24.8 GHz,\ncomplemented by published data. The high-resolution map at 24.8 GHz was used to\nsearch for spatial variations in the spectral index across the remnant. We\npresent the SRT images of Kes 73, providing the highest-frequency morphological\nand spectral characterization ever obtained for this source. By combining our\n18.7 and 24.8 GHz maps with previously published interferometric images at 1.4\nand 5 GHz, we identify a flatter spectrum in the western bright region compared\nto the rest of the shell. In the same region, we detect overlapping $^12$CO\nmolecular emission and $\\gamma$-ray radiation, providing strong evidence of\nSNR-molecular cloud interaction and enhanced CR production. We modelled the\nnon-thermal radio to $\\gamma$-ray emission from this region, favouring a\nlepto-hadronic scenario with a maximum electron energy of 1.1 TeV and a\nmagnetic field strength of 25 $\\mu$G."}
{"id": "2509.15469", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.15469", "abs": "https://arxiv.org/abs/2509.15469", "authors": ["Mary Hall Reno", "John F. Krizmanic"], "title": "$ν$SpaceSim: A Comprehensive Simulation Package for Modeling the Measurement of Cosmic Neutrinos using the Earth as the Neutrino Target and Space-based Detectors", "comment": "Submitted to the Proccedings of the 39th International Cosmic Ray\n  Conference (ICRC 2025) in Geneva, Switzerland", "summary": "$\\nu$SpaceSim is a highly-efficient (e.g., fast) module-based, end-to-end\nsimulation package that models the physical processes of cosmic neutrino\ninteractions that leads to detectable signals for sub-orbital and space-based\ninstruments. Starting with an input flux of neutrinos incident on a\nuser-specified geometry in the Earth, the flux of Earth-emergent leptons are\ncalculated followed by their subsequent extensive air showers (EAS). Next, the\nEAS optical Cherenkov and radio emission, signal attenuation to the detector,\nand the detector response are modeled to determine the sensitivity to both the\ndiffuse cosmic neutrinos and transient neutrino sources. Using the Earth as a\ntau neutrino target and the atmosphere as the signal generator effectively\nforms a detector with a mega-gigaton mass. Furthermore, \\taon decays and\nneutrino neutral-current interactions within the Earth (re)generates a flux of\nlower energy tau neutrinos that can also interact in the Earth thus enhancing\nthe detection probability. $\\nu$SpaceSim provides a tool to both understand the\ndata from recent experiments such as EUSO-SPB2 as well as design/understand the\nperformance the next generation of balloon- and space-based experiments,\nincluding POEMMA Balloon with Radio (PBR) and the Payload for Ultrahigh Energy\nObservations (PUEO). In this paper the $\\nu$SpaceSim software, physics\nmodeling, and the cosmic neutrino measurement capabilities of example\nsub-orbital and space-based experimental configurations are presented as well\nas status of planned modeling upgrades."}
{"id": "2509.15720", "categories": ["astro-ph.HE", "astro-ph.CO"], "pdf": "https://arxiv.org/pdf/2509.15720", "abs": "https://arxiv.org/abs/2509.15720", "authors": ["Judit Pérez-Romero", "Mattia di Mauro", "Rémi Adam", "Miguel Á. Sánchez-Conde", "Gabrijela Zaharijas"], "title": "Search for cosmic-ray induced gamma-ray emission from local galaxy clusters using Fermi-LAT data", "comment": "8 pages, 3 figures, presented at the 39th International Cosmic Ray\n  Conference (ICRC2025)", "summary": "Galaxy clusters are the most massive gravitationally bound structures in the\nUniverse. Even if clusters are nearly virialized structures, they undergo\nmerging processes, creating merging shocks, and suffer from feedback from\ngalaxies and Active Galactic Nuclei; causing complex turbulent motions and\namplifying their magnetic fields. These processes act as acceleration\nmechanisms for the plasma of the intracluster medium (ICM), originating a\npopulation of cosmic rays (CRs). Leptonic CRs have long been detected, but we\nshould also expect a CR hadronic population that, through interactions with the\nICM, should produce neutral pions that decay into gamma-rays. The detection of\ndiffuse gamma-ray emission from galaxy clusters is one of the long-awaited\nmilestones for the high-energy astroparticle physics community. Still, no\nunambiguous detection has yet been obtained. In this talk, we will present the\nresults of a combined cluster analysis searching for CR-induced gamma-ray\nsignals, using 16 years of Fermi-LAT data. In our previous work (di Mauro et\nal. 2023) we obtained from the combined analysis of 49 local galaxy clusters\n(12 years of data) a hint of signal between 2.5-3 sigma. These results are\nconsistent with other works as well, which consistently find a non-vanishing\nhint of signal, around the detection threshold. In this new work, we use a\nsample of near, well-known galaxy clusters and develop CR-induced emission\ntemplates using well-established X-ray measurements for calibration, assuming\nself similarity for the members of our sample. To strengthen the robustness of\nour analysis, we define benchmark models to encapsulate the uncertainties in\nthe spectral and spatial profiles for the CR-induced emission and perform the\nstandard template-fitting analysis using the likelihood ratio test."}
{"id": "2509.15840", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.15840", "abs": "https://arxiv.org/abs/2509.15840", "authors": ["Marvin Gottowik"], "title": "Simulating radio emission from extensive air showers with CORSIKA 8", "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC\n  2025), 7 pages, 3 figures", "summary": "CORSIKA 8 is a modern, flexible framework for simulating particle cascades in\nair and dense media, allowing for fully customizable shower simulations. The\nradio module autonomously handles electric field calculations and propagation\nto observer locations. It supports simultaneous simulations with both the\n``Endpoint formalism'' as implemented in CoREAS and the ``ZHS'' algorithm from\nZHAireS. In this contribution, we validate the radio module by comparing\nair-shower simulations in CORSIKA 8, CORSIKA 7, and ZHAireS. We investigate the\nimpact of simulation parameters, such as the step size of particle tracks, on\nthe resulting radio signals and perform a detailed comparison of the\n``Endpoints'' and ``ZHS'' formalisms. For the same underlying showers simulated\nwith CORSIKA 8 with optimized step sizes, both formalisms converge to the same\nradiation energy within 2%. For CORSIKA 8 and CORSIKA 7, agreement on the\nradiation energy is better than 10% in the 30-80 MHz band and improves to\nbetter than 2% for 50-350 MHz. This consistency provides further confirmation\nof the accuracy of microscopic air-shower radio emission simulations which is\ncrucial for precise energy scale estimations using radio detection."}
{"id": "2509.15792", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.15792", "abs": "https://arxiv.org/abs/2509.15792", "authors": ["Yi-xuan Shao", "Ping Zhou", "Xiao Zhang", "Zhi-Yu Zhang", "Yang Chen", "Qin Han", "Di Li", "Xiang-Dong Li", "Jian-Bin Weng", "Yong Shao"], "title": "Absence of Radio Emission Reveals an Exceptionally Weak Explosion of the Putative Historical Supernova Pa 30", "comment": "10 pages, 3 figures. Accepted for publication in ApJL", "summary": "We present the first deep radio continuum observations of Pa 30, a nebula\nhosting a unique optical source driven by an ultrafast outflow with a velocity\nof 16,000 km s$^{-1}$. The nebula was proposed to be the remnant of a white\ndwarf merger that occurred in 1181CE. We report no detection of the radio\ndiffuse emission from Pa 30 or radio emission from the central source, setting\n$3\\sigma$ upper limit flux densities of $0.84\\,\\rm mJy$ and $0.29\\,\\rm mJy$ at\n1.5 GHz and 6 GHz, respectively, for Pa 30. The radio surface brightness of Pa\n30 is $\\sim 3$ orders of magnitude smaller than that of typical supernova\nremnants (SNRs) with comparable angular size. If Pa 30 is an SNR, our\nobservations show it to be the faintest known in the radio band. Considering\nthat 10\\% of the supernova (SN) kinetic energy is transferred to cosmic rays\n(CRs), the absence of radio synchrotron emission suggests that the SN kinetic\nenergy $\\lesssim3\\times 10^{47}(B/10 \\mu\\rm G)^{-1.65}$ erg, which is 3 to 4\norders of magnitude lower than that of typical SNRs and the lowest measured\namong Galactic SNRs. There is also an indication of inefficient CR acceleration\nfor this source. The low SN kinetic energy either implies the potential\nexistence of many more radio-faint, sub-energetic SNRs in our Galaxy or\nchallenges the SNR interpretation of Pa 30."}
{"id": "2509.15824", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.15824", "abs": "https://arxiv.org/abs/2509.15824", "authors": ["Run-Chao Chen", "Bin-Bin Zhang", "Chen-Wei Wang", "Wen-Jun Tan", "Shao-Lin Xiong", "Jun Yang", "Yi-Han Iris Yin", "Shuang-Nan Zhang", "Bing Zhang"], "title": "Evidence for a brief appearance of gamma-ray periodicity after a compact star merger", "comment": "43 pages, 10 figures, 2 tables; author's version. Published in Nature\n  Astronomy at https://www.nature.com/articles/s41550-025-02649-w", "summary": "The product of a compact star merger is usually hypothesized to be a\nhyperaccreting black hole, typically resulting in a gamma-ray burst (GRB) with\na duration shorter than 2~s. However, recent observations of GRB~211211A and\nGRB~230307A, both arising from compact star mergers, challenge this model due\nto their minute-long durations. The data from both events are consistent with\nhaving a nascent, rapidly spinning highly magnetized neutron star (a\nmillisecond magnetar) as the merger product and GRB engine, but a smoking gun\nsignature is still missing. Here we report strong but not yet conclusive\nevidence for the detection of a 909-Hz gamma-ray periodic signal during a brief\ntime window of GRB~230307A, which is consistent with the rotation frequency of\nsuch a millisecond magnetar. Notably, the periodic signal appeared for only\n160~ms at an epoch coinciding with the transition epoch when the jet emission\nfrom the GRB central engine ceased and when the delayed emission from high\nlatitudes started. If this signal is real, the temporal and spectral features\nof this gamma-ray periodicity can be consistently interpreted as asymmetric\nmini-jet emission from a dissipating Poynting-flux-dominated jet, as revealed\nby the energy-dependent light curve data of this burst."}
{"id": "2509.15840", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.15840", "abs": "https://arxiv.org/abs/2509.15840", "authors": ["Marvin Gottowik"], "title": "Simulating radio emission from extensive air showers with CORSIKA 8", "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC\n  2025), 7 pages, 3 figures", "summary": "CORSIKA 8 is a modern, flexible framework for simulating particle cascades in\nair and dense media, allowing for fully customizable shower simulations. The\nradio module autonomously handles electric field calculations and propagation\nto observer locations. It supports simultaneous simulations with both the\n``Endpoint formalism'' as implemented in CoREAS and the ``ZHS'' algorithm from\nZHAireS. In this contribution, we validate the radio module by comparing\nair-shower simulations in CORSIKA 8, CORSIKA 7, and ZHAireS. We investigate the\nimpact of simulation parameters, such as the step size of particle tracks, on\nthe resulting radio signals and perform a detailed comparison of the\n``Endpoints'' and ``ZHS'' formalisms. For the same underlying showers simulated\nwith CORSIKA 8 with optimized step sizes, both formalisms converge to the same\nradiation energy within 2%. For CORSIKA 8 and CORSIKA 7, agreement on the\nradiation energy is better than 10% in the 30-80 MHz band and improves to\nbetter than 2% for 50-350 MHz. This consistency provides further confirmation\nof the accuracy of microscopic air-shower radio emission simulations which is\ncrucial for precise energy scale estimations using radio detection."}
{"id": "2509.15851", "categories": ["astro-ph.HE", "hep-ex"], "pdf": "https://arxiv.org/pdf/2509.15851", "abs": "https://arxiv.org/abs/2509.15851", "authors": ["Tomonori Ikeda", "Atsushi Takada", "Taito Takemura", "Kei Yoshikawa", "Yuta Nakamura", "Ken Onozaka", "Mitsuru Abe", "Yoshitaka Mizumura", "Toru Tanimori"], "title": "Observation of the Galactic Center in the Sub-MeV Gamma-Ray Band with an Electron-Tracking Compton Camera", "comment": "8 pages, 4 figures", "summary": "We report the first detection of gamma-ray emission from the Galactic center\nin the 150-600 keV band using a linear, imaging-spectroscopy approach used in\ncommon telescopes with an electron-tracking Compton camera (ETCC) aboard the\nSMILE-2+ balloon experiment. A one-day flight over Australia resulted in a\nsignificant gamma-ray detection in the light curve and revealed a $7.9\\sigma$\nexcess in the image map from the Galactic center region. These results,\nobtained through a simple and unambiguous analysis, demonstrate the high\nreliability and sensitivity of the ETCC and establish its potential for future\nhigh-precision MeV gamma-ray observations. The measured intensity and spatial\ndistribution were tested against three emission models: a single point-like\nsource, a multi-component structure, and a symmetric two-dimensional Gaussian.\nAll models were found to be statistically consistent with the data. The\npositronium-related flux in the multi-component model is\n$(3.2~\\pm~1.4)~\\times~10^{-2}$ photons cm$^{-2}$s$^{-1}$, which is\napproximately a factor of two higher than the value reported by INTEGRAL, with\na discrepancy at the $2\\sigma$ level. This difference may arise from unresolved\nsources or truly diffuse emission, such as exotic processes involving light\ndark matter or primordial black holes."}
{"id": "2509.15862", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.15862", "abs": "https://arxiv.org/abs/2509.15862", "authors": ["Denise Boncioli"], "title": "A new view of UHECRs with the Pierre Auger Observatory", "comment": "8 pages, UHECR24 proceedings", "summary": "In its Phase I, the Pierre Auger Observatory has led to several observations,\ndriving the field of ultra-high-energy cosmic ray (UHECR) research over the\nlast 20 years. Major achievements obtained so far include the unprecedented\nprecise energy spectrum and its features, the observables linked to the UHECR\nmass composition and the distribution of arrival directions of the most\nenergetic events. These results, together with the non-observation of\nhigh-energy neutrinos and photons, strongly disfavor the pre-Auger pure-proton\nparadigm. In this talk, we will provide an overview on the main results of the\nObservatory, and describe possible astrophysical scenarios for their\ninterpretation. The prospects of improving the current understanding about\nUHECR characteristics during the Phase II of the Observatory will be also\nshown."}
{"id": "2509.15869", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.15869", "abs": "https://arxiv.org/abs/2509.15869", "authors": ["E. Ruiz-Velasco", "C. Arcaro", "M. de Bony de Lavergne", "Z. Huang", "D. Sanchez", "M. Senniappan", "S. Wagner", "S. Zhu", "the H. E. S. S. Collaboration"], "title": "Fifteen years of Gamma-Ray Burst observations at Very High Energies with H.E.S.S", "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC\n  2025), 2025", "summary": "We present results from the High Energy Stereoscopic System (H.E.S.S.)\nfollow-up observations of Gamma-ray Bursts (GRBs) between 2004 and 2019. We are\nfocusing on non-detections and providing the most extensive set of\nvery-high-energy (VHE, >100 GeV) upper limits to date. We use this catalogue to\nconstrain the properties of VHE-detected GRBs and compare them to those\ndetected at VHE. Our study finds that VHE-detected GRBs are not a distinct\npopulation but are instead associated with bright X-ray afterglows and low\nredshifts. In addition, we model the multi-wavelength emission of a few of the\nobserved GRBs and discuss the results in the context of their obtained\nmicrophysical parameters. The results from this work help put current VHE\nobservations into perspective and highlight the capabilities of next-generation\ninstruments, in detecting fainter and more distant GRBs at VHE."}
{"id": "2509.15949", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.15949", "abs": "https://arxiv.org/abs/2509.15949", "authors": ["Haoyue Wang", "Michael J. Keith", "Patrick Weltevrede", "Geoffrey Wright", "Bhaswati Bhattacharyya", "JuiAn Hsu", "Xiaoxi Song"], "title": "The Thousand-Pulsar-Array programme on MeerKAT -- XVIII. Complex sub-pulse modulation patterns, bi-drifting and mode changing of nine radio pulsars", "comment": "Submitted to MNRAS, under review", "summary": "We present a detailed analysis of sub-pulse modulations in nine pulsars which\nshow evidence of changes in sub-pulse drift direction as a function of pulse\nlongitude in the Thousand Pulsar Array single pulse survey with MeerKAT. We\nconfirm that all of these are consistent with persistent drift direction\nchanges. These 'bi-drifting' pulsars present a challenge to the classical\ncarousel model for sub-pulse drifting. In general, bi-drifting in this expanded\nsample is less clear than some of the previously published cases, which we\nattribute to narrower profile widths ($<20$ degrees) or smaller $P_3$ values\n(close to 2$P$). However, given the broad variety of pulse shapes and drift\nbehaviours across the pulsar population, it is unsurprising that the phenomenon\nis not limited to only those where it can most easily be detected. Four of our\nsamples show at least two emission modes with different profile shapes and\ndrift properties, which seems to be a relatively common feature of bi-drifting\npulsars. We also find jumps in sub-pulse phase between adjacent components in\ntwo pulsars. In addition to our MeerKAT L-band data, we used GMRT observations\nfor four, and MeerKAT UHF observations for two of these pulsars to investigate\nthe frequency dependence of sub-pulse drift. We find subtle changes in the\ndrift as a function of frequency, but no clear overall pattern. Looking at the\ndistribution of bi-drifting pulsars over $P$, $\\dot{P}$ and $P_3$ suggests they\nare consistent with the underlying population of all drifting pulsars."}
{"id": "2509.15977", "categories": ["astro-ph.HE", "hep-ph"], "pdf": "https://arxiv.org/pdf/2509.15977", "abs": "https://arxiv.org/abs/2509.15977", "authors": ["S. Karpov", "V. Lipunov"], "title": "Why Do We See So Few Black Holes in Massive Binaries?", "comment": "3 pages", "summary": "We offer a simple explanation for the small number of black holes observed in\npairs with massive stars. In detached massive binaries, spherically symmetric\naccretion takes place. This accretion could result in effective energy release\nin the hard band only if the equipartition of the gravitational and magnetic\nenergy of plasma is established (Shvartsmans theorem). However, we show that\ndue to the magnetic exhaust effect this equilibrium is virtually never\nestablished for the actual magnetic fields observed on massive stars:\nShvartsmans theorem does not work. As a result, it is virtually impossible to\ndetect black holes in detached massive binaries by currently available means\n(mainly, through X-ray observations)."}
{"id": "2509.16089", "categories": ["astro-ph.HE", "hep-ph"], "pdf": "https://arxiv.org/pdf/2509.16089", "abs": "https://arxiv.org/abs/2509.16089", "authors": ["Mikalai Prakapenia", "Gregory Vereshchagin"], "title": "Pair luminosity and cooling of newborn strange star I. Noninteracting quarks", "comment": "9 pages", "summary": "It was shown that pair luminosity of the newborn strange star with\ntemperature of $10^{11}$ K may be as high as $L_\\pm\\simeq 10^{52}$ erg/s. The\nquestion remains: can a strange star maintain such a high surface temperature\nfor a long time? To answer this question we studied thermal evolution of\nnewborn strange star taking into account thermal conductivity of free quarks\nand neutrino emission by the URCA process. Our results show that extremely high\nluminosity due to the Schwinger process and insufficient thermal conductivity\nof quarks leads to development of steep temperature gradient at the surface of\nstrange star. As a result, the temperature at the surface and hence its\nluminosity decreases as a power law, reaching $10^{40}$ erg/s already at 10 ms.\nThis result holds even in the presence of neutrinosphere."}
{"id": "2509.16092", "categories": ["astro-ph.HE", "astro-ph.CO"], "pdf": "https://arxiv.org/pdf/2509.16092", "abs": "https://arxiv.org/abs/2509.16092", "authors": ["Ténéman Keita", "Renaud Belmont", "Thierry Stolarczyk"], "title": "Expected Constraints on the Intergalactic Magnetic Field using Gamma-Ray Bursts with the Cherenkov Telescope Array Observatory", "comment": "8 pages, 4 figures, 39th International Cosmic Ray Conference (ICRC\n  2025)", "summary": "The InterGalactic Magnetic Field (IGMF), which could permeate the cosmic\nvoids but was never detected so far, is considered a relic of the early\nUniverse. Constraints on its strength $B$ can be derived from its influence on\ntime-delayed very-high-energy photons from Gamma-Ray Bursts (GRBs) in the\nelectromagnetic cascades along their path to the Earth. The present lower limit\nachieved on its intensity is $10^{-18}\\;\\mathrm{G}$. In this work, we simulate\ndata from the Cherenkov Telescope Array Observatory (CTAO), accounting for\nrealistic observational constraints, and we apply a joint spectral and temporal\nfit to characterize the IGMF. GRBs 190114C and 221009A are used as test cases\nto assess the sensitivity of CTAO. They demonstrate that a broad range of IGMF\nstrengths can be probed with a lower bound as high as $10^{-15}\\;\\mathrm{G}$.\nNotably, we show that observations by the CTAO first large telescope, LST-1,\nalready allow us to exclude field strengths up to $3\\times\n10^{-17}\\;\\mathrm{G}$."}
{"id": "2509.15413", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.15413", "abs": "https://arxiv.org/abs/2509.15413", "authors": ["Andrew Zeolla", "Ingo Allekotte", "Jaime Alvarez-Muñiz", "Sergio Cabana-Freire", "Valentin Decoene", "Luciano Ferreyro", "Arsène Ferrière", "Matias Hampel", "Kumiko Kotera", "Olivier Martineau-Huynh", "Valentin Niess", "Federico Sanchez", "Stephanie Wissel"], "title": "Optimizing HERON for 100 PeV Neutrino Detection", "comment": null, "summary": "The Hybrid Elevated Radio Observatory for Neutrinos (HERON) is designed to\ntarget the astrophysical flux of Earth-skimming tau neutrinos at 100 PeV. HERON\nconsists of multiple compact, phased radio arrays embedded within a larger\nsparse array of antennas, located on the side of a mountain. This hybrid design\nprovides both excellent sensitivity and a sub-degree pointing resolution. To\ndesign HERON, a suite of simulations accounting for tau propagation, shower\ndevelopment, radio emission, and antenna response were used. These simulations\nwere used to discover the array layout which provides maximum sensitivity at\n100 PeV, as well to select the optimal antenna design. Additionally, the event\nreconstruction accuracy has been tested for various designs of the sparse array\nvia simulated interferometry. Here, we present the HERON simulation procedure\nand its results."}
{"id": "2509.15970", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.15970", "abs": "https://arxiv.org/abs/2509.15970", "authors": ["CTAO-ACADA Collaboration", ":", "Luca Castaldini", "Andrea Bulgarelli", "Vincent Pollet", "Gabriele Panebianco", "Pierre Aubert", "Sami Caroff", "Giovanni De Cesare", "Ambra Di Piano", "Valentina Fioretti", "Gilles Maurin", "Thibaut Oprinsen", "Nicolò Parmiggiani", "Thomas Vuillaume", "Igor Oya", "Kathrin Egberts"], "title": "The new architecture design of the Science Alert Generation pipeline of the Cherenkov Telescope Array Observatory", "comment": "8 pages, 2 figures, proceeding of 39th International Cosmic Ray\n  Conference (ICRC2025), Geneva, Switzerland", "summary": "The Cherenkov Telescope Array Observatory (CTAO) represents the\nnext-generation gamma-ray observatory and will operate for several decades. It\nwill be particularly suited to analyse transients and variable phenomena, which\nwill trigger real-time scientific alerts. To support this, the Science Alert\nGeneration (SAG) pipeline within the Array Control and Data Acquisition (ACADA)\nsystem will process data from telescope arrays in real time, using dedicated\npipelines for data reconstruction (SAG-RECO), data quality monitoring (SAG-DQ)\nand science monitoring (SAG-SCI). The Supervisor (SAG-SUP) oversees the dynamic\noperations of SAG and its integration with other ACADA components. SAG is\ndesigned to issue candidate science alerts within 20 s of data availability,\nprocessing events on multiple time scales (seconds to hours) and handling\ntrigger rates of tens of kHz. Meeting these requirements necessitates optimised\nsoftware and hardware architectures. This work presents recent developments in\nSAG's architecture, aimed at two main challenges: (1) selecting data only from\ntelescopes that have entered a stable tracking state, even when they begin\ntracking at different times during multi-telescope observations, and (2)\nincorporating environmental and system monitoring information to ensure high\ndata quality. SAG-SUP can retrieve real-time telescope status and environmental\nconditions from telescope managers and the weather station through the ACADA\nMonitoring system, collect them in a database and then use them to filter out\ndata from slewing phases or degraded conditions. These enhancements are crucial\nto ensure the reliability of science alerts and improve the overall performance\nand responsiveness of the CTAO real-time analysis framework."}
