{"id": "2509.07048", "categories": ["astro-ph.IM", "astro-ph.EP"], "pdf": "https://arxiv.org/pdf/2509.07048", "abs": "https://arxiv.org/abs/2509.07048", "authors": ["David Garfinkle", "Alberto G. Rojo"], "title": "What is the maximum radius of cold planets?", "comment": "Accepted for publication in American Journal of Physics", "summary": "Planets have maximum radii close to that of Jupiter. Qualitatively, the\nreason for this maximum size is that, as one adds mass, the force of gravity\nbecomes sufficiently strong to cause the radius to decrease. We show that this\neffect can be understood quantitatively using a simple variational principle\nvery similar to that used to compute the size of the hydrogen atom."}
{"id": "2509.07057", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.07057", "abs": "https://arxiv.org/abs/2509.07057", "authors": ["H. Mahmoodzadeh", "P. Saracco", "P. Conconi", "B- Saggin", "D- Scaccabarozzi", "I. Di Antonio", "M. Riva", "E. Molinari", "C. Arcidiacono", "I. Arosio", "E. Cascone", "V. Cianniello", "V. De Caprio", "G. Di Rico", "B. Di Francesco", "C- Eredia", "P. Franzetti", "M. Fumana", "D. Greggio", "E. Portaluri", "M. Scalera"], "title": "Conceptual Opto-Mechanical design of SHARP: a near-infrared multi-mode spectrograph conceived for the next-generation telescopes", "comment": "Accepted for publication on JATIS, 25 pages, 23 figures", "summary": "The next generation of Extremely Large Telescopes (ELTs), with their wide\napertures and advanced Multi-Conjugate Adaptive Optics (MCAO) systems, will\nprovide unprecedented sharp and deep observations, even surpassing the\ncapabilities of James Webb Space Telescope (JWST). SHARP, a near-infrared\n(0.95-2.45 {\\mu}m) spectrograph, is designed to optimally exploit the\ncollecting area and angular resolution of these forthcoming ELTs, and\nspecifically optimized for the MCAO unit MORFEO at the ELT. SHARP includes two\nmain units: NEXUS, a Multi-Object Spectrograph (MOS), and VESPER, a\nmulti-Integral Field Unit. This paper outlines the opto-mechanical design of\nSHARP based on the scientific requirements of the project. The optical design\nis engineered to meet project specifications, featuring a compact mechanical\nstructure that minimizes the required cryogenic power while ensuring ease of\naccess for maintenance and straightforward assembly procedures."}
{"id": "2509.07090", "categories": ["astro-ph.IM", "gr-qc"], "pdf": "https://arxiv.org/pdf/2509.07090", "abs": "https://arxiv.org/abs/2509.07090", "authors": ["Kyle A. Gersbach", "Stephen R. Taylor", "Bence Bécsy", "Anna-Malin Lemke", "Andrea Mitridate", "Nihan Pol"], "title": "Mapping the Gravitational-wave Background Across the Spectrum with a Next-Generation Anisotropic Per-frequency Optimal Statistic", "comment": null, "summary": "With pulsar timing arrays (PTAs) having observed a gravitational wave\nbackground (GWB) at nanohertz frequencies, the focus of the field is shifting\ntowards determining and characterizing its origin. While the primary candidate\nis a population of GW-emitting supermassive black hole binaries (SMBHBs), many\nother cosmological processes could produce a GWB with similar spectral\nproperties as have been measured. One key argument to help differentiate an\nSMBHB GWB from a cosmologically sourced one is its level of anisotropy; a GWB\nsourced by a finite population will likely exhibit greater anisotropy than a\ncosmological GWB through finite source effects (``shot noise'') and potentially\nlarge-scale structure. Current PTA GWB anisotropy detection methods often use\nthe frequentist PTA optimal statistic for its fast estimation of pulsar pair\ncorrelations and relatively low computational overhead compared to\nspatially-correlated Bayesian analyses. However, there are critical limitations\nwith the status quo approach. In this paper, we improve this technique by\nincorporating three recent advancements: accounting for covariance between\npulsar pairwise estimates of correlated GWB power; the per-frequency optimal\nstatistic to dissect the GWB across the spectrum; and constructing\nnull-hypothesis statistical distributions that include cosmic variance. By\ncombining these methods, our new pipeline can localize GWB anisotropies to\nspecific frequencies, through which anisotropy detection prospects -- while\nimpacted by cosmic variance -- are shown to improve in our simulations from a\n$p$-value of $\\sim0.2$ in a broadband search to $\\sim0.01$ in the per-frequency\nsearch. Our methods are already incorporated in community-available code and\nready to deploy on forthcoming PTA datasets."}
{"id": "2509.07138", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.07138", "abs": "https://arxiv.org/abs/2509.07138", "authors": ["Rachel Bowens-Rubin", "Maïssa Salama", "Jayke S. Nguyen", "William Thompson", "Philip Hinz"], "title": "An on-sky investigation into factors limiting the performance of Keck-NIRC2 for conducting infrared high-contrast imaging", "comment": "Event: SPIE Astronomical Telescopes + Instrumentation, 2024,\n  Yokohama, Japan", "summary": "The most common instrument used by the exoplanet/brown dwarf direct imaging\ncommunity at the W.M. Keck Observatory is currently the NIRC2 near-infrared\nimager. We performed on-sky testing to investigate three effects which may be\nlimiting the performance of NIRC2 when conducting high-contrast imaging\nobservations from $3-5\\mu$m. First, we report the measurements of an on-sky\ntest of the throughput of the L/M vector vortex coronagraph. We quantify the\nthroughput and additional background flux penalties, noting that the\nperformance effects of using the vector vortex coronagraph in the Ms-filter are\ngreater than in the Lp-filter. Second, we utilize the recently commissioned\nNIRC2 electronics upgrade to measure the sky variability at sub-second speeds.\nWe find that the background varies at timescales of less than 30s, indicating\nthat the electronics upgrade may open an opportunity to improve the\nsky-background subtraction of future surveys. Third, we document the\ncontribution of the image derotator to the spatial non-uniformity in the\nbackground flux. We conclude by giving a set of recommendations of how the\nKeck-NIRC2 high-contrast imaging community can adapt their observing strategies\nto improve the sensitivity of future surveys."}
{"id": "2509.07059", "categories": ["astro-ph.HE", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2509.07059", "abs": "https://arxiv.org/abs/2509.07059", "authors": ["Swati Ravi", "Mason Ng", "Herman L. Marshall", "Andrea Gnarini"], "title": "What's the Buzz About GX 13+1? Constraining Coronal Geometry with QUEEN-BEE: A Bayesian Nested Sampling Framework for X-ray Polarization Rotation Analysis", "comment": "16 pages, 8 figures, 7 tables, submitted to ApJ", "summary": "Observations from the Imaging X-ray Polarimetry Explorer (IXPE) have revealed\nelectric vector position angle (EVPA) rotation in several neutron star low-mass\nX-ray binaries, including the galactic X-ray burster GX 13+1. We developed a\nnovel Bayesian nested sampling framework-\"Q-U Event-by-Event Nested sampling\nfor Bayesian EVPA Evolution\" (QUEEN-BEE)-to model unbinned Stokes parameters\nand infer optimal EVPA rotation rates in IXPE data. We then applied this\nframework to three previous IXPE observations of GX 13+1. In the first\nobservation, QUEEN-BEE recovers a rotation rate of 42+/-4 degrees/day,\nconsistent with prior binned analysis. Energy-binned QUEEN-BEE analysis of this\nfirst observation suggests a slab-like coronal geometry, providing the first\nconstraints between slab and shell coronae for this source. We also explore\nalternative EVPA rotation scenarios in GX 13+1 including variable disk wind\nbehavior. The second observation of this source shows no evidence of rotation,\nand the third observation shows transient rotating behavior with an EVPA\nrotation rate when exiting a light curve dip of 170 +20/-40 degrees/day. The\nresults show marginal but consistent increases in the overall measured\npolarization degree (PD) for epochs where the EVPA rotation is identified.\nThese results demonstrate that QUEEN-BEE can identify evolving polarization\nsignatures in both time- and energy-resolved regimes, even where binned methods\nfall below detection thresholds. Our findings highlight the diagnostic\npotential of QUEEN-BEE as a tool for discriminating between competing physical\nmodels of coronal geometry and probing disk-wind-related polarization behavior,\nhighlighting the promising potential for application of this framework in a\nvariety of other IXPE observations."}
{"id": "2509.07592", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.07592", "abs": "https://arxiv.org/abs/2509.07592", "authors": ["Simon R. Goode", "Sara A. Webb", "Jeff Cooke", "Jielai Zhang", "James Freeburn", "Amy Lien", "Mohsen Shamohammadi", "Alexandra Rosenthal", "Laura N. Driessen", "Christopher Fluke", "Ashish Mahabal", "Anais Möller", "Dougal Dobie", "Adam Batten", "Natasha Van Bemmel"], "title": "A Machine Learning empowered search for Sub-Minute Optical Transient Events with the Deeper, Wider, Faster programme", "comment": "15 pages, 15 figures, pipeline source code available at\n  https://github.com/simongoode/SMOTEs", "summary": "Optical transient surveys continue to generate increasingly large datasets,\nprompting the introduction of machine-learning algorithms to search for quality\ntransient candidates efficiently. Existing machine-learning infrastructure can\nbe leveraged in novel ways to search these datasets for new classes of\ntransients. We present a machine-learning accelerated search pipeline for the\nDeeper, Wider, Faster (DWF) programme designed to identify high-quality\nastrophysical transient candidates that contain a single detection. Given the\nrapid observing cadence of the DWF programme, these single-detection transient\ncandidates have durations on sub-minute timescales. This work marks the first\ntime optical transients have been systematically explored on these timescales,\nto a depth of m$\\sim$23. We report the discovery of two high-quality sub-minute\ntransient candidates from a pilot study of 671,761 light curves and investigate\ntheir potential origins with multiwavelength data. We discuss, in detail,\npossible non-astrophysical false positives, confidently reject electronic\nartefacts and asteroids, ruling out glints from satellites below 800 km and\nstrongly disfavouring those at higher altitudes. We calculate a rate on the sky\nof $4.72^{+6.39}_{-3.28}\\times10^5$ per day for these sub-minute transient\ncandidates."}
{"id": "2509.07065", "categories": ["astro-ph.HE", "astro-ph.IM", "gr-qc"], "pdf": "https://arxiv.org/pdf/2509.07065", "abs": "https://arxiv.org/abs/2509.07065", "authors": ["Pedro Naethe Motta", "Ben S. Prather", "Alejandro Cárdenas-Avendaño"], "title": "$\\texttt{Jipole}$: A Differentiable $\\texttt{ipole}$-based Code for Radiative Transfer in Curved Spacetimes", "comment": "14 pages, 11 figures. Comments are welcome", "summary": "Recent imaging of supermassive black holes by the Event Horizon Telescope\n(EHT) has relied on exhaustive parameter-space searches, matching observations\nto large, precomputed libraries of theoretical models. As observational data\nbecome increasingly precise, the limitations of this computationally expensive\napproach grow more acute, creating a pressing need for more efficient methods.\nIn this work, we present $\\texttt{Jipole}$, an automatically differentiable\n(AD), $\\texttt{ipole}$-based code for radiative transfer in curved spacetimes,\ndesigned to compute image gradients with respect to underlying model\nparameters. These gradients quantify how parameter changes-such as the black\nhole's spin or the observer's inclination-affect the image, enabling more\nefficient parameter estimation and reducing the number of required images. We\nvalidate $\\texttt{Jipole}$ against $\\texttt{ipole}$ in two analytical tests and\nthen compare pixel-wise intensity derivatives from AD with those from\nfinite-difference methods. We then demonstrate the utility of these gradients\nby performing parameter recovery for an analytical model using a conjugate\ngradient optimizer in three increasingly complex cases for the injected image:\nideal, blurred, and blurred with added noise. In most cases, high-accuracy fits\nare obtained in only a few optimization steps, failing only in cases with\nextremely low signal-to-noise ratios and large blurring size kernels. These\nresults highlight the potential of AD-based methods to accelerate robust,\nhigh-fidelity model-data comparisons in current and future black hole imaging\nefforts."}
{"id": "2509.07065", "categories": ["astro-ph.HE", "astro-ph.IM", "gr-qc"], "pdf": "https://arxiv.org/pdf/2509.07065", "abs": "https://arxiv.org/abs/2509.07065", "authors": ["Pedro Naethe Motta", "Ben S. Prather", "Alejandro Cárdenas-Avendaño"], "title": "$\\texttt{Jipole}$: A Differentiable $\\texttt{ipole}$-based Code for Radiative Transfer in Curved Spacetimes", "comment": "14 pages, 11 figures. Comments are welcome", "summary": "Recent imaging of supermassive black holes by the Event Horizon Telescope\n(EHT) has relied on exhaustive parameter-space searches, matching observations\nto large, precomputed libraries of theoretical models. As observational data\nbecome increasingly precise, the limitations of this computationally expensive\napproach grow more acute, creating a pressing need for more efficient methods.\nIn this work, we present $\\texttt{Jipole}$, an automatically differentiable\n(AD), $\\texttt{ipole}$-based code for radiative transfer in curved spacetimes,\ndesigned to compute image gradients with respect to underlying model\nparameters. These gradients quantify how parameter changes-such as the black\nhole's spin or the observer's inclination-affect the image, enabling more\nefficient parameter estimation and reducing the number of required images. We\nvalidate $\\texttt{Jipole}$ against $\\texttt{ipole}$ in two analytical tests and\nthen compare pixel-wise intensity derivatives from AD with those from\nfinite-difference methods. We then demonstrate the utility of these gradients\nby performing parameter recovery for an analytical model using a conjugate\ngradient optimizer in three increasingly complex cases for the injected image:\nideal, blurred, and blurred with added noise. In most cases, high-accuracy fits\nare obtained in only a few optimization steps, failing only in cases with\nextremely low signal-to-noise ratios and large blurring size kernels. These\nresults highlight the potential of AD-based methods to accelerate robust,\nhigh-fidelity model-data comparisons in current and future black hole imaging\nefforts."}
{"id": "2509.07067", "categories": ["astro-ph.HE", "astro-ph.GA", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2509.07067", "abs": "https://arxiv.org/abs/2509.07067", "authors": ["Sara Rastello", "Giuliano Iorio", "Mark Gieles", "Long Wang"], "title": "Micro-Tidal Disruption Events in Young Star Clusters", "comment": "19 pages, 13 figures; submitted to A&A (under review); comments\n  welcome", "summary": "Dense young star clusters (YSCs) are ideal environments for dynamical\ninteractions between stars and stellar mass black holes (BHs). In such dense\nenvironments, stars can undergo close encounters with BHs and fall within their\ntidal radius, resulting in micro-tidal disruption events (micro-TDEs),\ntransient phenomena with potential multi-messenger signatures. We performed a\nsuite of direct N-body simulations using the PETAR code, to which we\nimplemented new prescriptions for modeling micro-TDEs. We constructed a set of\nrealistic YSC models including primordial binaries, based on the observed Milky\nWay population. Our simulations incorporate stellar and binary evolution,\nsupernova kicks, and stellar winds using the BSE code, and account for the\nGalactic tidal field via the GALPY library. We identify three dynamical\nchannels for micro-TDE production: single star-single BH encounters,\nbinary-mediated interactions (including supernova-kick triggers), and\ninteractions involving higher-order multiple systems such as hierarchical\ntriples and quadruples, as well as chaotic few-body interactions. Multiple\nencounters are the most efficient production channel, which dominates the total\nrate: 350-450 Gpc$^{-3}$ yr$^{-1}$. Micro-TDEs from YSCs are expected to be\ndetectable by upcoming surveys, particularly the Legacy Survey of Space and\nTime, with detection rates potentially up to hundreds per year. The\ngravitational wave (GW) signals expected from micro-TDEs peak in the deci-Hertz\nband, making them accessible to future instruments such as the Lunar\nGravitational Wave Antenna and the Deci-Hertz Interferometer Gravitational-wave\nObservatory. Micro-TDEs emerge as promising multi-messenger sources,\npotentially offering unique insights into star cluster dynamics, stellar\ncollisions, and the population of dormant stellar-mass BHs, through both\nelectromagnetic and GW observations."}
{"id": "2509.07221", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.07221", "abs": "https://arxiv.org/abs/2509.07221", "authors": ["Jack Heinzel", "Salvatore Vitale"], "title": "When (not) to trust Monte Carlo approximations for hierarchical Bayesian inference", "comment": "40 pages, 24 figures", "summary": "The coming years of gravitational wave astrophysics promises thousands of new\ndetections, which can unlock fundamental scientific insights if the information\nin each observation can be properly synthesized into a coherent picture.\nState-of-the-art approaches often accomplish this with hierarchical Bayesian\ninference. However, this typically relies on Monte Carlo approximations that\nare already very expensive in current data, and may become prohibitively so in\nthe future. In this paper we show how this process can be understood from a\nfirst-principles statistical approach. We derive an error estimator $\\hat{E}$\nfor quantifying the amount of information that is lost due to the Monte Carlo\napproximation and recommend that this error is limited to no more than $\\hat{E}\n\\lesssim 0.2$ bits for reliable inference. We also show that the hierarchical\nlikelihood estimator is biased but may be corrected. Finally, we show some\npractical examples for inference on synthetic gravitational-wave population\ninference, demonstrating that simple models with strong assumptions can be much\nmore stable to Monte Carlo uncertainty than those with weaker assumptions. We\nalso provide a \\texttt{pip}-installable package \\texttt{population-error} with\nwhich analysts can calculate the error statistics $\\hat{E}$."}
{"id": "2509.07080", "categories": ["astro-ph.HE", "astro-ph.GA", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2509.07080", "abs": "https://arxiv.org/abs/2509.07080", "authors": ["Raphael Baer-Way", "A. J. Nayana", "Wynn Jacobson-Galan", "Poonam Chandra", "Maryam Modjaz", "Samantha C. Wu", "Daichi Tsuna", "Raffaella Margutti", "Ryan Chornock", "Craig Pellegrino", "Yize Dong", "Maria R. Drout", "Charles D. Kilpatrick", "Dan Milisavljevic", "Daniel Patnaude", "Candice Stauffer"], "title": "The first radio view of a type Ibn supernova in SN 2023fyq: Understanding the mass-loss history in the last decade before the explosion", "comment": "Submitted to ApJL, comments welcome. 15 pages, 7 Figures", "summary": "Supernovae that interact with hydrogen-poor, helium-rich circumstellar\nmaterial (CSM), known as Type Ibn supernovae (SNe Ibn), present a unique\nopportunity to probe mass-loss processes in massive stars. In this work, we\nreport the first radio detection of a SN Ibn, SN 2023fyq, and characterize the\nmass-loss history of its stellar progenitor using the radio and X-ray\nobservations obtained over 18 months post-explosion. We find that the radio\nemission from 58--185 days is best modeled by synchrotron radiation attenuated\nby free-free absorption from a CSM of density $\\sim$ $10^{-18}$ g/$\\rm{cm^{3}}$\n($\\sim 10^{6} \\mathrm{\\rho_{ISM}}$) at a radius of $10^{16}$ cm, corresponding\nto a mass-loss rate of $\\sim$ $4 \\times 10^{-3} \\ \\mathrm{M_{\\odot} \\ yr^{-1}}$\n(for a wind velocity of 1700 km/s from optical spectroscopy) from 0.7 to 3\nyears before the explosion. This timescale is consistent with the time frame\nover which pre-explosion optical outbursts were observed. However, our\nlate-time observations at 525 days post-explosion yield non-detections, and the\n3$\\sigma$ upper limits (along with an X-ray non-detection) allow us to infer\nlower-density CSM at $2\\times 10^{16}$ cm with $\\rm{\\dot{M}}$ $< 2.5\\times\n10^{-3} \\ \\mathrm{M_{\\odot} \\ yr^{-1}}$. These results suggest a shell-like CSM\nfrom at most $4 \\times 10^{15}$ to $2 \\times 10^{16}$ cm ($\\sim 10^{5}\nR_{\\rm{\\odot}}$) with an elevated CSM density (0.004 $\\mathrm{M_{\\odot} \\\nyr^{-1}}$) that is roughly consistent with predictions from a merger model for\nthis object. Future radio observations of a larger sample of SNe Ibn will\nprovide key details on the extent and density of their helium-rich CSM."}
{"id": "2509.07981", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.07981", "abs": "https://arxiv.org/abs/2509.07981", "authors": ["Jack T. Dinsmore", "Roger W. Romani"], "title": "Advanced Weights for IXPE Polarization Analysis", "comment": "8+2 pages, 4 figures. Submitted to ApJ", "summary": "As the Imaging X-ray Polarimetry Explorer (IXPE) measures increasingly faint\nsources, the need for precise polarimetry extraction becomes paramount. In\naddition to previously described neural-net (NN) weights, we introduce here\npoint-spread function weights and particle background weights, which can be\ncritical for faint sources. In some cases these can be augmented by time/phase\nand energy weights. We provide a publicly available analysis tool to\nincorporate these new weights, validate our method on simulated data, and test\nit on archival IXPE observations. Together these weights decrease the area of\nthe polarization uncertainty contour by a factor of two and will be essential\nfor background-limited IXPE observations."}
{"id": "2509.07081", "categories": ["astro-ph.HE", "gr-qc"], "pdf": "https://arxiv.org/pdf/2509.07081", "abs": "https://arxiv.org/abs/2509.07081", "authors": ["Miquel Miravet-Tenés", "Martin Obergaulinger", "Pablo Cerdá-Durán", "José A. Font", "Milton Ruiz"], "title": "Subgrid modelling of MRI-driven turbulence in differentially rotating neutron stars", "comment": "11 pages, 11 figures", "summary": "Following a binary neutron star (BNS) merger, the transient remnant is often\na fast-spinning, differentially rotating, magnetised hypermassive neutron star\n(HMNS). This object is prone to the magnetorotational instability (MRI) which\ndrives magnetohydrodynamic turbulence that significantly influences the HMNS\nglobal dynamics. A key consequence of turbulence is the outward transport of\nangular momentum which impacts the remnant's stability and lifetime. Most\nnumerical simulations of BNS mergers are unable to resolve the MRI due to its\ninherently small wavelength. To overcome this limitation, subgrid models have\nbeen proposed to capture the effects of unresolved small-scale physics in terms\nof large-scale quantities. We present the first implementation of our\nMHD-Instability-Induced Turbulence (MInIT) model in global Newtonian\nsimulations of MRI-sensitive, differentially rotating, magnetised neutron\nstars. Here, we show that by adding the corresponding turbulent stress tensors\nto the momentum equation, MInIT successfully reproduces the angular momentum\ntransport in neutron stars driven by small-scale turbulence."}
{"id": "2509.07141", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.07141", "abs": "https://arxiv.org/abs/2509.07141", "authors": ["Brendan O'Connor", "Paz Beniamini", "Eleonora Troja", "Malte Busmann", "Simone Dichiara", "Ramandeep Gill", "Jonathan Granot", "Michael Moss", "Xander Hall", "Antonella Palmese", "Niccolo Passaleva", "Yu-Han Yang"], "title": "The redshift distribution of Einstein Probe transients supports their relation to gamma-ray bursts", "comment": "Submitted to ApJL", "summary": "The launch of the \\textit{Einstein Probe} unleashed a new era of high-energy\ntransient discovery in the largely unexplored soft X-ray band. The\n\\textit{Einstein Probe} has detected a significant number of fast X-ray\ntransients that display no gamma-ray emission, complicating their robust\nassociation to more common gamma-ray bursts. To explore their possible\nconnection, we analyzed the redshift distribution of both \\textit{Einstein\nProbe} fast X-ray transients and long duration gamma-ray bursts. A comparative\nanalysis of their cumulative redshift distributions using non-parametric\ntwo-sample tests, namely the Kolmogorov-Smirnov and Anderson-Darling tests,\nfinds no statistically significant difference. These tests favor that their\nredshifts are drawn from the same underlying distribution. This empirical\nconnection between \\textit{Einstein Probe} transients and long gamma-ray bursts\nis further supported by their agreement with the so-called ``Amati relation''\nbetween the spectral peak energy and the isotropic-equivalent energy. Together,\nthese results indicate that most extragalactic \\textit{Einstein Probe} fast\nX-ray transients are closely related to long gamma-ray bursts and originate\nfrom a massive star (collapsar) progenitor channel. Our findings highlight the\nrole of the \\textit{Einstein Probe} in uncovering the missing population of\nfailed jets and dirty fireballs that emit primarily at soft X-ray wavelengths."}
{"id": "2509.07221", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.07221", "abs": "https://arxiv.org/abs/2509.07221", "authors": ["Jack Heinzel", "Salvatore Vitale"], "title": "When (not) to trust Monte Carlo approximations for hierarchical Bayesian inference", "comment": "40 pages, 24 figures", "summary": "The coming years of gravitational wave astrophysics promises thousands of new\ndetections, which can unlock fundamental scientific insights if the information\nin each observation can be properly synthesized into a coherent picture.\nState-of-the-art approaches often accomplish this with hierarchical Bayesian\ninference. However, this typically relies on Monte Carlo approximations that\nare already very expensive in current data, and may become prohibitively so in\nthe future. In this paper we show how this process can be understood from a\nfirst-principles statistical approach. We derive an error estimator $\\hat{E}$\nfor quantifying the amount of information that is lost due to the Monte Carlo\napproximation and recommend that this error is limited to no more than $\\hat{E}\n\\lesssim 0.2$ bits for reliable inference. We also show that the hierarchical\nlikelihood estimator is biased but may be corrected. Finally, we show some\npractical examples for inference on synthetic gravitational-wave population\ninference, demonstrating that simple models with strong assumptions can be much\nmore stable to Monte Carlo uncertainty than those with weaker assumptions. We\nalso provide a \\texttt{pip}-installable package \\texttt{population-error} with\nwhich analysts can calculate the error statistics $\\hat{E}$."}
{"id": "2509.07258", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.07258", "abs": "https://arxiv.org/abs/2509.07258", "authors": ["C. M. Diez", "S. Dupourqué", "M. Zhou", "E. Quintin", "G. A. Matzeu", "F. Fürst", "P. Kretschmar", "R. Amato", "C. Malacaria"], "title": "First look at Vela X-1 with XRISM: A simultaneous campaign with XMM-Newton and NuSTAR", "comment": "8 pages, 6 figures, A&A accepted on 3 Sept. 2025", "summary": "High-Mass X-ray Binaries (HMXBs) serve as useful laboratories for exploring\nthe behaviour of accreted matter onto compact objects and for probing the\ncomplex wind environments of massive stars. These investigations are essential\nfor understanding stellar life cycles and the dynamics of the Milky Way, and\nthey are prominent topics in the science cases for XRISM and NewAthena. We\nreport, for the first time, a XRISM observation of the HMXB Vela X-1, conducted\nduring the first cycle of the XRISM general observer programme and complemented\nby simultaneous XMM-Newton and NuSTAR coverage. This campaign targeted a\ncritical orbital phase -- when the neutron star is in inferior conjunction --\nduring which significant changes in absorption are expected. We performed\nabsorption-resolved spectral analyses during two time intervals of interest:\nthe soft and hard hardness ratio (HR) intervals, as it is strongly correlated\nwith absorption variability. We observed a sudden transition in the HR from a\nsoft to a hard state, coinciding with an increase in the absorption column\ndensity. This is likely attributed to the onset of the accretion structure\ncrossing our line of sight. With XRISM/Resolve, we also investigated the Fe K\nregion, and we report for the first time the presence of a Fe K$\\alpha$ doublet\nin the spectrum of Vela X-1, together with the presence of already known Fe\nK$\\beta$ and Ni K$\\alpha$ lines that are produced in cold clumps embedded in\nthe hot ionised wind. The measured line velocities of the order of $10^2 \\\n\\mathrm{km\\,s^{-1}}$ are consistent with production sites in the vicinity of\nthe neutron star. This precursor study with Vela X-1 shows the potential of\nXRISM in studying in unprecedented details the spectral evolution of\nwind-accreting X-ray binaries."}
{"id": "2509.07265", "categories": ["astro-ph.HE", "hep-ex", "physics.data-an"], "pdf": "https://arxiv.org/pdf/2509.07265", "abs": "https://arxiv.org/abs/2509.07265", "authors": ["Erin Barillier", "Laura Manenti", "Knut Mora", "Paolo Padovani", "Isaac Sarnoff", "Yongheng Xu", "Bjorn Penning", "Francesco Arneodo"], "title": "Setting Limits on Blazar-Boosted Dark Matter with Xenon-based Detectors", "comment": null, "summary": "Dual-phase xenon time projection chambers achieve optimal sensitivity for\ndark matter in the $10$--$1000~\\mathrm{GeV}/c^2$ mass range, but sub-GeV dark\nmatter particles lack sufficient energy to produce nuclear recoils above\ndetection thresholds in these detectors. Blazar-boosted dark matter offers a\nway to overcome this limitation: relativistic jets in active galactic nuclei\ncan accelerate light dark matter in their host-galaxy halos to energies capable\nof producing detectable nuclear recoil signals in xenon-based detectors on\nEarth. We present the first blazar-boosted dark matter search incorporating\ndetector response modeling, using public data from XENON1T and LZ for the\nblazar TXS~0506+056. We model dark matter--proton scattering in the jet\nenvironment, covering the full process from jet acceleration to detector\nresponse. We explore how the host-galaxy dark matter density profile impacts\nour analysis. Using XENON1T data, we exclude dark matter--nucleon cross\nsections for $m_\\chi \\sim 1~\\mathrm{MeV}$ in the range $5.8\\times\n10^{-31}~\\mathrm{cm^2} \\lesssim \\sigma_{\\chi n} \\lesssim 6.3\\times\n10^{-29}~\\mathrm{cm^2}$, and using LZ EFT searches we constrain $9.9\\times\n10^{-32}~\\mathrm{cm^2} \\lesssim \\sigma_{\\chi n} \\lesssim 2.5\\times\n10^{-28}~\\mathrm{cm^2}$. Our results show that astrophysical uncertainties,\nespecially the dark matter density profile near the supermassive black hole,\nset the primary limitation on the sensitivity rather than detector systematics.\nThese findings highlight blazar-boosted dark matter as a promising probe of\nlight dark matter and motivate further astrophysical modeling."}
{"id": "2509.07481", "categories": ["astro-ph.HE", "hep-ph"], "pdf": "https://arxiv.org/pdf/2509.07481", "abs": "https://arxiv.org/abs/2509.07481", "authors": ["Xing-Jian Lv", "Xiao-Jun Bi", "Kun Fang", "Han-Xiang Hu", "Peng-Fei Yin", "Meng-Jie Zhao"], "title": "Uncertainty in Hadronic Diffuse $γ$-Ray Emission from the Temporal Stochasticity of Cosmic-Ray Sources", "comment": "7 pages, 4 figures", "summary": "Diffuse $\\gamma$-ray emission is a key probe of cosmic rays (CRs)\ndistribution within the Galaxy. However, the discrepancies between observations\nand theoretical model expectations highlight the need for refined uncertainty\nestimates. In the literature, spatial and temporal variability of lepton flux\nhas been discussed as an uncertainty in diffuse $\\gamma$-ray estimation. In the\npresent work, we demonstrate that variability in the high energy CR hadron flux\nis an important, yet previously underappreciated, source of uncertainty in\ndiffuse $\\gamma$-ray estimates. To assess this effect, we perform fully\nthree-dimensional, time-dependent GALPROP simulations of CR protons injected\nfrom discrete Galactic sources. Our results reveal that the uncertainty in the\nhadronic component of diffuse $\\gamma$ rays is non-negligible and can be\ncomparable to, or even exceed, current experimental uncertainties at very high\nenergies. This finding challenges the conventional assumption that only\nleptonic fluctuations are relevant to diffuse $\\gamma$-ray modeling."}
{"id": "2509.07527", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2509.07527", "abs": "https://arxiv.org/abs/2509.07527", "authors": ["Alberto Domínguez"], "title": "TeV Emission in NGC 4278: Shock Energetics Insufficient, Compact Origin Favored", "comment": "Published in Research Notes of the American Astronomical Society", "summary": "The Large High Altitude Air Shower Observatory recently detected TeV emission\nfrom the low-luminosity active galactic nucleus (LLAGN) NGC 4278.\nIntegral-field spectroscopy with MEGARA revealed ionized outflows on\nhundred-parsec scales with kinetic power $\\dot E_{\\rm shock} \\sim 10^{38}$ erg\ns$^{-1}$, well below the TeV luminosity $L_{\\gamma} \\gtrsim 10^{41}$ erg\ns$^{-1}$. The implied efficiencies, $\\eta \\gtrsim 1000$, are far above unity,\nshowing that shocks cannot account for the TeV emission. Contemporaneous\nFermi-Large Area Telescope and Swift data, consistent with a compact\nsynchrotron self-Compton jet component, favor a nuclear origin. NGC 4278 is the\nfirst low-ionization nuclear emission-line region (LINER)/LLAGN of its class\ndetected at TeV energies, a benchmark for LINERs with outflows and a prime\ntarget for the Cherenkov Telescope Array Observatory. I conclude that the TeV\nphotons arise from a compact nuclear accelerator, while optical outflows trace\nlarger-scale jet--ISM interactions that coexist but do not power the TeV\nradiation."}
{"id": "2509.07535", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.07535", "abs": "https://arxiv.org/abs/2509.07535", "authors": ["Minghao Zhang", "Wenda Zhang", "Hongping Deng", "Hengxiao Guo", "Jingbo Sun"], "title": "Tidal disruption events in active galactic nuclei: on orbital inclination and Schwarzschild apsidal precession", "comment": "27 pages, 16 figures, 2 tables, accepted for publication in ApJ", "summary": "Tidal disruption events (TDEs) in active galactic nuclei (AGNs) mark a regime\nwhere traditional vacuum models fail to capture the full dynamics, especially\ndue to interaction between stellar debris and pre-existing accretion disks. We\nperform meshless hydrodynamic simulations incorporating both general\nrelativistic (GR) effects and radiative cooling to study TDEs in AGNs with\ndifferent orbital inclinations ($\\theta_{\\rm inc}$) of the disrupted star,\nranging from projected prograde to retrograde orbits. We post-process the\nsimulations to derive multi-wavelength light curves and identify several\ndistinct features in the light curves, including a precursor flare from early\ndebris-disk collision and a major flare driven by fallback. The dynamics of the\nstellar debris and accretion disk, and subsequently the light curve features,\nare strongly affected by $\\theta_{\\rm inc}$ and GR effects. Retrograde orbits\n($\\theta_{\\rm inc}=135^\\circ$) yield a more luminous, shorter major flare and a\nmore prominent precursor than prograde ones ($\\theta_{\\rm inc}=22.5^\\circ$).\nDuring fallback, prograde cases ($\\theta_{\\rm inc} = 22.5^\\circ$, $45^\\circ$)\ndevelop a central cavity with spirals in the inner region of the AGN disk,\nleading to transient UV/X-ray suppression accompanied by oscillations, while\nhigher inclinations ($\\theta_{\\rm inc}=90^\\circ$, $135^\\circ$) form a gradually\ntilting inner disk, potentially causing UV/X-ray dips via geometric effects at\ncertain viewing angles. Relativistic apsidal precession alters stream\ncollisions, producing structural differences in the inner disk, outer disk, and\ndebris compared to Newtonian cases, and drives quasi-periodic signals in\nprograde configurations. These results provide predictive diagnostics for\nidentifying AGN TDEs and interpreting observed light-curve diversity."}
{"id": "2509.07560", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.07560", "abs": "https://arxiv.org/abs/2509.07560", "authors": ["Amit K. Ror", "S. B. Pandey", "S. R. Oates", "Rahul Gupta", "Amar Aryan", "A. J. Castro-Tirado", "Sudhir Kumar"], "title": "Investigating Temporal Features in Swift GRB Afterglows: A Comparative Study of UVOT and XRT Data", "comment": "The article includes 39 pages, 12 figures and 4 tables in the main\n  text, 8 figures and 8 tables in the appendix. Accepted for publication in\n  Monthly Notices of the Royal Astronomical Society", "summary": "This study presents a statistical analysis of optical light curves (LCs) of\n200 UVOT-detected GRBs from 2005 to 2018. We have categorised these LCs based\non their distinct morphological features, including early flares, bumps,\nbreaks, plateaus, etc. Additionally, to compare features across different\nwavelengths, we have also included XRT LCs in our sample. The early observation\ncapability of UVOT has allowed us to identify very early flares in 21 GRBs\npreceding the normal decay or bump, consistent with predictions of external\nreverse or internal shock. The decay indices of optical LCs following a simple\npower-law (PL) are shallower than corresponding X-ray LCs, indicative of a\nspectral break between two wavelengths. Not all LCs with PL decay align with\nthe forward shock model and require additional components such as energy\ninjection or a structured jet. Further, plateaus in the optical LCs are\nprimarily consistent with energy injection from the central engine to the\nexternal medium. However, in four cases, plateaus followed by steep decay may\nhave an internal origin. The optical luminosity observed during the plateau is\ntightly correlated with the break time, indicative of a magnetar as their\npossible central engine. For LCs with early bumps, the peak position,\ncorrelations between the parameters, and observed achromaticity allowed us to\nconstrain their origin as the onset of afterglow, off-axis jet, late\nre-brightening, etc. In conclusion, the ensemble of observed features is\nexplained through diverse physical mechanisms or emissions observed from\ndifferent outflow locations and, in turn, diversity among possible progenitors."}
{"id": "2509.07660", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.07660", "abs": "https://arxiv.org/abs/2509.07660", "authors": ["Giacomo Principe"], "title": "The time-domain gamma-ray sky seen by the Fermi-LAT", "comment": "Proceeding of the ICNFP 2023 conference, published in World\n  Scientific International Journal of Modern Physics A", "summary": "The Fermi Gamma-ray Space Telescope is currently celebrating its 15th\nanniversary of operation. Since its launch, the Fermi-Large Area Telescope\n(LAT), the main instrument onboard the Fermi satellite, has remarkably unveiled\nthe sky at GeV energies providing outstanding results in time-domain gamma-ray\nastrophysics. In particular, LAT has observed some of the most powerful\ntransient phenomena in the Universe (such as gamma-ray bursts, blazar flares,\nmagnetar flares, ...) enabling the possibility to test our current\nunderstanding of the laws of physics in extreme conditions. In this paper I\nwill review some of the main recent results with a focus on the transient\nphenomena seen by LAT with a multi-wavelength and multi-messenger connection."}
{"id": "2509.07767", "categories": ["astro-ph.HE", "nucl-th"], "pdf": "https://arxiv.org/pdf/2509.07767", "abs": "https://arxiv.org/abs/2509.07767", "authors": ["Nai-Bo Zhang", "Bao-An Li", "Jia-Yu Zhang", "Wei-Na Shen", "Hui Zhang"], "title": "Illuminating dark matter admixed in neutron stars with simultaneous mass-radius constraints", "comment": "14 pages, 5 figures", "summary": "We investigate how simultaneous mass and radius measurements of massive\nneutron stars (NSs) can help constrain properties of dark matter (DM) possibly\nadmixed in them. Within a fermionic DM model that interacts only through\ngravitation, along with a well-constrained nuclear matter equation of state, we\nshow that the simultaneous mass and radius measurement of PSRJ0740+6620 reduces\nthe uncertainty of DM central energy density by more than 50\\% compared to the\nresults obtained from using the two observables independently, while other DM\nparameters remain unconstrained. Additionally, we find that the DM fraction\n$f_D$ should be smaller than 2\\% when constrained by the observed NS maximum\nmass alone, and it could be even smaller than 0.3\\% with the simultaneous\nmeasurement of mass and radius, supporting the conclusion that only a small\namount of DM exists in DM admixed neutron stars (DANS)."}
{"id": "2509.07967", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.07967", "abs": "https://arxiv.org/abs/2509.07967", "authors": ["Sourabh Magare", "Anupreeta More", "Shasvath J. Kapadia"], "title": "Early warning for lensed gravitational wave counterparts from time delays of their host galaxies observed in the optical", "comment": "12 pages, 9 figures", "summary": "Gravitational lensing of gravitational waves (GWs) can be leveraged to\nprovide early-warning times of $\\mathcal{O}({\\rm hours})$ to $\\mathcal{O}({\\rm\ndays})$ before the merger of Binary Neutron Stars (BNSs) and Neutron Star Black\nHoles (NSBHs). This in turn could enable electromagnetic (EM) telescopes to\ncapture emissions surrounding the time of the merger. In this work, we assess\nthe practicability of lensing-driven early-warning by analysing optical images\nof the lensed host galaxy to predict the arrival time of subsequent BNS/NSBH\nsignals following the observation of the first signal. We produce mock lenses\nwith image quality and resolution similar to images taken with the Hubble Space\nTelescope (HST) and the ground-based Hyper Suprime-Cam (HSC) on the Subaru\ntelescope. We compare the time delay uncertainties between these two cases for\ntypical lensed image configurations and multiplicity. These include doubles and\nquads, and among quads: the fold, cusp, cross image configurations. We find\nthat time delay uncertainties for doubles are comparable for both HST and HSC\nmocks. On the other hand, quads tend to provide accurate time-delay predictions\n(typical relative error $\\sim0.1$) with HST. Analysis of a real lens led to a\ndifference in time-delay estimates of $\\mathcal{O}(\\rm days)$ between the\npredictions derived from HST and HSC data. Our work therefore strongly\nadvocates the need for high-resolution EM observations of lensed host galaxies\nto feasibly enable lensing-driven early-warning."}
{"id": "2509.07981", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.07981", "abs": "https://arxiv.org/abs/2509.07981", "authors": ["Jack T. Dinsmore", "Roger W. Romani"], "title": "Advanced Weights for IXPE Polarization Analysis", "comment": "8+2 pages, 4 figures. Submitted to ApJ", "summary": "As the Imaging X-ray Polarimetry Explorer (IXPE) measures increasingly faint\nsources, the need for precise polarimetry extraction becomes paramount. In\naddition to previously described neural-net (NN) weights, we introduce here\npoint-spread function weights and particle background weights, which can be\ncritical for faint sources. In some cases these can be augmented by time/phase\nand energy weights. We provide a publicly available analysis tool to\nincorporate these new weights, validate our method on simulated data, and test\nit on archival IXPE observations. Together these weights decrease the area of\nthe polarization uncertainty contour by a factor of two and will be essential\nfor background-limited IXPE observations."}
{"id": "2509.07592", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.07592", "abs": "https://arxiv.org/abs/2509.07592", "authors": ["Simon R. Goode", "Sara A. Webb", "Jeff Cooke", "Jielai Zhang", "James Freeburn", "Amy Lien", "Mohsen Shamohammadi", "Alexandra Rosenthal", "Laura N. Driessen", "Christopher Fluke", "Ashish Mahabal", "Anais Möller", "Dougal Dobie", "Adam Batten", "Natasha Van Bemmel"], "title": "A Machine Learning empowered search for Sub-Minute Optical Transient Events with the Deeper, Wider, Faster programme", "comment": "15 pages, 15 figures, pipeline source code available at\n  https://github.com/simongoode/SMOTEs", "summary": "Optical transient surveys continue to generate increasingly large datasets,\nprompting the introduction of machine-learning algorithms to search for quality\ntransient candidates efficiently. Existing machine-learning infrastructure can\nbe leveraged in novel ways to search these datasets for new classes of\ntransients. We present a machine-learning accelerated search pipeline for the\nDeeper, Wider, Faster (DWF) programme designed to identify high-quality\nastrophysical transient candidates that contain a single detection. Given the\nrapid observing cadence of the DWF programme, these single-detection transient\ncandidates have durations on sub-minute timescales. This work marks the first\ntime optical transients have been systematically explored on these timescales,\nto a depth of m$\\sim$23. We report the discovery of two high-quality sub-minute\ntransient candidates from a pilot study of 671,761 light curves and investigate\ntheir potential origins with multiwavelength data. We discuss, in detail,\npossible non-astrophysical false positives, confidently reject electronic\nartefacts and asteroids, ruling out glints from satellites below 800 km and\nstrongly disfavouring those at higher altitudes. We calculate a rate on the sky\nof $4.72^{+6.39}_{-3.28}\\times10^5$ per day for these sub-minute transient\ncandidates."}
