{"id": "2509.22878", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.22878", "abs": "https://arxiv.org/abs/2509.22878", "authors": ["Robin H. D. Corbet"], "title": "A Less Terrifying Universe? Mundanity as an Explanation for the Fermi Paradox", "comment": "12 pages, 1 figure. Submitted. Comments invited", "summary": "Applying a principle of \"radical mundanity\", this paper examines explanations\nfor the lack of strong evidence for the presence of technology-using\nextraterrestrial civilizations (ETCs) in the Galaxy - the Fermi paradox. With\nthis principle, the prospect that the Galaxy contains a modest number of\ncivilizations is preferred, where none have achieved technology levels\nsufficient to accomplish large-scale astro-engineering or lack the desire to do\nso. This consideration also leads to the expectation that no ETC will colonize\na large fraction of the Galaxy, even using robotic probes, and that there are\nno long-duration high-power beacons. However, there is a reasonable chance that\nwe may make contact on a short, by historical standards, timescale. This event\nwould be momentous, but could still leave us slightly disappointed. Such a\nUniverse would be less terrifying than either of the two possibilities in the\nquote generally attributed to Arthur C. Clarke on whether we are alone or not.\nAlso, if there is a modest number of ETCs in the Galaxy, that would suggest\nthat there is a large number of planets with some form of life."}
{"id": "2509.23172", "categories": ["astro-ph.IM", "gr-qc", "physics.ins-det"], "pdf": "https://arxiv.org/pdf/2509.23172", "abs": "https://arxiv.org/abs/2509.23172", "authors": ["Yuki Inoue", "Hsiang-Chieh Hsu", "Hsiang-Yu Huang", "M. Afif Ismail", "Vivek Kumar", "Miftahul Ma'arif", "Avani Patel", "Daiki Tanabe", "Henry Tsz-King Wong", "Da-Chun Yu"], "title": "CHRONOS: Cryogenic sub-Hz cROss torsion bar detector with quantum NOn-demolition Speed meter", "comment": "8pages, 5figures", "summary": "We propose a next-generation ground-based gravitational-wave detector, the\nCryogenic sub-Hz cROss torsion-bar detector with quantum NOn-demolition Speed\nmeter (CHRONOS), optimized for the unexplored 0.1-10Hz band bridging the gap\nbetween the space-based LISA and future ground-based detectors such as Cosmic\nExplorer and the Einstein Telescope. CHRONOS combines a ring-cavity Sagnac\ninterferometer with torsion-bar test masses to realize the first quantum\nnondemolition (QND) measurement of angular momentum in a macroscopic system. By\nimplementing a speed-meter readout in the rotational degree of freedom, CHRONOS\ncoherently cancels quantum radiation-pressure noise and enables sub-Hz\nobservations. We show that detuned power recycling and cavity-length\noptimization can simultaneously relax technical requirements on both torsion\nbars and speed meters. Assuming a realistic optical design with a 1m torsion\nbar, we estimate strain sensitivities of $h \\simeq 1 \\times\n10^{-18}\\mathrm{Hz}^{-1/2}$ at 1Hz for detectors with arm lengths of 2.5m, 40m,\nand 300m. These sensitivities enable (i) direct detection of intermediate-mass\nblack hole binaries up to 380Mpc with ${\\rm SNR}=3$, (ii) probing stochastic\ngravitational-wave backgrounds down to $\\Omega_{\\rm GW} \\sim 3.2 \\times\n10^{-9}$ at 0.2Hz with 5yr accumulation. Furthermore, CHRONOS enables prompt\ndetection of gravity-gradient signals from magnitude-5.5 earthquakes even with\na 2.5m prototype. CHRONOS thus opens new opportunities for quantum-limited\ngeophysical observation and multi-band, multi-messenger gravitational-wave\nastronomy."}
{"id": "2509.23422", "categories": ["astro-ph.IM", "physics.ins-det"], "pdf": "https://arxiv.org/pdf/2509.23422", "abs": "https://arxiv.org/abs/2509.23422", "authors": ["Henry E. Nachman", "Oorie Desai", "Nicholas Galitzki", "Daniel Lee", "JB Lloyd", "Tannishtha Nandi", "Ani Pagni", "Ray Radebaugh", "Elle C. Shaw"], "title": "Cryogenic Materials Repository: A Public Resource and New Measurements for Cryogenic Research Applications", "comment": null, "summary": "Low-temperature systems play a vital role in a variety of scientific research\napplications, including the next generation of cosmology and astrophysics\ntelescopes. More ambitious cryogenic applications require precise estimates of\nthe thermal conductivity of materials and thermal joints to meet project goals.\nWe present the development of the Cryogenic Material Repository (CMR), a public\nGitHub repository of cryogenic material properties data created to support and\nenable researchers across scientific disciplines to accurately and efficiently\ndesign and assess cryogenic systems. We also present updated sub-Kelvin thermal\nconductivity results for select carbon fiber reinforced polymer and aluminum\nalloy samples."}
{"id": "2509.23632", "categories": ["astro-ph.IM", "physics.pop-ph"], "pdf": "https://arxiv.org/pdf/2509.23632", "abs": "https://arxiv.org/abs/2509.23632", "authors": ["Michael Garrett"], "title": "Blink and you'll miss it -- How Technological Acceleration Shrinks SETI's Narrow Detection Window", "comment": "15 pages, 2 figures, accepted by Acta Astronautica", "summary": "The search for extraterrestrial intelligence (SETI) has historically focused\non detecting electromagnetic technosignatures, implicitly assuming that alien\ncivilisations are biological and technologically analogous to ourselves. This\npaper challenges that paradigm, arguing that highly advanced, potentially\npost-biological civilisations may undergo rapid technological acceleration,\nquickly progressing beyond recognisable or detectable phases. We introduce a\nsimple model showing that the technological acceleration rate of such\ncivilisations can compress their detectable phase to mere decades, dramatically\nnarrowing the temporal \"detection window\" in which their technosignatures\noverlap with our current capabilities. This framework offers a plausible\nresolution to the \"Great Silence\": advanced civilisations may be abundant and\nlong-lived, but effectively invisible to present-day SETI methods.\nConsequently, our efforts must include but also evolve beyond the search for\nnarrow-band communication signals in the radio and optical domains. Instead, we\nrequire an expanded, technology-agnostic strategy focused on persistent,\nlarge-scale manifestations of intelligence, such as broadband electromagnetic\nleakage, waste heat from megastructures, and multi-dimensional anomaly\ndetection across extensive, multi-wavelength and multi-messenger datasets.\nLeveraging advanced artificial intelligence for unsupervised anomaly discovery,\nrecursive algorithm optimisation, and predictive modelling will be essential to\nuncover the subtle, non-anthropocentric traces of advanced civilisations whose\ntechnosignatures lie beyond our current technological and cognitive frameworks."}
{"id": "2509.22778", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.22778", "abs": "https://arxiv.org/abs/2509.22778", "authors": ["Benjamin P. Gompertz", "Andrew J. Levan", "Tanmoy Laskar", "Benjamin Schneider", "Ashley A. Chrimes", "Antonio Martin-Carrillo", "Albert Sneppen", "David ONeill", "Daniele B. Malesani", "Peter G. Jonker", "Eric Burns", "Gregory Corcoran", "Laura Cotter", "Antonio de Ugarte Postigo", "Dimple", "Rob A. J. Eyles-Ferris", "L. Izzo", "Pall Jakobsson", "Gavin P. Lamb", "Jesse T. Palmerio", "Giovanna Pugliese", "Maria Edvige Ravasio", "Andrea Saccardi", "Ruben Salvaterra", "Nikhil Sarin", "Steve Schulze", "Nial Tanvir", "Makenzie E. Wortley"], "title": "JWST Spectroscopy of GRB 250702B: An Extremely Rare and Exceptionally Energetic Burst in a Dusty, Massive Galaxy at $z=1.036$", "comment": "17 pages, 5 figures, submitted to ApJL", "summary": "We present follow-up observations of the day-long, repeating GRB 250702B with\nthe Near Infrared Spectrograph (NIRSpec) on board the James Webb Space\nTelescope (JWST). Through the identification of narrow hydrogen emission lines\nat a consistent redshift of $z = 1.036 \\pm 0.004$, we calibrate the distance\nscale, and therefore the energetics, of this unique extragalactic transient. At\nthis distance, the resulting $\\gamma$-ray energy release is at least\n$E_{\\gamma,\\rm iso} = 2.2 \\times 10^{54}$\\,erg. We find no evidence for ongoing\ntransient emission at the GRB position, and exclude any accompanying supernova\nwith a luminosity comparable to the Type Ic broad-line SN 2023lcr, though we\nare unable to constrain fainter events. The inferred rate of such events,\nassuming at most one in the lifetime of {\\em Fermi}, suggests that such bursts\nare very rare, with volumetric rates $>1,000$ times lower than normal high\nluminosity long GRBs and $> 10^5$ times lower than core collapse supernovae\nwhen corrected for beaming. Furthermore, we find that the host galaxy is unique\namongst GRB host galaxies, and extremely rare in the general galaxy population,\nbeing extremely large, dusty and with high stellar mass. The identification of\nsuch an exotic GRB in such an unusual galaxy raises the possibility that the\nenvironment was important in the progenitor channel for this event."}
{"id": "2509.23901", "categories": ["astro-ph.IM", "astro-ph.GA", "cs.AI", "cs.CV"], "pdf": "https://arxiv.org/pdf/2509.23901", "abs": "https://arxiv.org/abs/2509.23901", "authors": ["Wei Zhang", "Qiufan Lin", "Yuan-Sen Ting", "Shupei Chen", "Hengxin Ruan", "Song Li", "Yifan Wang"], "title": "Interpreting deep learning-based stellar mass estimation via causal analysis and mutual information decomposition", "comment": "Accepted at Astronomy & Astrophysics; 23 + 12 pages; 8 + 16 figures", "summary": "End-to-end deep learning models fed with multi-band galaxy images are\npowerful data-driven tools used to estimate galaxy physical properties in the\nabsence of spectroscopy. However, due to a lack of interpretability and the\nassociational nature of such models, it is difficult to understand how the\ninformation additional to integrated photometry (e.g., morphology) contributes\nto the estimation task. Improving our understanding in this field would enable\nfurther advances into unraveling the physical connections among galaxy\nproperties and optimizing data exploitation. Therefore, our work is aimed at\ninterpreting the deep learning-based estimation of stellar mass via two\ninterpretability techniques: causal analysis and mutual information\ndecomposition. The former reveals the causal paths between multiple variables\nbeyond nondirectional statistical associations, while the latter quantifies the\nmulticomponent contributions (i.e., redundant, unique, and synergistic) of\ndifferent input data to the stellar mass estimation. Using data from the Sloan\nDigital Sky Survey (SDSS) and the Wide-field Infrared Survey Explorer (WISE),\nwe obtained meaningful results that provide physical interpretations for\nimage-based models. Our work demonstrates the gains from combining deep\nlearning with interpretability techniques, and holds promise in promoting more\ndata-driven astrophysical research (e.g., astrophysical parameter estimations\nand investigations on complex multivariate physical processes)."}
{"id": "2509.22779", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.22779", "abs": "https://arxiv.org/abs/2509.22779", "authors": ["Paz Beniamini", "Hagai B. Perets", "Jonathan Granot"], "title": "Ultra-long Gamma-ray Bursts from Micro-Tidal Disruption Events: The Case of GRB 250702B", "comment": "11 pages, 1 figure. Submitted", "summary": "Ultra-long gamma-ray bursts (ULGRBs), a rare class of high-energy transients\nwith durations $>10^3$,s, remain poorly understood. GRB,250702B ($z=1.04$) is\nnotable for its multi-hour prompt emission, an X-ray precursor $\\sim$1 day\nearlier, off-nuclear host position, and hard, rapidly variable gamma-rays. This\ncombination is difficult to explain with standard ULGRB progenitors such as\nblue-supergiant collapsars, magnetar engines, or white-dwarf tidal disruptions\nby intermediate-mass black holes. We interpret the event as a micro-tidal\ndisruption event ($\\mu$TDE), where a stellar-mass black hole or neutron star\npartially or fully disrupts a main-sequence star. Three $\\mu$TDE pathways can\nreproduce the observed precursor-main flare delay: (i) a \\emph{dynamical\n(partial/repeating)} disruption, in which a grazing passage yields a faint\nprecursor and the core returns after $\\sim$day for a deeper encounter; (ii) a\n\\emph{natal-kick} disruption, where the delay reflects the ballistic motion of\na newborn compact object relative to its companion, leading to full disruption;\nand (iii) a \\emph{hybrid natal-kick + partial} case, in which the kick seeds\nthe close encounter but the first passage is only partial, with the core\nreturning on the day-scale period. Cross-section scalings imply comparable\nrates for partial and full outcomes in both dynamical and natal-kick scenarios.\nThe highly variable, hard $\\gamma$-ray emission supports association with a\nstellar-mass compact object. Fallback and viscous accretion naturally explain\nthe ultra-long duration, energetics, and ks-scale X-ray variability. We outline\nobservational discriminants between the three channels and argue that $\\mu$TDEs\noffer a compelling framework for ULGRBs such as GRB 250702B."}
{"id": "2509.24134", "categories": ["astro-ph.IM", "cs.AI", "cs.LG"], "pdf": "https://arxiv.org/pdf/2509.24134", "abs": "https://arxiv.org/abs/2509.24134", "authors": ["Antony Tan", "Pavlos Protopapas", "Martina Cádiz-Leyton", "Guillermo Cabrera-Vives", "Cristobal Donoso-Oliva", "Ignacio Becker"], "title": "ASTROCO: Self-Supervised Conformer-Style Transformers for Light-Curve Embeddings", "comment": "Accepted at the NeurIPS 2025 Workshop on Machine Learning and the\n  Physical Sciences (ML4PS), camera-ready version in progress", "summary": "We present AstroCo, a Conformer-style encoder for irregular stellar light\ncurves. By combining attention with depthwise convolutions and gating, AstroCo\ncaptures both global dependencies and local features. On MACHO R-band, AstroCo\noutperforms Astromer v1 and v2, yielding 70 percent and 61 percent lower error\nrespectively and a relative macro-F1 gain of about 7 percent, while producing\nembeddings that transfer effectively to few-shot classification. These results\nhighlight AstroCo's potential as a strong and label-efficient foundation for\ntime-domain astronomy."}
{"id": "2509.22784", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.22784", "abs": "https://arxiv.org/abs/2509.22784", "authors": ["Jonathan Carney", "Igor Andreoni", "Brendan O'Connor", "James Freeburn", "Hannah Skobe", "Lewi Westcott", "Malte Busmann", "Antonella Palmese", "Xander J. Hall", "Ramandeep Gill", "Paz Beniamini", "Eric R. Coughlin", "Charles D. Kilpatrick", "Akash Anumarlapudi", "Nicholas M. Law", "Hank Corbett", "Tomas Ahumada", "Ping Chen", "Christopher Conselice", "Guillermo Damke", "Kaustav K. Das", "Avishay Gal-Yam", "Daniel Gruen", "Steve Heathcote", "Lei Hu", "Viraj Karambelkar", "Mansi Kasliwal", "Kathleen Labrie", "Dheeraj Pasham", "Arno Riffeser", "Michael Schmidt", "Kritti Sharma", "Silona Wilke", "Weicheng Zang"], "title": "Optical/infrared observations of the extraordinary GRB 250702B: a highly obscured afterglow in a massive galaxy consistent with multiple possible progenitors", "comment": "Submitted to ApJL", "summary": "GRB 250702B was the longest gamma-ray burst ever observed, with a duration\nthat challenges standard collapsar models and suggests an exotic progenitor. We\ncollected a rich set of optical and infrared follow-up observations of its\nrapidly fading afterglow using a suite of telescopes including the W. M. Keck\nObservatory, the Gemini telescopes, the Magellan Baade Telescope, the Victor M.\nBlanco 4-meter telescope, and the Fraunhofer Telescope at Wendelstein\nObservatory. Our analysis reveals that the afterglow emission is well described\nby forward shock emission from a highly obscured relativistic jet. Deep\nphotometric observations of the host galaxy reveal a massive 10^10.66 solar\nmasses, dusty, and extremely asymmetric system that is consistent with two\ngalaxies undergoing a major merger. The galactocentric offset, host galaxy\nproperties, and jet characteristics do not definitively distinguish between\ncompeting progenitor scenarios. We find that the afterglow and host are\nconsistent with a range of progenitors including a collapsar, a merger between\na helium star and a stellar mass black hole, the disruption of a star by a\nstellar mass compact object, and the tidal disruption of a star by an\noff-nuclear intermediate mass black hole."}
{"id": "2509.24487", "categories": ["astro-ph.IM", "astro-ph.EP", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2509.24487", "abs": "https://arxiv.org/abs/2509.24487", "authors": ["Xander Byrne", "Amy Bonsor", "Laura K. Rogers", "Mariona Badenas-Agusti"], "title": "Finding rare classes in large datasets: the case of polluted white dwarfs from Gaia XP spectra", "comment": "Accepted for publication in RASTI 29 Sep 2025. 15 pages, 9 figures, 1\n  table", "summary": "The Gaia mission's third data release recorded low-resolution spectra for\nabout 100 000 white dwarf candidates. A small subset of these spectra show\nevidence of characteristic broad Ca II absorption features, implying the\naccretion of rocky material by so-called polluted white dwarfs -- important\nprobes of the composition of exoplanetary material. Several supervised and\nunsupervised data-intensive methods have recently been applied to identify\npolluted white dwarfs from the Gaia spectra. We present a comparison of these\nmethods, along with the first application of $t$-distributed stochastic\nneighbour embedding ($t$SNE) to this dataset. We find that $t$SNE outperforms\nthe similar technique Uniform Manifold Approximation and Projection (UMAP),\nisolating over 50% more high-confidence polluted candidates, including 39 new\ncandidates which are not selected by any other method investigated and which\nhave not been observed at higher resolution. Supervised methods benefit greatly\nfrom data labels provided by earlier works, selecting many known polluted white\ndwarfs which are missed by unsupervised methods. Our work provides a useful\ncase study in the selection of members of rare classes from a large,\nsporadically labelled dataset, with applications across astronomy."}
{"id": "2509.22787", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.22787", "abs": "https://arxiv.org/abs/2509.22787", "authors": ["Brendan O'Connor", "Ramandeep Gill", "James DeLaunay", "Jeremy Hare", "Dheeraj Pasham", "Eric R. Coughlin", "Ananya Bandopadhyay", "Akash Anumarlapudi", "Paz Beniamini", "Jonathan Granot", "Igor Andreoni", "Jonathan Carney", "Michael J. Moss", "Ersin Göğüş", "Jamie A. Kennea", "Malte Busmann", "Simone Dichiara", "James Freeburn", "Daniel Gruen", "Xander J. Hall", "Antonella Palmese", "Tyler Parsotan", "Samuele Ronchini", "Aaron Tohuvavohu", "Maia A. Williams"], "title": "Comprehensive X-ray Observations of the Exceptional Ultra-long X-ray and Gamma-ray Transient GRB 250702B with Swift, NuSTAR, and Chandra: Insights from the X-ray Afterglow Properties", "comment": "Submitted to ApJL", "summary": "GRB 250702B is an exceptional transient that produced multiple episodes of\nluminous gamma-ray radiation lasting for $>25$ ks, placing it among the class\nof ultra-long gamma-ray bursts (GRBs). However, unlike any known GRB, a soft\nX-ray precursor was discovered by the Einstein Probe up to 24 hours before the\ngamma-ray triggers. We present comprehensive X-ray observations of the\ntransient's afterglow obtained with the Neil Gehrels Swift Observatory, the\nNuclear Spectroscopic Telescope Array, and the Chandra X-ray Observatory\nbetween 0.5 to 65 days (observer frame) after the initial high-energy trigger.\nThe X-ray emission decays steeply as $\\sim t^{-1.9}$, and shows short timescale\nX-ray variability ($\\Delta T/T < 0.03$) in both Swift and NuSTAR, consistent\nwith flares superposed on an external shock continuum. Serendipitous detections\nby the Swift Burst Alert Telescope (BAT) out to $\\sim$0.3 days and continued\nNuSTAR variability to $\\sim$2 days imply sustained central engine activity;\nincluding the precursor, the required engine duration is $\\gtrsim 3$ days.\nAfterglow modeling favors the combination of forward and reverse shock emission\nin a wind-like ($k \\approx 2$) environment. These properties, especially the\nlong-lived engine and soft X-ray precursor, are difficult to reconcile with a\ncollapsar origin, and GRB 250702B does not fit neatly with canonical ultra-long\nGRBs or relativistic tidal disruption events (TDEs). A hybrid scenario in which\na star is disrupted by a stellar-mass black hole (a micro-TDE) provides a\nplausible explanation, although a relativistic TDE from an intermediate-mass\nblack hole remains viable. Decisive discrimination between progenitors will\nrequire sensitive late-time X-ray observations."}
{"id": "2509.24870", "categories": ["astro-ph.IM", "stat.AP"], "pdf": "https://arxiv.org/pdf/2509.24870", "abs": "https://arxiv.org/abs/2509.24870", "authors": ["Pablo A. Peña R.", "James S. Jenkins"], "title": "Closing the Evidence Gap: reddemcee, a Fast Adaptive Parallel Tempering Sampler", "comment": "v2: Revised after referee comments; resubmitted to A&A on 24 Sep 2025", "summary": "Markov Chain Monte Carlo (MCMC) excels at sampling complex posteriors but\ntraditionally lags behind nested sampling in accurate evidence estimation,\nwhich is crucial for model comparison in astrophysical problems. We introduce\nreddemcee, an Adaptive Parallel Tempering Ensemble Sampler, aiming to close\nthis gap by simultaneously presenting next-generation automated\ntemperature-ladder adaptation techniques and robust, low-bias evidence\nestimators. reddemcee couples an affine-invariant stretch move with five\ninterchangeable ladder-adaptation objectives, Uniform Swap Acceptance Rate,\nSwap Mean Distance, Gaussian-Area Overlap, Small Gaussian Gap, and Equalised\nThermodynamic Length, implemented through a common differential update rule.\nThree evidence estimators are provided: Curvature-aware Thermodynamic\nIntegration (TI+), Geometric-Bridge Stepping Stones (SS+), and a novel Hybrid\nalgorithm that blends both approaches (H+). Performance and accuracy are\nbenchmarked on n-dimensional Gaussian Shells, Gaussian Egg-box, Rosenbrock\nFunctions, and exoplanet radial-velocity time-series of HD 20794. Across Shells\nup to 15 dimensions, reddemcee presents roughly 7 times the effective sampling\nspeed of the best dynamic nested sampling configuration. The TI+, SS+ and H+\nestimators recover estimates under 3 percent error and supply realistic\nuncertainties with as few as six temperatures. In the HD 20794 case study,\nreddemcee reproduces literature model rankings and yields tighter yet\nconsistent planetary parameters compared with dynesty, with evidence errors\nthat track run-to-run dispersion. By unifying fast ladder adaptation with\nreliable evidence estimators, reddemcee delivers strong throughput and accurate\nevidence estimates, often matching, and occasionally surpassing, dynamic nested\nsampling, while preserving the rich posterior information which makes MCMC\nindispensable for modern Bayesian inference."}
{"id": "2509.22792", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.22792", "abs": "https://arxiv.org/abs/2509.22792", "authors": ["Eliza Neights", "Eric Burns", "Chris L. Fryer", "Dmitry Svinkin", "Suman Bala", "Rachel Hamburg", "Ramandeep Gill", "Michela Negro", "Megan Masterson", "James DeLaunay", "David J. Lawrence", "Sophie E. D. Abrahams", "Yuta Kawakubo", "Paz Beniamini", "Christian Aa. Diget", "Dmitry Frederiks", "John Goldsten", "Adam Goldstein", "Alexander D. Hall-Smith", "Erin Kara", "Alison M. Laird", "Gavin P. Lamb", "Oliver J. Roberts", "Ryan Seeb", "V. Ashley Villar", "Aldana Holzmann Airasca", "Joseph R. Barber", "P. Narayana Bhat", "Elisabetta Bissaldi", "Michael S. Briggs", "William H Cleveland", "Sarah Dalessi", "Davide Depalo", "Misty M. Giles", "Jonathan Granot", "Boyan A. Hristov", "C. Michelle Hui", "Andreas von Kienlin", "Carolyn Kierans", "Daniel Kocevski", "Stephen Lesage", "Alexandra L. Lysenko", "Bagrat Mailyan", "Christian Malacaria", "Tyler Parsotan", "Anna Ridnaia", "Samuele Ronchini", "Lorenzo Scotton", "Aaron C. Trigg", "Anastasia Tsvetkova", "Mikhail Ulanov", "Péter Veres", "Maia Williams", "Colleen A. Wilson-Hodge", "Joshua Wood"], "title": "GRB 250702B: Discovery of a Gamma-Ray Burst from a Black Hole Falling into a Star", "comment": "Will submit to MNRAS", "summary": "Gamma-ray bursts are the most luminous electromagnetic events in the\nuniverse. Their prompt gamma-ray emission has typical durations between a\nfraction of a second and several minutes. A rare subset of these events have\ndurations in excess of a thousand seconds, referred to as ultra-long gamma-ray\nbursts. Here, we report the discovery of the longest gamma-ray burst ever seen\nwith a ~25,000 s gamma-ray duration, GRB 250702B, and characterize this event\nusing data from four instruments in the InterPlanetary Network and the Monitor\nof All-sky X-ray Image. We find a hard spectrum, subsecond variability, and\nhigh total energy, which are only known to arise from ultrarelativistic jets\npowered by a rapidly-spinning stellar-mass central engine. These properties and\nthe extreme duration are together incompatible with all confirmed gamma-ray\nburst progenitors and nearly all models in the literature. This burst is\nnaturally explained with the helium merger model, where a field binary ends\nwhen a black hole falls into a stripped star and proceeds to consume and\nexplode it from within. Under this paradigm, GRB 250702B adds to the growing\nevidence that helium stars expand and that some ultra-long GRBs have similar\nevolutionary pathways as collapsars, stellar-mass gravitational wave sources,\nand potentially rare types of supernovae."}
{"id": "2509.24949", "categories": ["astro-ph.IM", "gr-qc"], "pdf": "https://arxiv.org/pdf/2509.24949", "abs": "https://arxiv.org/abs/2509.24949", "authors": ["David Yallup", "Metha Prathaban", "James Alvey", "Will Handley"], "title": "Parallel Nested Slice Sampling for Gravitational Wave Parameter Estimation", "comment": "To be submitted to SciPost Physics Proceedings (EuCAIFCon 2025)", "summary": "Inferring parameters and testing hypotheses from gravitational wave signals\nis a computationally intensive task central to modern astrophysics. Nested\nsampling, a Bayesian inference technique, has become an established standard\nfor this in the field. However, most common implementations lack the ability to\nfully utilize modern hardware acceleration. In this work, we demonstrate that\nwhen nested sampling is reformulated in a natively vectorized form and run on\nmodern GPU hardware, we can perform inference in a fraction of the time of\nlegacy nested sampling implementations whilst preserving the accuracy and\nrobustness of the method. This scalable, GPU-accelerated approach significantly\nadvances nested sampling for future large-scale gravitational-wave analyses."}
{"id": "2509.22797", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.22797", "abs": "https://arxiv.org/abs/2509.22797", "authors": ["Julia Sisk-Reynes", "Daniel Schwartz", "Anna Barnacka", "Cristiana Spingola", "Giulia Migliori"], "title": "Probing the origin of the X-ray and optical emission in the z=3.1 strongly lensed radio-quiet quasar GraL J065904.1+162909 to milliarcsecond resolution", "comment": "18 pages, 7 figures, 4 tables. Submitted for publication in ApJ.\n  Comments welcome!", "summary": "We perform milliarcsecond X-ray astrometry of the quadruply lensed\nradio-quiet quasar GraL J065904.1+162909 (J0659). This z = 3.083 quasar is\nlensed into four images and was discovered with the second Data Release of the\nGaia Space Observatory (Gaia DR2). The methodology of using gravitational\nlenses as high resolution telescopes has been applied, so far, to five lensed\nquasars (including J0659) and shows potential to elucidate the spatial origin\nof the X-ray and optical emitting regions in distant quasars. We use Gaia DR3\nand HST observations of J0659 and infer a mass model for the deflector that\nreproduces the positions of the quasar lensed images to milliarcsecond\nprecision. Next, we apply archival Chandra observations of J0659, together with\nour lens model, to conduct a Bayesian test evaluating whether the X-ray\nemitting region coincides with the optical source position predicted by our\nmass model. We constrain the origin of the X-ray emission to be within a\n0.''030 x 0.''020 ellipse at the 99.7% level, finding the maximum possible\ndistance between the X-ray and optical source is 44.7 milliarcseconds. Our\nmethodology enhances Chandra's spatial resolution at high-z by a factor of 6.\nWe provide a novel approach that extends the methodology towards investigating\nthe origin of the soft and hard X-ray emitting regions in lensed quasars. We\nelaborate on the potential of upcoming broadband and spectrally resolved X-ray\nastrometric studies to probe complex quasar morphology at high-z and to\nidentify dual and binary AGN candidates."}
{"id": "2509.25018", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.25018", "abs": "https://arxiv.org/abs/2509.25018", "authors": ["Lawrence T. Lin", "Eve M. Vavagiakis", "Jason E. Austermann", "James R. Burgoyne", "Scott Chapman", "Steve K. Choi", "Abigail T. Crites", "Cody J. Duell", "Rodrigo G. Freundt", "Eliza Gazda", "Christopher Groppi", "Anthony I. Huber", "Zachary B. Huber", "Johannes Hubmayr", "Ben Keller", "Philip Mauskopf", "Alicia Middleton", "Michael D. Niemack", "Darshan A. Patel", "Cody Roberson", "Adrian K. Sinclair", "Ema Smith", "Anna Vaskuri", "Benjamin J. Vaughan", "Samantha Walker", "Yi Wang", "Yuhan Wang", "Jordan Wheeler", "Ruixuan", "Xie"], "title": "CCAT: Mod-Cam Cryogenic Performance and its Impact on 280 GHz KID Array Noise", "comment": "7 pages, 8 figures, Low temperature detector 2025 proceeding\n  submitted to IEEE Transactions on Applied Superconductivity", "summary": "The CCAT Observatory's Fred Young Submillimeter Telescope (FYST) is designed\nto observe submillimeter astronomical signals with high precision, using\nreceivers fielding state-of-the-art kinetic inductance detector (KID) arrays.\nMod-Cam, a first-light instrument for FYST, serves as a testbed for instrument\nmodule characterization, including detailed evaluation of thermal behavior\nunder operating conditions prior to deploying modules in the larger Prime-Cam\ninstrument. Prime-Cam is a first generation multi-band, wide-field camera for\nFYST, designed to field up to seven instrument modules and provide\nunprecedented sensitivity across a broad frequency range.\n  We present results from two key laboratory characterizations: an \"optically\nopen\" cooldown to validate the overall thermal performance of the cryostat, and\na \"cold load\" cooldown to measure the effect of focal plane temperature\nstability on detector noise. During the optically open test, we achieved stable\nbase temperatures of 1.5 K on the 1 K stage and 85 mK at the detector stage. In\nthe cold load configuration, we measured a detector focal plane RMS temperature\nstability of 3.2e-5 K. From this stability measurement, we demonstrate that the\nequivalent power from focal plane thermal fluctuations is only 0.0040% of a 5pW\nincident photon power for aluminum detectors and 0.0023% for titanium-nitride\ndetectors, a negligible level for CCAT science goals. This highlights the\nsuccess of the cryogenic system design and thermal management."}
{"id": "2509.22805", "categories": ["astro-ph.HE", "hep-ph"], "pdf": "https://arxiv.org/pdf/2509.22805", "abs": "https://arxiv.org/abs/2509.22805", "authors": ["Manuel Goimil-García", "Irene Tamborra"], "title": "Steady state of fast-oscillating neutrinos in an inhomogeneous medium", "comment": "11 pages, including 4 figures", "summary": "The streaming of neutrinos in an inhomogeneous medium is known to affect the\nphysics of flavor conversion. We employ an ensemble of single-crossed angular\ndistributions and explore the physics of flavor conversion, while neutrinos\npropagate across a one-dimensional inhomogeneous medium. The advective term in\nthe neutrino equations of motion is responsible for the cascade of flavor waves\ntowards ever smaller spatial and angular scales. However, as the system\nevolves, perturbations with large wavenumbers are damped, with a resulting\nsmearing of the flavor configuration. We provide a simple recipe that allows to\nforecast the steady-state flavor configuration achieved by neutrinos without\nsolving their kinetic equations. In particular, we find that flavor\nequipartition on one side of the angular spectrum and the cancellation of the\nspectral crossing in the lepton number distributions, proposed in the\nliterature as generic flavor outcome, is a special solution depending on the\ndegree of neutrino-antineutrino asymmetry. This work constitutes a step forward\ntowards the development of semi-analytic schemes to account for flavor\nconversion physics in hydrodynamic simulations of core-collapse supernovae and\nneutron-star merger remnants."}
{"id": "2509.25021", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.25021", "abs": "https://arxiv.org/abs/2509.25021", "authors": ["Ben Keller", "Rodrigo Freundt", "James R. Burgoyne", "Scott Chapman", "Steve Choi", "Cody J. Duell", "Christopher Groppi", "Caleb Humphreys", "Lawrence T. Lin", "Alicia Middleton", "Michael D. Niemack", "Darshan Patel", "Eve Vavagiakis", "Samantha Walker", "Yuhan Wang", "Ruixuan", "Xie"], "title": "CCAT: Mod-Cam Readout Overview and Flexible Stripline Performance", "comment": "6 pages, 7 figures, submitted to LTD 2025 conference proceedings", "summary": "The CCAT Observatory's first-light and commissioning instrument, Mod-Cam, is\nnearing readiness for deployment to the Fred Young Submillimeter Telescope\n(FYST) in the Atacama Desert in northern Chile. In-lab testing of Mod-Cam and\nthe first CCAT instrument module, a 280 GHz broadband camera fielding over\n10,000 kinetic inductance detectors (KIDs), is currently underway. CCAT's\nfirst-generation science instrument, Prime-Cam, will field approximately\n100,000 KIDs across seven instrument modules. Like Mod-Cam, it employs 46 cm\nlong low-thermal-conductivity flexible circuits (\"stripline\") between 4 K and\n300 K to connect large arrays of multiplexed detectors in each instrument\nmodule to readout electronics. The 280 GHz camera currently installed in\nMod-Cam uses six striplines to read out its over 10,000 detectors across 18 RF\nchains, each individual stripline containing six traces. In-lab testing thus\nfar has allowed us to begin optimizing the attenuation in the readout chains\nfor each of the three detector arrays in the 280 GHz module and demonstrate\nsimultaneous readout of all networks using CCAT's RFSoC warm readout\nelectronics. Here we present an overview of the Mod-Cam cold readout and\ndiscuss the stripline performance by investigating how its thermal conductivity\nimpacts Mod-Cam and Prime-Cam cryogenic performance. We also report on\nstripline electrical transmission and crosstalk, identifying transition printed\ncircuit boards (PCBs) as the dominant source of crosstalk. Using this result we\noutline design improvements to these PCBs that enhance isolation between\nreadout networks."}
{"id": "2509.22843", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.22843", "abs": "https://arxiv.org/abs/2509.22843", "authors": ["Rob AJ Eyles-Ferris", "Andrew King", "Rhaana LC Starling", "Peter G Jonker", "Andrew J Levan", "Antonio Martin-Carrillo", "Tanmoy Laskar", "Jillian C Rastinejad", "Nikhil Sarin", "Nial R Tanvir", "Benjamin P Gompertz", "Nusrin Habeeb", "Paul T O'Brien", "Massimiliano De Pasquale"], "title": "Can GRB 250702B be explained as the tidal disruption of a white dwarf by an intermediate mass black hole? Yes", "comment": "7 pages, 2 figures. Submitted to MNRAS Letters, comments welcome!", "summary": "GRB 250702B is a unique astrophysical transient characterised by its nature\nas a repeating gamma-ray trigger. Its properties include possible periodicity\nin its gamma-ray light curve, an X-ray counterpart that rose prior to the\ngamma-ray outbursts and faded quickly, and radio and infrared counterparts.\nThese features are difficult to reconcile with most models of high energy\ntransients but we show that they are compatible with a white dwarf bound to an\nintermediate mass black hole that is tidally stripped over multiple pericentre\npassages before being fully disrupted. Accretion onto the black hole powers a\nmildly relativistic jet that produces the X-rays through internal processes and\nthe infrared and radio counterparts through thermal emission and external\nshocks respectively but is unable to produce the gamma-ray emission on its own.\nWe propose that chaotic debris streams from the multiple stripping episodes can\ncollide with a period roughly the same as the orbital period of the star. These\nshocks produce hard X-ray photons that are upscattered by the jet to produce\nthe observed gamma-ray emission. Future analysis of the jet properties will\nallow us to place firmer constraints on our model."}
{"id": "2509.25128", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.25128", "abs": "https://arxiv.org/abs/2509.25128", "authors": ["Judit Pérez-Romero", "Saptashwa Bhattacharyya", "Sascha Caron", "Dmitry Malyshev", "Rodney Nicolas", "Giacomo Principe", "Zoja Rokavec", "Roberto Ruiz de Austri", "Danijel Skočaj", "Fiorenzo Stoppa", "Domen Tabernik", "Gabrijela Zaharijas"], "title": "Towards a foundation model for astrophysical source detection: An End-to-End Gamma-Ray Data Analysis Pipeline Using Deep Learning", "comment": "6 pages, 3 figures, presented at EuCAIFCon 2025", "summary": "The increasing volume of gamma-ray data demands new analysis approaches that\ncan handle large-scale datasets while providing robustness for source\ndetection. We present a Deep Learning (DL) based pipeline for detection,\nlocalization, and characterization of gamma-ray sources. We extend our\nAutoSourceID (ASID) method, initially tested with \\textit{Fermi}-LAT simulated\ndata and optical data (MeerLICHT), to Cherenkov Telescope Array Observatory\n(CTAO) simulated data. This end-to-end pipeline demonstrates a versatile\nframework for future application to other surveys and potentially serves as a\nbuilding block for a foundational model for astrophysical source detection."}
{"id": "2509.22933", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.22933", "abs": "https://arxiv.org/abs/2509.22933", "authors": ["Thomas Donlon II"], "title": "Two Brief Geometric Derivations of the Shklovskii Effect in Pulsars", "comment": "Community note. Comments welcome", "summary": "I provide two short derivations for the Shklovskii effect, which describes\nthe apparent secular period drift of a periodic source due to its motion on the\nsky. These derivations use easily visualizable geometry and calculus, and might\nbe useful for those who wish to gain intuition for the subject."}
{"id": "2509.24453", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.24453", "abs": "https://arxiv.org/abs/2509.24453", "authors": ["E. Molina", "L. Foffano", "S. Crestan", "S. Iovenitti", "S. Lombardi", "F. Lucarelli", "T. Mineo"], "title": "To cut or not to cut: Data-quality evaluation for the ASTRI Mini-Array", "comment": "8 pages, 4 figures. Proceedings of the ICRC 2025", "summary": "The ASTRI Mini-Array consists of nine Cherenkov telescopes under construction\nat the Observatorio del Teide, with one of them already performing observations\nsince November 2024. Given the complexity of the analysis of gamma-ray data\nacquired with Cherenkov telescopes, a proper evaluation of the quality of these\ndata is important to avoid a negative impact on the high-level scientific\nproducts. There are several factors that can contribute to reducing the quality\nof the observations, such as clouds, high humidity or a high dust concentration\nin the air, among others. In order to take all these factors into account and\nevaluate their impact on the data, a quality check pipeline has been developed\nfor ASTRI. This contribution describes the pipeline, from its inputs at\ndifferent data levels to the production of outputs in the form of good-quality\nlists and diagnostic plots. We also show how setting preliminary quality cuts\non the Crab Nebula data taken with the first ASTRI telescope can significantly\nimprove the source detection."}
{"id": "2509.23295", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.23295", "abs": "https://arxiv.org/abs/2509.23295", "authors": ["Oleh Petruk", "Taras Kuzyo"], "title": "On the properties of turbulence in the remnant of Tycho supernova", "comment": "Accepted by Astrophysical Journal", "summary": "We investigate the turbulent structures in the Tycho supernova remnant (SNR)\nby applying two-point autocorrelation and power spectral analyses to\nhigh-resolution X-ray and radio images. Using cleaned Chandra and VLA data, we\nderive two-dimensional (2D) and one-dimensional (1D) autocorrelation functions\nand power spectra, revealing that the fluctuations in both X-ray brightness\n(approximately tracing plasma density) and radio brightness (tracing magnetic\nfield strength) follow the power-law distributions consistent with\nKolmogorov-type turbulence. Specifically, power spectra exhibit a slope $8/3$\nin 2D and $5/3$ in 1D analyses, indicating fully developed turbulence across a\nbroad range of spatial scales. The structure functions and spectral slopes\nremain robust with and without correction for line-of-sight integration\neffects, suggesting the presence of Kolmogorov-like turbulence locally\nthroughout the remnant's volume. Anisotropies in the 2D autocorrelation\nfunction are aligned with known density and magnetic field gradients. Analysis\nof the 1D radial properties of turbulence confirms Kolmogorov scaling and\nindicates that modes in the power spectra may be related either to periodicity\nin the fluctuations or to the physical sizes of bright or dim features in the\nsurface brightness. Our results demonstrate that the Tycho SNR hosts a\nspatially and temporally developed turbulent cascade, providing insight into\nthe physics of turbulence in SNRs."}
{"id": "2509.24499", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.24499", "abs": "https://arxiv.org/abs/2509.24499", "authors": ["Bastien Lacave", "Tjark Miener", "Alexander Cerviño"], "title": "Deep Learning Reconstruction on Crab LST-1 Data", "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC\n  2025), 2025", "summary": "The Cherenkov Telescope Array Observatory (CTAO) is the next-generation\nground-based observatory for very-high-energy (VHE) gamma-ray astronomy. The\nLarge-Sized Telescope prototype, LST-1, located on the Canary Island of La\nPalma, is responsible for observation of the low-energy range of the VHE\ngamma-ray spectrum. It is undergoing commissioning and has already observed the\nCrab Nebula as a standard reference source. Accurate reconstruction of shower\nparameters (e.g. energy, direction, and particle type) is crucial for achieving\nthe scientific goals of the CTAO. In this work, we use CTLearn to implement\ndeep-learning event reconstruction, as an alternative to the standard Random\nForest method. CTLearn is built to be fully compatible with ctapipe, a\nframework for prototyping the low-level data processing algorithms for the\nCTAO, and can be seamlessly used for data analysis without changing the general\nframework. It implements convolution-neural-network based models that take the\nintegrated charge and the relative peak time of calibrated pixels in cleaned\nimages as an input, to infer the primary particle's properties. Using Crab\nNebula observations as a validation sample, we explore two different\napproaches. The first is to train a model with Monte-Carlo (MC) simulations\ncovering all possible altitude-azimuth coordinates of the Crab Nebula sample\nobservations, resulting in a single model that can be used to reconstruct\nevents from any Crab Nebula observations. The second approach is to train 10\nmodels along this coordinate line, each incorporating a range of\n\\textasciitilde10{\\deg} in altitude. In this contribution, we present our\ninvestigation of the performance of CTLearn models, and highlight the potential\nof CTLearn for future data analysis in the CTAO."}
{"id": "2509.23345", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.23345", "abs": "https://arxiv.org/abs/2509.23345", "authors": ["Nissim Fraija", "B. Betancourt Kamenetskaia", "Antonio Galván Gámez", "Maria G. Dainotti", "Hermes León Vargas"], "title": "Closure Relations of Synchrotron Self-Compton from Reverse shock and Fermi-LAT GRBs", "comment": "34 pages, 10 figures, Accepted in MNRAS", "summary": "Synchrotron radiation from the reverse- and forward-shock regions typically\ndescribes the evolution of temporal and spectral features given by the closure\nrelations (CRs) during the late and long-/short-lasting emission in the\nafterglow phase of Gamma-ray bursts (GRBs). Although synchrotron photons are\nrestricted to keV and a few MeV energies, the synchrotron self-Compton (SSC)\nmechanism can disperse them above hundreds of MeV energies. We present the CRs\nof the SSC process radiated from the reverse-shock region for the case of a\nthick and thin shell, considering that the reverse shock lies in the adiabatic\nregime and evolves in an environment with a homogeneous and stratified medium.\nWe analyze these CRs with the spectral and temporal characteristics of the\nbursts described in the second \\textit{Fermi}-LAT GRB catalog (2FLGC) and found\nthat i) the thin shell case is preferred over a thick shell and a\nconstant-density medium over a stellar-wind environment, ii) bursts with an\natypical and hard spectral index could be successfully described by this\nscenario in different cooling conditions, iii) the early optical flash and GeV\nemission exhibited in GRB 160625B and 180720B were generated from the same\naccelerated region and electron population, concluding that LAT emission\noriginated during the early afterglow, and iv) the maximum synchrotron energy\nradiated from the reverse-shock scenario could explain only a few photons with\nthe exception of a pair of bursts, so that scattered photons by the SSC process\nmust be required."}
{"id": "2509.24954", "categories": ["astro-ph.HE", "astro-ph.IM", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2509.24954", "abs": "https://arxiv.org/abs/2509.24954", "authors": ["Mario Pasquato", "Martino Marelli", "Andrea De Luca", "Ruben Salvaterra", "Gaia Carenini", "Andrea Belfiore", "Andrea Tiengo", "Paolo Esposito"], "title": "Stellar flare detection in XMM-Newton with gradient boosted trees", "comment": "15 pages, 14 figures, Accepted for publication by A&A", "summary": "The EXTraS project, based on data collected with the XMM-Newton observatory,\nprovided us with a vast amount of light curves for X-ray sources. For each\nlight curve, EXTraS also provided us with a set of features\n(https://extras.inaf.it). We extract from the EXTraS database a tabular dataset\nof 31,832 variable sources by 108 features. Of these, 13,851 sources were\nmanually labeled as stellar flares or non-flares based on direct visual\ninspection. We employ a supervised learning approach to produce a catalog of\nstellar flares based on our dataset, releasing it to the community. We leverage\nexplainable AI tools and interpretable features to better understand our\nclassifier. We train a gradient boosting classifier on 80\\% of the data for\nwhich labels are available. We compute permutation feature importance scores,\nvisualize feature space using UMAP, and analyze some false positive and false\nnegative data points with the help of Shapley additive explanations -- an AI\nexplainability technique used to measure the importance of each feature in\ndetermining the classifier's prediction for each instance. On the test set made\nup of the remainder 20\\% of our labeled data, we obtain an accuracy of 97.1\\%,\nwith a precision of 82.4\\% and a recall of 73.3\\%. Our classifier outperforms a\nsimple criterion based on fitting the light curve with a flare template and\nsignificantly surpasses a gradient-boosted classifier trained only on\nmodel-independent features. False positives appear related to flaring light\ncurves that are not associated with a stellar counterpart, while false\nnegatives often correspond to multiple flares or otherwise peculiar or noisy\ncurves. We apply our trained classifier to currently unlabeled sources,\nreleasing the largest catalog of X-ray stellar flares to date. [abridged]"}
{"id": "2509.23451", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.23451", "abs": "https://arxiv.org/abs/2509.23451", "authors": ["Teresa Montaruli"], "title": "The Terzina payload on board the NUSES space mission", "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC\n  2025). 9 pages, 7 figures", "summary": "The Terzina payload, onboard the NUSES space mission is being built in\ncollaboration with TAS-I by GSSI, INFN and the University of Geneva. It is a\nCherenkov Schmidt-Cassegrain compact telescope with an effective focal length\nof 925~mm and a camera focal assembly composed of 640 pixels (16 vertically and\n40 horizontally) organized in $8\\times 8$ tiles produced by FBK with sensitive\narea $2.73 \\times 2.64$~mm$^2$. We will illustrate the performance for the\nsignal of cosmic rays beyond a threshold of few hundreds of PeV. Understanding\nthe operation of SiPMs in space with almost direct exposure to solar and\ntrapped protons and electrons, defining the mitigation strategy for the\nincrease of DCR of exposed silicon, the characterisation of the luminous\nbackgrounds, the data acquisition strategy for this payload, the maximization\nof the effective exposure to the atmospheric showers induced by the signal of\nneutrinos and cosmic rays are the challenges. At this conference, we describe\nhow they are being addressed."}
{"id": "2509.23547", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.23547", "abs": "https://arxiv.org/abs/2509.23547", "authors": ["Huan Yu", "Jun Fang"], "title": "Particle Acceleration along Magnetic Fields as the Origin of Ear-like Structures in Supernova Remnants", "comment": "6 pages, 4 figures, Accepted for publication in MNRAS", "summary": "The origin of ear-like structures with two opposite lobes extending from the\nshell of supernova remnants (SNRs) remains a subject of active debate, with\nproposed mechanisms ranging from jet-driven explosions to interactions with\nbipolar circumstellar media. We present a novel investigation using\nParticle-in-Cell (PIC) simulations to examine the dynamics of a spherical\nejecta in magnetized media, revealing a different formation mechanism for these\nstructures. Our results demonstrate that particle acceleration is significantly\nenhanced along the magnetic-field direction, producing substantial\nmodifications to shock morphology. These effects naturally generate elongated\nprotrusions bearing a remarkable similarity to the observed SNR ear structures.\nThis magnetic alignment scenario represents a distinct mechanism from the\nexisting jet-based and circumstellar interaction models. Our findings suggest\nthat magnetic field orientation may serve as a crucial diagnostic for\ndistinguishing between different ear formation mechanisms in SNRs."}
{"id": "2509.23628", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.23628", "abs": "https://arxiv.org/abs/2509.23628", "authors": ["Joseph R. Farah", "Alexandru Lupsasca", "Eliot Quataert", "Michael D. Johnson"], "title": "Interferometric inference of black hole spin from photon ring size and brightness", "comment": "11 pages, 6 figures", "summary": "The $n=1$ photon ring is a full image of the astrophysical source around a\nblack hole, produced by photons that execute $n\\approx1$ half-orbit around the\nevent horizon on their way to an observer. The Black Hole Explorer (BHEX) is a\nproposed extension of the Event Horizon Telescope to space that will target the\n$n=1$ photon rings of the supermassive black holes M87${}^\\ast$ and\nSgr\\,A${}^\\ast$. In this paper, we introduce a new interferometric observable\nthat will be directly measurable on BHEX baselines and which admits a clear\nimage-domain interpretation in terms of the photon ring brightness profile.\nAcross a wide range of semi-analytic equatorial emission models, we find that\nthe azimuthal intensity profile of the ring can change depending on the\nastrophysics of the source, but its width $w_b$ is weakly sensitive to these\ndetails -- much like the ring shape, which has previously been identified as a\nprobe of the spacetime geometry. Our survey suggests that interferometric\nmeasurements of the photon ring diameter and $w_b$ can place constraints (to\n$\\lesssim\\!20\\%$) on the spin and inclination of a black hole with a known\nmass-to-distance ratio, such as Sgr\\,A${}^\\ast$. State-of-the-art numerical\nsimulations support this finding, paving the way to a precise photon-ring-based\nspin measurement for Sgr\\,A${}^\\ast$ with BHEX."}
{"id": "2509.23894", "categories": ["astro-ph.HE", "astro-ph.GA", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2509.23894", "abs": "https://arxiv.org/abs/2509.23894", "authors": ["Pavel Abolmasov", "Omer Bromberg", "Amir Levinson", "Ehud Nakar"], "title": "Tidal disruption of a magnetized star", "comment": "submitted to ApJ; 24 pages, 15 figures, two tables; comments welcome!", "summary": "Tidal disruptions of stars by supermassive black holes in galactic centers\n(TDEs) are now being actively studied both theoretically and observationally.\nThey are observed throughout the electromagnetic spectrum, from radio to\ngamma-rays. It is still unclear how the emission is produced and, in\nparticular, what is the role of the magnetic field of the disrupted star. There\nare many ways how magnetic fields might affect the dynamics of a TDE. They are\nlikely responsible for the angular momentum transfer in the accretion disk\nformed at later stages and thus affect the radiation associated with the disk.\nMagnetic fields are also an important requirement for the formation of\nrelativistic jets, that are seen in some TDEs. The goal of our study is to\nconnect the field within the star to the fields that develop during the\nfallback and disk accretion. Using the fluid-dynamic code Athena++, we perform\na large-scale three-dimensional adaptive-mesh magnetohydrodynamic simulation of\na tidal disruption of a magnetized star. The fallback stream returning to the\nblack-hole vicinity after the disruption contains smooth magnetic fields\naligned with the stream lines. Formation of a nozzle shock near the pericenter\nof the initial orbit leads to a turbulent eccentric disk-like structure where\nthe field is amplified and entangled on the local dynamic time scales up to\napproximate equipartition. The resulting field is mildly anisotropic and has a\ntypical length several times smaller than the pericenter distance. The\nproperties of the field are consistent with the early stages of turbulent\ndynamo."}
{"id": "2509.23897", "categories": ["astro-ph.HE", "astro-ph.CO", "gr-qc"], "pdf": "https://arxiv.org/pdf/2509.23897", "abs": "https://arxiv.org/abs/2509.23897", "authors": ["Yin-Jie Li", "Yuan-Zhu Wang", "Shao-Peng Tang", "Yi-Zhong Fan"], "title": "Aligned Hierarchical Black Hole Mergers in AGN disks revealed by GWTC-4", "comment": "10 pages, 8 figures, comments are welcome", "summary": "The active galactic nucleus (AGN) accretion disks are ideal sites for\nhierarchical black hole (BH) mergers. To robustly probe such a possibility, we\nanalyze binary black hole mergers in the GWTC-4 with a flexible mixture\npopulation model for component masses, spin magnitudes, and spin tilt angles,\nand identify two distinct subpopulations. In the second subpopulation\ncharacterized by high spin magnitudes $\\chi\\sim 0.8$ as well as the broad mass\ndistribution up to $\\gtrsim 150M_\\odot$, we find a pronounced preference for\nspins aligned with the orbital angular momentum: an isotropic tilt distribution\nis strongly disfavored (logarithmic Bayes factor = 4.5). The aligned events\naccount for $\\sim 0.57^{+0.23}_{-0.31}$ of the second subpopulation,\ncorresponding to a local rate of $\\sim 0.25^{+0.38}_{-0.16} ~ {\\rm Gpc}^{-3}\n{\\rm yr}^{-1}$ (all values reflect central 90\\% credible intervals). These\nnotable features naturally arise from hierarchical mergers embedded in AGN\ndisks, where gas torques can effectively align spins. Our results identify\nAGN-disk hierarchical assembly as an important channel in the present\ngravitational-wave sample and provide concrete, testable predictions for future\ndetection."}
{"id": "2509.24021", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.24021", "abs": "https://arxiv.org/abs/2509.24021", "authors": ["Ken Ohashi", "Anatoli Fedynitch", "Hiroaki Menjo"], "title": "Constraining the strangeness enhancement scenario of the UHECR muon puzzle with LHC experiments", "comment": "9 pages, 6 figures", "summary": "The excess of muons observed in ultra-high-energy cosmic-ray air showers\nrelative to simulation predictions, known as the muon puzzle, provides indirect\nevidence of our incomplete understanding of high-energy hadronic interactions.\nAn unambiguous resolution requires that each proposed solution be directly\ntested through collider experiments probing hadronic interactions. In this\nwork, we develop a framework to assess the strangeness enhancement scenario,\nwherein an increased yield of kaons relative to pions boosts muon production.\nUsing the MCEQ air-shower simulation package, we first identify the key\nphase-space regions of hadronic interactions that drive muon yields in this\nscenario. We then demonstrate that combining Pierre Auger Observatory muon\nmeasurements with forthcoming kaon-to-pion ratio data from LHC Run~3 can\nrobustly constrain the scenario's parameters. In particular, we find that\nachieving 10.8% precision on the kaon-to-pion ratio at LHCb and 8.4% at FASER\nis sufficient to test the strangeness enhancement hypothesis over its viable\nparameter space. These upcoming experimental results will provide the first\ndirect constraints on strangeness enhancement as a potential resolution of the\nmuon puzzle."}
{"id": "2509.24447", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.24447", "abs": "https://arxiv.org/abs/2509.24447", "authors": ["G. Imaizumi", "M. Anzorena", "K. Fujita", "Y. Katayose", "S. Kato", "T. Kawashima", "K. Kawata", "A. Mizuno", "M. Ohnishi", "R. Garcia", "T. Sako", "F. Sugimoto", "M. Takita", "Y. Yokoe"], "title": "A Simulation Study on the Cosmic Ray Energy Spectra of Elemental Mass Groups using the Tibet Air Shower and Muon Detector Arrays through the Bayesian Unfolding Method", "comment": null, "summary": "We study the analysis method to determine the cosmic-ray energy spectra of\ndifferent mass groups assuming the use of the Tibet AS$\\gamma$ experiment,\nwhich consists of the high-density Tibet air-shower array (Tibet-AS) and the\nunderground muon detector (MD) array. These arrays measure the sampling air\nshower size $\\Sigma\\rho$ and the total muon number $\\Sigma N_{\\mu}$ of each air\nshower event. These parameters are known to contain information on the energy\nand mass of the primary particle. To reconstruct the energy spectra of\nindividual cosmic-ray mass groups, we apply a multidimensional unfolding method\nbased on Bayes' theorem to the two-dimensional distribution of $\\Sigma\\rho$ and\n$\\Sigma N_{\\mu}$ produced by Monte Carlo simulation. Simulated datasets with\ncombinations of the EPOS-LHC, SIBYLL-2.3c, and QGSJET~II-04 high-energy\nhadronic interaction models and a helium-dominant composition model are\nanalyzed while using a response matrix produced by EPOS-LHC. The unfolded\nspectra of the EPOS + helium-dominant composition model dataset show a\ndeviation from the input flux within $\\pm$10\\% except for a few bins, meaning\nthat the uncertainty of the technique itself and the composition model\ndependence is at that level. It is also shown that the deviation in the\nall-particle spectrum is within $\\pm$10\\% even when using different hadronic\ninteraction models in the dataset and the response matrix. On the other hand,\nthe unfolded spectra of individual mass groups have a clear dependence on the\nhadronic interaction model. The model dependence of the proton and helium\nspectra amounts to \\pm25% below 10$^{6.5}$ GeV. The dependence in the carbon\ngroup is at a \\pm25% level below 10$^{6}$ GeV, and for the iron spectrum, it\namounts to +55% and -30% in the energy range of 10$^{5.1}$ GeV to 10$^{6.7}$\nGeV."}
{"id": "2509.24453", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.24453", "abs": "https://arxiv.org/abs/2509.24453", "authors": ["E. Molina", "L. Foffano", "S. Crestan", "S. Iovenitti", "S. Lombardi", "F. Lucarelli", "T. Mineo"], "title": "To cut or not to cut: Data-quality evaluation for the ASTRI Mini-Array", "comment": "8 pages, 4 figures. Proceedings of the ICRC 2025", "summary": "The ASTRI Mini-Array consists of nine Cherenkov telescopes under construction\nat the Observatorio del Teide, with one of them already performing observations\nsince November 2024. Given the complexity of the analysis of gamma-ray data\nacquired with Cherenkov telescopes, a proper evaluation of the quality of these\ndata is important to avoid a negative impact on the high-level scientific\nproducts. There are several factors that can contribute to reducing the quality\nof the observations, such as clouds, high humidity or a high dust concentration\nin the air, among others. In order to take all these factors into account and\nevaluate their impact on the data, a quality check pipeline has been developed\nfor ASTRI. This contribution describes the pipeline, from its inputs at\ndifferent data levels to the production of outputs in the form of good-quality\nlists and diagnostic plots. We also show how setting preliminary quality cuts\non the Crab Nebula data taken with the first ASTRI telescope can significantly\nimprove the source detection."}
{"id": "2509.24475", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.24475", "abs": "https://arxiv.org/abs/2509.24475", "authors": ["Arnau Aguasca-Cabot", "Susumu Inoue", "Monica Seglar-Arroyo", "Kenta Terauchi", "Pol Bordas", "Marc Ribó"], "title": "LST-1 observations of GRB 221009A: Insights into its late-time VHE afterglow", "comment": "8 pages, 1 figure. Presented at the 39th International Cosmic Ray\n  Conference (ICRC 2025), 2025", "summary": "Gamma-ray bursts (GRBs) originate from explosions at cosmological distances,\ngenerating collimated jets. GRB 221009A, exploded on 9 October 2022, has been\nestablished as the brightest GRB to date. Its bright and long emission was\nextensively followed up from radio to gamma rays. LHAASO firmly detected the\nonset of the afterglow emission at energies up to $\\sim$13 TeV within about an\nhour after the burst, starting just a few minutes after the trigger. While this\nVHE emission component can be accounted for in a narrow jet scenario, such an\ninterpretation cannot reproduce the broadband emission observed at later times,\nwhich exceeds the theoretical expectations. This discrepancy can be settled if\nmore complex models are considered, providing the first strong evidence for a\nstructured jet in a long GRB. Unfortunately, the VHE emission after a few hours\nis poorly constrained, as sensitive VHE observations by Cherenkov Telescopes\nwere prevented due to strong moonlight conditions. The first Large-Sized\nTelescope (LST-1) of the future Cherenkov Telescope Array Observatory began\nobservations about one day after the burst under high night sky background\nconditions. These observations are the first ones performed on GRB 221009A by a\nCherenkov telescope, revealing a hint of a signal with a statistical\nsignificance of about 4$\\sigma$ during the observations performed at 1.3 days\nafter the burst. The monitoring campaign continued until the end of November\n2022, making it the deepest observation campaign performed on a GRB with the\nLST-1. In this contribution, we will present the analysis results of the LST-1\nobservation campaign on GRB 221009A in October 2022."}
{"id": "2509.24499", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.24499", "abs": "https://arxiv.org/abs/2509.24499", "authors": ["Bastien Lacave", "Tjark Miener", "Alexander Cerviño"], "title": "Deep Learning Reconstruction on Crab LST-1 Data", "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC\n  2025), 2025", "summary": "The Cherenkov Telescope Array Observatory (CTAO) is the next-generation\nground-based observatory for very-high-energy (VHE) gamma-ray astronomy. The\nLarge-Sized Telescope prototype, LST-1, located on the Canary Island of La\nPalma, is responsible for observation of the low-energy range of the VHE\ngamma-ray spectrum. It is undergoing commissioning and has already observed the\nCrab Nebula as a standard reference source. Accurate reconstruction of shower\nparameters (e.g. energy, direction, and particle type) is crucial for achieving\nthe scientific goals of the CTAO. In this work, we use CTLearn to implement\ndeep-learning event reconstruction, as an alternative to the standard Random\nForest method. CTLearn is built to be fully compatible with ctapipe, a\nframework for prototyping the low-level data processing algorithms for the\nCTAO, and can be seamlessly used for data analysis without changing the general\nframework. It implements convolution-neural-network based models that take the\nintegrated charge and the relative peak time of calibrated pixels in cleaned\nimages as an input, to infer the primary particle's properties. Using Crab\nNebula observations as a validation sample, we explore two different\napproaches. The first is to train a model with Monte-Carlo (MC) simulations\ncovering all possible altitude-azimuth coordinates of the Crab Nebula sample\nobservations, resulting in a single model that can be used to reconstruct\nevents from any Crab Nebula observations. The second approach is to train 10\nmodels along this coordinate line, each incorporating a range of\n\\textasciitilde10{\\deg} in altitude. In this contribution, we present our\ninvestigation of the performance of CTLearn models, and highlight the potential\nof CTLearn for future data analysis in the CTAO."}
{"id": "2509.24523", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.24523", "abs": "https://arxiv.org/abs/2509.24523", "authors": ["Francesco Schiavone"], "title": "Dark matter and fundamental physics with the Cherenkov Telescope Array Observatory", "comment": "6 pages, submitted to Il Nuovo Cimento C", "summary": "The Cherenkov Telescope Array Observatory (CTAO) will be the next-generation\nmajor ground-based gamma-ray observatory. It will be made up of two large\narrays of imaging atmospheric Cherenkov telescopes (IACTs), with one site in\nthe Northern hemisphere (La Palma, Canary Islands) and one in the Southern\n(Paranal, Chile). CTAO aims to offer great improvement in energetic and angular\nresolution with respect to current IACT systems, spanning a photon energy range\nfrom 20 GeV to 300 TeV, as well as a significantly larger effective area and\nfull-sky coverage. Besides a percentage of observational time available for\nexternal proposals, making it the first open gamma-ray observatory, the core\nobservational program of CTAO is organized in several Key Science Projects. A\nsignificant amount of time will be devoted to dark matter (e.g. WIMPs,\naxion-like particles) and fundamental physics studies from a variety of\ntargets, including the Milky Way's Galactic centre, dwarf spheroidal galaxies,\nthe Large Magellanic Cloud, and extragalactic objects such as blazars. In this\ncontribution, an overview of CTAO's main features is provided, with a focus on\nits capabilities to investigate these yet unanswered questions of modern\nphysics."}
{"id": "2509.24543", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.24543", "abs": "https://arxiv.org/abs/2509.24543", "authors": ["Francesco Schiavone", "Leonardo Di Venere", "Francesco Giordano"], "title": "A machine learning approach to axion-like particle searches in CTAO observations of blazars", "comment": "7 pages, 2 figures, ICRC 2025 proceeding submitted to PoS", "summary": "Axion-like particles (ALPs) are a common prediction of several extensions of\nthe Standard Model of particle physics and could be detected through their\ncoupling to photons, which enables ALP-photon conversions in external magnetic\nfields. This conversion could lead to two distinct signatures in gamma-ray\nspectra of blazars: a superimposition of energy-dependent \"wiggles\" on the\nspectral shape, and a hardening at high (multi-TeV) energies, due to the ALP\nbeam eluding absorption by the extragalactic background light (EBL). The\nenhanced energy resolution of the Cherenkov Telescope Array Observatory (CTAO)\nwith respect to present ground-based gamma-ray telescopes makes it an ideal\ninstrument to probe such phenomena. In this contribution, we explore a\ndifferent approach based on the use of machine learning (ML) classifiers and\ncompare it to the standard method. Our preliminary results suggest that both\ntechniques yield consistent results, with the ML-based method offering\ncomparable or even slightly broader coverage, potentially extending the CTAO\nsensitivity beyond existing constraints."}
{"id": "2509.24593", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.24593", "abs": "https://arxiv.org/abs/2509.24593", "authors": ["The Event Horizon Telescope Collaboration"], "title": "Horizon-scale variability of M87* from 2017--2021 EHT observations", "comment": "38 pages, 8 figures, accepted in Astronomy & Astrophysics", "summary": "We report three epochs of polarized images of M87* at 230\\,GHz using data\nfrom the Event Horizon Telescope (EHT) taken in 2017, 2018, and 2021. The\nbaseline coverage of the 2021 observations is significantly improved through\nthe addition of two new EHT stations: the 12\\,m Kitt Peak Telescope and the\nNorthern Extended Millimetre Array (NOEMA). All observations result in images\ndominated by a bright, asymmetric ring with a persistent diameter of $43.9\\pm\n0.6\\,\\muas$, consistent with expectations for lensed synchrotron emission\nencircling the apparent shadow of a supermassive black hole. We find that the\ntotal intensity and linear polarization of \\m87 vary significantly across the\nthree epochs. Specifically, the azimuthal brightness distribution of the total\nintensity images varies from year to year, as expected for a stochastic\naccretion flow. However, despite a gamma-ray flare erupting in M87\nquasi-contemporaneously to the 2018 observations, the 2018 and 2021 images look\nremarkably similar. The resolved linear polarization fractions in 2018 and 2021\npeak at $\\sim$5\\%, compared to $\\sim$15\\% in 2017. The spiral polarization\npattern on the ring also varies from year to year, including a change in the\nelectric vector position angle helicity in 2021 that could reflect changes in\nthe magnetized accretion flow or an external Faraday screen. The improved 2021\ncoverage also provides the first EHT constraints on jet emission outside the\nring, on scales of $\\lesssim 1$\\,mas. Overall, these observations provide\nstrong proof of the reliability of the EHT images and probe the dynamic\nproperties of the horizon-scale accretion flow surrounding \\m87."}
{"id": "2509.24954", "categories": ["astro-ph.HE", "astro-ph.IM", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2509.24954", "abs": "https://arxiv.org/abs/2509.24954", "authors": ["Mario Pasquato", "Martino Marelli", "Andrea De Luca", "Ruben Salvaterra", "Gaia Carenini", "Andrea Belfiore", "Andrea Tiengo", "Paolo Esposito"], "title": "Stellar flare detection in XMM-Newton with gradient boosted trees", "comment": "15 pages, 14 figures, Accepted for publication by A&A", "summary": "The EXTraS project, based on data collected with the XMM-Newton observatory,\nprovided us with a vast amount of light curves for X-ray sources. For each\nlight curve, EXTraS also provided us with a set of features\n(https://extras.inaf.it). We extract from the EXTraS database a tabular dataset\nof 31,832 variable sources by 108 features. Of these, 13,851 sources were\nmanually labeled as stellar flares or non-flares based on direct visual\ninspection. We employ a supervised learning approach to produce a catalog of\nstellar flares based on our dataset, releasing it to the community. We leverage\nexplainable AI tools and interpretable features to better understand our\nclassifier. We train a gradient boosting classifier on 80\\% of the data for\nwhich labels are available. We compute permutation feature importance scores,\nvisualize feature space using UMAP, and analyze some false positive and false\nnegative data points with the help of Shapley additive explanations -- an AI\nexplainability technique used to measure the importance of each feature in\ndetermining the classifier's prediction for each instance. On the test set made\nup of the remainder 20\\% of our labeled data, we obtain an accuracy of 97.1\\%,\nwith a precision of 82.4\\% and a recall of 73.3\\%. Our classifier outperforms a\nsimple criterion based on fitting the light curve with a flare template and\nsignificantly surpasses a gradient-boosted classifier trained only on\nmodel-independent features. False positives appear related to flaring light\ncurves that are not associated with a stellar counterpart, while false\nnegatives often correspond to multiple flares or otherwise peculiar or noisy\ncurves. We apply our trained classifier to currently unlabeled sources,\nreleasing the largest catalog of X-ray stellar flares to date. [abridged]"}
{"id": "2509.25036", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.25036", "abs": "https://arxiv.org/abs/2509.25036", "authors": ["Kinjal Roy", "Hemanth Manikantan", "Biswajit Paul"], "title": "XMM-Newton view of pulsating iron fluorescent emission from Centaurus X3", "comment": "Accepted for publication in ApJ", "summary": "Cen X-3 is a bright, high-mass X-ray binary pulsar. We present a pulse\nphase-resolved X-ray spectral analysis of data from an archival XMM-Newton\nobservation of Cen X-3 taken during the high state of the source. The\nobservation was entirely in the out-of-eclipse part of the binary orbit. We\nstudy the pulse phase variability of the three K${\\alpha}$ fluorescent emission\nlines from near-neutral, Helium-like and Hydrogen-like iron, along with the\niron K${\\beta}$ emission line. All four lines show clear modulation with the\npulse phase of the neutron star, and modulation is found to be higher for the\nlines from highly ionised iron compared to the neutral lines. Structures within\nthe light travel distance corresponding to the pulse period of the neutron star\nare likely responsible for the pulse phase modulation of the emission lines. We\nhave also investigated the orbital phase dependence of the pulse phase\nvariability in the iron lines by dividing the data into four segments at\ndifferent orbital phases of Cen X-3. The pulse phase modulation behaviour of\nthe four lines is quite identical at different orbital phases of Cen X-3,\nindicating the pulsed iron emission region is persistent in nature and probably\nphase aligned with respect to the observer. The accretion stream intercepting\nthe line of sight can probably produce the observed phase dependence of the\niron fluorescence emission lines."}
{"id": "2509.25128", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.25128", "abs": "https://arxiv.org/abs/2509.25128", "authors": ["Judit Pérez-Romero", "Saptashwa Bhattacharyya", "Sascha Caron", "Dmitry Malyshev", "Rodney Nicolas", "Giacomo Principe", "Zoja Rokavec", "Roberto Ruiz de Austri", "Danijel Skočaj", "Fiorenzo Stoppa", "Domen Tabernik", "Gabrijela Zaharijas"], "title": "Towards a foundation model for astrophysical source detection: An End-to-End Gamma-Ray Data Analysis Pipeline Using Deep Learning", "comment": "6 pages, 3 figures, presented at EuCAIFCon 2025", "summary": "The increasing volume of gamma-ray data demands new analysis approaches that\ncan handle large-scale datasets while providing robustness for source\ndetection. We present a Deep Learning (DL) based pipeline for detection,\nlocalization, and characterization of gamma-ray sources. We extend our\nAutoSourceID (ASID) method, initially tested with \\textit{Fermi}-LAT simulated\ndata and optical data (MeerLICHT), to Cherenkov Telescope Array Observatory\n(CTAO) simulated data. This end-to-end pipeline demonstrates a versatile\nframework for future application to other surveys and potentially serves as a\nbuilding block for a foundational model for astrophysical source detection."}
