{"id": "2512.04145", "categories": ["astro-ph.IM", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2512.04145", "abs": "https://arxiv.org/abs/2512.04145", "authors": ["Alexander T. Gagliano", "Yunyi Shen", "V. A. Villar"], "title": "Minuet: A Diffusion Autoencoder for Compact Semantic Compression of Multi-Band Galaxy Images", "comment": "27 pages, 15 figures, to be submitted to ApJ. Comments welcome", "summary": "The Vera C. Rubin Observatory is slated to observe nearly 20 billion galaxies during its decade-long Legacy Survey of Space and Time. The rich imaging data it collects will be an invaluable resource for probing galaxy evolution across cosmic time, characterizing the host galaxies of transient phenomena, and identifying novel populations of anomalous systems. While machine learning models have shown promise for extracting galaxy features from multi-band astronomical imaging, the large dimensionality of the learned latent space presents a challenge for mechanistic interpretability studies. In this work, we present Minuet, a low-dimensional diffusion autoencoder for multi-band galaxy imaging. Minuet is trained to reconstruct 72x72-pixel $grz$ image cutouts of 6M galaxies within $z<1$ from the Dark Energy Camera Legacy Survey using only five latent dimensions. By using a diffusion model conditioned on the transformer-based autoencoder's output for image reconstruction, we achieve semantically-meaningful latent representations of galaxy images while still allowing for high-fidelity, probabilistic reconstructions. We train a series of binary classifiers on Minuet's latent features to quantify their connection to morphological labels from Galaxy Zoo, and a conditional flow to produce posterior distributions of SED-derived redshifts, stellar masses, and star-formation rates. We further show the value of Minuet for nearest neighbor searches in the learned latent space. Minuet provides strong evidence for the low intrinsic dimensionality of galaxy imaging, and introduces a class of astrophysical models that produce highly compact representations for diverse science goals."}
{"id": "2512.04204", "categories": ["astro-ph.IM", "astro-ph.HE", "cs.AI"], "pdf": "https://arxiv.org/pdf/2512.04204", "abs": "https://arxiv.org/abs/2512.04204", "authors": ["Yang Liu", "Yuhao Lu", "Rahim Moradi", "Bo Yang", "Bing Zhang", "Wenbin Lin", "Yu Wang"], "title": "Machine Phenomenology: A Simple Equation Classifying Fast Radio Bursts", "comment": "19 pages, 9 figures, 3 tables. Submitted to SCIENCE CHINA Physics, Mechanics & Astronomy", "summary": "This work shows how human physical reasoning can guide machine-driven symbolic regression toward discovering empirical laws from observations. As an example, we derive a simple equation that classifies fast radio bursts (FRBs) into two distinct Gaussian distributions, indicating the existence of two physical classes. This human-AI workflow integrates feature selection, dimensional analysis, and symbolic regression: deep learning first analyzes CHIME Catalog 1 and identifies six independent parameters that collectively provide a complete description of FRBs; guided by Buckingham-$π$ analysis and correlation analysis, humans then construct dimensionless groups; finally, symbolic regression performed by the machine discovers the governing equation. When applied to the newer CHIME Catalog, the equation produces consistent results, demonstrating that it captures the underlying physics. This framework is applicable to a broad range of scientific domains."}
{"id": "2512.04224", "categories": ["astro-ph.IM", "physics.soc-ph"], "pdf": "https://arxiv.org/pdf/2512.04224", "abs": "https://arxiv.org/abs/2512.04224", "authors": ["Joyful E. Mdhluli"], "title": "LEBS Toolkit for Addressing Development Challenges through Astronomy", "comment": "6 pages, 3 figures, 1 table", "summary": "The LEBS Toolkit provides a comprehensive framework for astronomers and natural scientists to address development challenges through their field. The toolkit aligns with the Sustainable Development Goals (SDGs) and offers practical actions to achieve development outcomes. It emphasises the importance of effective communication between astronomy and development, highlighting four key components: Leadership, Externalities, Break Barriers to Entry and Support Functioning Markets & Institutions (LEBS). Using these components, scientists can promote accurate information dissemination, encourage positive community impacts, overcome monopolistic barriers, and improve market efficiency and institutional settings. The LEBS Toolkit serves as a guide for the scientific community in bridging the gap between scientific knowledge and practical development actions, ultimately contributing to global development goals."}
{"id": "2512.04326", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2512.04326", "abs": "https://arxiv.org/abs/2512.04326", "authors": ["Sebastián Espinosa", "Rene A. Mendez", "Jorge F. Silva", "Marcos Orchard"], "title": "A review on fundamental bounds and estimators for photometry and astrometry of celestial point sources using array detectors, from first principles", "comment": null, "summary": "Precise astrometric and photometric measurements of celestial point sources are fundamental to modern astronomy. These measurements, used to determine object positions, motions, and fluxes, are based on observational models that have evolved from empirical centroiding rules to rigorous probabilistic formulations at the pixel level. This review summarizes key contributions that formalized this transition and analyzes seminal works addressing both the theoretical limits and the empirical performance of estimators. Central to these developments is the derivation of fundamental bounds, such as the Cramér-Rao Lower Bound (CRLB), and the assessment of widely used estimators, including Maximum Likelihood (ML), Least Squares (LS), and Weighted Least Squares (WLS). These studies show that, while the CRLB sets a theoretical benchmark, practical estimators achieve it only under specific signal-to-noise ratio (SNR) regimes, with notable discrepancies in high-SNR conditions. Moreover, recent results demonstrate that jointly estimating source flux and background significantly improves photometric precision compared to sequential approaches. Looking ahead, the increasing complexity of astronomical surveys, driven by massive data volumes, dynamic observational conditions, and the integration of machine learning, poses new challenges to reliable inference. In this context, tools from statistical theory, including performance bounds and theoretically grounded estimators, remain critical to guide algorithm design and ensure robust astrometric and photometric pipelines."}
{"id": "2512.04181", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.04181", "abs": "https://arxiv.org/abs/2512.04181", "authors": ["Daniel Íñiguez-Pascual", "Daniele Viganò", "Diego F. Torres"], "title": "The dispersion in pulsar $γ$-ray efficiency", "comment": "5 pages, 3 figures. Accepted for publication in Astronomy & Astrophysics Letters", "summary": "The observational efficiency of pulsars, defined as the ratio of the observationally derived isotropic-equivalent luminosity, $4πd_{obs}^2 F_{obs}$, where $F_{obs}$ is the average pulsed energy flux of a pulsar and $d_{obs}$ is its estimated distance, to its energy budget, shows a wide range of values. This dispersion is believed to be a combination of beaming effects, different geometries, and case-by-case variability of the emission mechanism efficiency, but it is not clear in what proportion. In this work we focused on the gamma-ray range and analysed the four main ingredients that likely contribute to this dispersion: the geometrical term arising from the anisotropic emission (beaming), viewing and inclination angles, the uncertainty on the pulsar distance, the uncertainty on the moment of inertia, and the intrinsic efficiency of the mechanism producing the gamma-ray emission. Estimating the expected ranges of the moment of inertia and the distance errors, and considering a geometrical and spectral model that we have recently used to fit the light curves and spectra of the entire gamma-ray pulsar population, we estimate the a priori distribution of the first three ingredients in order to obtain the a posteriori distribution of the intrinsic efficiency of the mechanism. We found the latter to peak at $\\sim 5-15 \\%$ and to have a dispersion of around one order of magnitude. That is, we found the intrinsic efficiency of the mechanism to be the leading factor in the observed dispersion. In addition, we found little sensitivity of these results on different distributions of the estimated pulsar distance errors, and saw that the weak, alleged correlation with the spin-down power can only explain part of the observed dispersion. This methodology can be easily applied to other geometrical models of the emission, to test the sensitivity of these results on the beaming distribution."}
{"id": "2512.04372", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2512.04372", "abs": "https://arxiv.org/abs/2512.04372", "authors": ["Wei Guo", "Jiangpei Dou", "Mingming Xu", "Linyi Kong", "Baolu Liu", "Bo Chen", "Shu Jiang"], "title": "Design and dynamics experiment of filter wheel mechanism of space coronagraph", "comment": "Ninth Symposium on Novel Photoelectronic Detection Technology and Applications; 126174K (2023)", "summary": "In order to realize multi-spectral imaging of space coronagraph, a compact filter wheel mechanism is designed. The filters with different spectral transmittance can be cut into the optical path at different times by this mechanism. Because the image contrast of space coronagraph is very high, the high stability requirement for the optical unit of coronagraph is put forward. Small modulus worm gear and worm are taken by the mechanism, in order to realize compact structure, high stiffness, the unidirectional 360 degrees rotation and reverse self-locking function. The precision, stiffness, mechanical properties and reliability of the mechanism are analyzed in the paper. The results show that the position accuracy of the filter wheel can meet the requirement of 0.5mm. The first order modal of the mechanism is 313Hz. The results of vibration test indicate that stiffness, dynamic performance and reliability of the mechanism can be meet. Therefore, the design of filter wheel in this paper can ensure the multi-spectral imaging requirements under complex spatial conditions."}
{"id": "2512.04342", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.04342", "abs": "https://arxiv.org/abs/2512.04342", "authors": ["Ryan T. Wollaeger", "Jim E. Morel", "Kendra P. Long", "Mathew A. Cleveland", "Robert B. Lowrie"], "title": "Asymptotic constraints for 1D planar grey photon diffusion from linear transport with special-relativistic effects", "comment": "31 pages, 5 figures, 1 table. Submitted to the Journal of Quantitative Spectroscopy and Radiative Transfer (JQSRT) on 12/2/2025", "summary": "We derive a grey linear diffusion equation for photons with respect to inertial (or lab-frame) space and time, using asymptotic analysis in 1D planar geometry. The solution of the equation is the comoving radiation energy density. Our analysis does not make use of assumptions about the magnitude of velocity; instead we derive an asymptotic scaling in the lab frame such that we avoid apparent non-physical pathologies that are encountered with the standard static-matter scaling. We permit the photon direction to be continuous (as opposed to constraining the analysis to discrete ordinates). The result is a drift-diffusion equation in the lab frame for comoving radiation energy density, with an adiabatic term that matches the standard semi-relativistic diffusion equation. Following a recent study for discrete directions, this equation reduces to a pure advection equation as the velocity approaches the speed of light. We perform preliminary numerical experiments comparing solutions to relativistic lab-frame Monte Carlo transport and to the well-known semi-relativistic diffusion equation."}
{"id": "2512.04549", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.04549", "abs": "https://arxiv.org/abs/2512.04549", "authors": ["E. A. Kravchenko", "G. I. Rubtsov", "D. S. Zhadan"], "title": "Towards Baikal-Top: Feasibility study of an onshore detector system for the joint registration of EAS with Baikal-GVD", "comment": "7 pages, 4 figures", "summary": "We study the possibility of registering high-energy extensive air showers (EAS) by the onshore detector facility simultaneously with the trigger of the Baikal-GVD neutrino telescope. The location of the surface detector array on the shore of Lake Baikal is motivated by the fact that permanent placement of detectors on the surface of the lake is challenging. Within the given geometry, simultaneous registration is possible for EAS with a zenith angle of about 76 degrees within the limited solid angle. The corresponding inclined EAS are dominated by muons and significantly attenuated. The installation will make it possible to obtain an estimate of the number of high-energy muons in EAS. This, subsequently, would make it possible to verify EAS modeling and calculations of the atmospheric neutrino flux. The detector may also be used for cross-calibration of energy and direction measurements by the neutrino telescope. We use the CORSIKA program to simulate the registration of EAS on the shore close to the Baikal-GVD. The propagation of ultra-high energy muons produced by EAS through 3.5 km of water and their registration by Baikal-GVD is simulated using the PROPOSAL package. We calculate the minimal total area of the onshore detectors suitable for several cosmic ray energy thresholds, starting from 1 PeV. The report presents estimates of the number of events jointly registered by the onshore installation and the Baikal-GVD the EAS registration detector systems with different areas."}
{"id": "2512.04360", "categories": ["astro-ph.HE", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2512.04360", "abs": "https://arxiv.org/abs/2512.04360", "authors": ["Nat Gopalswamy", "Pertti Mäkelä", "Seiji Yashiro", "Sachiko Akiyama", "Hong Xie", "G. Sindhuja"], "title": "Solar Cycle Variation of Sustained Gamma Ray Emission from the Sun", "comment": "27 pages, 6 figures, 3 tables, Submitted to Solr Physics", "summary": "We investigated the occurrence rate of the sustained gamma ray emission (SGRE) events from the Sun using Fermi Large Area Telescope (LAT) data covering solar cycle (SC) 24 and the rising and maximum phases of SC 25. Due to a solar array drive assembly malfunction starting in March 2018, only small number (15) of SGRE events were observed during SC 25. Over the first 61 months, the average sunspot number (SSN) increased from 56.9 in SC 24 to 79.0 in SC 25. Fast and wide (FW) CMEs and decameter-hectometric (DH) type II bursts also increased significantly in SC 25 by 29% and 33%, respectively when normalized to SSN. Therefore, the increase in solar activity should result in a higher number of SGREs in SC 25. We estimated the number of SGREs in SC 25 using three methods. (i) If the SGRE number varies commensurate FW CMEs and DH type II bursts, SC 25 should have 45-47 SGRE events. (ii) In SC 24, ~17% of FW CMEs and 25% of DH type II bursts were associated with SGRE events. At this rate, SC 25 should have 46 SGRE events. (iii) Since SGRE events are invariably associated with >100 keV hard X-ray (HXR) bursts, we identified DH type II bursts associated with >100 keV HXR bursts from Fermi gamma ray burst monitor (GBM) during LAT data gaps. Based on our finding that SGRE events in SCs 24 and 25 were all associated with HXR bursts of duration > ~5 min, we found only 27 of the 79 LAT-gap type II bursts had >100 keV HXR bursts with duration > ~5 min. These DH type II bursts are likely to indicate SGRE, bringing the total number of SGRE events to 42 (15 observed + 27 inferred). Thus, the three methods provide similar estimates of the number of SGRE events in SC 25. We, therefore, conclude that that SC 25 is stronger than SC 24 based on the estimated number SGRE events. Halo CMEs, ground level enhancement (GLE) events, and intense geomagnetic storms are also consistent with a stronger SC 25."}
{"id": "2512.04669", "categories": ["astro-ph.IM", "physics.ins-det"], "pdf": "https://arxiv.org/pdf/2512.04669", "abs": "https://arxiv.org/abs/2512.04669", "authors": ["S. Diebold", "J. Barnstedt", "L. Conti", "H. R. Elsener", "L. Hanke", "M. Höltzli", "C. Kalkuhl", "D. Rau", "D. Schaadt", "T. Schanz", "B. Stelzer", "K. Werner"], "title": "Progress towards a microchannel plate detector with AlGaN photocathode and cross-strip anode for ultraviolet astronomy", "comment": "18 pages, 8 figures", "summary": "Microchannel plates (MCPs) were the driving detector technology for ultraviolet (UV) astronomy over many years, and still today MCP-based detectors are the baseline for several planned UV instruments. The development of advanced MCP detectors is ongoing and pursues the major goals of maximizing sensitivity, resolution, and lifetime, while at the same time decreasing weight, volume, and power consumption.\n  Development efforts for an MCP-based detector system for the UV are running at IAAT at the University of Tübingen. In this publication, we present our latest results towards coating aluminum gallium nitride (AlGaN) photocathodes directly on MCPs, to improve quantum detection efficiency in the far- and extreme-UV. Furthermore, we report on the implementation of a non-iterative centroiding algorithm for our coplanar cross-strip anode directly in an FPGA."}
{"id": "2512.04378", "categories": ["astro-ph.HE", "astro-ph.CO", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2512.04378", "abs": "https://arxiv.org/abs/2512.04378", "authors": ["Yacheng Kang", "Jin-Ping Zhu", "Lijing Shao", "Jiahang Zhong", "Jinghao Zhang", "Bing Zhang"], "title": "Mini-supernovae from white dwarf-neutron star mergers: Viewing-angle-dependent spectra and lightcurves", "comment": "Under final review at A&A after minor revisions, 14 pages, 7 figures", "summary": "Unstable mass transfer may occur during white dwarf-neutron star (WD-NS) mergers, in which the WD can be tidally disrupted and form an accretion disk around the NS. Such an accretion disk can produce unbound wind ejecta, with synthesized $^{56}\\mathrm{Ni}$ mixed in. Numerical simulations reveal that this unbound ejecta should be strongly polar-dominated, which may cause the following radioactive-powered thermal transient to be viewing-angle-dependent. This issue has so far received limited investigation.\n  We investigate how the intrinsically non-spherical geometry of WD-NS wind ejecta affects the viewing-angle dependence of the thermal transients. Using a two-dimensional axisymmetric ejecta configuration and incorporating heating from the radioactive decay of $^{56}\\mathrm{Ni}$, we employ a semi-analytical discretization scheme to simulate the observed viewing-angle-dependent photospheric evolution, as well as the resulting spectra and lightcurves. The observed photosphere evolves over time and depends strongly on the viewing angle: off-axis observers can see deeper, hotter inner layers of the ejecta and larger projected photospheric areas compared to on-axis observers. For a fiducial WD-NS merger producing 0.3 solar mass of ejecta and 0.01 solar mass of synthesized $^{56}\\mathrm{Ni}$, the resulting peak optical absolute magnitudes of the transient span from ~ -12 mag along the polar direction to ~ -16 mag along the equatorial direction, corresponding to luminosities of $10^{40}$-$10^{42}$ erg s$^{-1}$. The typical peak timescales are expected to be 3-10 d. We for the first time explore the viewing-angle effect on WD-NS merger transients. Since their ejecta composition and energy sources resemble those of supernovae, yet WD-NS merger transients are dimmer and evolve more rapidly, we propose using \"mini-supernovae\" to describe the thermal emission following WD-NS mergers."}
{"id": "2512.04816", "categories": ["astro-ph.IM", "physics.ins-det"], "pdf": "https://arxiv.org/pdf/2512.04816", "abs": "https://arxiv.org/abs/2512.04816", "authors": ["Thomas Essinger-Hileman", "C. Matt Bradford", "Patrick Brown", "Sean Bryan", "Jesse Coldsmith", "Jennifer Corekin", "Sumit Dahal", "Thomas Devlin", "Marc Foote", "Draisy Friedman", "Alessandro Geist", "Jason Glenn", "Christopher Green", "Tracee Jamison-Hooks", "Kevin Horgan", "Jared Lucey", "Philip Mauskopf", "Lynn Miles", "Sanetra Bailey Newman", "Gerard Quilligan", "Cody Roberson", "Adrian Sinclair", "Salman Sheikh", "Eric Weeks", "Christopher Wilson", "Travis Wise"], "title": "Spaceflight KID Readout Electronics for PRIMA", "comment": "5 pages, 4 figures, Submitted to IEEE Transactions on Applied Superconductivity", "summary": "We present the design and testing of a prototype multiplexing kinetic inductance detector (KID) readout electronics for the PRobe far-Infrared Mission for Astrophysics (PRIMA) space mission. PRIMA is a Probe-class astrophysics mission concept that will answer fundamental questions about the formation of planetary systems, the co-evolution of stars and supermassive black holes in galaxies, and the rise of heavy elements and dust over cosmic time. The readout electronics for PRIMA must be compatible with operation at Earth-Sun L2 and capable of multiplexing more than 1000 detectors over 2.5 GHz bandwidth while consuming around 30 W per readout chain. The electronics must also be capable of switching between the two instruments, which have different readout bands: the hyperspectral imager (PRIMAger, 2.6-4.9 GHz) and the spectrometer (FIRESS, 0.4-2.4 GHz). The PRIMA readout electronics use high-heritage SpaceCube digital electronics with a build-to-print SpaceCube Mini v3.0 board using a radiation-tolerant Kintex KU060 field programmable gate array (FPGA) and a custom high-speed digitizer board, along with RF electronics that provide filtering and power conditioning. We present the driving requirements for the system, as well as the hardware, firmware, software, and system-level design that meets those requirements."}
{"id": "2512.04508", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.04508", "abs": "https://arxiv.org/abs/2512.04508", "authors": ["XRISM collaboration"], "title": "Chlorine and Potassium Enrichment in the Cassiopeia A Supernova Remnant", "comment": "29 pages, 9 figures, 2 tables. Published in Nature Astronomy, 4 December 2025", "summary": "The elements in the universe are synthesized primarily in stars and supernovae, where nuclear fusion favors the production of even-Z elements. In contrast, odd-Z elements are less abundant and their yields are highly dependent on detailed stellar physics, making theoretical predictions of their cosmic abundance uncertain. In particular, the origin of odd-Z elements such as phosphorus (P), chlorine (Cl), and potassium (K), which are important for planet formation and life, is poorly understood. While the abundances of these elements in Milky Way stars are close to solar values, supernova explosion models systematically underestimate their production by up to an order of magnitude, indicating that key mechanisms for odd-Z nucleosynthesis are currently missing from theoretical models. Here we report the observation of P, Cl, and K in the supernova remnant Cassiopeia A using high-resolution X-ray spectroscopy with XRISM, with the detection of K at above the 6$σ$ level being the most significant finding. Supernova explosion models of normal massive stars cannot explain the element abundance pattern, especially the high abundances of Cl and K, while models that include stellar rotation, binary interactions or shell mergers agree closely with the observations. Our observations suggest that such stellar activity plays a significant role in supplying these elements to the universe."}
{"id": "2512.04840", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2512.04840", "abs": "https://arxiv.org/abs/2512.04840", "authors": ["Richard Fuchs", "Jakob Knollmüller", "Jakob Roth", "Vincent Eberle", "Philipp Frank", "Torsten A. Enßlin", "Lukas Heinrich"], "title": "aim-resolve: Automatic Identification and Modeling for Bayesian Radio Interferometric Imaging", "comment": "16 pages, 11 figures", "summary": "Modern radio interferometers deliver large volumes of data containing high-sensitivity sky maps over wide fields-of-view. These large area observations can contain various and superposed structures such as point sources, extended objects, and large-scale diffuse emission. To fully realize the potential of these observations, it is crucial to build appropriate sky emission models which separate and reconstruct the underlying astrophysical components. We introduce aim-resolve, an automatic and iterative method that combines the Bayesian imaging algorithm resolve with deep learning and clustering algorithms in order to jointly solve the reconstruction and source extraction problem. The method identifies and models different astrophysical components in radio observations while providing uncertainty quantification of the results. By using different model descriptions for point sources, extended objects, and diffuse background emission, the method efficiently separates the individual components and improves the overall reconstruction. We demonstrate the effectiveness of this method on synthetic image data containing multiple different sources. We further show the application of aim-resolve to an L-band (856 - 1712 MHz) MeerKAT observation of the radio galaxy ESO 137-006 and other radio galaxies in that environment. We observe a reasonable object identification for both applications, yielding a clean separation of the individual components and precise reconstructions of point sources and extended objects along with detailed uncertainty quantification. In particular, the method enables the creation of catalogs containing source positions and brightnesses and the corresponding uncertainties. The full decoupling of sky emission model and instrument response makes the method applicable to a wide variety of instruments or wavelength bands."}
{"id": "2512.04589", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2512.04589", "abs": "https://arxiv.org/abs/2512.04589", "authors": ["Kathrin Grunthal", "Nataliya Porayko", "David J. Champion", "Michael Kramer"], "title": "The role of distant pulsars in the detectability of continuous gravitational waves", "comment": "11 pages, 9 figures, accepted for publication by A&A", "summary": "One of the imminent science goals of pulsar timing arrays (PTAs) is the detection of a continuous gravitational wave (CGW) emitted by an individual supermassive black hole binary (SMBHB). SMBHBs that cause CGWs with GW frequencies $f_\\mathrm{GW} > 10 \\text{nHz}$ have undergone significant orbital evolution, hence a change of $f_\\mathrm{GW}$ over time. In PTA data sets with sufficiently long observational time span, this means that the Earth and pulsar terms' contributions to the CGW signal signature can eventually become resolvable. Since the pulsar term is accumulated incoherently and thus often treated as an additional source of noise, this separation can prove to be beneficial for the detection of the CGW signal in the PTA data set. We aim to investigate to what extent resolvable Earth and pulsar terms affect currently used techniques for CGW searches with PTA data sets, that treat the pulsar term as an additional source noise. We focus on the dependency of the pulsar term frequencies on the pulsar's distance. We aim to answer the question of whether adding more distant pulsars to a PTA data set can mitigate biases and improve the detection of CGWs. We show that under ideal conditions, more distant pulsars can facilitate the CGW search with PTA data sets. Bayesian parameter estimation is yielding better parameter constraints and the frequentist per-frequentist optimal statistic search becomes more stable. However, using the realistic data set simulations, it was found that other configuration parameters of a PTA, such as the anisotropic distribution of pulsars and the effective number of pulsars in a PTA, can play a crucial role to the importance of this effect."}
{"id": "2512.05078", "categories": ["astro-ph.IM", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2512.05078", "abs": "https://arxiv.org/abs/2512.05078", "authors": ["Mikaeel Yunus", "John F. Wu", "Benne W. Holwerda"], "title": "Improving Posterior Inference of Galaxy Properties with Image-Based Conditional Flow Matching", "comment": "Accepted at NeurIPS 2025 ML4PS workshop", "summary": "Estimating physical properties of galaxies from wide-field surveys remains a central challenge in astrophysics. While spectroscopy provides precise measurements, it is observationally expensive, and photometry discards morphological information that correlates with mass, star formation history, metallicity, and dust. We present a conditional flow matching (CFM) framework that leverages pixel-level imaging alongside photometry to improve posterior inference of galaxy properties. Using $\\sim10^5$ SDSS galaxies, we compare models trained on photometry alone versus photometry plus images. The image+photometry model outperforms the photometry-only model in posterior inference and more reliably recovers known scaling relations. Morphological information also helps mitigate the dust--age degeneracy. Our results highlight the potential of integrating morphology into photometric SED fitting pipelines, opening a pathway towards more accurate and physically informed constraints on galaxy properties."}
{"id": "2512.04804", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2512.04804", "abs": "https://arxiv.org/abs/2512.04804", "authors": ["Alessandro Veutro", "Irene Di Palma", "Marco Drago", "Pablo Cerdá-Durán", "Robin van der Laag", "Melissa López", "Fulvio Ricci"], "title": "Unveiling gravitational waves from core-collapse supernovae with MUSE", "comment": null, "summary": "The core collapse of a massive star at the end of its life can give rise to one of the most powerful phenomena in the Universe. Because of violent mass motions that take place during the explosion, core-collapse supernovae have been considered a potential source of detectable gravitational waveforms for decades. However, their intrinsic stochasticity makes ineffective the use of modelled techniques such as matched filtering, forcing us to develop model independent technique to unveil their nature. In this work we present MUSE pipeline, which is based on a classification procedure of the time-frequency images using a Convolutional Neural Network. The network is trained on phenomenological waveforms that are built to mimic the main common features observed in numerical simulation. The method is finally tested on a representative 3D simulation catalog in the context of Einstein Telescope, a third generation GW telescope. Among the three detector geometries considered here, the 2L with a relative inclination of $45^\\circ$ is the one achieving the best results, thus being able to detect a Kuroda2016-like waveform with an efficiency above $90\\%$ at 50 kpc."}
{"id": "2512.04589", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2512.04589", "abs": "https://arxiv.org/abs/2512.04589", "authors": ["Kathrin Grunthal", "Nataliya Porayko", "David J. Champion", "Michael Kramer"], "title": "The role of distant pulsars in the detectability of continuous gravitational waves", "comment": "11 pages, 9 figures, accepted for publication by A&A", "summary": "One of the imminent science goals of pulsar timing arrays (PTAs) is the detection of a continuous gravitational wave (CGW) emitted by an individual supermassive black hole binary (SMBHB). SMBHBs that cause CGWs with GW frequencies $f_\\mathrm{GW} > 10 \\text{nHz}$ have undergone significant orbital evolution, hence a change of $f_\\mathrm{GW}$ over time. In PTA data sets with sufficiently long observational time span, this means that the Earth and pulsar terms' contributions to the CGW signal signature can eventually become resolvable. Since the pulsar term is accumulated incoherently and thus often treated as an additional source of noise, this separation can prove to be beneficial for the detection of the CGW signal in the PTA data set. We aim to investigate to what extent resolvable Earth and pulsar terms affect currently used techniques for CGW searches with PTA data sets, that treat the pulsar term as an additional source noise. We focus on the dependency of the pulsar term frequencies on the pulsar's distance. We aim to answer the question of whether adding more distant pulsars to a PTA data set can mitigate biases and improve the detection of CGWs. We show that under ideal conditions, more distant pulsars can facilitate the CGW search with PTA data sets. Bayesian parameter estimation is yielding better parameter constraints and the frequentist per-frequentist optimal statistic search becomes more stable. However, using the realistic data set simulations, it was found that other configuration parameters of a PTA, such as the anisotropic distribution of pulsars and the effective number of pulsars in a PTA, can play a crucial role to the importance of this effect."}
{"id": "2512.04893", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.04893", "abs": "https://arxiv.org/abs/2512.04893", "authors": ["T. Mondal", "S. Chakraborty", "L. Resmi", "D. Bose"], "title": "Probing TeV Afterglow Emission of GRB~221009A with Gaussian Structured jet in Wind-driven medium", "comment": "12 pages, 8 figures", "summary": "Recent detections of very high energy (VHE; GeV-TeV) photons from gamma-ray burst (GRB) afterglows, most notably the extreme event GRB 221009A, require refined models that include realistic jet structures and complex circumburst environments. The jet's angular structure is crucial for shaping afterglow emission. Our recent work demonstrates that Gaussian jets, with their smooth angular decline, naturally produce early bright peaks for on-axis observers and delayed, softer, dimmer peaks at higher inclinations. The gradual decline suppresses excessive lateral expansion, unlike the sharp edge in top-hat jets, making Gaussian jets a compelling alternative to both top-hat and other structured-jet models. Here we implement a Gaussian structured-jet model to explain TeV afterglows from adiabatic forward shocks propagating in a wind-driven medium. We show that the TeV peak time and flux depend sensitively on jet geometry, kinetic energy, wind density, and on microphysical parameter ratios that scale the SSC component. We identify the afterglow parameter space that is favourable for detecting sub-TeV photons with the Cherenkov Telescope Array (CTA), finding that only about ten per cent of simulated TeV events exceed CTA sensitivity in a wind medium. These detections arise from near core-aligned views, with high kinetic energy and wind density, moderate initial Lorentz factor and downstream magnetic field, and a relatively large fraction of energy in nonthermal electrons. Applying this model to GRB 221009A, we perform multi-band fits including wind-modified dynamics, Klein-Nishina effects, and EBL attenuation, and find that a mildly off-axis geometry reproduces the observed X-ray and GeV-TeV light curves."}
{"id": "2512.04804", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2512.04804", "abs": "https://arxiv.org/abs/2512.04804", "authors": ["Alessandro Veutro", "Irene Di Palma", "Marco Drago", "Pablo Cerdá-Durán", "Robin van der Laag", "Melissa López", "Fulvio Ricci"], "title": "Unveiling gravitational waves from core-collapse supernovae with MUSE", "comment": null, "summary": "The core collapse of a massive star at the end of its life can give rise to one of the most powerful phenomena in the Universe. Because of violent mass motions that take place during the explosion, core-collapse supernovae have been considered a potential source of detectable gravitational waveforms for decades. However, their intrinsic stochasticity makes ineffective the use of modelled techniques such as matched filtering, forcing us to develop model independent technique to unveil their nature. In this work we present MUSE pipeline, which is based on a classification procedure of the time-frequency images using a Convolutional Neural Network. The network is trained on phenomenological waveforms that are built to mimic the main common features observed in numerical simulation. The method is finally tested on a representative 3D simulation catalog in the context of Einstein Telescope, a third generation GW telescope. Among the three detector geometries considered here, the 2L with a relative inclination of $45^\\circ$ is the one achieving the best results, thus being able to detect a Kuroda2016-like waveform with an efficiency above $90\\%$ at 50 kpc."}
{"id": "2512.04946", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.04946", "abs": "https://arxiv.org/abs/2512.04946", "authors": ["Dylan Magill", "Matt Nicholl", "Vysakh Anilkumar", "Sjoert van Velzen", "Xinyue Sheng", "Thai Son Mai", "Hung Viet Tran", "Ngoc Phu Doan", "Thomas Moore", "Shubham Srivastav", "David R. Young", "Charlotte R. Angus", "Joshua Weston"], "title": "MALLORN: Many Artificial LSST Lightcurves based on Observations of Real Nuclear transients", "comment": null, "summary": "The Vera C. Rubin Observatory's 10-Year Legacy Survey of Space and Time (LSST) is expected to produce a hundredfold increase in the number of transients we observe. However, there are insufficient spectroscopic resources to follow up on all of the wealth of targets that LSST will provide. As such it is necessary to be able to prioritise objects for followup observations or inclusion in sample studies based purely on their LSST photometry. We are particularly keen to identify tidal disruption events (TDEs) with LSST. TDEs are immensely useful for determining black hole parameters and probing our understanding of accretion physics. To assist in these efforts, we present the Many Artificial LSST Lightcurves based on the Observations of Real Nuclear transients (MALLORN) data set and the corresponding classifier challenge for identifying TDEs. MALLORN comprises 10178 simulated LSST light curves, constructed from real Zwicky Transient Facility (ZTF) observations of 64 TDEs, 727 nuclear supernovae and 1407 AGN with spectroscopic labels using Gaussian process fitting, empirically-motivated spectral energy distributions from SNCosmo and the baseline from the Rubin Survey Simulator. Our novel approach can be easily adapted to simulate transients for any photometric survey using observations from another, requiring only the limiting magnitudes and an estimate of the cadence of observations. The MALLORN Astronomical Classification Challenge, launched on Kaggle on 15/10/2025, will allow competitors to test their photometric classifiers on simulated LSST data to find TDEs and improve upon their capabilities prior to the start of LSST."}
{"id": "2512.04956", "categories": ["astro-ph.HE", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2512.04956", "abs": "https://arxiv.org/abs/2512.04956", "authors": ["Janette Suherli", "Ivo R. Seitenzahl", "Samar Safi-Harb", "Frédéric P. A. Vogt", "Wynn C. G. Ho", "Parviz Ghavamian", "Chuan-Jui Li", "Ashley J. Ruiter", "Roland M. Crocker", "Arpita Roy", "Ralph Sutherland"], "title": "Intertwined birth and death: a Herbig-Haro outflow resolves the distance to Vela Junior", "comment": "Accepted for publication in ApJ Letters", "summary": "The distance to the Vela Junior supernova remnant (RX J0852.0-4622 or G266.2-1.2) has long remained uncertain, limiting our understanding of its physical properties. Using VLT/MUSE integral field spectroscopy, we uncover chemical and kinematic connections between the nebula surrounding its Central Compact Object (CXOU J085201.4-461753) and the nearby Herbig-Haro outflow of Ve 7-27 (Wray 16-30), indicating a shared nitrogen-rich, Fe-peak-enhanced environment. This link ties stellar birth and death, with the young star Ve 7-27 embedded in material expelled by Vela Junior's massive progenitor, and the remnant's blast wave is expanding through the same medium. Adopting the Gaia-based distance to Ve 7-27, we revise Vela Junior's distance to $1.41\\pm0.14$ kpc. At this distance, the remnant's physical radius is $23.3\\pm2.3$ pc, and X-ray proper motions of the northwestern rim correspond to shock speeds of $(2.8\\pm0.7)\\times10^3$ to $(5.6\\pm1.5)\\times10^3$ km s$^{-1}$. These imply an age of $\\sim$1.6-3.3 kyr and a very low ambient density, indicating that Vela Junior is expanding within a highly rarefied wind-blown cavity carved by a massive progenitor -- consistent with the non-detection of strong thermal X-ray emission. This distance update also resolves long-standing inconsistencies, with major implications for its energy budget, particle acceleration efficiency, and compact object evolution."}
{"id": "2512.04972", "categories": ["astro-ph.HE", "astro-ph.SR", "nucl-th"], "pdf": "https://arxiv.org/pdf/2512.04972", "abs": "https://arxiv.org/abs/2512.04972", "authors": ["Peng Liu", "Zhonghao Tu", "Jianping Yuan", "Ang Li"], "title": "Internal superfluid response and torque evolution in the giant glitch of PSR J1718-3718", "comment": "9 pages, 3 figures, 4 tables", "summary": "We investigate the post-glitch rotational evolution of pulsars by analyzing the 2007 giant glitch of PSR J1718$-$3718 using a vortex creep model that incorporates both inward and outward nonlinear vortex motion, along with a time-varying external torque. A comprehensive fitting framework is developed, constrained by prior knowledge of moment of inertia participation from previous glitch studies. We apply a Markov Chain Monte Carlo approach to quantify uncertainties and parameter correlations. The model reproduces the observed timing data and yields physically consistent values for moment of inertia fractions and creep timescales. Our results indicate that inward creep and a long-term change in external torque dominate the observed increase in spin-down rate, pointing to structural changes within the star-likely triggered by a crustquake that initiated both vortex motion and a change in the moment of inertia. We estimate that the glitch involved approximately $2.4 \\times 10^{12}$ inward-moving vortices and $\\sim 142$ crustal plates with a typical size of $\\sim 0.03$ km. This study demonstrates that detailed post-glitch modeling of sparse timing data can simultaneously constrain internal superfluid dynamics and external torque evolution, providing a quantitative framework to probe the structural properties of neutron star interiors."}
{"id": "2512.05035", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2512.05035", "abs": "https://arxiv.org/abs/2512.05035", "authors": ["Philipp Mertsch"], "title": "Spectrum and anisotropies of Galactic cosmic rays: a laboratory for magnetic fields", "comment": "16 pages, 10 figures", "summary": "Much has been learned about Galactic cosmic rays in the past decade: On the observational side, the spectra of cosmic ray nuclei have been directly measured with high precision, resolving chemical composition up to TV rigidities. At even higher rigidities, direct detection is making contact with indirect observations from air shower arrays. A number of breaks have been found in the nuclear spectrum, which was previously thought to be a pure power law up to the knee. Data from air shower arrays also show interesting features in the arrival directions of cosmic-ray nuclei. On the theoretical side, more sophisticated models are able to explain the various spectral breaks either with transitions between different classes of sources or with changes in the transport regime. Yet, it has become clear that our ignorance of the structure of the Galactic magnetic fields, both on large and small scales, is limiting precision predictions. Turning this problem into an opportunity though, we can use Galactic cosmic rays as a laboratory for the study of Galactic magnetic fields. In this review talk, delivered at the 39th International Cosmic Ray Conference (ICRC2025), I have summarised what is known about the spectrum and anisotropies of Galactic cosmic rays, what is not known yet and what can be learnt in the future."}
{"id": "2512.05099", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.05099", "abs": "https://arxiv.org/abs/2512.05099", "authors": ["Roger W. Romani", "Maya Beleznay", "Alexei V. Filippenko", "Thomas G. Brink", "WeiKang Zheng"], "title": "PSR J0952-0607: Tightening a Record-High Neutron Star Mass", "comment": "To appear in the Astrophysical Journal", "summary": "We report on new orbit-minimum photometry and revised radial-velocity fitting that provide an improved measurement of the mass of the neutron star (NS) in pulsar PSR~J0952$-$0607 at $M_NS = 2.35\\pm 0.11 M_\\odot$. With its fast spin and unusually low magnetic field, this NS has evidently experienced unusual evolution, likely connected with its high mass, which is now $2.5σ$ above that of the heaviest pulsar with a white dwarf companion, as measured by Shapiro delay techniques. By tightening the mass measurement, we also raise the maximum (commonly called Tolman-Oppenheimer-Volkoff) NS mass to $M_{\\rm TOV} > 2.27\\,M_\\odot$$(2.12\\,M_\\odot)$ at $1σ$$(3σ)$ confidence, which improves bounds on the dense-matter equation of state. While the statistical error decreases and systematic issues should be modest, uncertainties remain; we comment briefly on these factors and prospects for further improvement."}
{"id": "2512.04204", "categories": ["astro-ph.IM", "astro-ph.HE", "cs.AI"], "pdf": "https://arxiv.org/pdf/2512.04204", "abs": "https://arxiv.org/abs/2512.04204", "authors": ["Yang Liu", "Yuhao Lu", "Rahim Moradi", "Bo Yang", "Bing Zhang", "Wenbin Lin", "Yu Wang"], "title": "Machine Phenomenology: A Simple Equation Classifying Fast Radio Bursts", "comment": "19 pages, 9 figures, 3 tables. Submitted to SCIENCE CHINA Physics, Mechanics & Astronomy", "summary": "This work shows how human physical reasoning can guide machine-driven symbolic regression toward discovering empirical laws from observations. As an example, we derive a simple equation that classifies fast radio bursts (FRBs) into two distinct Gaussian distributions, indicating the existence of two physical classes. This human-AI workflow integrates feature selection, dimensional analysis, and symbolic regression: deep learning first analyzes CHIME Catalog 1 and identifies six independent parameters that collectively provide a complete description of FRBs; guided by Buckingham-$π$ analysis and correlation analysis, humans then construct dimensionless groups; finally, symbolic regression performed by the machine discovers the governing equation. When applied to the newer CHIME Catalog, the equation produces consistent results, demonstrating that it captures the underlying physics. This framework is applicable to a broad range of scientific domains."}
{"id": "2512.04549", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.04549", "abs": "https://arxiv.org/abs/2512.04549", "authors": ["E. A. Kravchenko", "G. I. Rubtsov", "D. S. Zhadan"], "title": "Towards Baikal-Top: Feasibility study of an onshore detector system for the joint registration of EAS with Baikal-GVD", "comment": "7 pages, 4 figures", "summary": "We study the possibility of registering high-energy extensive air showers (EAS) by the onshore detector facility simultaneously with the trigger of the Baikal-GVD neutrino telescope. The location of the surface detector array on the shore of Lake Baikal is motivated by the fact that permanent placement of detectors on the surface of the lake is challenging. Within the given geometry, simultaneous registration is possible for EAS with a zenith angle of about 76 degrees within the limited solid angle. The corresponding inclined EAS are dominated by muons and significantly attenuated. The installation will make it possible to obtain an estimate of the number of high-energy muons in EAS. This, subsequently, would make it possible to verify EAS modeling and calculations of the atmospheric neutrino flux. The detector may also be used for cross-calibration of energy and direction measurements by the neutrino telescope. We use the CORSIKA program to simulate the registration of EAS on the shore close to the Baikal-GVD. The propagation of ultra-high energy muons produced by EAS through 3.5 km of water and their registration by Baikal-GVD is simulated using the PROPOSAL package. We calculate the minimal total area of the onshore detectors suitable for several cosmic ray energy thresholds, starting from 1 PeV. The report presents estimates of the number of events jointly registered by the onshore installation and the Baikal-GVD the EAS registration detector systems with different areas."}
