{"id": "2511.01883", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.01883", "abs": "https://arxiv.org/abs/2511.01883", "authors": ["Chintan Patel", "Sayantan Bhattacharya", "Karan Akbari", "Sudip Bhattacharyya", "Manojendu Choudhury"], "title": "A continuous transition from Type-C Quasi Periodic Oscillations to the Heartbeat state in the Black hole X-ray binary 4U 1630-47", "comment": "11 pages, 3 figures", "summary": "We present a timing analysis of the black hole X-ray binary (BHXRB) 4U\n1630-47 using AstroSat observations from 10-19 March 2023, for the first time\ncapturing a rare and rapid transition in variability properties. Within less\nthan a day, the source evolved from a type-C quasi-periodic oscillation (QPO)\nstate, with centroid frequencies between 3-5 Hz, to the Heartbeat state,\ncharacterized by a broad peak in the power density spectrum at ~25 mHz,\ncorresponding to a ~40 s modulation period. As the source evolved, it passed\nthrough a transition track where the QPO features weakened and ultimately\ndisappeared in the Heartbeat state. In the hardness-intensity Diagram, the QPOs\noccur at higher hardness and lower intensity, followed by a brightening phase\nas the source moved towards the soft intermediate state, and finally reached\nthe Heartbeat state through a transition towards lower hardness. In the\npower-color diagram, this transition is marked by a clear shift to a distinct\nregion of power color space, separate from the range occupied by other observed\nstates. This work establishes 4U 1630-47 as another system, apart from GRS\n1915+105, where a continuous transition from QPO to Heartbeat state has been\nobserved. Notably, 4U 1630-47 is the only system where the QPO is absent during\nthe heartbeat state. This provides us with another probe to understand the\nphysical mechanism governing this transition and the overall accretion\nmechanism in BHXRBs."}
{"id": "2511.01919", "categories": ["astro-ph.HE", "gr-qc"], "pdf": "https://arxiv.org/pdf/2511.01919", "abs": "https://arxiv.org/abs/2511.01919", "authors": ["Shashwat C. Sardesai", "Gabriel E. Freedman", "Sarah J. Vigeland", "Caitlin A. Witt"], "title": "Optimal strategies for continuous wave detection in pulsar timing arrays: Realistic pulsar noise and a gravitational wave background", "comment": "11 Figures, 12 pages, 2 tables", "summary": "Pulsar timing arrays are sensitive to low-frequency gravitational waves\n(GWs), such as those produced by supermassive binary black holes at subparsec\nseparations. The incoherent superposition of GWs emitted by a cosmological\npopulation of these sources produces a gravitational wave background (GWB),\nwhile some individual sources may be resolvable as deterministic signals with\nslowly varying GW frequencies, which are often referred to as \"continuous\nwaves\" (CWs). The Fp-statistic is a frequentist method of detecting these CWs.\nIn this paper, we study how the presence of pulsar red noise and a GWB affect\nthe Fp-statistic. We compare results when marginalizing over the red noise and\nusing the maximum-likelihood values of the red noise, and find little\ndifference between the two. We also present results of using the Fp-statistic\nto analyze the NANOGrav 12.5-year data set, where we find no evidence for CWs\nin agreement with the previously published Bayesian results."}
{"id": "2511.01969", "categories": ["astro-ph.HE", "astro-ph.GA", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2511.01969", "abs": "https://arxiv.org/abs/2511.01969", "authors": ["Greta Ettorre", "Emanuele Dalessandro", "Mario Cadelano", "Cristina Pallanca", "Paulo C. C. Freire", "Alessandro Ridolfi"], "title": "Identification and characterization of optical companions to the population of millisecond pulsars in the globular cluster M3", "comment": "Accepted for publication in Astronomy and Astrophysics. 14 pages, 11\n  figures, 3 tables (additional 2 pages, 1 figure and 1 table in the Appendix)", "summary": "The study of binary millisecond pulsars (MSPs) in globular clusters (GCs) is\na key ingredient to study binary and stellar evolution under extreme\nconditions. In this context, an accurate analysis of the optical emission,\nwhich is mostly dominated by the companion star, is essential for a\ncomprehensive characterization of these systems and their role within their\nenvironment. In this work, we present a multi-wavelength investigation of five\nbinary MSPs in the Galactic GC M3 (NGC 5272) using archival Hubble Space\nTelescope (HST) data. Our analysis builds on the timing solutions obtained with\nthe FAST radio Telescope by Li et al. (2024). For each MSP, we carry out\nprecise astrometric cross-matching with the accurate radio positions to\nidentify potential counterparts. When a match is found, we analyse its location\nin the colour-magnitude diagrams and compare the results with updated binary\nevolution models to infer the system properties. We confirm the identification\nof the optical companion to M3B, matching the source previously reported by\nCadelano et al. (2019), and successfully identify and characterize the optical\ncompanions to M3D and M3F. All three are consistent with helium white dwarfs,\nas expected from the canonical formation scenario. For M3A and M3E, no reliable\ncounterparts are found, but we place strong upper limits on the brightness and\nmass of the undetected companion. In the case of M3E, we detect a red object\nnear the radio position in two F814W observations; however, astrometric\nmeasurements over a 15-year baseline reveal a significant proper motion\ninconsistent with cluster membership, identifying the source as a foreground\ncontaminant. This study highlights the effectiveness of combining precise radio\ntiming with deep, multi-band HST images to uncover and constrain the nature of\nMSP companions in GCs, offering insights into their formation and evolutionary\nhistories."}
{"id": "2511.02037", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.02037", "abs": "https://arxiv.org/abs/2511.02037", "authors": ["Carlos Garcia Diaz", "Q. Daniel Wang", "Kevin C. Harrington", "James D. Lowenthal", "Patrick S. Kamieneski", "Eric F. Jimenez-Andrade", "Nicholas Foo", "Min S. Yun", "Brenda L. Frye", "Dazhi Zhou", "Amit Vishwas", "Ilsang Yoon", "Belen Alcalde Pampliega", "Daizhong Liu", "Massimo Pascale"], "title": "The complicated nature of the X-ray emission from the field of the strongly lensed hyperluminous infrared galaxy PJ1053+60 at z=3.549", "comment": "12 pages, 9 figures, Monthly Notices of the Royal Astronomical\n  Society", "summary": "We present an analysis of XMM-Newton X-ray observations of PJ1053+60, a\nhyperluminous infrared galaxy (HyLIRG) at z=3.549 that is strongly lensed by a\nforeground group at z=0.837. We also present GNIRS spectroscopy confirming the\npresence of an active galactic nucleus (AGN) to the southwest of PJ1053+60\n($AGN_{SW}$) at $z_{SW}$ = 1.373 $\\pm$ 0.006. Using this redshift prior, we\ndecompose the X-ray spectrum of PJ1053+60 into $AGN_{SW}$ and high-mass X-ray\nbinary (HMXB) components from the HyLIRG. The HMXB component has an unusually\nhigh luminosity, $\\sim$ 50 times higher than calibration derived from local\ngalaxies, and a characteristic photon index likely too flat to be caused by\nhigh-mass X-ray binaries at rest frame energies above a few keV. Our 2-D\nspatial decomposition also suggests a similarly high X-ray HMXB luminosity,\nalthough the limited spatial resolution prevents meaningful morphological\nconstraints on the component. We conclude that the enhanced X-ray emission may\nonly be explained by the presence of another AGN ($AGN_{FG}$) embedded in the\nforeground group lensing the PJ1053+60 system. The presence of $AGN_{FG}$ is\nfurther supported by the detection of a point-like radio continuum source that\ncoincides with the brightest group galaxy (BGG) of the foreground lens. Our\nstudy demonstrates the limited capability of current X-ray observatories while\nhighlighting the need for higher angular resolution observations to\ndefinitively characterize the nature of X-ray emission in distant, strongly\nlensed HyLIRGs."}
{"id": "2511.01958", "categories": ["astro-ph.IM", "astro-ph.CO", "astro-ph.HE", "cs.LG"], "pdf": "https://arxiv.org/pdf/2511.01958", "abs": "https://arxiv.org/abs/2511.01958", "authors": ["Eleonora Villa", "Golam Mohiuddin Shaifullah", "Andrea Possenti", "Carmelita Carbone"], "title": "Improving Bayesian inference in PTA data analysis: importance nested sampling with Normalizing Flows", "comment": "37 pages, 7 figures, 3 tables. Submitted to the Astronomy and\n  Computing special issue HPC in Cosmology and Astrophysics", "summary": "We present a detailed study of Bayesian inference workflows for pulsar timing\narray data with a focus on enhancing efficiency, robustness and speed through\nthe use of normalizing flow-based nested sampling. Building on the Enterprise\nframework, we integrate the i-nessai sampler and benchmark its performance on\nrealistic, simulated datasets. We analyze its computational scaling and\nstability, and show that it achieves accurate posteriors and reliable evidence\nestimates with substantially reduced runtime, by up to three orders of\nmagnitude depending on the dataset configuration, with respect to conventional\nsingle-core parallel-tempering MCMC analyses. These results highlight the\npotential of flow-based nested sampling to accelerate PTA analyses while\npreserving the quality of the inference."}
{"id": "2511.02057", "categories": ["astro-ph.HE", "gr-qc"], "pdf": "https://arxiv.org/pdf/2511.02057", "abs": "https://arxiv.org/abs/2511.02057", "authors": ["Morifumi Mizuno", "Samuel E. Gralla", "Alexander Philippov"], "title": "Plasma flow in force-free magnetospheres: two-fluid model near pulsars and black holes", "comment": "26 pages, 9 figures, 1 table", "summary": "Force-free electrodynamics describes the electromagnetic field of the\nmagnetically dominated plasma found near pulsars and active black holes, but\ngives no information about the underlying particles that ultimately produce the\nobservable emission. Working in the two-fluid approximation, we show how\nparticles can be \"painted on\" to a force-free solution as a function of\nboundary conditions that encode the particle output of \"gap regions\" where the\nforce-free approximation does not hold. These boundary conditions also\ndetermine the leading parallel electric field in the entire magnetosphere. Our\ntreatment holds in a general (possibly curved) spacetime and is phrased in\nlanguage intrinsic to the 1+1 dimensional \"field sheet spacetimes\" experienced\nby particles stuck to magnetic field lines. Besides the new results, this\nprovides an elegant formulation of some standard equations; for example, we\nshow that the zero-gyroradius guiding center approximation is just the Lorentz\nforce law on the field sheet. We derive a general perturbative method and apply\nit to pulsar and black hole magnetospheres with radial magnetic fields to\nproduce fully analytic models that capture key features of the full problem.\nWhen applied to more realistic magnetic field configurations together with\nsimulation-informed boundary conditions for the gap regions, this approach has\nthe potential to provide global magnetosphere models without the need for\nglobal particle-in-cell simulations."}
{"id": "2511.01959", "categories": ["astro-ph.IM", "astro-ph.CO", "astro-ph.HE", "cs.LG"], "pdf": "https://arxiv.org/pdf/2511.01959", "abs": "https://arxiv.org/abs/2511.01959", "authors": ["Eleonora Villa", "Luigi D'Amico", "Aldo Barca", "Fatima Modica Bittordo", "Francesco Alì", "Massimo Meneghetti", "Luca Naso"], "title": "Addressing prior dependence in hierarchical Bayesian modeling for PTA data analysis II: Noise and SGWB inference through parameter decorrelation", "comment": "18 pages, 7 figures. Submitted to the Astronomy and Computing special\n  issue HPC in Cosmology and Astrophysics", "summary": "Pulsar Timing Arrays provide a powerful framework to measure low-frequency\ngravitational waves, but accuracy and robustness of the results are challenged\nby complex noise processes that must be accurately modeled. Standard PTA\nanalyses assign fixed uniform noise priors to each pulsar, an approach that can\nintroduce systematic biases when combining the array. To overcome this\nlimitation, we adopt a hierarchical Bayesian modeling strategy in which noise\npriors are parametrized by higher-level hyperparameters. We further address the\nchallenge posed by the correlations between hyperparameters and physical noise\nparameters, focusing on those describing red noise and dispersion measure\nvariations. To decorrelate these quantities, we introduce an orthogonal\nreparametrization of the hierarchical model implemented with Normalizing Flows.\nWe also employ i-nessai, a flow-guided nested sampler, to efficiently explore\nthe resulting higher-dimensional parameter space. We apply our method to a\nminimal 3-pulsar case study, performing a simultaneous inference of noise and\nSGWB parameters. Despite the limited dataset, the results consistently show\nthat the hierarchical treatment constrains the noise parameters more tightly\nand partially alleviates the red-noise-SGWB degeneracy, while the orthogonal\nreparametrization further enhances parameter independence without affecting the\ncorrelations intrinsic to the power-law modeling of the physical processes\ninvolved."}
{"id": "2511.02186", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2511.02186", "abs": "https://arxiv.org/abs/2511.02186", "authors": ["Kazuki Yanagisawa", "Tomoharu Oka", "Ryo Ariyama", "Kazuki Yanagihara", "Yuhei iwata", "Mikiya M. Takahashi"], "title": "A Face-on Accretion Disk Geometry Revealed by Millimeter-wave Periodicity in Sgr A$^*$", "comment": "8 pages", "summary": "We analyzed 77 epochs of Atacama Large Millimeter/submillimeter Array (ALMA)\narchival data to investigate flux variability in Sagittarius A$^*$ (Sgr A$^*$),\nthe supermassive black hole at the Galactic Center. Among these, we identified\na rare but unusually clear and coherent ~52-minute sinusoidal modulation at 230\nGHz, with a statistical significance exceeding 5{\\sigma}. Modeling with a\nDoppler-boosted hotspot scenario yields an orbital radius of ~4 Schwarzschild\nradii and a disk inclination of 8$^\\circ$ (or 172$^\\circ$), providing the first\ndirect millimeter wavelength constraint on the inner accretion flow geometry.\nThis nearly face-on inclination is in good agreement with previous constraints\nfrom GRAVITY and EHT observations. These findings provide robust, independent\nevidence that millimeter-wave periodicity can directly probe the innermost\naccretion flow geometry, offering a powerful complement to variability studies\nat infrared and X-ray wavelengths."}
{"id": "2511.02173", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2511.02173", "abs": "https://arxiv.org/abs/2511.02173", "authors": ["Wilber Dominguez", "Darcy R. Barron", "Zeeshan Ahmed", "Amy N. Bender", "Sandra Diez", "Malcolm Durkin", "Tristan A. Eggenberger", "Gunther Haller", "Shawn W. Henderson", "Katherine Hewey", "Johannes Hubmayr", "Christopher Rooney", "Robinjeet Singh", "Michael Vissers"], "title": "Thermal and Electrical Properties of Prototype Readout Components for CMB-S4", "comment": "7 pages, 4 figures, submitted for review to IEEE Transactions on\n  Applied Superconductivity (IEEE-TAS) for a special issue for Low Temperature\n  Detectors 2025 (LTD2025) conference proceedings", "summary": "CMB-S4 is the fourth-generation ground-based cosmic microwave background\nproject, designed to probe the early universe and cosmic inflation. CMB-S4\nwould achieve its science goals in part by dramatically increasing the number\nof transition edge sensor (TES) bolometer detectors on the sky. The detector\nreadout system for CMB-S4 is time-division multiplexing (TDM) with a two-stage\nSuperconducting Quantum Interference Device (SQUID) system. To accommodate the\nlarge increase in detectors, the size of our camera increases, placing physical\nconstraints on the readout, its wiring, and its power dissipation. Therefore,\nto optimize readout performance, we need to balance competing design\nconsiderations such as thermal load and bandwidth. We present results\ncharacterizing the thermal and electrical performance of prototype components,\nincluding wiring and SQUID arrays for CMB-S4, and discuss the impact on overall\nsystem performance."}
{"id": "2511.02222", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.02222", "abs": "https://arxiv.org/abs/2511.02222", "authors": ["K. Abe", "S. Abe", "Y. Asaoka", "M. Harada", "Y. Hayato", "K. Hiraide", "K. Hosokawa", "T. H. Hung", "K. Ieki", "M. Ikeda", "J. Kameda", "Y. Kanemura", "Y. Kataoka", "S. Miki", "S. Mine", "M. Miura", "S. Moriyama", "M. Nakahata", "S. Nakayama", "Y. Noguchi", "G. Pronost", "K. Sato", "H. Sekiya", "R. Shinoda", "M. Shiozawa", "Y. Suzuki", "A. Takeda", "Y. Takemoto", "H. Tanaka", "T. Yano", "Y. Itow", "T. Kajita", "R. Nishijima", "K. Okumura", "T. Tashiro", "T. Tomiya", "X. Wang", "P. Fernandez", "L. Labarga", "D. Samudio", "B. Zaldivar", "C. Yanagisawa", "E. Kearns", "L. Wan", "T. Wester", "B. W. Pointon", "J. Bian", "B. Cortez", "N. J. Griskevich", "Y. Jiang", "M. B. Smy", "H. W. Sobel", "V. Takhistov", "A. Yankelevich", "J. Hill", "M. C. Jang", "S. H. Lee", "D. H. Moon", "R. G. Park", "B. S. Yang", "B. Bodur", "K. Scholberg", "C. W. Walter", "A. Beauch'ene", "E. Le Bl'evec", "O. Drapier", "A. Ershova", "M. Ferey", "Th. A. Mueller", "A. D. Santos", "P. Paganini", "C. Quach", "R. Rogly", "T. Nakamura", "J. S. Jang", "R. P. Litchfield", "L. N. Machado", "F. J. P. Soler", "J. G. Learned", "K. Choi", "S. Cao", "L. H. V. Anthony", "N. W. Prouse", "M. Scott", "Y. Uchida", "V. Berardi", "N. F. Calabria", "M. G. Catanesi", "N. Ospina", "E. Radicioni", "A. Langella", "G. De Rosa", "G. Collazuol", "M. Feltre", "M. Mattiazzi", "L. Ludovici", "M. Gonin", "L. P'eriss'e", "B. Quilain", "S. Horiuchi", "A. Kawabata", "M. Kobayashi", "Y. M. Liu", "Y. Maekawa", "Y. Nishimura", "R. Akutsu", "M. Friend", "T. Hasegawa", "Y. Hino", "T. Ishida", "T. Kobayashi", "M. Jakkapu", "T. Matsubara", "T. Nakadaira", "Y. Oyama", "A. Portocarrero Yrey", "K. Sakashita", "T. Sekiguchi", "T. Tsukamoto", "N. Bhuiyan", "G. T. Burton", "F. Di Lodovico", "J. Gao", "T. Katori", "R. Kralik", "N. Latham", "R. M. Ramsden", "H. Ito", "T. Sone", "A. T. Suzuki", "Y. Takeuchi", "S. Wada", "H. Zhong", "J. Feng", "L. Feng", "S. Han", "J. Hikida", "J. R. Hu", "Z. Hu", "M. Kawaue", "T. Kikawa", "T. Nakaya", "T. V. Ngoc", "R. A. Wendell", "S. J. Jenkins", "N. McCauley", "A. Tarrant", "M. Fan`i", "M. J. Wilking", "Z. Xie", "Y. Fukuda", "H. Menjo", "Y. Yoshioka", "J. Lagoda", "M. Mandal", "J. Zalipska", "M. Mori", "J. Jiang", "K. Hamaguchi", "H. Ishino", "Y. Koshio", "F. Nakanishi", "T. Tada", "T. Ishizuka", "G. Barr", "D. Barrow", "L. Cook", "S. Samani", "D. Wark", "A. Holin", "F. Nova", "S. Jung", "J. Yoo", "J. E. P. Fannon", "L. Kneale", "M. Malek", "J. M. McElwee", "T. Peacock", "P. Stowell", "M. D. Thiesse", "L. F. Thompson", "H. Okazawa", "S. M. Lakshmi", "E. Kwon", "M. W. Lee", "J. W. Seo", "I. Yu", "Y. Ashida", "A. K. Ichikawa", "K. D. Nakamura", "S. Goto", "H. Hayasaki", "S. Kodama", "Y. Kong", "Y. Masaki", "Y. Mizuno", "T. Muro", "K. Nakagiri", "Y. Nakajima", "N. Taniuchi", "M. Yokoyama", "P. de Perio", "S. Fujita", "C. Jes'us-Valls", "K. Martens", "Ll. Marti", "K. M. Tsui", "M. R. Vagins", "J. Xia", "M. Kuze", "S. Izumiyama", "R. Matsumoto", "R. Asaka", "M. Ishitsuka", "M. Sugo", "M. Wako", "K. Yamauchi", "Y. Nakano", "F. Cormier", "R. Gaur", "M. Hartz", "A. Konaka", "X. Li", "B. R. Smithers", "S. Chen", "Y. Wu", "B. D. Xu", "A. Q. Zhang", "B. Zhang", "H. Adhikary", "M. Girgus", "P. Govindaraj", "M. Posiadala-Zezula", "Y. S. Prabhu", "S. B. Boyd", "R. Edwards", "D. Hadley", "M. Nicholson", "M. O'Flaherty", "B. Richards", "A. Ali", "B. Jamieson", "C. Bronner", "D. Horiguchi", "A. Minamino", "Y. Sasaki", "R. Shibayama", "R. Shimamura"], "title": "Search for Diffuse Supernova Neutrino Background with 956.2 days of Super-Kamiokande Gadolinium Dataset", "comment": null, "summary": "We report the search result for the Diffuse Supernova Neutrino Background\n(DSNB) in neutrino energies beyond 9.3~MeV in the gadolinium-loaded\nSuper-Kamiokande (SK) detector with $22,500\\times956.2$$~\\rm m^3\\cdot day$\nexposure. %$22.5{\\rm k}\\times956.2$$~\\rm m^3\\cdot day$ exposure. Starting in\nthe summer of 2020, SK introduced 0.01\\% gadolinium (Gd) by mass into its\nultra-pure water to enhance the neutron capture signal, termed the SK-VI phase.\nThis was followed by a 0.03\\% Gd-loading in 2022, a phase referred to as\nSK-VII. We then conducted a DSNB search using 552.2~days of SK-VI data and\n404.0~days of SK-VII data through September 2023. This analysis includes\nseveral new features, such as two new machine-learning neutron detection\nalgorithms with Gd, an improved atmospheric background reduction technique, and\ntwo parallel statistical approaches. No significant excess over background\npredictions was found in a DSNB spectrum-independent analysis, and 90\\% C.L.\nupper limits on the astrophysical electron anti-neutrino flux were set.\nAdditionally, a spectral fitting result exhibited a $\\sim1.2\\sigma$\ndisagreement with a null DSNB hypothesis, comparable to a previous result from\n5823~days of all SK pure water phases."}
{"id": "2511.02328", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.02328", "abs": "https://arxiv.org/abs/2511.02328", "authors": ["Guanhong Lin", "Dejia Zhou", "Jianli Zhang", "Jialang Ding", "Fei Liu", "Xiaoyun Ma", "Yuan Liang", "Ruan Duan", "Liaoyuan Liu", "Xuanyu Wang", "Xiaohui Yan", "Yingrou Zhan", "Yuting Chu", "Jing Qiao", "Wei Wang", "Jie Zhang", "Zerui Wang", "Meng Liu", "Chenchen Miao", "Menquan Liu", "Meng Guo", "Di Li", "Pei Wang"], "title": "ASTROFLOW: A Real-Time End-to-End Pipeline for Radio Single-Pulse Searches", "comment": "17 pages, 14 figures", "summary": "Fast radio bursts (FRBs) are extremely bright, millisecond duration cosmic\ntransients of unknown origin. The growing number of wide-field and\nhigh-time-resolution radio surveys, particularly with next-generation\nfacilities such as the SKA and MeerKAT, will dramatically increase FRB\ndiscovery rates, but also produce data volumes that overwhelm conventional\nsearch pipelines. Real-time detection thus demands software that is both\nalgorithmically robust and computationally efficient. We present Astroflow, an\nend-to-end, GPU-accelerated pipeline for single-pulse detection in radio\ntime-frequency data. Built on a unified C++/CUDA core with a Python interface,\nAstroflow integrates RFI excision, incoherent dedispersion, dynamic-spectrum\ntiling, and a YOLO-based deep detector. Through vectorized memory access,\nshared-memory tiling, and OpenMP parallelism, it achieves 10x\nfaster-than-real-time processing on consumer GPUs for a typical 150 s,\n2048-channel observation, while preserving high sensitivity across a wide range\nof pulse widths and dispersion measures. These results establish the\nfeasibility of a fully integrated, GPU-accelerated single-pulse search stack,\ncapable of scaling to the data volumes expected from upcoming large-scale\nsurveys. Astroflow offers a reusable and deployable solution for real-time\ntransient discovery, and provides a framework that can be continuously refined\nwith new data and models."}
{"id": "2511.02236", "categories": ["astro-ph.HE", "nucl-th"], "pdf": "https://arxiv.org/pdf/2511.02236", "abs": "https://arxiv.org/abs/2511.02236", "authors": ["Kenji Fukushima", "Josuke Minamiguchi", "Tomoya Uji"], "title": "Magnetic-type Love number differentiating quark stars from neutron stars", "comment": "6 pages, 4 figures", "summary": "The quark star (QS) is a hypothetical and yet undiscovered stellar object,\nand its existence would mark a paradigm shift in research on nuclear and quark\nmatter. Although compactness is a well-known signature for distinguishing\nbetween two branches of QSs and neutron stars (NSs), some QSs can overlap with\nNSs in the radius-mass plane. To manifest their evident differences, we\ninvestigate the tidal properties of QSs and NSs. We then find that the\nmagnetic-type Love number is a robust indicator for differentiating between QSs\nand NSs, whereas the electric-type one is insufficient when QSs and NSs have\nsimilar masses and radii. Finally, we show that gravitational waves from binary\nstar mergers can be sensitive to differences between QSs and NSs to the\ndetectable level."}
{"id": "2511.02756", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2511.02756", "abs": "https://arxiv.org/abs/2511.02756", "authors": ["Matthew A. Koc", "Jason Austermann", "James Beall", "Johannes Hubmayr", "Joel N. Ullom", "Michael Vissers", "Jordan Wheeler"], "title": "Development of Silicon Micromachined Waveguide Filter-Banks for On-Chip Spectrometers", "comment": "6 pages, 6 figures, submitted to IEEE Transactions on Applied\n  Superconductivity", "summary": "Development of high-speed, spatial-mapping spectrometers in the millimeter\nand far-infrared frequencies would enable entirely new research avenues in\nastronomy and cosmology. An \"on-chip\" spectrometer is one such technology that\ncould enable Line Intensity Mapping. Recent work has shown the promise of\nhigh-speed imaging; however, a limiting factor is that many of these devices\nsuffer from low optical efficiency. Here we present the fabrication of a\nmetalized, Si waveguide filter-bank fabricated using deep reactive ion etching\nfor use in millimeter spectroscopy. Our design simultaneously provides\nhigh-density pixel packing, high optical efficiency, high spectral resolution,\nand is readily compatible with simple and multiplexable MKID arrays. Gold\nplated test waveguide and filter show excellent match to simulations with a\nmeasured resolving power of 263 and a loss quality factor of 1116 at room\ntemperature. The results show promise for extending the measurements to larger,\nmulti-wavelength designs."}
{"id": "2511.02375", "categories": ["astro-ph.HE", "astro-ph.CO", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2511.02375", "abs": "https://arxiv.org/abs/2511.02375", "authors": ["Rashmi Sagar", "Abhirup Datta", "Arnab Chakraborty", "Nirupam Roy", "Akriti Sinha", "Aishrila Mazumder", "Prasun Dutta", "Kh. Md. Asif Elahi", "Kanan K. Datta", "Samir Choudhuri", "Somnath Bharadwaj", "Srijita Pal", "Anshuman Tripathi", "Suman Majumdar", "Tirthankar Roy Choudhury", "Sk. Saiyad Ali"], "title": "ELAIS-N1 Deep Field uGMRT Band-2: Constraints on Diffuse Galactic Synchrotron Emission Power Spectrum", "comment": "17 pages, 11 figures, 8 tables, Accepted in MNRAS for publication", "summary": "We present high sensitivity, low radio frequency continuum observations of\nthe ELAIS-N1 field with 32 hours of observations of the uGMRT Band-2 ($120-250$\nMHz) covering $5.86\\,\\text{deg}^2$ area, achieving a central off-source RMS\nnoise of $237\\,\\mu\\mathrm{Jy}/\\mathrm{beam}$ with a resolution of $11.45''$ at\nthe central frequency of 183 MHz. A radio source catalogue of 1027 sources\nstatistically matches with similar observations at different frequencies within\nthe sensitivity range of the uGMRT. The calibrated data is further used to\ncharacterise the dominant foreground, the Diffuse Galactic Synchrotron Emission\n(DGSE), in angular scale and frequency regime. We derived the angular power\nspectrum (APS) of DGSE in two ways: image-based estimator (i-APS) and\nvisibility-based Tapered Gridded Estimator (TGE; hereafter as t-APS). We assess\nthe characteristics of DGSE with a power-law form of $C_{\\ell} =\nA({1000}/{\\ell})^{\\beta}$. Combining data from Band-2 and earlier Band-3\nobservations, we derived a spectral variation of $C_{\\ell}$ in the form of\n$C_{\\ell} = A{\\nu^{-2{\\alpha}}}{\\ell^{-{\\beta}}}$. Our result indicates a\nspectral break at $\\nu = 230\\,{\\pm}\\,5$ MHz, corresponding to a synchrotron age\nof $t_\\text{syn} = 106\\,{\\pm}\\,1$ Myr for the cosmic-ray electrons (CRe). This\nbreak result suggests a low-energy cutoff in the CRe population, leading to\nspectral curvature at low frequencies. Using both of the techniques, i-APS and\nt-APS, we find that the mean spectral index $\\alpha$ and power-law index\n$\\beta$ are consistent within the frequency range $120-500$ MHz."}
{"id": "2511.02562", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.02562", "abs": "https://arxiv.org/abs/2511.02562", "authors": ["D. Eappachen", "A. Balasubramanian", "Vishwajeet Swain", "G. C. Anupama", "D. K. Sahu", "V. Bhalerao", "T. Ahumada", "I. Andreoni", "Sudhanshu Barway", "J. Carney", "J. Freeburn", "M. M. Kasliwal", "Tanishk Mohan", "A. C. Rodriguez", "G. Waratkar"], "title": "Characterising EP241107a: Multiwavelength Observations of an Einstein Probe-detected Fast X-ray Transient", "comment": "13 pages, 9 figures, 2 tables. Submitted to MNRAS", "summary": "Fast X-ray Transients (FXTs) represent a new class of highly luminous\ntransients in soft X-rays ($\\sim$0.3-10 keV) associated with violent\nastrophysical processes. They manifest as short, singular flashes of X-ray\nphotons with durations lasting from minutes to hours. Their origin remains\nunclear, and they have been associated with various progenitor mechanisms. The\nnewly launched X-ray survey, Einstein-Probe (EP), is revolutionising this field\nby enabling the discovery and immediate follow-up of FXTs. Here we present the\nmultiwavelength observations of EP-discovered FXT EP241107a and the discovery\nof its radio counterpart. Comparison of the optical and radio observations of\nEP241107a and its host properties with other extragalactic transients suggests\na gamma-ray burst (GRB) origin. Through our afterglow modelling, we infer the\nGRB jet properties for EP241107a, yielding a jet of the isotropic-equivalent\nkinetic energy $E_{\\mathrm{K,iso}} \\sim10^{51}$ erg, with a half opening angle\n$\\theta_{c}$ $\\approx$15$^{\\circ}$, viewed at an angle of $\\theta_{\\rm\nobs}$~$\\approx$9$^{\\circ}$. We also evaluate EP241107a in the landscape of both\nEP-discovered FXTs as well as the FXTs discovered from Chandra, XMM-Newton, and\nSwift-XRT."}
{"id": "2511.02634", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.02634", "abs": "https://arxiv.org/abs/2511.02634", "authors": ["Rohan Arni", "Carlos Blanco", "Anirudh Prabhu"], "title": "Using Deep Learning for Robust Classification of Fast Radio Bursts", "comment": "15 pages, 4 figures, 9 tables. Comments are welcome", "summary": "While the nature of fast radio bursts (FRBs) remains unknown,\npopulation-level analyses can elucidate underlying structure in these signals.\nIn this study, we employ deep learning methods to both classify FRBs and\nanalyze structural patterns in the latent space learned from the first CHIME\ncatalog. We adopt a Supervised Variational Autoencoder (sVAE) architecture\nwhich combines the representational learning capabilities of Variational\nAutoencoders (VAEs) with a supervised classification task, thereby improving\nboth classification performance and the interpretability of the latent space.\nWe construct a learned latent space in which we perform further dimensionality\nreduction to find underlying structure in the data. Our results demonstrate\nthat the sVAE model achieves high classification accuracy for FRB repeaters and\nreveals separation between repeater and non-repeater populations. Upon further\nanalysis of the latent space, we observe that dispersion measure excess,\nspectral index, and spectral running are the dominant features distinguishing\nrepeaters from non-repeaters. We also identify four non-repeating FRBs as\nrepeater candidates, two of which have been independently flagged in previous\nstudies."}
{"id": "2511.01958", "categories": ["astro-ph.IM", "astro-ph.CO", "astro-ph.HE", "cs.LG"], "pdf": "https://arxiv.org/pdf/2511.01958", "abs": "https://arxiv.org/abs/2511.01958", "authors": ["Eleonora Villa", "Golam Mohiuddin Shaifullah", "Andrea Possenti", "Carmelita Carbone"], "title": "Improving Bayesian inference in PTA data analysis: importance nested sampling with Normalizing Flows", "comment": "37 pages, 7 figures, 3 tables. Submitted to the Astronomy and\n  Computing special issue HPC in Cosmology and Astrophysics", "summary": "We present a detailed study of Bayesian inference workflows for pulsar timing\narray data with a focus on enhancing efficiency, robustness and speed through\nthe use of normalizing flow-based nested sampling. Building on the Enterprise\nframework, we integrate the i-nessai sampler and benchmark its performance on\nrealistic, simulated datasets. We analyze its computational scaling and\nstability, and show that it achieves accurate posteriors and reliable evidence\nestimates with substantially reduced runtime, by up to three orders of\nmagnitude depending on the dataset configuration, with respect to conventional\nsingle-core parallel-tempering MCMC analyses. These results highlight the\npotential of flow-based nested sampling to accelerate PTA analyses while\npreserving the quality of the inference."}
{"id": "2511.01959", "categories": ["astro-ph.IM", "astro-ph.CO", "astro-ph.HE", "cs.LG"], "pdf": "https://arxiv.org/pdf/2511.01959", "abs": "https://arxiv.org/abs/2511.01959", "authors": ["Eleonora Villa", "Luigi D'Amico", "Aldo Barca", "Fatima Modica Bittordo", "Francesco Alì", "Massimo Meneghetti", "Luca Naso"], "title": "Addressing prior dependence in hierarchical Bayesian modeling for PTA data analysis II: Noise and SGWB inference through parameter decorrelation", "comment": "18 pages, 7 figures. Submitted to the Astronomy and Computing special\n  issue HPC in Cosmology and Astrophysics", "summary": "Pulsar Timing Arrays provide a powerful framework to measure low-frequency\ngravitational waves, but accuracy and robustness of the results are challenged\nby complex noise processes that must be accurately modeled. Standard PTA\nanalyses assign fixed uniform noise priors to each pulsar, an approach that can\nintroduce systematic biases when combining the array. To overcome this\nlimitation, we adopt a hierarchical Bayesian modeling strategy in which noise\npriors are parametrized by higher-level hyperparameters. We further address the\nchallenge posed by the correlations between hyperparameters and physical noise\nparameters, focusing on those describing red noise and dispersion measure\nvariations. To decorrelate these quantities, we introduce an orthogonal\nreparametrization of the hierarchical model implemented with Normalizing Flows.\nWe also employ i-nessai, a flow-guided nested sampler, to efficiently explore\nthe resulting higher-dimensional parameter space. We apply our method to a\nminimal 3-pulsar case study, performing a simultaneous inference of noise and\nSGWB parameters. Despite the limited dataset, the results consistently show\nthat the hierarchical treatment constrains the noise parameters more tightly\nand partially alleviates the red-noise-SGWB degeneracy, while the orthogonal\nreparametrization further enhances parameter independence without affecting the\ncorrelations intrinsic to the power-law modeling of the physical processes\ninvolved."}
{"id": "2511.02328", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.02328", "abs": "https://arxiv.org/abs/2511.02328", "authors": ["Guanhong Lin", "Dejia Zhou", "Jianli Zhang", "Jialang Ding", "Fei Liu", "Xiaoyun Ma", "Yuan Liang", "Ruan Duan", "Liaoyuan Liu", "Xuanyu Wang", "Xiaohui Yan", "Yingrou Zhan", "Yuting Chu", "Jing Qiao", "Wei Wang", "Jie Zhang", "Zerui Wang", "Meng Liu", "Chenchen Miao", "Menquan Liu", "Meng Guo", "Di Li", "Pei Wang"], "title": "ASTROFLOW: A Real-Time End-to-End Pipeline for Radio Single-Pulse Searches", "comment": "17 pages, 14 figures", "summary": "Fast radio bursts (FRBs) are extremely bright, millisecond duration cosmic\ntransients of unknown origin. The growing number of wide-field and\nhigh-time-resolution radio surveys, particularly with next-generation\nfacilities such as the SKA and MeerKAT, will dramatically increase FRB\ndiscovery rates, but also produce data volumes that overwhelm conventional\nsearch pipelines. Real-time detection thus demands software that is both\nalgorithmically robust and computationally efficient. We present Astroflow, an\nend-to-end, GPU-accelerated pipeline for single-pulse detection in radio\ntime-frequency data. Built on a unified C++/CUDA core with a Python interface,\nAstroflow integrates RFI excision, incoherent dedispersion, dynamic-spectrum\ntiling, and a YOLO-based deep detector. Through vectorized memory access,\nshared-memory tiling, and OpenMP parallelism, it achieves 10x\nfaster-than-real-time processing on consumer GPUs for a typical 150 s,\n2048-channel observation, while preserving high sensitivity across a wide range\nof pulse widths and dispersion measures. These results establish the\nfeasibility of a fully integrated, GPU-accelerated single-pulse search stack,\ncapable of scaling to the data volumes expected from upcoming large-scale\nsurveys. Astroflow offers a reusable and deployable solution for real-time\ntransient discovery, and provides a framework that can be continuously refined\nwith new data and models."}
