{"id": "2509.08051", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.08051", "abs": "https://arxiv.org/abs/2509.08051", "authors": ["Joseph R. Farah", "Logan J. Prust", "D. Andrew Howell", "Yuan Qi Ni", "Curtis McCully", "Moira Andrews", "Harsh Kumar", "Daichi Hiramatsu", "Sebastian Gomez Kathryn Wynn", "Alexei V. Filippenko", "K. Azalee Bostroem", "Edo Berger", "Peter Blanchard"], "title": "Lense-Thirring precessing magnetar engine drives a superluminous supernova", "comment": "Submitted to Nature; received first report, will update with\n  revisions. 43 pages, 10 figures", "summary": "Type I superluminous supernovae (SLSNe-I) are at least an order of magnitude\nbrighter than standard supernovae, with the internal power source for their\nluminosity still unknown. The central engines of SLSNe-I are hypothesized to be\nmagnetars, but the majority of SLSNe-I light curves have multiple bumps or\npeaks that are unexplained by the standard magnetar model. Existing\nexplanations for the bumps either modulate the central engine luminosity or\ninvoke interactions with material in the circumstellar environment. Systematic\nsurveys of the limited sample of SLSNe-I light curves find no compelling\nevidence favoring either scenario, leaving both the nature of the light-curve\nfluctuations and the applicability of the magnetar model unresolved. Here, we\nreport high-cadence multiband observations of an SLSN-I with clear \"chirped\"\n(i.e., decreasing period) light-curve bumps that can be directly linked to the\nproperties of the magnetar central engine. Our observations are consistent with\na tilted, infalling accretion disk undergoing Lense-Thirring precession around\na magnetar centrally located within the expanding supernova ejecta. Our model\ndemonstrates that the overall light curve and bump frequency independently and\nself-consistently constrain the spin period and the magnetic field strength of\nthe magnetar. Assuming standard accretion disk parameters, we constrain the\naccretion rate onto the magnetar. Our results provide the first observational\nevidence of the Lense-Thirring effect in the environment of a magnetar, and\nconfirm the magnetar spin-down model as an explanation for the extreme\nluminosity observed in SLSNe-I. We anticipate this discovery will create\navenues for testing general relativity in a new regime -- the violent centers\nof young supernovae."}
{"id": "2509.08061", "categories": ["astro-ph.HE", "physics.plasm-ph"], "pdf": "https://arxiv.org/pdf/2509.08061", "abs": "https://arxiv.org/abs/2509.08061", "authors": ["Damiano Caprioli", "Luca Orusa", "Miha Cernetic", "Colby C. Haggerty", "Bricker Ostler"], "title": "Acceleration of Heavy Ions at Non-Relativistic Collisionless Shocks", "comment": "6 pages, 3 figures. Submitted to ApJL", "summary": "We investigate the process of Diffusive Shock Acceleration (DSA) of particles\nwith mass number to charge number ratios $A/Q > 1$, e.g., partially-ionized\nheavy ions. To this end, we introduce helium- and carbon-like ions at solar\nabundances into two-dimensional hybrid (kinetic ions--fluid electrons)\nsimulations of non-relativistic collisionless shocks. This study yields three\nmain results: 1) Heavy ions are preferentially accelerated compared to\nhydrogen. For typical solar abundances, the energy transferred to accelerated\nhelium ions is comparable to, or even exceeds, that of hydrogen, thereby\nenhancing the overall shock acceleration efficiency. 2) Accelerated helium ions\ncontribute to magnetic field amplification, which increases the maximum\nattainable particle energy and steepen the spectra of accelerated particles. 3)\nThe efficient acceleration of helium significantly enhances the production of\nhadronic gamma rays and neutrinos, likely dominating the one due to hydrogen.\nThese effects should be taken into account, especially when modeling strong\nspace and astrophysical shocks."}
{"id": "2509.08119", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2509.08119", "abs": "https://arxiv.org/abs/2509.08119", "authors": ["Taya Govreen-Segal", "Ehud Nakar", "Eliot Quataert"], "title": "X-ray Transmission Through Photoionized Gas with Moderate Thomson Optical Depth", "comment": "Submitted to MNRAS. 12 pages, 4 figures, 5 tables. Comments welcome!", "summary": "We model the absorption of X-rays by gas obscuring the source and\nphotoionized by it. We consider a broad range of column densities, including\nboth Thomson-thin and Thomson-thick media. For the Thomson thin regime, we\nderive a simple criterion, based on the source luminosity and spectrum and the\nmedium radius and column density, that distinguish between the following cases:\n(i) The absorption can be modeled well by a neutral medium; (ii) The radiation\nionizes its way through the medium and no absorption is expected; and (iii) A\ndetailed model is required because the column density inferred from modeling\nthe absorption with a neutral gas is much lower than the actual column density,\nor because the absorption features cannot be fitted by a neutral absorber. We\nderive the criterion analytically using a toy model of hydrogen and oxygen, and\ncalibrate it for realistic compositions with metallicities in the range\n$Z/Z_{\\odot}=0.01-50$, using CLOUDY. We generalize the model to the\nThomson-thick regime, where we consider, alongside photoabsorption, electron\nscattering, Compton heating, Comptonization, and photon degradation. In this\ncase, the emergent spectrum depends on the boundary condition experienced by\nphotons scattered back towards the source. We discuss the effect of a\nreflective boundary and a reprocessing boundary. We provide simple criteria for\nthe expected absorption state, and discuss additional effects that alter the\nspectrum. The main motivation of our modeling is X-ray emission from supernovae\ninteracting with circumstellar medium; however, we expect it to be useful to\nmany other applications."}
{"id": "2509.08172", "categories": ["astro-ph.HE", "gr-qc"], "pdf": "https://arxiv.org/pdf/2509.08172", "abs": "https://arxiv.org/abs/2509.08172", "authors": ["J. A. Rueda", "R. Ruffini", "Yu Wang"], "title": "Short GRB 090510: a magnetized neutron star binary merger leading to a black hole", "comment": "Accepted for publication in the Journal of High Energy Astrophysics\n  (JHEAP)", "summary": "We model the short gamma-ray bursts (GRB) 090510 as the product of a\nmagnetized neutron star (NS) binary merger. Accounting for the NS critical mass\nconstraint given by the mass of PSR J0952--0607, we infer that GRB 090510 was a\nhighly-magnetized NS-NS merger that left as remnant a Kerr black hole (BH) of\n$2.4 M_\\odot$ with a low-mass accretion disk. The gamma-ray precursor is\npowered by the magnetic energy released during the merger of the NSs. The\nprompt emission originates at the transparency of an ultra-relativistic\n$e^+e^-$ pair-plasma produced by the overcritical electric field induced by the\nrotating strong magnetic field around the merged object before it reaches the\ncritical mass, the GeV emission by the extractable energy of the newborn BH,\nand the X-ray afterglow by accretion onto it. We derive the masses of the\nmerging NSs, their magnetic fields, the BH mass, spin, and irreducible mass,\nthe strength of the magnetic field, the disk mass, and obtain an estimate of\nthe gravitational-wave emission during the merger phase preceding the prompt\nshort GRB emission. The inferred parameters agree with up-to-date numerical\nrelativity simulations, confirming that strong magnetic fields above $10^{14}$\nG develop in NS-NS mergers and that mergers leading to a central BH remnant\nhave low-mass disks of $\\sim 10^{-2} M_\\odot$. We also advance the possibility\nthat quasi-period oscillations of tens of Hz of frequency due to Lense-Thirring\nprecession of the matter surrounding the merged object before BH formation can\nexplain the successive spikes following the prompt emission peak."}
{"id": "2509.08044", "categories": ["astro-ph.IM", "astro-ph.EP"], "pdf": "https://arxiv.org/pdf/2509.08044", "abs": "https://arxiv.org/abs/2509.08044", "authors": ["Matthias Samland"], "title": "spherical: A Comprehensive Database and Automated Pipeline for VLT/SPHERE High-Contrast Imaging", "comment": "4 pages, 0 figures, submitted to JOSS", "summary": "I present spherical (https://github.com/m-samland/spherical), a software\npackage and database designed for the ESO VLT/SPHERE high-contrast imager.\nSPHERE has produced the world's largest archive of direct imaging observations\nof exoplanets and circumstellar disks, but its heterogeneous metadata and\nfragmented reduction tools make end-to-end analysis labor-intensive. spherical\naddresses this by combining (1) a curated, regularly updated, and searchable\ndatabase of all SPHERE observations, cross-matched with stellar properties and\nobserving conditions, and (2) a Python-based, script-driven pipeline for the\nIntegral Field Spectrograph (IFS). The database, archived on Zenodo\n(https://doi.org/10.5281/zenodo.15147730) and reproducible from the ESO\narchive, currently includes about 6000 IRDIS dual-band imaging, about 1000\nIRDIS polarimetric, and about 4500 IFS sequences, with additional modes\n(ZIMPOL, IRDIS-LSS, SAM) planned. The pipeline automates raw data retrieval,\ncalibration, and IFS reduction with the adapted open-source CHARIS instrument\npipeline, followed by astrometric and photometric calibration and\npost-processing with TRAP for companion detection and spectral extraction.\nspherical lowers the barrier from raw files to science-ready products, enabling\nhomogeneous population studies, atmospheric characterization of companions, and\nefficient survey follow-up, while remaining interoperable with community tools\nsuch as VIP, pyKLIP, and IRDAP."}
{"id": "2509.08224", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.08224", "abs": "https://arxiv.org/abs/2509.08224", "authors": ["Si-Yuan Zhu", "Lang Shao", "Pak-Hin Thomas Tam", "Fu-Wen Zhang"], "title": "Unsupervised machine learning classification of gamma-ray bursts based on the rest-frame prompt emission parameters", "comment": "11 pages, 6 figures, 2 tables, Accepted for publication in A&A", "summary": "Gamma-ray bursts (GRBs) are generally believed to originate from two distinct\nprogenitors, compact binary mergers and massive collapsars. Traditional and\nsome recent machine learning-based classification schemes predominantly rely on\nobserver-frame physical parameters, which are significantly affected by the\nredshift effects and may not accurately represent the intrinsic properties of\nGRBs. In particular, the progenitors usually could only be decided by\nsuccessful detection of the multi-band long-term afterglow, which could easily\ncost days of devoted effort from multiple global observational utilities. In\nthis work, we apply the unsupervised machine learning (ML) algorithms called\nt-SNE and UMAP to perform GRB classification based on rest-frame prompt\nemission parameters. The map results of both t-SNE and UMAP reveal a clear\ndivision of these GRBs into two clusters, denoted as GRBs-I and GRBs-II. We\nfind that all supernova-associated GRBs, including the atypical short-duration\nburst GRB 200826A (now recognized as collapsar-origin), consistently fall\nwithin the GRBs-II category. Conversely, all kilonova-associated GRBs (except\nfor two controversial events) are classified as GRBs-I, including the peculiar\nlong-duration burst GRB 060614 originating from a merger event. In another\nwords, this clear ML separation of two types of GRBs based only on prompt\nproperties could correctly predict the results of progenitors without follow-up\nafterglow properties. Comparative analysis with conventional classification\nmethods using $T_{90}$ and $E_{\\rm p,z}$--$E_{\\rm iso}$ correlation\ndemonstrates that our machine learning approach provides superior\ndiscriminative power, particularly in resolving ambiguous cases of hybrid GRBs."}
{"id": "2509.08313", "categories": ["astro-ph.IM", "astro-ph.EP"], "pdf": "https://arxiv.org/pdf/2509.08313", "abs": "https://arxiv.org/abs/2509.08313", "authors": ["Jayke S. Nguyen", "Quinn M. Konopacky", "William Thompson", "Natasha Popenoe", "Bruce Macintosh"], "title": "Ground-Based Mid-IR Direct Imaging: The Origin of the Thermal Background on the Keck II Telescope and Correcting Instrumental Systematics", "comment": "14 pages, 14 figures, accepted to PASP", "summary": "Mid-IR wavelengths are of particular interest to exoplanet science due to the\nfact they can extend the searchable parameter space to planets that are older\nand/or colder. However, a significant source of uncertainty at mid-IR\nwavelengths on ground-based telescopes is the thermal background. This\nbackground comes from blackbody radiation in the atmosphere and telescope and\nis therefore dependent on instrument design and atmospheric conditions. When\nperforming imaging observations, this background manifests as a slowly varying,\ninhomogeneous signal throughout the image, underlying our data. Photometry at\nmid-IR can greatly constrain atmospheric models but existing data are usually\nscarce or have significant error bars due to the difficulty of subtracting the\nbackground. Using M-band direct imaging observing sequences on NIRC2, we\nevaluate the thermal background of the Keck II telescope and attempt to\nsubtract the background in a more comprehensive way. For our primary science\ntarget, the forming protoplanet AB Aur b, we present a contrast upper limit of\n$2 \\times 10^{-4}$ in M-band and address the limiting factors in our\nobservation due to the thermal background. We determine that the origin of the\nsystematic components of the thermal background comes from the K-mirror and\nfind that the thermal background is also strongly influenced by emission from\nthe secondary spiders on Keck II."}
{"id": "2509.08298", "categories": ["astro-ph.HE", "astro-ph.GA", "astro-ph.SR", "gr-qc"], "pdf": "https://arxiv.org/pdf/2509.08298", "abs": "https://arxiv.org/abs/2509.08298", "authors": ["Guo-Peng Li", "Xi-Long Fan"], "title": "The Hierarchical Merger Scenario for GW231123", "comment": "Comments are welcome", "summary": "GW231123 exhibits exceedingly massive components and high spins, which\nchallenges the formation of first-generation (1G) black holes from stellar\ncollapse and implies that this event might originate from hierarchical mergers.\nHere we show that the \\texttt{2G+2G} merger scenario for GW231123 is favored\nover a \\texttt{2G+1G} (or \\texttt{3G+2G}) merger, with odds ratios of\n$>$$\\mathcal{O}(10^3)$. The primary (secondary) black hole is consistent with\nmerging binary black holes with masses of $75^{+7}_{-7}\\,M_\\odot$ and\n$66^{+4}_{-10}\\,M_\\odot$ ($64^{+8}_{-10}\\,M_\\odot$ and $59^{+7}_{-9}\\,M_\\odot$;\n90\\% credible intervals), respectively. Our results reveal that the treatment\nof spin priors from the population level and waveform model choice are decisive\nin interpreting potential hierarchical gravitational-wave signals."}
{"id": "2509.08361", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.08361", "abs": "https://arxiv.org/abs/2509.08361", "authors": ["Steven J. Tingay"], "title": "The Murchison Widefield Array Enters Adolescence: A Personal Review of the Early Years of Operations", "comment": "Accepted to the journal \"galaxies\"", "summary": "The Murchison Widefield Array (MWA) is a low frequency radio interferometer\ndesigned and developed by an international consortium, operated on behalf of\nthe consortium by Curtin University. The MWA is a Precursor for the low\nfrequency Square Kilometre Array (SKA) and is located at the SKA site in\nWestern Australia, Inyarrimanha Ilgari Bundara, the CSIRO Murchison\nRadio-astronomy Observatory. Commencing science operations in 2013 after an\nextended development period, the MWA has performed observations over a wide set\nof science objectives, has been upgraded multiple times, and has played a\nfundamental role in the development of the low frequency SKA. As MWA Program\nManager from 2008 to 2011, as Director from 2011 until 2015, and then again\nfrom 2021 to the present, I describe some personal reflections on the MWA's\nactivities and successes in these different dimensions, as well as my view of\nsome of the approaches that have enabled these successes. I offer some of the\nlessons I've perceived over the last 17+ years in the project."}
{"id": "2509.08447", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.08447", "abs": "https://arxiv.org/abs/2509.08447", "authors": ["P. Blasi"], "title": "Gamma radiation from cosmic rays escaping a young supernova remnant: The case of Cas A", "comment": "Manuscript accepted for publication in Astronomy & Astrophysics", "summary": "The escape of accelerated particles from supernova remnants remains one of\nthe central and yet least understood aspects of the origin of cosmic rays. Here\nwe use the results of the recent LHAASO observation of gamma rays from a region\nof $\\sim 2$ degrees around the Cassiopeia A (Cas A) supernova remnant to\nconstrain the process of particle escape from this remnant. We dedicate special\nattention to discuss the impact of shock evolution and particle propagation in\nthe near source region on the gamma ray emission. This is very important to\nassess the possibility that very high-energy protons may have been accelerated\nin past activity of Cas A. Given the core collapse nature of Cas A and its\nyoung age ($\\sim 340$ years), the non detection of $\\gtrsim 100$ TeV gamma rays\nfrom this remnant allows us to draw some conclusions on the role of supernova\nexplosions for the origin of cosmic rays at the knee. In particular we\ncalculate the spectrum of cosmic rays that may have escaped this remnant to\nmake a clear distinction between the instantaneous maximum energy and the one\nthat appears as a flux suppression in the time integrated spectrum from an\nindividual supernova. LHAASO observation of the region around Cas A as well as\ngamma ray observations of the remnant itself confirm that this remnant is not\noperating as a PeVatron and that, although in the early stages the maximum\nenergy may have reached $\\sim$Peta-electronVolt, the number of such particles\nin the surroundings of Cas A is exceedingly small."}
{"id": "2509.08631", "categories": ["astro-ph.IM", "hep-ex"], "pdf": "https://arxiv.org/pdf/2509.08631", "abs": "https://arxiv.org/abs/2509.08631", "authors": ["Joaquin de Jesus"], "title": "The Underground Muon Detector of AugerPrime: Status and Performance", "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC\n  2025). 13 pages, 6 figures", "summary": "As part of the upgrade of the Pierre Auger Observatory, known as AugerPrime,\nthe Underground Muon Detector is being installed in the low-energy extension of\nthe Surface Detector, allowing for a direct measurement of the muonic component\nof air showers produced by ultra-high-energy cosmic rays with energies between\n10^{16.8} and 10^{19} eV. The detector consists of an array of 30 m2 plastic\nscintillator detectors buried 2.3 m underground near a water-Cherenkov\ndetector. Two modes of operation are implemented to achieve an extended dynamic\nrange: the binary mode, conceived for low muon densities, and the calorimetric\nmode, designed for high muon densities. In this contribution, we present the\ncurrent status and improvements in the reconstruction and performance of this\ncomponent of AugerPrime."}
{"id": "2509.08506", "categories": ["astro-ph.HE", "astro-ph.CO", "hep-ph"], "pdf": "https://arxiv.org/pdf/2509.08506", "abs": "https://arxiv.org/abs/2509.08506", "authors": ["E. I. Zakharov", "V. V. Barinov", "D. S. Gorbunov", "R. A. Krivonos", "A. A. Mukhin"], "title": "Search for a photon peak from keV-scale dark matter annihilation with NuSTAR: Constraints on $\\langle σv \\rangle$ after 11 years of observations", "comment": "7 pages, 8 figures", "summary": "We report new constraints on the velocity-independent annihilation cross\nsection $\\langle \\sigma v \\rangle$ of keV-scale dark matter particles based on\n11 years of observations with the NuSTAR X-ray telescope. Using the unfocused\nstray light mode of the instrument, which provides a wide field-of-view and a\nstable instrumental background, we perform a sensitive search for photon\nsignatures from dark matter annihilation in the Galactic halo. We model the\nresulting diffuse X-ray spectrum over the 3-20 keV energy range and search for\nline-like spectral features that may arise from the annihilation of dark matter\nparticles into photons. No statistically significant excess over the expected\nastrophysical background is found. We therefore place upper limits on $\\langle\n\\sigma v \\rangle$ as a function of dark matter mass, assuming a\nvelocity-independent s-wave annihilation and several Galactic dark matter\nprofiles. Across most of the explored mass range our results provide the\nstrongest X-ray constraints to date, reaching the level of $\\langle\\sigma\nv\\rangle \\lesssim 10^{-33}$ -- $10^{-34}$ cm$^3$ s$^{-1}$, and they are\ncomplementary to the most recent bounds derived from SRG/ART-XC observations."}
{"id": "2509.08766", "categories": ["astro-ph.IM", "gr-qc"], "pdf": "https://arxiv.org/pdf/2509.08766", "abs": "https://arxiv.org/abs/2509.08766", "authors": ["Tyler Rosauer", "Huy Tuong Cao", "Mohak Bhattacharya", "Peter Carney", "Luke Johnson", "Shane Levin", "Cynthia Liang", "Xuesi Ma", "Luis Martin Gutierrez", "Michael Padilla", "Liu Tao", "Aiden Wilkin", "Aidan Brooks", "Jonathan W. Richardson"], "title": "Demonstration of a next-generation wavefront actuator for gravitational-wave detection", "comment": "9 pages, 11 figures", "summary": "In the last decade, the Laser Interferometer Gravitational-Wave Observatory\n(LIGO) and the European Virgo observatory have opened a new observational\nwindow on the universe. These cavity-enhanced laser interferometers sense\nspacetime strain, generated by distant astrophysical events such as black hole\nmergers, to an RMS fluctuation of a few parts in $10^{21}$ over a\nmulti-kilometer baseline. Optical advancements in laser wavefront control are\nkey to advancing the sensitivity of current detectors and enabling a planned\nnext-generation 40-km gravitational wave observatory in the United States,\nknown as Cosmic Explorer. We report the first experimental demonstration of a\nnew wavefront control technique for gravitational-wave detection, obtained from\ntesting a full-scale prototype on a 40-kg LIGO mirror. Our results indicate\nthat this design can meet the unique and challenging requirements of providing\nhigher-order precision wavefront corrections at megawatt laser power levels,\nwhile introducing extremely low effective displacement noise into the\ninterferometer. This new technology will have a direct and enabling impact on\nthe observational science, expanding the gravitational-wave detection horizon\nto very early times in the universe, before the first stars formed, and\nenabling new tests of gravity, cosmology, and dense nuclear matter."}
{"id": "2509.08649", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2509.08649", "abs": "https://arxiv.org/abs/2509.08649", "authors": ["XRISM collaboration"], "title": "Delving into the depths of NGC 3783 with XRISM II. Cross-calibration of X-ray instruments used in the large, multi-mission observational campaign", "comment": "12 pages, 12 figures, Astronomy & Astrophysics, accepted for\n  publication", "summary": "Accurate X-ray spectroscopic measurements are fundamental for deriving basic\nphysical parameters of the most abundant baryon components in the Universe. The\nplethora of X-ray observatories currently operational enables a panchromatic\nview of the high-energy emission of celestial sources. However, uncertainties\nin the energy-dependent calibration of the instrument transfer functions (e.g.\nthe effective area, energy redistribution, or gain) can limit - and\nhistorically, did limit - the accuracy of X-ray spectroscopic measurements.\n  We revised the status of the cross-calibration among the scientific payload\non board four operation missions: Chandra, NuSTAR, XMM-Newton, and the recently\nlaunched XRISM. XRISM carries the micro-calorimeter Resolve, which yields the\nbest energy resolution at energies above 2 keV. For this purpose, we used the\ndata from a 10-day-long observational campaign targeting the nearby active\ngalactic nucleus NGC 3783, carried out in July 2024.\n  We present a novel model-independent method for assessing the\ncross-calibration status that is based on a multi-node spline of the spectra\nwith the highest-resolving power (XRISM/Resolve in our campaign). We also\nestimated the impact of the intrinsic variability of NGC 3783 on the\ncross-calibration status due to the different time coverages of participating\nobservatories and performed an empirical reassessment of the Resolve throughput\nat low energies.\n  Based on this analysis, we derived a set of energy-dependent correction\nfactors of the observed responses, enabling a statistically robust analysis of\nthe whole spectral dataset. They will be employed in subsequent papers\ndescribing the astrophysical results of the campaign."}
{"id": "2509.08674", "categories": ["astro-ph.HE", "gr-qc"], "pdf": "https://arxiv.org/pdf/2509.08674", "abs": "https://arxiv.org/abs/2509.08674", "authors": ["Ahmad Al-Badawi", "Faizuddin Ahmed", "Orhan Donmez", "Fatih Dogan", "Behnam Pourhassan", "İzzet Sakallı", "Yassine Sekhmani"], "title": "Analytical and Numerical Analysis of QPO Frequencies in Quantum-Corrected Black Hole Spacetimes", "comment": "36 pagaes, 20 figures, 2 tables. Comments are welcome", "summary": "This investigation examines QPOs in two quantum-corrected BH spacetimes that\npreserve general covariance while incorporating quantum gravitational effects\nthrough a dimensionless parameter \\zeta. We combine analytical derivations of\nepicyclic frequencies with comprehensive numerical simulations of BHL accretion\nto explore how quantum corrections manifest in observable astrophysical\nphenomena. Using a fiducial BH mass of M=10M_\\odot representative of\nstellar-mass X-ray binaries, we demonstrate that the two models exhibit\nfundamentally different behaviors: Model-I modifies both temporal and radial\nmetric components, leading to innermost stable circular orbit migration\nproportional to \\zeta^4 and dramatic stagnation point evolution from 27M to 5M\nas quantum corrections strengthen. Model-II preserves the classical temporal\ncomponent while altering only spatial geometry, maintaining constant stagnation\npoints and stable cavity structures throughout the parameter range. Our\nnumerical simulations reveal distinct QPO generation mechanisms, with Model-I\nshowing systematic frequency evolution and cavity shrinkage that suppresses\noscillations for \\zeta \\geq 3M, while Model-II maintains stable low-frequency\nmodes up to \\zeta \\geq 5M. Power spectral density analyzes demonstrate\ncharacteristic frequency ratios (3:2, 2:1, 5:3) consistent with observations\nfrom X-ray binaries, providing specific targets for discriminating between\nquantum correction scenarios. The hydrodynamically derived constraints (\\zeta\n\\lesssim 4M) show remarkable agreement with independent EHT limits for M87* and\nSgr A*, validating our theoretical framework through multiple observational\nchannels. These results establish QPO frequency analysis as a probe for\ndetecting quantum gravitational effects in astrophysical BHs and demonstrate\nthe complementary nature of timing and imaging observations in constraining\nfundamental physics."}
{"id": "2509.08686", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.08686", "abs": "https://arxiv.org/abs/2509.08686", "authors": ["MAGIC Collaboration", "K. Abe", "S. Abe", "J. Abhir", "A. Abhishek", "A. Aguasca-Cabot", "I. Agudo", "T. Aniello", "S. Ansoldi", "L. A. Antonelli", "A. Arbet Engels", "C. Arcaro", "T. T. H. Arnesen", "A. Babić", "C. Bakshi", "U. Barres de Almeida", "J. A. Barrio", "L. Barrios-Jiménez", "I. Batković", "J. Baxter", "J. Becerra González", "W. Bednarek", "E. Bernardini", "J. Bernete", "A. Berti", "C. Bigongiari", "A. Biland", "O. Blanch", "G. Bonnoli", "Ž Bošnjak", "E. Bronzini", "I. Burelli", "A. Campoy-Ordaz", "A. Carosi", "R. Carosi", "M. Carretero-Castrillo", "A. J. Castro-Tirado", "D. Cerasole", "G. Ceribella", "Y. Chai", "A. Cifuentes", "J. L. Contreras", "J. Cortina", "S. Covino", "F. D'Ammando", "P. Da Vela", "F. Dazzi", "A. De Angelis", "B. De Lotto", "R. de Menezes", "J. Delgado", "C. Delgado Mendez", "F. Di Pierro", "R. Di Tria", "L. Di Venere", "A. Dinesh", "D. Dominis Prester", "A. Donini", "D. Dorner", "M. Doro", "L. Eisenberger", "D. Elsaesser", "J. Escudero", "L. Fariña", "L. Foffano", "L. Font", "S. Fröse", "Y. Fukazawa", "R. J. García López", "S. García Soto", "M. Garczarczyk", "S. Gasparyan", "J. G. Giesbrecht Paiva", "N. Giglietto", "F. Giordano", "P. Gliwny", "T. Gradetzke", "R. Grau", "D. Green", "J. G. Green", "P. Günther", "A. Hahn", "T. Hassan", "L. Heckmann", "J. Herrera Llorente", "D. Hrupec", "D. Israyelyan", "J. Jahanvi", "I. Jiménez Martínez", "J. Jiménez Quiles", "J. Jormanainen", "S. Kankkunen", "T. Kayanoki", "J. Konrad", "P. M. Kouch", "G. Koziol", "H. Kubo", "J. Kushida", "M. Laínez", "A. Lamastra", "E. Lindfors", "S. Lombardi", "F. Longo", "M. López-Moya", "A. López-Oramas", "S. Loporchio", "L. Lulić", "E. Lyard", "P. Majumdar", "M. Makariev", "M. Mallamaci", "G. Maneva", "M. Manganaro", "S. Mangano", "K. Mannheim", "S. Marchesi", "M. Mariotti", "M. Martínez", "P. Maruševec", "S. Menchiari", "J. Méndez Gallego", "S. Menon", "D. Miceli", "J. M. Miranda", "R. Mirzoyan", "M. Molero González", "E. Molina", "H. A. Mondal", "A. Moralejo", "C. Nanci", "A. Negro", "V. Neustroev", "L. Nickel", "M. Nievas Rosillo", "C. Nigro", "L. Nikolić", "S. Nozaki", "A. Okumura", "J. Otero-Santos", "S. Paiano", "D. Paneque", "R. Paoletti", "J. M. Paredes", "M. Peresano", "M. Persic", "M. Pihet", "G. Pirola", "F. Podobnik", "P. G. Prada Moroni", "E. Prandini", "W. Rhode", "M. Ribó", "J. Rico", "A. Roy", "N. Sahakyan", "F. G. Saturni", "K. Schmitz", "F. Schmuckermaier", "T. Schweizer", "A. Sciaccaluga", "G. Silvestri", "A. Simongini", "J. Sitarek", "V. Sliusar", "D. Sobczynska", "A. Stamerra", "J. Strišković", "D. Strom", "M. Strzys", "Y. Suda", "H. Tajima", "R. Takeishi", "F. Tavecchio", "T. Terzić", "M. Teshima", "A. Tutone", "S. Ubach", "J. van Scherpenberg", "M. Vazquez Acosta", "S. Ventura", "G. Verna", "I. Viale", "A. Vigliano", "C. F. Vigorito", "E. Visentin", "V. Vitale", "I. Vovk", "R. Walter", "F. Wersig", "M. Will", "T. Yamamoto", "P. K. H. Yeung", "M. Petropoulou", "M. Polkas"], "title": "Time-Dependent Modeling of the Sub-Hour Spectral Evolution During the 2013 Outburst of Mrk 421", "comment": "Submitted for publication. Corresponding authors: A. Arbet-Engels, M.\n  Polkas, M. Petropoulou, D. Paneque. All the broadband SEDs in 15-min bins are\n  available at https://zenodo.org/records/17054582. The MAGIC data are also\n  released in a Data Level 3 (DL3) format and can be downloaded from\n  https://zenodo.org/records/17064461", "summary": "In April 2013, the TeV blazar Markarian~421 underwent one of its most\npowerful emission outbursts to date. An extensive multi-instrument campaign\nfeaturing MAGIC, VERITAS, and \\textit{NuSTAR} provided comprehensive\nvery-high-energy (VHE; $E > 100$\\,GeV) and X-ray coverage over nine consecutive\ndays. In this work, we perform a detailed spectral analysis of the X-ray and\nVHE emissions on sub-hour timescales throughout the flare. We identify several\nclockwise spectral hysteresis loops in the X-rays, revealing a spectral\nevolution more complex than a simple harder-when-brighter trend. The VHE\nspectrum extends beyond 10\\,TeV, and its temporal evolution closely mirrors the\nbehavior in the X-rays. We report the first evidence of VHE spectral hysteresis\noccurring simultaneously with the X-ray loops. To interpret these findings, we\napply a time-dependent leptonic model to 240 broadband spectral energy\ndistributions (SEDs) binned on a 15-minute scale, allowing us to\nself-consistently track the particle distribution's history. Our modeling shows\nthat the majority of the sub-hour flux and spectral variations are driven by\nchanges in the luminosity and slope of the injected electron distribution. The\nrequired variations in the electron slope are difficult to reconcile with\nmagnetic reconnection but are consistent with a shock-acceleration scenario\nwhere the shock compression ratio evolves by a factor of $\\sim2$. The model\nalso points to a relatively stable magnetic field and emitting region size,\nfavoring a scenario where the emission originates from a stationary feature in\nthe jet, such as a recollimation shock. However, this scenario requires a jet\nLorentz factor that significantly exceeds values from VLBI measurements to\naccount for the high minimum electron energy implied by the lack of variability\nin the optical band."}
