{"id": "2510.19899", "categories": ["astro-ph.IM", "astro-ph.CO"], "pdf": "https://arxiv.org/pdf/2510.19899", "abs": "https://arxiv.org/abs/2510.19899", "authors": ["Parth Nayak", "Michael Walther", "Daniel Gruen"], "title": "LyαNNA II: Field-level inference with noisy Lyα forest spectra", "comment": "11 pages, submitted to A&A", "summary": "Deep learning (DL) has been shown to outperform traditional, human-defined\nsummary statistics of the Ly{\\alpha} forest in constraining key astrophysical\nand cosmological parameters owing to its ability to tap into the realm of\nnon-Gaussian information. An understanding of the impact of nuisance effects\nsuch as noise on such field-level frameworks, however, still remains elusive.\nIn this work we conduct a systematic investigation into the efficacy of DL\ninference from noisy Ly{\\alpha} forest spectra. Building upon our previous,\nproof-of-concept framework (Nayak et al. 2024) for pure spectra, we constructed\nand trained a ResNet neural network using labeled mock data from hydrodynamical\nsimulations with a range of noise levels to optimally compress noisy spectra\ninto a novel summary statistic that is exclusively sensitive to the power-law\ntemperature-density relation of the intergalactic medium. We fit a Gaussian\nmixture surrogate with 23 components through our labels and summaries to\nestimate the joint data-parameter distribution for likelihood free inference,\nin addition to performing inference with a Gaussian likelihood. The posterior\ncontours in the two cases agree well with each other. We compared the precision\nand accuracy of our posterior constraints with a combination of two human\ndefined summaries (the 1D power spectrum and PDF of the Ly{\\alpha}\ntransmission) that have been corrected for noise, over a wide range of\ncontinuum-to-noise ratios (CNR) in the likelihood case. We found a gain in\nprecision in terms of posterior contour area with our pipeline over the said\ncombination of 65% (at a CNR of 20 per 6 km/s) to 112% (at 200 per 6 km/s).\nWhile the improvement in posterior precision is not as large as in the\nnoiseless case, these results indicate that DL still remains a powerful tool\nfor inference even with noisy, real-world datasets."}
{"id": "2510.19911", "categories": ["astro-ph.IM", "physics.optics"], "pdf": "https://arxiv.org/pdf/2510.19911", "abs": "https://arxiv.org/abs/2510.19911", "authors": ["Yoo Jung Kim", "Michael P. Fitzgerald", "Sébastien Vievard", "Jonathan Lin", "Yinzi Xin", "Miles Lucas", "Olivier Guyon", "Julien Lozi", "Vincent Deo", "Elsa Huby", "Sylvestre Lacour", "Manon Lallement", "Rodrigo Amezcua-Correa", "Sergio Leon-Saval", "Barnaby Norris", "Mathias Nowak", "Steph Sallum", "Jehanne Sarrazin", "Adam Taras", "Stephanos Yerolatsitis", "Nemanja Jovanovic"], "title": "On-sky Demonstration of Subdiffraction-limited Astronomical Measurement Using a Photonic Lantern", "comment": "Published in the Astrophysical Journal Letters", "summary": "Resolving fine details of astronomical objects provides critical insights\ninto their underlying physical processes. This drives in part the desire to\nconstruct ever-larger telescopes and interferometer arrays and to observe at\nshorter wavelength to lower the diffraction limit of angular resolution.\nAlternatively, one can aim to overcome the diffraction limit by extracting more\ninformation from a single telescope's aperture. A promising way to do this is\nspatial mode-based imaging, which projects focal-plane field onto a set of\nspatial modes before detection, retaining focal-plane phase information crucial\nat small angular scales but typically lost in intensity imaging. However, the\npractical implementation of mode-based imaging in astronomy from the ground has\nbeen challenged by atmospheric turbulence. Here, we present the first on-sky\ndemonstration of a subdiffraction-limited, mode-based measurement using a\nphotonic lantern (PL)-fed spectrometer installed on the SCExAO instrument at\nthe Subaru Telescope. We introduce a novel calibration strategy that mitigates\ntime-varying wavefront error and misalignment effects, leveraging\nsimultaneously recorded focal-plane images and using a spectral-differential\ntechnique that self-calibrates the data. Observing the classical Be star\n$\\beta$ CMi, we detected spectral-differential spatial signals and\nreconstructed images of its H$\\alpha$-emitting disk. We achieved an\nunprecedented H$\\alpha$ photocenter precision of 50$\\mu$as in about 10-minute\nobservation with a single telescope, measuring the disk's near-far side\nasymmetry for the first time. This work demonstrates the high precision,\nefficiency, and practicality of photonic mode-based imaging techniques to\nrecover subdiffraction-limited information, opening new avenues for high\nangular resolution spectroscopic studies in astronomy."}
{"id": "2510.20010", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.20010", "abs": "https://arxiv.org/abs/2510.20010", "authors": ["Asad Hussain", "Maximiliano Isi", "Aaron Zimmerman"], "title": "Living on the edge: Testing for compact population features at the edges of parameter space", "comment": "25 pages, 11 figures", "summary": "Many astrophysical population studies involve parameters that exist on a\nbounded domain, such as the dimensionless spins of black holes or the\neccentricities of planetary orbits, both of which are confined to $[0, 1]$. In\nsuch scenarios, we often wish to test for distributions clustered near a\nboundary, e.g., vanishing spin or orbital eccentricity. Conventional approaches\n-- whether based on Monte Carlo, kernel density estimators, or machine-learning\ntechniques -- often suffer biases at the boundaries. These biases stem from\nsparse sampling near the edge, kernel-related smoothing, or artifacts\nintroduced by domain transformations. We introduce a truncated Gaussian mixture\nmodel framework that substantially mitigates these issues, enabling accurate\ninference of narrow, edge-dominated population features. While our method has\nbroad applications to many astronomical domains, we consider gravitational wave\ncatalogs as a concrete example to demonstrate its power. In particular, we\nmaintain agreement with published constraints on the fraction of zero-spin\nbinary black hole systems in the GWTC-3 catalog -- results originally derived\nat much higher computational cost through dedicated reanalysis of individual\nevents in the catalog. Our method can achieve similarly reliable results with a\nmuch lower computational cost. The method is publicly available in the\nopen-source packages gravpop and truncatedgaussianmixtures."}
{"id": "2510.20195", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2510.20195", "abs": "https://arxiv.org/abs/2510.20195", "authors": ["John Nijim", "Zoran Ninkov", "Dmitry Vorobiev", "Kevin Kearney"], "title": "Performance analysis of a Hadamard Transform Spectral Imaging system", "comment": "19 pages, 15 figures", "summary": "Hadamard Transform Spectral Imaging (HTSI) is a multiplexing technique used\nto recover spectra via encoding with multi-slit masks, and is particularly\nuseful in low photon flux applications where signal-independent noise is the\ndominant noise source. This work focuses on the procedure that is used to\nrecover spectra encoded with multi-slit masks generated from a Hadamard matrix;\nthe decoding process involves multiplying the output encoded spectral images by\nthe inverse of the Hadamard matrix, which separates any spectra that were\noverlapping in the target object. The output from HTSI is compared to direct\nmeasurement methods, such as single-slit scanning, to evaluate its performance\nand identify under which conditions it can provide an advantage or\ndisadvantage. HTSI resulted in an increase in the average signal-to-noise (SNR)\nratio of spectra when signal-independent noise, such as detector read noise, is\npresent, and has no average net effect when signal dependent-noise, such as\nPoisson photon noise, is the only noise source present. The SNR of emission\nlines was found to be greater with HTSI than with single-slit scanning under\nboth signal-independent and signal-dependent noise, and increases as the ratio\nof read-to-shot noise increases."}
{"id": "2510.19925", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2510.19925", "abs": "https://arxiv.org/abs/2510.19925", "authors": ["Philip Kirkeberg", "Rixin Li", "Martin E. Pessah"], "title": "On the Evolution of Disk-Embedded Binaries: Framing Local Models in Global Context", "comment": null, "summary": "The disks of Active Galactic Nuclei (AGN) have in recent years been\nrecognized as possible sites for gravitational wave sources, leading to a\nseries of numerical studies on the evolution of disk-embedded black hole\nbinaries. The majority of these works have been carried out so far using the\nshearing box, a local Cartesian domain co-rotating with the binary\ncenter-of-mass around the supermassive black hole. The local nature of this\nframework allows for focusing computational power close to the binary at the\nexpense of detaching the gas flow around the binary from the global dynamics.\nIn this paper, we provide a framework to assess the applicability of the\nshearing box for studying the long-term evolution of the orbital elements of\nthe embedded binary in viscous hydrodynamic disks. We accomplish this by\nidentifying the conditions under which relevant global timescales are longer\nthan the gas-induced evolution timescale of the embedded binary across various\nAGN disk models. For black hole masses of interest, we report the existence of\nradii beyond which the global influence of the disk may be reasonably\nneglected, supporting the use of the shearing box. More generally, we introduce\na systematic approach to link local simulations with the global problem they\naim to approximate while providing a way to gauge their accuracy. This will\nprove to be essential as we seek to add additional physics, such as magnetic\nfields and radiative transport, to develop more realistic models for black hole\nbinary mergers and their potential electromagnetic signatures in AGN disks."}
{"id": "2510.20248", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2510.20248", "abs": "https://arxiv.org/abs/2510.20248", "authors": ["Sarah E. Kay", "Brian N. Wenny"], "title": "Satellite Underflight Utility for Thermal Sensor Harmonization", "comment": "8 pages, 12 figures. This paper has been reviewed by the independent\n  peers. A shorter version of this paper will likely be published as a journal\n  article", "summary": "Underflight maneuvers provide a unique opportunity to harmonize calibration\nof on-orbit sensors. Due to their similar sensor technologies, their\nnear-identical transmission profiles, orbital properties and platform\noperations, the underflight data of Landsat 8 and 9 instruments stand out as a\nqualifier to test proposed metrics, methods, and the extent over which to\ncompare two independently calibrated sensors across their similar operating\nbandpasses. This study performed a pixel-to-pixel comparison of thermal imagery\nof TIRS and TIRS-2 (aboard Landsat 8 and 9, respectively) during their five-day\nunderflight maneuver in November 2021, with the ultimate goal of identifying\nthe key site/scene-selection criteria for a subset of images that are suitable\nfor radiative calibration validation purposes. If a group of\nnear-coincidentally observed images by two identical underflying sensors fail\nto show consistent Top-of-Atmosphere (TOA) Brightness Temperatures for the same\nexact geographical locations, then the scenes with those shared properties\nand/or observing conditions will prove unreliable for cross calibration\nvalidation of less-similar underflying sensor pairs. This study demonstrates\nthat near-coincidental images with Root Mean Square Deviations (RMSDs) of less\nthan 5\\% between their TOA radiances are optimum candidates for\ncross-validation of radiative calibration between two independently calibrated\nsensors. This criterion is shown to be reliable for coincidental acquisitions\nwith a wide range of overlapping area, terrain type, land-to-water fraction and\ncloud coverage. Important considerations include any time gap between\nnear-coincident acquisitions as well as the application of pixel quality masks.\nThe analysis of the selected underflight scenes demonstrated an agreement\nbetween the TIRS on Landsat 8 and 9 to within 0.123 K and 0.066 K for the\n10.9um and 12.0um bands respectively."}
{"id": "2510.20076", "categories": ["astro-ph.HE", "nucl-th"], "pdf": "https://arxiv.org/pdf/2510.20076", "abs": "https://arxiv.org/abs/2510.20076", "authors": ["Jade Powell", "Bernhard Müller"], "title": "Impact of the nuclear equation of state on the explodability of massive stars", "comment": null, "summary": "In recent years, astrophysical observations have placed tight constraints on\nkey properties of the nuclear equation of state (EoS). Using 45 two-dimensional\nsimulations for three different EoS compatible with the current tight\nconstraints, we show that the EoS remains a major uncertainty for the outcome\nof core-collapse supernovae. Whereas explosions are obtained in most cases for\nthe SFHo and SFHx EoS, for the CMF EoS, which includes a crossover from\nnucleonic matter to a quark phase, explosions occur only for 2 out of 15\nprogenitors. Less favourable conditions for neutrino-driven explosions arise\nfor the CMF EoS due to lower neutrino luminosities and mean energies and\nslightly weaker contraction of the warm proto-neutron star. Our results suggest\nthat the explodability of massive stars cannot yet be predicted based on first\nprinciples without better knowledge of the nuclear EoS. Conversely,\nobservational constraints on stellar explodability may help further constrain\nthe EoS."}
{"id": "2510.20334", "categories": ["astro-ph.IM", "astro-ph.HE", "cs.LG"], "pdf": "https://arxiv.org/pdf/2510.20334", "abs": "https://arxiv.org/abs/2510.20334", "authors": ["A. P. Kryukov", "A. Yu. Razumov", "A. P. Demichev", "J. J. Dubenskaya", "E. O. Gres", "S. P. Polyakov", "E. B. Postnikov", "P. A. Volchugov", "D. P. Zhurov"], "title": "Capability of using the normalizing flows for extraction rare gamma events in the TAIGA experiment", "comment": "9 pages, 4 figures, Proceedings of The 9th International Conference\n  on Deep Learning in Computational Physics, July, 2-4, 2025, Moscow, Russia", "summary": "The objective of this work is to develop a method for detecting rare gamma\nquanta against the background of charged particles in the fluxes from sources\nin the Universe with the help of the deep learning and normalizing flows based\nmethod designed for anomaly detection. It is shown that the suggested method\nhas a potential for the gamma detection. The method was tested on model data\nfrom the TAIGA-IACT experiment. The obtained quantitative performance\nindicators are still inferior to other approaches, and therefore possible ways\nto improve the implementation of the method are proposed."}
{"id": "2510.20083", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2510.20083", "abs": "https://arxiv.org/abs/2510.20083", "authors": ["Jon M. Miller", "Xin Xiang", "Doyee Byun", "Ehud Behar", "Laura Brenneman", "Edward Cackett", "Elisa Costantini", "Luigi Gallo", "Keith Horne", "Elias Kammoun", "Chen Li", "Abderahmen Zoghbi"], "title": "XRISM/Resolve Spectroscopy of the Central Engine in the Seyfert-1 AGN Mrk 279", "comment": "ApJ Letters, accepted", "summary": "High-resolution X-ray spectroscopy with XRISM gives an unprecedented view of\nthe ``central engine'' in active galactic nuclei, providing unique insights\ninto black hole accretion and feedback. We present an analysis of the first\nXRISM/Resolve spectrum of the Seyfert-1 galaxy Mrk 279, known for its complex\nline profiles and variability. The data reveal velocity components within the\nFe K$_{\\alpha}$ emission line that can be associated with the inner face of the\nmolecular torus ($r \\geq 10^{4}~GM/c^{2})$, the broad line region (BLR; $r =\n1650^{+5780}_{-1480}~GM/c^{2}$), and the inner accretion disk ($r =\n81^{+280}_{-75}~GM/c^{2}$). We find evidence of low-velocity, highly ionized\ngas that contributes an H-like Fe XXVI emission line at 6.97 keV, confirming\nsuggestions from prior low-resolution spectra. The data do not show slow winds\nin absorption, but two pairs of lines - consistent with He-like and H-like Fe\nshifted by $v\\simeq 0.22c$ and $v\\simeq 0.33c$ - improve the fit, and could\nrepresent an ultra-fast outflow (UFO). Their addition to the model only reduces\nthe Akaike Information Criterion by 3.6 and 3.5, respectively, signaling modest\nsupport. Additional observations are needed to definitively test for the\npresence of fast X-ray winds in Mrk 279. We discuss these results in the\ncontext of the geometry of the central engine in AGN, emerging trends in XRISM\nstudies of AGN, and the nature of the potential UFOs."}
{"id": "2510.20522", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2510.20522", "abs": "https://arxiv.org/abs/2510.20522", "authors": ["Jakub Kmec", "Petr Boril", "Fraser Bradfield", "Karel Cerny", "Ladislav Chytka", "Toshihiro Fujii", "Pavel Horvath", "Miroslav Hrabovsky", "Vlastimil Jilek", "Jiri Kvita", "Max Malacari", "Massimo Mastrodicasa", "John N. Matthews", "Stanislav Michal", "Marcus Niechciol", "Libor Nozka", "Miroslav Palatka", "Miroslav Pech", "Paolo Privitera", "Francesco Salamida", "Shunsuke Sakurai", "Petr Schovanek", "Radomir Smida", "Zuzana Svozilikova", "Haruka Tachibana", "Akimichi Taketa", "Stan B. Thomas", "Petr Travnicek", "Martin Vacula", "Jiri Zahora", "Dusan Mandat", "Petr Hamal"], "title": "Detection of ultra-high-energy cosmic rays in the southern hemisphere with FAST: data acquisition and preliminary results", "comment": null, "summary": "Ultra-high-energy cosmic rays (UHECRs) remain one of the greatest mysteries\nin astroparticle physics. The Fluorescence detector Array of Single-pixel\nTelescopes (FAST) is a next-generation cosmic ray experiment which utilizes\nground-based fluorescence telescopes designed to detect these extremely rare\nparticles at energies exceeding 30 EeV. FAST offers a cost-effective and\nlow-maintenance solution to cover the huge detection areas required for UHECR\nobservation. FAST telescopes are currently installed and remotely operated in\nboth hemispheres, at the Pierre Auger Observatory and the Telescope Array\nexperiment. To enable fully autonomous operation, a sophisticated trigger for\ndata acquisition is essential. In this paper, we present two novel triggering\nalgorithms inspired by those used at the largest observatories, but improved to\nmeet the specific requirements imposed by the FAST design. Their performance is\nvalidated using Monte Carlo simulations of extensive air showers and UHECR\nevents detected by the FAST telescope in the southern hemisphere. Finally, we\npresent the sensitivity analysis estimate for FAST."}
{"id": "2510.20522", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2510.20522", "abs": "https://arxiv.org/abs/2510.20522", "authors": ["Jakub Kmec", "Petr Boril", "Fraser Bradfield", "Karel Cerny", "Ladislav Chytka", "Toshihiro Fujii", "Pavel Horvath", "Miroslav Hrabovsky", "Vlastimil Jilek", "Jiri Kvita", "Max Malacari", "Massimo Mastrodicasa", "John N. Matthews", "Stanislav Michal", "Marcus Niechciol", "Libor Nozka", "Miroslav Palatka", "Miroslav Pech", "Paolo Privitera", "Francesco Salamida", "Shunsuke Sakurai", "Petr Schovanek", "Radomir Smida", "Zuzana Svozilikova", "Haruka Tachibana", "Akimichi Taketa", "Stan B. Thomas", "Petr Travnicek", "Martin Vacula", "Jiri Zahora", "Dusan Mandat", "Petr Hamal"], "title": "Detection of ultra-high-energy cosmic rays in the southern hemisphere with FAST: data acquisition and preliminary results", "comment": null, "summary": "Ultra-high-energy cosmic rays (UHECRs) remain one of the greatest mysteries\nin astroparticle physics. The Fluorescence detector Array of Single-pixel\nTelescopes (FAST) is a next-generation cosmic ray experiment which utilizes\nground-based fluorescence telescopes designed to detect these extremely rare\nparticles at energies exceeding 30 EeV. FAST offers a cost-effective and\nlow-maintenance solution to cover the huge detection areas required for UHECR\nobservation. FAST telescopes are currently installed and remotely operated in\nboth hemispheres, at the Pierre Auger Observatory and the Telescope Array\nexperiment. To enable fully autonomous operation, a sophisticated trigger for\ndata acquisition is essential. In this paper, we present two novel triggering\nalgorithms inspired by those used at the largest observatories, but improved to\nmeet the specific requirements imposed by the FAST design. Their performance is\nvalidated using Monte Carlo simulations of extensive air showers and UHECR\nevents detected by the FAST telescope in the southern hemisphere. Finally, we\npresent the sensitivity analysis estimate for FAST."}
{"id": "2510.20545", "categories": ["astro-ph.HE", "gr-qc"], "pdf": "https://arxiv.org/pdf/2510.20545", "abs": "https://arxiv.org/abs/2510.20545", "authors": ["Nikita Kramarev", "Andrey Yudin"], "title": "Non-conservative Mass Transfer in the Neutron Star Stripping Model", "comment": "8 pages, 2 figures", "summary": "The process of long-term stable mass transfer (or stripping) in a close\nneutron star binary system is possible at a sufficiently large initial\nasymmetry of the component masses. At the final stage of the evolution of such\nsystems, the low-mass neutron star fills its Roche lobe, whereupon its mass is\ngradually transferred to the more massive component. At a certain point, the\nstability of the mass transfer is lost, causing the minimum-mass neutron star\nto explode. In the present stripping calculations, the effect of\nnon-conservative mass transfer has been taken into account for the first time,\nresulting in an increase in the duration of stable mass transfer from a few\ntenths of a second to a few seconds. This allows the time delay of 1.7 s\nbetween the loss of the gravitational-wave signal and the detection of the\ngamma-ray burst from the multimessenger event GW170817-GRB170817A to be\nnaturally explained. The interaction of the envelope of the exploded\nminimum-mass neutron star with the matter ejected during non-conservative mass\ntransfer may explain two episodes in the light curve of this gamma-ray burst."}
{"id": "2510.20628", "categories": ["astro-ph.HE", "physics.plasm-ph"], "pdf": "https://arxiv.org/pdf/2510.20628", "abs": "https://arxiv.org/abs/2510.20628", "authors": ["Samuel Sebastian", "Luca Comisso"], "title": "Magnetic Field-Line Curvature and Its Role in Particle Acceleration by Magnetically Dominated Turbulence", "comment": "To appear in The Astrophysical Journal Letters", "summary": "We employ first-principles, fully kinetic particle-in-cell simulations to\ninvestigate magnetic field-line curvature in magnetically dominated turbulent\nplasmas and its role in particle acceleration through curvature-drift motion\nalong the motional electric field. By varying the fluctuation-to-mean\nmagnetic-field ratio $\\delta B_0/B_0$, we examine curvature $\\kappa$ statistics\nand their connection to particle acceleration. The curvature probability\ndensities display broad power-law wings, scaling linearly in $\\kappa$ below the\npeak and developing hard high-$\\kappa$ tails for $\\delta B_0/B_0 \\gtrsim 1$. As\nthe mean field strengthens, the high-$\\kappa$ tails steepen, and\nlarge-curvature events are suppressed when $\\delta B_0/B_0 \\ll 1$. The\nprobability density functions of magnetic field-line contraction, ${\\bf v}_E\n\\cdot {\\bf \\kappa}$, with ${\\bf v}_E$ the field-line velocity, develop\npower-law tails well described by a symmetric Pareto distribution,\ncharacteristic of stochastic energy exchanges, with the tails becoming harder\nas $\\delta B_0/B_0$ increases. Our guiding-center analysis shows that\ncurvature-drift acceleration accounts for a substantial fraction of the\nenergization via the motional electric field, and that it strengthens with\nincreasing $\\delta B_0/B_0$. For well-magnetized particles, curvature-drift\nacceleration typically exceeds ${\\bf\\nabla}B$ drift, polarization drift, and\nbetatron contributions. These results identify curvature-drift acceleration as\na principal pathway through which magnetized turbulence transfers energy to\nnonthermal particles in astrophysical plasmas."}
{"id": "2510.20687", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.20687", "abs": "https://arxiv.org/abs/2510.20687", "authors": ["Rong-Lan Li", "Hao-Ning He", "Da-Ming Wei"], "title": "Search for neutrino emission from LHAASO observed Microquasar with IceCube 10-year data", "comment": null, "summary": "The Large High Altitude Air Shower Observatory (LHAASO) has detected\nultra-high-energy (UHE; E>100 TeV) gamma-ray emission from five microquasars,\nsuggesting their potential as Galactic PeV cosmic-ray accelerators. At these\nenergies, the Klein-Nishima effect strongly suppresses leptonic processes,\nmaking neutrinos observation a crucial test for hadronic acceleration. We\npresent a search for neutrino emission from these LHAASO-identified\nMicroquasars using ten years of IceCube muon-track data. No significant\nneutrino signal was found in either single-source or stacking analyses. Our\nstacking result further shows that the studied microquasars population can only\naccount for a small fraction of the diffuse neutrino flux along the Galactic\nPlane. Finally, we demonstrate that new-generation neutrino telescopes, such as\nHUN, will have the sensitivity to probe harmonic emission from these candidate\nPeVatrons."}
{"id": "2510.20767", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2510.20767", "abs": "https://arxiv.org/abs/2510.20767", "authors": ["Tomás Cabrera", "Antonella Palmese", "Maya Fishbach"], "title": "Multi-messenger constraints on LIGO/Virgo/KAGRA gravitational wave binary black holes merging in AGN disks", "comment": "13 pages, 3 figures. Submitted to Astrophysical Journal. Comments\n  welcome", "summary": "While the LIGO/Virgo/KAGRA (LVK) gravitational wave (GW) detectors have\ndetected over 300 binary black hole (BBH) mergers to date, the first\nconfirmation of an electromagnetic (EM) counterpart to such an event remains\nelusive. Previous works have performed searches for counterpart candidates in\ntransient catalogs and have identified active galactic nuclei (AGN) flares\ncoincident with GW events; existing theory predicts that such flares may arise\nfrom the interaction of the merger remnant with the embedding accretion disk\nenvironment. We apply a statistical formalism to measure the significance of\ncoincidence for the catalog as a whole, measuring that less than 3\\% (90\\%\ncredible interval) of LVK BBH mergers give rise to observable AGN flares. This\nresult still allows up to $\\sim 40\\%$ of BBH mergers to originate in AGN disks.\nWe also examine the individual coincidences of each merger/flare pairing,\ndetermining that in all cases the flares are more likely to belong to a\nbackground population of flares not associated with GW events. Our results are\nconsistent with theoretical predictions accounting for the observability of EM\ncounterparts in AGN disks, as well as based on the fact that the most massive\nAGNs (such as those included in the search) are not expected to harbor the\nmajority of the BBHs. We emphasize that developing both the means to\ndistinguish BBH counterpart flares from background AGN flares and an\nunderstanding of which BBHs are most likely to produce AGN flares as\ncounterparts is critical to optimize the use of follow-up resources."}
{"id": "2510.20775", "categories": ["astro-ph.HE", "astro-ph.SR", "physics.atom-ph", "physics.plasm-ph"], "pdf": "https://arxiv.org/pdf/2510.20775", "abs": "https://arxiv.org/abs/2510.20775", "authors": ["Anil K. Pradhan", "Sultana N. Nahar"], "title": "The Opacity Project: R-Matrix Calculations for Opacities of High-Energy-Density Astrophysical and Laboratory Plasmas", "comment": "12 pages, 5 figures", "summary": "Accurate determination of opacity is critical for understanding radiation\ntransport in both astrophysical and laboratory plasmas. We employ atomic data\nfrom R-Matrix calculations to investigate radiative properties in\nhigh-energy-density (HED) plasma sources. Specifically, we analyze environments\nsuch as the base of the convective zone (BCZ) of the Sun 2 x 10^6$ K, N_e =\n10^{23}/cc and the inertial confinement fusion (ICF) device at the Sandia Z\nfacility 2.11 x 10^6 K, N_e = 3.16 x 10^{22}/cc. We calculate Rosseland Mean\nOpacities (RMO) within a range of temperatures and densities and analyze how\nthey vary under different plasma conditions. In this study, we specifically\nfocus on electron collisional and Stark ion microfield broadening effects on\nautoionizing resonances in photoabsorption cross sections. Our results are\nrelevant to astrophysical models, particularly in the context of the solar\nopacity problem, and provide insights into discrepancies between theoretical\ncalculations and experimental measurements. In addition, we investigate the\nequation-of-state (EOS) and its impact on opacities. In addition, we examine\nthe equation-of-state (EOS) and its impact on opacities of the \"chemical\npicture\" Mihalas-Hummer-Dappen EOS with respect to level populations of excited\nlevels included in the R-matrix calculations. This study should contribute to\nimproving opacity models of HED sources such as stellar interiors adn\nlaboratory fusion plasma experiments."}
{"id": "2510.20791", "categories": ["astro-ph.HE", "astro-ph.SR", "nucl-th"], "pdf": "https://arxiv.org/pdf/2510.20791", "abs": "https://arxiv.org/abs/2510.20791", "authors": ["Zhonghao Tu", "Ang Li"], "title": "A Microphysical Probe of Neutron Star Interiors: Constraining the Equation of State with Glitch Dynamics", "comment": "19 pages, 12 figures, 4 tables", "summary": "Glitches in neutron stars originate from the sudden transfer of angular\nmomentum between superfluid components and the observable crust. By modeling\nthis glitch dynamics, including vortex motion, mutual friction, and angular\nmomentum exchange, we can probe the dense matter equation of state. We match\ntheoretical predictions of glitch rise times, overshoot patterns, and\nrelaxation timescales to the well-documented observations of the 2016 Vela\nglitch. Our model incorporates microphysical parameters such as the mutual\nfriction coefficient $\\mathcal{B}$, which in the core arises from electron\nscattering off magnetized vortices, and in the crust from Kelvin wave\nexcitation during vortex-lattice interactions. Our Markov Chain Monte Carlo\nanalysis of the timing residuals reveals detailed glitch dynamics: the crustal\nsuperfluid couples on timescales of $\\sim100$ seconds, the core exhibits\novershoot behavior due to strong central behavior, and the inner crust shows\nweak entrainment, with $\\sim70\\%$ of free neutrons remaining superfluid. The\nmodeled rise times are consistent with the observed upper limit of 12.6\nseconds, and the observed overshoot requires strong crustal friction but weak\ncore friction, supporting a spatially varying $\\mathcal{B}$.These findings\nhighlight the importance of microphysical modeling and demonstrate the\npotential of future high-cadence timing observations to further constrain the\ninternal dynamics and composition of neutron stars."}
{"id": "2510.20811", "categories": ["astro-ph.HE", "astro-ph.GA", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2510.20811", "abs": "https://arxiv.org/abs/2510.20811", "authors": ["Nathan Steinle", "Matthew Mould", "Sarah Al-Humaikani", "Austin MacMaster", "Brydyn Mac Intyre", "Samar Safi-Harb"], "title": "Simulation-calibrated Bayesian inference for progenitor properties of the microquasar SS 433", "comment": null, "summary": "SS\\,433 is one of the most extreme Galactic X-ray binaries, exhibiting\nsemi-relativistic jets and super-critical accretion, and harboring a compact\nobject, likely a black hole. Despite decades of observation and modeling, the\nprecise nature of its progenitor binary remains uncertain. To estimate the\nzero-age main sequence (ZAMS) properties of binaries that evolve into\nSS\\,433-like systems, we apply simulation-based calibration to Bayesian\ninference and convolve a multivariate Gaussian likelihood constructed from six\nmeasured binary parameters of SS\\,433 with the isolated binary evolution model\n\\textsc{COSMIC}. Employing the dynamic nested sampler of \\texttt{dynesty}, we\nperform posterior inference over a ten-dimensional progenitor parameter space\ndefined by the masses, orbital parameters, mass transfer possibilities, and\nnatal kick velocity. We find that SS\\,433-like systems arise from specific\nregions of binary evolution parameter space depending on key assumptions, such\nas the mass transfer rate and uncertainty taken from observations. Our\nsimulation-based calibration framework, implemented with a suite of machine\nlearning algorithms and scored by a heuristic reliability metric, allows us to\niteratively build posterior distributions of the progenitors of SS\\,433-like\nsystems. This analysis reveals 90\\% confidence intervals for the ZAMS primary\nmass $(8, 11)$ M$_\\odot$, secondary mass $(32, 40)$ M$_\\odot $, orbital period\n$(136, 2259)$ days, eccentricity $(0.26, 0.6)$, common envelope evolution\nefficiency $(0.44, 0.76)$, accreted fraction in stable mass transfer $(0.22,\n0.6)$, and black hole natal kick velocity magnitude $(5, 68)$ km/s. These\nresults demonstrate the feasibility of direct probabilistic inference of X-ray\nbinary progenitors to offer new insights into the evolution of\nhigh-accretion-rate systems such as SS\\,433."}
{"id": "2510.20010", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.20010", "abs": "https://arxiv.org/abs/2510.20010", "authors": ["Asad Hussain", "Maximiliano Isi", "Aaron Zimmerman"], "title": "Living on the edge: Testing for compact population features at the edges of parameter space", "comment": "25 pages, 11 figures", "summary": "Many astrophysical population studies involve parameters that exist on a\nbounded domain, such as the dimensionless spins of black holes or the\neccentricities of planetary orbits, both of which are confined to $[0, 1]$. In\nsuch scenarios, we often wish to test for distributions clustered near a\nboundary, e.g., vanishing spin or orbital eccentricity. Conventional approaches\n-- whether based on Monte Carlo, kernel density estimators, or machine-learning\ntechniques -- often suffer biases at the boundaries. These biases stem from\nsparse sampling near the edge, kernel-related smoothing, or artifacts\nintroduced by domain transformations. We introduce a truncated Gaussian mixture\nmodel framework that substantially mitigates these issues, enabling accurate\ninference of narrow, edge-dominated population features. While our method has\nbroad applications to many astronomical domains, we consider gravitational wave\ncatalogs as a concrete example to demonstrate its power. In particular, we\nmaintain agreement with published constraints on the fraction of zero-spin\nbinary black hole systems in the GWTC-3 catalog -- results originally derived\nat much higher computational cost through dedicated reanalysis of individual\nevents in the catalog. Our method can achieve similarly reliable results with a\nmuch lower computational cost. The method is publicly available in the\nopen-source packages gravpop and truncatedgaussianmixtures."}
{"id": "2510.20334", "categories": ["astro-ph.IM", "astro-ph.HE", "cs.LG"], "pdf": "https://arxiv.org/pdf/2510.20334", "abs": "https://arxiv.org/abs/2510.20334", "authors": ["A. P. Kryukov", "A. Yu. Razumov", "A. P. Demichev", "J. J. Dubenskaya", "E. O. Gres", "S. P. Polyakov", "E. B. Postnikov", "P. A. Volchugov", "D. P. Zhurov"], "title": "Capability of using the normalizing flows for extraction rare gamma events in the TAIGA experiment", "comment": "9 pages, 4 figures, Proceedings of The 9th International Conference\n  on Deep Learning in Computational Physics, July, 2-4, 2025, Moscow, Russia", "summary": "The objective of this work is to develop a method for detecting rare gamma\nquanta against the background of charged particles in the fluxes from sources\nin the Universe with the help of the deep learning and normalizing flows based\nmethod designed for anomaly detection. It is shown that the suggested method\nhas a potential for the gamma detection. The method was tested on model data\nfrom the TAIGA-IACT experiment. The obtained quantitative performance\nindicators are still inferior to other approaches, and therefore possible ways\nto improve the implementation of the method are proposed."}
