{"id": "2509.25347", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.25347", "abs": "https://arxiv.org/abs/2509.25347", "authors": ["L. Sewanou", "G. Laibe", "B. Commerçon"], "title": "A highly accurate drag solver for multi-fluid dust and gas hydrodynamics on GPUs", "comment": "Accepted for publication in Astronomy & Astrophysics", "summary": "Exascale supercomputing unleashes the potential for simulations of\nastrophysical systems with unprecedented resolution. Taking full advantage of\nthis computing power requires the development of new algorithms and numerical\nmethods that are GPU friendly and scalable. In the context of multi-fluid\ndust-gas dynamics, we propose a highly accurate algorithm that is specifically\ndesigned for GPUs. We developed a multi-fluid gas-dust algorithm capable of\ncomputing friction terms on GPU architectures to machine precision, with the\nconstraint for the drag-time step to remain a fraction of the global\nhydrodynamic time step for computational efficiency in practice. We present a\nscaling-and-squaring algorithm tailored to modern architectures for computing\nthe exponential of the drag matrix, enabling high accuracy in friction\ncalculations across relevant astrophysical regimes. The algorithm was validated\nthrough the Dustybox Dustywave and Dustyshock tests. The algorithm was\nimplemented and tested in two multi-GPU codes with different architectures and\nGPU programming models: Dyablo, an adaptive mesh refinement code based on the\nKokkos library, and Shamrock, a multi-method code based on Sycl. On current\narchitectures, the friction computation remains acceptable for both codes\n(below the typical hydro time step) up to 16 species, enabling a further\nimplementation of growth and fragmentation. This algorithm might be applied to\nother physical processes, such as radiative transfer or chemistry."}
{"id": "2509.25350", "categories": ["astro-ph.IM", "astro-ph.CO"], "pdf": "https://arxiv.org/pdf/2509.25350", "abs": "https://arxiv.org/abs/2509.25350", "authors": ["Erin E. Hayes", "Suhail Dhawan", "Stephen Thorp", "Justin D. R. Pierel", "Nikki Arendse"], "title": "The Case for Space: Estimating Precise Time Delays from Ground- and Space-Based Observations of Lensed Supernovae with Glimpse", "comment": "30 pages, 13 figures; submitted to MNRAS", "summary": "The delay in arrival time of the multiple images of gravitationally lensed\nsupernovae (glSNe) can be related to the present-day expansion rate of the\nuniverse, $H_{0}$. Despite their rarity, Rubin Observatory's Legacy Survey of\nSpace and Time (Rubin-LSST) is expected to discover tens of galaxy-scale glSNe\nper year, many of which will not be resolved due to their compact nature.\nFollow-up from ground- and space-based telescopes will be necessary to estimate\ntime delays to sufficient precision for meaningful $H_{0}$ constraints. We\npresent the Glimpse model (GausSN Light curve Inference of Magnifications and\nPhase Shifts, Extended) that estimates time delays with resolved and unresolved\nobservations together for the first time, while simultaneously accounting for\ndust and microlensing effects. With this method, we explore best follow-up\nstrategies for glSNe observed by Rubin-LSST. For unresolved systems on the\ndimmest end of detectability by Rubin-LSST, having peak i-band magnitudes of\n22-24 mag, the time delays are measured to as low as 0.7 day uncertainty with\n6-8 epochs of resolved space-based observations in each of 4-6 optical and NIR\nfilters. For systems of similar brightness that are resolved by ground-based\nfacilities, time delays are consistently constrained to 0.5-0.8 day precision\nwith 6 epochs in 4 optical and NIR filters of space-based observations or 8\nepochs in 4 optical filters of deep ground-based observations. This work\nimproves on previous time-delay estimation methods and demonstrates that glSNe\ntime delays of $\\sim10-20$ days can be measured to sufficient precision for\ncompetitive $H_{0}$ estimates in the Rubin-LSST era."}
{"id": "2509.25366", "categories": ["astro-ph.IM", "astro-ph.CO", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2509.25366", "abs": "https://arxiv.org/abs/2509.25366", "authors": ["Alvaro Callejas-Tavera", "Erik Molino-Minero-Re", "Octavio Valenzuela"], "title": "Co-SOM: Co-training for photometric redshift estimation using Self-Organizing Maps", "comment": "Submitted to astronomy & Computing. Comments Welcome", "summary": "The upcoming galaxy large-scale surveys, such as the Vera C. Rubin\nObservatory's Legacy Survey of Space and Time (LSST), will generate photometry\nfor billions of galaxies. The interpretation of large-scale weak lensing maps,\nas well as the estimation of galaxy clustering, requires reliable redshifts\nwith high precision for multi-band photometry. However, obtaining spectroscopy\nfor billions of galaxies is impractical and complex; therefore, having a\nsufficiently large number of galaxies with spectroscopic observations to train\nsupervised algorithms for accurate redshift estimation is a significant\nchallenge and an open research area. We propose a novel methodology called\nCo-SOM, based on Co-training and Self-Organizing Maps (SOM), integrating\nlabeled (sources with spectroscopic redshifts) and unlabeled (sources with\nphotometric observations only) data during the training process, through a\nselection method based on map topology (connectivity structure of the SOM\nlattice) to leverage the limited spectroscopy available for photo-z estimation.\nWe utilized the magnitudes and colors of Sloan Digital Sky Survey data release\n18 (SDSS-DR18) to analyze and evaluate the performance, varying the proportion\nof labeled data and adjusting the training parameters. For training sets of 1%\nof labeled data ($\\approx 20{,}000$ galaxies) we achieved a performance of bias\n$\\Delta z = 0.00007 \\pm 0.00022$, precision $\\sigma_{zp} = 0.00063 \\pm\n0.00032$, and outlier fraction $f_{\\mathrm{out}} = 0.02083 \\pm 0.00027$.\nAdditionally, we conducted experiments varying the volume of labeled data, and\nthe bias remains below $10^{-3}$, regardless of the size of the spectroscopic\nor photometric data. These low-redshift results demonstrate the potential of\nsemi-supervised learning to address spectroscopic limitations in future\nphotometric surveys."}
{"id": "2509.25433", "categories": ["astro-ph.IM", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2509.25433", "abs": "https://arxiv.org/abs/2509.25433", "authors": ["Shashank Dholakia", "Benjamin J. S. Pope"], "title": "Analytic Interferometry of Rotating Stellar Surfaces", "comment": "29 pages, 9 figures, submitted to PASP. Code available open-source at\n  https://github.com/shashankdholakia/harmonix", "summary": "The surfaces of rotating stars serve as a window into their interiors,\nmagnetic dynamos, and are important in other areas including exoplanet\ndiscovery and atmospheric characterization. While indirect techniques such as\nphotometry and Doppler imaging have been studied for their ability to map\nstellar surfaces, the gold standard remains optical long-baseline\ninterferometry. In this paper, we develop new closed-form solutions for the\ninterferometric visibility of a rotating star with an arbitrary inhomogeneous\nsurface. We introduce the concept of 'stellar rotation synthesis' in\ninterferometry--an analog of Earth rotation synthesis--where stellar rotation\nadds information to the spherical harmonic modes representing the star's\nsurface intensity. We implement these solutions in the open-source package\nharmonix, written in JAX with automatic differentiation, providing a rich\necosystem for fitting and inference. Inspired by similar studies for photometry\nand Doppler imaging, we use simulations of a fiducial star as observed by the\nCHARA Array and intensity interferometers to perform a comprehensive\ntheoretical study of the information theory of the starspot mapping problem in\ninterferometry. We show that adding simultaneous photometry from a space-based\ninstrument such as TESS adds complementary spatial information to\ninterferometry and can improve the precision on the map coefficients by over an\norder of magnitude, enabling the detailed mapping of nearby main-sequence stars\nwith current facilities. Finally, we evaluate the performance of existing and\nproposed intensity interferometers for stellar surface mapping."}
{"id": "2509.25315", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.25315", "abs": "https://arxiv.org/abs/2509.25315", "authors": ["Collin Lewin", "Erin Kara", "Christos Panagiotou", "Edward M. Cackett", "Jonathan Gelbord", "Juan V. Hernández Santisteban", "Keith Horne", "Gerard A. Kriss"], "title": "The Accretion Disk Size Problem in AGN Disk Reverberation Mapping is an Obscuration Effect: A Uniform AGN Sample Study with Swift", "comment": "21 pages, 9 figures, 2 tables. Accepted for publication in ApJ", "summary": "In the past decade, Swift has performed several AGN high-cadence\nreverberation mapping campaigns, and generally found that the UV/optical\ninterband lags are $\\sim$3 times longer than predicted for a standard thin\ndisk, thus coined \"the accretion disk size problem\". Here we present a\nsystematic sample of Swift-monitored AGN. In this analysis, we confirm the\naccretion disk size problem, but find that the lag excess occurs only in the\nsubset of obscured AGN, which show a significantly elevated mean normalization\nof $5.21 \\pm 0.47$ ($p = 0.008$), whereas the unobscured AGN exhibit a mean\nexcess consistent with standard disk predictions ($1.00 \\pm 0.31$). Correlation\nand regression analyses similarly reveal X-ray column density as the strongest\npredictor of lag excess, explaining over 80% of its variance. We interpret\nthese results as line-of-sight obscuration being linked to the too-long lags\nvia additional reprocessed emission from the absorbing material itself. The\nconsistency of lags in the unobscured subgroup with standard disk predictions\nsuggests that the accretion disk size problem is not the result of shortcomings\nof standard accretion disk theory nor contamination by the broad-line region\n(BLR). X-ray to UV lag amplitudes and correlations show more complex and\nvariable behavior in obscured AGN, suggesting that obscuration may disrupt or\ncomplicate the connection between high- and low-energy emission potentially\nthrough reprocessing, scattering, and/or ionization changes."}
{"id": "2509.25547", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.25547", "abs": "https://arxiv.org/abs/2509.25547", "authors": ["Sylvie Dagoret-Campagne", "Marc Moniez", "Jeremy Neveu", "Aurelien Blot", "Pierre Antilogus", "Claire Juramy", "Leurent Le Guillou", "Philippe Repain", "Eduardo Sepulveda", "Christophe Michel", "Francois Colas"], "title": "A transmission hologram for slitless spectrophotometry on a convergent telescope beam. Optimisation and characterization", "comment": "16 pages, 19 figures, submitted to A&A", "summary": "This article details the optimisation and the characterisation of the\nhologram described in a companion paper published in 2021, which showed the\nsuperiority of a holographic optical element over a periodic grating as a\ndisperser installed in the path of a converging beam on an on-axis detector\n(unbent spectrograph) for slitless spectroscopy. In this article, we describe\nin detail the development and optimisation of the final optical holographic\nelement installed on the spectrograph of the auxiliary telescope (AuxTel) at\nthe Rubin-LSST observatory. After recalling the general principle of a hologram\nused as a dispersing and focusing element, we describe the technical resources\n- optical bench and sky measurements - and modeling tools that enabled us to\ndetermine the optimum production parameters for the AuxTel hologram after 4\nprototyping phases. We also describe the on-sky verifications and measurements\ncarried out with various telescopes. Thanks to these various techniques, we\nhave succeeded in obtaining a diffraction efficiency in the first order close\nto the maximum theoretically possible with our thin-type hologram. This\nhologram has been in place on AuxTel's spectrograph since February 2021, and\nhas since given full satisfaction, coupled with analysis software adapted to\nslitless spectroscopy."}
{"id": "2509.25324", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2509.25324", "abs": "https://arxiv.org/abs/2509.25324", "authors": ["Scott Hagen", "Chris Done", "Edward M. Cackett", "Ethan R. Partington", "Rick Edelson", "Collin Lewin", "Erin Kara", "Jonathan Gelbord"], "title": "Untangling the Complex Nature of AGN Variability with Fairall 9", "comment": "17 pages, 8 figures, Submitted to MNRAS after addressing initial\n  round of referee comments. Comments welcome", "summary": "The accretion flow in AGN is not well understood, motivating intensive\nmonitoring campaigns of multiwavelength variability to probe its structure. One\nof the best of these is the 3 year optical/UV/X-ray approximately daily\nmonitoring campaign on Fairall\\,9, a fairly typical moderate accretion rate\nAGN. The UV lightcurve shows a clear increase over $\\sim 50$ days between years\n1 and 2, strongly coherent with the X-ray lightcurve rise. This changes the\naverage spectral energy distribution such that the disc component is stronger\nwhile the X-ray spectrum steepens, so that the total X-ray power remains\nroughly constant. Outside of this global change, we apply a Fourier resolved\nanalysis to test stochastic models where intrinsic fluctuations in the UV disc\npropagate down into the hard X-ray emission region via both changing the seed\nphoton flux for Compton scattering (short light travel timescale) and changing\nthe electron density (longer propagation timescale). Unlike these models, the\nhard X-rays are not particularly well correlated with the UV, and also have the\nwrong sign in that the hard X-rays marginally lead the UV fluctuations. We show\nthat this is instead consistent with uncorrelated stochastic fluctuations in\nboth the UV (slow) and X-ray (fast), which are linked together only weakly via\nlight travel time. These variability properties, as well as the changes in the\nSED, has implications for our understanding of AGN structure and physics, as\nwell as future monitoring campaigns."}
{"id": "2509.25726", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.25726", "abs": "https://arxiv.org/abs/2509.25726", "authors": ["Thomas P. Satterthwaite", "Zeeshan Ahmed", "Cody J. Duell", "Shawn W. Henderson", "Tristan Pinsonneault-Marotte", "Max Silva-Feaver", "Yuhan Wang"], "title": "The Simons Observatory: Studies of Phase Drift in RF Transmission Lines from the First Large-Scale Deployment of Microwave Frequency Multiplexing for Cosmology", "comment": "6 pages, 7 figures. Proceedings of the 21st International Conference\n  on Low Temperature Detectors (LTD 2025)", "summary": "Fulfilling the science goals of the Simons Observatory, a state-of-the-art\ncosmic microwave background (CMB) experiment, has required deploying tens of\nthousands of superconducting bolometers. Reading out data from the\nobservatory's more than 67,000 transition-edge sensor (TES) detectors while\nmaintaining cryogenic conditions requires an effective multiplexing scheme. The\nSLAC microresonator radio frequency (SMuRF) electronics have been developed to\nprovide the warm electronics for a high-density microwave frequency\nmultiplexing readout system, and this system has been shown to achieve\nmultiplexing factors on the order of 1,000. SMuRF has recently been deployed to\nthe Simons Observatory, which is located at 5,200 m on Cerro Toco in Chile's\nAtacama Desert. As the SMuRF system is exposed to the desert's diurnal\ntemperature swings, resulting phase drift in RF transmission lines may\nintroduce a systematic signal contamination. We present studies of phase drift\nin the room-temperature RF lines of the Simons Observatory's 6 m large-aperture\ntelescope, which hosts the largest deployment to date of TES microwave\nfrequency multiplexing to a single telescope. We show that these phase drifts\noccur on time scales which are significantly longer than sky scanning, and that\ntheir contribution to on-sky in-transition detector noise is within the readout\nnoise budget."}
{"id": "2509.25337", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.25337", "abs": "https://arxiv.org/abs/2509.25337", "authors": ["Tal Wasserman", "Eli Waxman"], "title": "Supernovae Exploding within Dense Extended Material: Early Emission Regimes and Degeneracies in Parameter Inference from Observations", "comment": "Submitted to ApJ", "summary": "Early light curves of many core-collapse supernovae (SNe) are thought to be\npowered by the interaction of the shock wave with optically thick extended\nmaterial, either a bound envelope or preexplosion ejected circumstellar matter\n(CSM). We analytically analyze the early emission produced by a shock with\nvelocity $v$ traversing a material of mass $M_\\mathrm{e}$ and opacity $\\kappa$\nextending to radius $R_\\mathrm{e}$, and show the emission varies qualitatively\nwith varying $\\tau_\\mathrm{e}=\\kappa\\!M_\\mathrm{e}/(4\\pi\\!R_\\mathrm{e}^2)$: For\n$\\tau_\\mathrm{e}\\gg\\!c/v$ a shock breakout occurs near $R_\\mathrm{e}$ producing\nan ``edge breakout\" -- a UV-dominated breakout burst followed by ``cooling\nemission\" of the shock-heated material; for $\\tau_\\mathrm{e}\\lesssim\\!c/v$ a\n``wind breakout\" occurs -- the breakout pulse is prolonged and followed by\nextended emission shifting from UV to X-ray as the shock becomes collisionless.\nWe derive the dependence on $\\{v,\\kappa,M_\\mathrm{e},R_\\mathrm{e}\\}$ of the\nduration and luminosity characterizing the different emission phases, and show\nthat current observations typically do not allow inference of all parameters.\nIn particular, since the optical bands lie in the Rayleigh-Jeans tail of\nradiation emitted during the cooling phase, the observed cooling luminosity\ndepends weakly on radius, $\\propto\\!R_\\mathrm{e}^{1/4}$, leading to $1-2$\norders of magnitude uncertainty in its inferred value. This suggests, e.g.,\nthat the common day-scale light curve features in Stripped-Envelope SNe do not\nnecessarily imply material extending to $R_\\mathrm{e}\\sim10^3\\!R_\\odot$ and are\noften consistent with low-mass $R_\\mathrm{e}\\sim\\!10^2\\!R_\\odot$ bound\nenvelopes. Early multiband coverage (especially in UV/X-ray) can break these\ndegeneracies; the forthcoming \\emph{ULTRASAT} UV mission will allow inferring\nthe properties of extended material around the population of SNe progenitors."}
{"id": "2509.25902", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.25902", "abs": "https://arxiv.org/abs/2509.25902", "authors": ["Kunal Bhardwaj", "Asen Christov", "Sergey Karpov"], "title": "A Photometric Classifier for Tidal Disruption Events in Rubin LSST", "comment": null, "summary": "Tidal Disruption Events (TDEs) are astrophysical phenomena arising when stars\nare disrupted by supermassive black holes. The Vera C. Rubin Observatory Legacy\nSurvey of Space and Time (LSST), with its unprecedented depth and cadence, will\ndetect thousands of TDEs, motivating the need for robust photometric\nclassifiers capable of efficiently distinguishing these events from other\nextragalactic transients. We aim to develop and validate a machine learning\npipeline for photometric TDE identification in LSST-scale datasets. Our\nclassifier is designed to provide high precision and recall, enabling the\nconstruction of reliable TDE catalogs for multi-messenger follow-up and\nstatistical studies. Using the second Extended LSST Astronomical Time Series\nClassification Challenge (ELAsTiCC2) dataset, we fit Gaussian Processes (GP) to\nlight curves for feature extraction (e.g., color, rise/fade times, GP length\nscales). We then train and tune boosted decision-tree models (XGBoost) with a\ncustom scoring function emphasizing high-precision recovery of TDEs. Our\npipeline is tested on a diverse simulation of transient and variable events,\nincluding supernovae, active galactic nuclei, and superluminous supernovae. We\nachieve high precision (up to 95%) while maintaining competitive recall (about\n72%) for TDEs, with minimal contamination from non-TDE classes. Key predictive\nfeatures include post-peak colors and GP hyperparameters, reflecting\ncharacteristic timescales and spectral behaviors of TDEs. Our photometric\nclassifier provides a practical and scalable approach to identifying TDEs in\nforthcoming LSST data. By capturing essential color and temporal properties\nthrough GP-based feature extraction, it enables efficient construction of clean\nTDE candidate samples."}
{"id": "2509.25356", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.25356", "abs": "https://arxiv.org/abs/2509.25356", "authors": ["Samsuzzaman Afroz", "Suvodip Mukherjee"], "title": "The Non Parametric Reconstruction of Binary Black Hole Mass Evolution from GWTC-4.0 Gravitational Wave Catalog", "comment": "10 pages, 3 figures", "summary": "The distribution of binary black hole (BBH) masses and its evolution with\nredshift provide key insights into the different formation channels of the\ncompact objects and their evolution with cosmic time and stellar properties\nsuch stellar metallicity and star formation rate history. We present a non\nparametric, model-independent joint reconstruction of the redshift evolution of\nBBH mass distribution from gravitational wave (GW) catalog GWTC-4.0 from the\nfourth observation of LIGO-Virgo-KAGRA (LVK). This method simultaneously\nsearches for the signature of any linear and quadratic redshift evolution with\nrespect to the low redshift in a Bayesian framework taking into accounting the\ndetector selection effects. We find tentative evidence for a linear\nredshift-dependent evolution of the mass distribution, consistent over a mass\nrange ($m \\gtrsim 50\\,M_\\odot$). While lower mass systems shows no signature of\nevolution. The quadratic term remains consistent with zero, indicating that a\nsimple linear dependence adequately describes the population up to redshift $z\n\\sim 1$. In future with more GW sources, this technique can shed light into the\ntrue nature of the redshift dependence and possibility to uncover subtle\nevolutionary features in BBH populations and to probe the cosmic history of\nblack hole formation."}
{"id": "2509.26279", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.26279", "abs": "https://arxiv.org/abs/2509.26279", "authors": ["Steven Stetzler", "Mario Jurić", "Pedro H. Bernardinelli", "Dino Bektešević", "Colin Orion Chandler", "Andrew J. Connolly", "Fred C. Adams", "Cesar Fuentes", "David W. Gerdes", "Matthew J. Holman", "Hsing Wen Lin", "Larissa Markwardt", "Andrew McNeill", "Michael Mommert", "Kevin J. Napier", "William J. Oldroyd", "Matthew J. Payne", "Andrew S. Rivkin", "Luis E. Salazar-Manzano", "Hilke Schlichting", "Scott S. Sheppard", "Dallin Spencer", "Ryder Strauss", "David E. Trilling", "Chadwick A. Trujillo"], "title": "An Efficient Shift-and-Stack Algorithm Applied to Detection Catalogs", "comment": "35 pages, 15 figures, accepted for publication in The Astronomical\n  Journal", "summary": "The boundary of solar system object discovery lies in detecting its faintest\nmembers. However, their discovery in detection catalogs from imaging surveys is\nfundamentally limited by the practice of thresholding detections at\nsignal-to-noise (SNR) $\\geq 5$ to maintain catalog purity. Faint moving objects\ncan be recovered from survey images using the shift-and-stack algorithm, which\ncoadds pixels from multi-epoch images along a candidate trajectory.\nTrajectories matching real objects accumulate signal coherently, enabling\nhigh-confidence detections of very faint moving objects. Applying\nshift-and-stack comes with high computational cost, which scales with target\nobject velocity, typically limiting its use to searches for slow-moving objects\nin the outer solar system. This work introduces a modified shift-and-stack\nalgorithm that trades sensitivity for speedup. Our algorithm stacks low SNR\ndetection catalogs instead of pixels, the sparsity of which enables\napproximations that reduce the number of stacks required. Our algorithm\nachieves real-world speedups of $10$--$10^3 \\times$ over image-based\nshift-and-stack while retaining the ability to find faint objects. We validate\nits performance by recovering synthetic inner and outer solar system objects\ninjected into images from the DECam Ecliptic Exploration Project (DEEP).\nExploring the sensitivity--compute time trade-off of this algorithm, we find\nthat our method achieves a speedup of $\\sim30\\times$ with $88\\%$ of the memory\nusage while sacrificing $0.25$ mag in depth compared to image-based\nshift-and-stack. These speedups enable the broad application of shift-and-stack\nto large-scale imaging surveys and searches for faint inner solar system\nobjects. We provide a reference implementation via the find-asteroids Python\npackage and this URL: https://github.com/stevenstetzler/find-asteroids."}
{"id": "2509.25422", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.25422", "abs": "https://arxiv.org/abs/2509.25422", "authors": ["Connor Mooney"], "title": "VERITAS Follow-Up Observations of the Ultra-High-Energy Neutrino Event KM3-230213A", "comment": "8 pages, 3 figures. Contribution to the 39th International Cosmic Ray\n  Conference (ICRC2025), Geneva, Switzerland, July 2025", "summary": "The recent announcement of the detection of the ultra-high-energy (UHE)\nneutrino event KM3-230213A by the KM3NeT telescope represents a critical\nopportunity to explore the origins of cosmic neutrinos and their potential\ngamma-ray counterparts. With an inferred neutrino energy exceeding 100 PeV,\nthis event stands as the most energetic neutrino observed to date. The large\noffset from the galactic plane (11 degrees) and the presence of several blazars\nwith temporally correlated multiwavelength counterparts within the 3 degrees\nlocalization region raise the possibility of an extragalactic origin.\nAdditionally, the event's apparent tension with IceCube constraints suggests\nthat it could be transient in nature rather than cosmogenic. VERITAS conducted\na targeted follow-up campaign to search for very-high-energy (VHE, greater than\n100 GeV) gamma-ray emission associated with KM3-230213A. Observations were\nperformed in February and March 2025, using a four-point wobble strategy\ncentered on the best-fit neutrino position, covering nearly the entire 90\npercent confidence region. These observations probe potential hadronic\ngamma-ray emission from a common origin with the neutrino, placing constraints\non particle-acceleration scenarios. We present the results of this search,\nincluding upper limits on very-high-energy gamma-ray flux and their\nimplications for possible source models of KM3-230213A."}
{"id": "2509.26510", "categories": ["astro-ph.IM", "physics.soc-ph"], "pdf": "https://arxiv.org/pdf/2509.26510", "abs": "https://arxiv.org/abs/2509.26510", "authors": ["Danilo Albergaria", "Kateryna Frantseva", "Pedro Russo", "Svitlana Babiichuk", "Oksana Berezhna", "Sofiia Denyshchenko", "Daria Dobrycheva", "Vadym Kaydash", "Olena Kompaniiets", "Oleksander Konovalenko", "Yurii Kulinich", "Igor Lukyanyk", "Vladyslava Marsakova", "Bohdan Novosyadlyj", "Elena Panko", "Volodymyr Reshetnyk", "Ivan Slyusarev", "Iurii Sushch", "Ganna Tolstanova", "Iryna Vavilova", "Liubov Yankiv-Vitkovska", "Yaroslav Yatskiv", "Vyacheslav Zakharenko"], "title": "Ukrainian Wartime Astronomy and its Prospects", "comment": "8 pages", "summary": "The Russian invasion of Ukraine damaged or compromised astronomical\nfacilities and has prompted the displacement of researchers. A plan to restore\nUkrainian astronomy, rooted in a deeper integration with the international\ncommunity, is now being developed."}
{"id": "2509.25577", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2509.25577", "abs": "https://arxiv.org/abs/2509.25577", "authors": ["Peter Scherbak", "Abigail Polin", "Mansi Kasliwal", "Kishaley De", "Peter Behroozi", "Dave Cook", "Wynn Jacobson-Galán"], "title": "Characterizing the host galaxies and delay times of Ca-rich gap transients vs 91bg-like SNe and normal Type Ia SNe", "comment": "10 pages, 6 figures. Submitted to PASP", "summary": "Calcium-rich gap transients are a faint, fast-evolving class of supernovae\nthat show strong nebular Ca emission lines. Their progenitor systems are\nuncertain, but they are often associated with old and quiescent host galaxies.\nIn this work, we compare the properties of the hosts of hydrogen-poor Ca-rich\ngap transients to the hosts of 3 other classes of supernova (SNe): normal Type\nIa, 91bg-like, and Type II. We use data from the Zwicky Transient Facility\n(ZTF) Census of the Local Universe (CLU) experiment to build up our 4 SNe\nsamples and identify the host galaxies. A combination of precomputed host\nproperties from the CLU catalog and those derived from SED fitting are used to\ncharacterize each host's stellar mass, star formation rate, and specific star\nformation rate (sSFR). We find that the hosts of Ca-rich gap transients and\n91bg-like SNe occupy a similar parameter space of mass and sSFR, and are more\nmassive and quiescent compared to the hosts of Type Ia and Type II SNe.\nAdditionally, we construct delay time distributions (DTDs) for our 4 samples,\nfinding that Ca-rich gap transients and 91bg-like SNe have the longest peak\ndelay times $\\sim 10^4$ Myr, compared to the peak delay times of Type Ia SNe\n($\\sim 10^3$ Myr) and Type II SNe ($\\sim 10$ Myr). The similarity of host\nenvironment and DTDs for Ca-rich gap transients and 91bg-like SNe motivates\nfurther analysis of the relationship of these two transient classes."}
{"id": "2509.26567", "categories": ["astro-ph.IM", "cs.AI", "cs.LG", "physics.space-ph"], "pdf": "https://arxiv.org/pdf/2509.26567", "abs": "https://arxiv.org/abs/2509.26567", "authors": ["Angel Pan Du", "Miguel Arana-Catania", "Enric Grustan Gutiérrez"], "title": "AI-assisted Advanced Propellant Development for Electric Propulsion", "comment": "23 pages, 10 figures, 5 tables. Journal of Electric Propulsion", "summary": "Artificial Intelligence algorithms are introduced in this work as a tool to\npredict the performance of new chemical compounds as alternative propellants\nfor electric propulsion, focusing on predicting their ionisation\ncharacteristics and fragmentation patterns. The chemical properties and\nstructure of the compounds are encoded using a chemical fingerprint, and the\ntraining datasets are extracted from the NIST WebBook. The AI-predicted\nionisation energy and minimum appearance energy have a mean relative error of\n6.87% and 7.99%, respectively, and a predicted ion mass with a 23.89% relative\nerror. In the cases of full mass spectra due to electron ionisation, the\npredictions have a cosine similarity of 0.6395 and align with the top 10 most\nsimilar mass spectra in 78% of instances within a 30 Da range."}
{"id": "2509.25833", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.25833", "abs": "https://arxiv.org/abs/2509.25833", "authors": ["Moeri Tao", "Takaaki Tanaka", "Hidetoshi Sano", "Rami Z. E. Alsaberi", "Jun Kataoka"], "title": "Turbulent Magnetic Fields and Molecular Cloud Interactions in the Supernova Remnant G1.9+0.3", "comment": null, "summary": "We present on results of a spatially resolved spectral analysis of G1.9+0.3,\nthe youngest known supernova remnant in the Galaxy. The X-ray spectra are well\ndescribed by synchrotron emission from a power-law electron distribution with\nan exponential cutoff. We found a cutoff energy $\\epsilon_0 \\sim 1 ~ \\rm{keV}$\nin both the radio bright rim and the X-ray bright rims. In the loss-limited\ncase, the cutoff energy depends on the shock velocity $v_{\\rm{sh}}$ and the\nBohm factor $\\eta$, following the relation $\\epsilon_0 \\propto v_{\\rm{sh}}^2\n\\eta^{-1} $. Our analysis shows that $\\eta$ ranges from 2 to 4 in the radio rim\nand from 12 to 15 in the X-ray rims. This suggests that the magnetic field in\nthe radio rim is more turbulent than in the X-ray rims. The presence of CO\nclouds along the radio rim likely contributes to this difference. Interaction\nbetween the shock and these clouds can slow the shock down and generate\nturbulent eddies. The resulting turbulence eddies can amplify the magnetic\nfield. We propose that the strong radio emission from the radio rim is\nprimarily due to this amplified magnetic field. In contrast, a CO cloud located\nin the south-west appears to lie in the foreground, as indicated by its low\nturbulence and the absence of shock deceleration."}
{"id": "2509.25893", "categories": ["astro-ph.HE", "astro-ph.CO", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.25893", "abs": "https://arxiv.org/abs/2509.25893", "authors": ["Bisweswar Sen"], "title": "Bayesian Gaussian Methods for Robust Background Modeling in CALorimetric Electron Telescope (CALET) Gravitational-Wave Searches", "comment": "5 Pages, Code Available at\n  https://github.com/SMALLSCALEDEV/Bayesian-Gaussian-Approach-for-Background-Estimation-in-CALET-GW", "summary": "The search for gamma-ray counterparts to gravitational-wave events with the\nCALET Gamma-ray Burst Monitor (CGBM) requires accurate and robust background\nmodeling. Previous CALET observing runs (O3 and O4) relied on averaged\npre/post-event baselines or low-order polynomial fits, approaches that neglect\ncorrelated noise, temporal non-stationarity, and the propagation of background\nuncertainty into derived flux upper limits. These simplifications can lead to\nreduced sensitivity to faint or atypical transients. In this work, we present a\nnovel Bayesian framework for background estimation based on Gaussian Process\n(GP) regression and change-point modeling. Our approach captures correlated\nstructures in the detector background, quantifies predictive uncertainties, and\npropagates them into both detection statistics and Bayesian credible upper\nlimits. We demonstrate, using archival CALET time-tagged event data and\nsimulated signal injections, that our method improves sensitivity to weak\nshort-duration bursts by up to an order of magnitude compared to traditional\npolynomial fits. This probabilistic background treatment enables a more\nphysically robust interpretation of non-detections and offers a scalable,\nreal-time compatible extension for future joint multi-messenger searches. All\ncodes used in this paper are available at\nhttps://github.com/SMALLSCALEDEV/Bayesian-Gaussian-Approach-for-Background-Estimation-in-CALET-GW."}
{"id": "2509.25838", "categories": ["astro-ph.HE", "hep-ph", "nucl-th"], "pdf": "https://arxiv.org/pdf/2509.25838", "abs": "https://arxiv.org/abs/2509.25838", "authors": ["Steven P. Harris", "C. J. Horowitz"], "title": "Bulk viscosity from neutron decays to dark baryons in neutron star matter", "comment": null, "summary": "The possibility of neutron decay into dark particles has been proposed as a\nway to resolve a growing discrepancy between two different measurements of the\nneutron lifetime. The most popular formulation is a dark sector consisting of a\ndark baryon $\\chi$ and a dark scalar $\\phi$, where a neutron in vacuum decays\nabout 1% of the time via the channel $n\\rightarrow \\chi+\\phi$. In this work, we\nconsider the effect of this additional neutron decay channel on transport in\nneutrons star mergers. We find that the neutron dark decay rate in medium is\nquite slow, and thus the dark baryons modify the dense matter equation of state\nin a way that decreases the Urca bulk viscosity by, at most, a factor of 2-3.\nHowever, if the neutron dark decay was to occur more rapidly, then the bulk\nviscosity at merger temperatures of tens of MeV would be strongly enhanced,\npotentially rapidly damping oscillations in merger environments and therefore\nproviding a signature of slowly equilibrating matter in the merger."}
{"id": "2509.25877", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.25877", "abs": "https://arxiv.org/abs/2509.25877", "authors": ["D. -Y. Li", "J. Yang", "W. -D. Zhang", "the Einstein Probe collaborations"], "title": "A fast powerful X-ray transient from tidal disruption of a white dwarf", "comment": "to be submitted", "summary": "Stars captured by black holes (BHs) can be tore apart by strong tidal force,\nproducing electromagnetic flares. Some 100 tidal disruption events (TDEs) have\nbeen observed, involving invariably normal gaseous stars whose debris falls\nonto the BH fueling the flares over years. White dwarfs (WDs)-the most\nprevalent compact stars a million times denser and thus tougher than gaseous\nstars-can only be disrupted by intermediate-mass black holes (IMBHs) of\n10^2-10^5 solar masses. WD-TDEs are predicted to generate more powerful and\nshort-lived flares, but their evidence has been lacking. Here we report\nobservations of a fast, luminous X-ray transient EP250702a. Its one-day-long\npeak showed strong recurrent flares extending to several tens of MeV in\ngamma-rays, indicating relativistic jet emission. The jet X-rays dropped\nsharply from exceeding 3 x 10^49 to around 10^44 erg/s within 20 days. These\ncharacteristics are inconsistent with any known transient phenomena other than\na jetted-TDE evolving within a short timespan previously unseen-indicating the\ndisruption of a white dwarf by an IMBH. At late times, a new soft component\nprogressively dominates the X-ray spectrum, exhibiting extreme super-Eddington\nluminosity, possibly from an accretion disc. WD-TDEs open a new window to study\nelusive IMBHs and the otherwise invisible interior of degenerate stars."}
{"id": "2509.25886", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.25886", "abs": "https://arxiv.org/abs/2509.25886", "authors": ["Qi-Zuo Wu", "Ruo-Yu Liu"], "title": "Spatial distribution of secondary electrons' Synchrotron emission: property and implication", "comment": "Accepted by APJ, 10 pages", "summary": "Galactic $\\gamma$-ray sources can be produced by either high-energy protons\nvia proton-proton collisions or electrons/positrons via inverse Compton\nscattering. Distinguishing between the hadronic and leptonic origin of\n$\\gamma$-ray emission in Galactic sources remains challenging. Measurements of\nnon-thermal X-ray spectra of these sources, which could originate from primary\nelectrons in the leptonic scenario or secondary electrons/positrons in the\nhadronic scenario, have been suggested as an efficient way of discriminating\nbetween these scenarios. In this work, we investigate the morphology of the\nX-ray emission from secondary electrons/positrons. By calculating the surface\nbrightness profile and the photon index profile of X-ray emission, we find that\nsecondary electrons produce a distinctively flat X-ray surface brightness\nprofile. Our results suggest that, in addition to the X-ray spectrum, the X-ray\nmorphology is crucial to determine the radiation mechanism of ultrahigh-energy\n$\\gamma$-ray sources and help to identify sources of PeV cosmic rays."}
{"id": "2509.25888", "categories": ["astro-ph.HE", "math-ph", "math.MP", "nlin.CD"], "pdf": "https://arxiv.org/pdf/2509.25888", "abs": "https://arxiv.org/abs/2509.25888", "authors": ["Tiberiu Harko", "Gabriela Raluca Mocanu"], "title": "The Stochastic-Dissipative Störmer Problem-Trajectories and Radiation Patterns", "comment": "15 pages, 12 figures, accepted for publication in Annalen der Physik", "summary": "We consider a generalization of the classical nonrelativistic St\\\"{o}rmer\nproblem, describing the motion of charged particles in a purely magnetic dipole\nfield, by taking into account the effects of the dissipation, assumed to be of\nfriction type, proportional to the velocity of the particle, and of the\npresence of stochastic forces. In the presence of dissipative/stochastic\neffects, the motion of the particle in the magnetic dipole field can be\ndescribed by a generalized Langevin type equation, which generalizes the\nstandard Lorentz force equation. We perform a detailed numerical analysis of\nthe dynamical behavior of the particles in a magnetic dipolar field in the\npresence of dissipative and stochastic forces, as well as of the\nelectromagnetic radiation patterns emitted during the motion. The effects of\nthe dissipation coefficient and of the stochastic force on the particle motion\nand on the emitted electromagnetic power are investigated, and thus a full\ndescription of the spectrum of the magnetic dipole type electromagnetic\nradiation and of the physical properties of the motion is also obtained. The\npower spectral density of the emitted electromagnetic power is also obtained\nfor each case, and, for all considered St\\\"{o}rmer type models, it shows the\npresence of peaks in the radiation spectrum, corresponding to certain intervals\nof the frequency."}
{"id": "2509.25893", "categories": ["astro-ph.HE", "astro-ph.CO", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.25893", "abs": "https://arxiv.org/abs/2509.25893", "authors": ["Bisweswar Sen"], "title": "Bayesian Gaussian Methods for Robust Background Modeling in CALorimetric Electron Telescope (CALET) Gravitational-Wave Searches", "comment": "5 Pages, Code Available at\n  https://github.com/SMALLSCALEDEV/Bayesian-Gaussian-Approach-for-Background-Estimation-in-CALET-GW", "summary": "The search for gamma-ray counterparts to gravitational-wave events with the\nCALET Gamma-ray Burst Monitor (CGBM) requires accurate and robust background\nmodeling. Previous CALET observing runs (O3 and O4) relied on averaged\npre/post-event baselines or low-order polynomial fits, approaches that neglect\ncorrelated noise, temporal non-stationarity, and the propagation of background\nuncertainty into derived flux upper limits. These simplifications can lead to\nreduced sensitivity to faint or atypical transients. In this work, we present a\nnovel Bayesian framework for background estimation based on Gaussian Process\n(GP) regression and change-point modeling. Our approach captures correlated\nstructures in the detector background, quantifies predictive uncertainties, and\npropagates them into both detection statistics and Bayesian credible upper\nlimits. We demonstrate, using archival CALET time-tagged event data and\nsimulated signal injections, that our method improves sensitivity to weak\nshort-duration bursts by up to an order of magnitude compared to traditional\npolynomial fits. This probabilistic background treatment enables a more\nphysically robust interpretation of non-detections and offers a scalable,\nreal-time compatible extension for future joint multi-messenger searches. All\ncodes used in this paper are available at\nhttps://github.com/SMALLSCALEDEV/Bayesian-Gaussian-Approach-for-Background-Estimation-in-CALET-GW."}
{"id": "2509.25915", "categories": ["astro-ph.HE", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2509.25915", "abs": "https://arxiv.org/abs/2509.25915", "authors": ["Bo Wang", "Dongdong Liu", "Yunlang Guo", "Zhanwen Han"], "title": "The Formation of Neutron Star Systems through Electron-capture Supernovae: A Review", "comment": "19 pages, 7 figures, comments are welcome", "summary": "It is generally believed that the electron-capture reactions happen when the\noxygen-neon (ONe) cores grow in masses close to the Chandrasekhar limit,\nleading to the formation of neutron stars (NSs) via electron-capture supernovae\n(EC-SNe). EC-SNe are predicted to be the most likely short-lived and faint\noptical transients, and a small ejecta mass is expected during the collapse.\nThis kind of SNe provide an alternative channel for producing isolated NSs and\nNS systems, especially for the formation of X-ray binaries and double NSs.\nHowever, there are still some uncertainties for the origin of EC-SNe. In this\narticle, we review recent studies on the two classic progenitor channels of\nEC-SNe, i.e., the single star channel and the binary star channel. In the\nsingle star channel, EC-SNe can happen in super asymptotic giant branch stars\nor He stars, whereas in the binary star channel EC-SNe can occur in He stars in\nbinaries (including He star+MS systems and NS+He star systems) or\naccretion-induced collapse in white dwarf binaries (including the\nsingle-degenerate scenario and the double-degenerate scenario). Recent progress\non the two progenitor channels is discussed, including the initial parameter\nrange for EC-SNe, the evolutionary paths to EC-SNe, related objects, and some\nobservational constraints, etc. We also discuss the formation of double NSs\nthrough NS+He star binaries, in which the He star companion experiences an\nEC-SN. Research on EC-SNe is at a pivotal stage, with key theoretical\nuncertainties and observational challenges requiring integrated modeling and\nmulti-wavelength observations for robust identification."}
{"id": "2509.25935", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2509.25935", "abs": "https://arxiv.org/abs/2509.25935", "authors": ["Ying Gu", "Xiao Li", "Xing-Qian Cheng", "Dou-Dou Wang", "Xue-Guang Zhang", "En-Wei Liang"], "title": "Time-Dependent obscuration of a tidal disruption event candidate in the active galactic nucleus CSS100217", "comment": "6 pages, 5 figures. Accepted by A&A Letter", "summary": "CSS100217 is considered a peculiar tidal disruption event (TDE) candidate\noccurring in an active galactic nucleus (AGN). Unlike typical TDEs, where the\npost-flare luminosity is equal to that pre-flare, CSS100217 decayed to $\\sim$\n0.4 magnitudes fainter than its pre-flare V band level. In this manuscript, we\npropose an obscured TDE model to explain the light curve of CSS100217. Assuming\nthat the time-dependent obscuration, caused by the TDE unbound stellar debris,\nor by nuclear clouds moving around the supermassive black hole (SMBH), follows\na Weibull distribution, we find that the light curve of CSS100217 can be\ndescribed by the tidal disruption of a $4.6_{-0.9}^{+0.9}{\\rm M_\\odot}$\nmain-sequence star by a $3.3_{-0.3}^{+0.3}\\times10^7{\\rm M_\\odot}$ black hole.\nThe total energy of the event derived from our fit is $7.23\\times10^{53}$ ergs\nand about 1.38 ${\\rm M_\\odot}$ of debris mass is accreted by the central SMBH.\nThe model indicates that the contribution of the host galaxy to the observed\npre-flare optical luminosity is not-significant compared to that of the AGN,\nwhich is consistent with the results of the spectral analysis. These results\nsuggest that obscuration may play an important role in explaining the unusual\nTDE-like variability observed in CSS100217."}
{"id": "2509.25943", "categories": ["astro-ph.HE", "astro-ph.GA", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2509.25943", "abs": "https://arxiv.org/abs/2509.25943", "authors": ["Flora Petrou", "Natasha Hurley-Walker", "Sam McSweeney", "Susmita Sett", "Rebecca Kyer", "Chia Min Tan", "Yogesh Maan", "Arash Bahramian", "Dougal Dobie", "David Kaplan", "Andrew Zic", "Julia Deneva", "Tara Murphy", "Emil Polisensky", "Akash Anumarlapudi"], "title": "Investigating four new candidate redback pulsars discovered in the image plane", "comment": "26 pages, 14 figures, 6 tables", "summary": "This paper reports the discovery and follow-up of four candidate redback\nspider pulsars: GPM J1723-33, GPM J1734-28, GPM J1752-30 and GPM J1815-14,\ndiscovered with the Murchison Widefield Array (MWA) from an imaging survey of\nthe Galactic Plane. These sources are considered to be redback candidates based\non their eclipsing variability, steep negative spectral indices, and potential\nFermi $\\gamma$-ray associations, with GPM J1723-33 and GPM J1815-14 lying\nwithin a Fermi 95% error ellipse. Follow-up pulsation searches with MeerKAT\nconfirmed pulsations from GPM J1723-33, while the non-detections of the other\nthree are likely due to scattering by material ablated from their companion\nstars. We identify possible orbital periods by applying folding algorithms to\nthe light curves and determine that all sources have short orbital periods (<24\nhours), consistent with redback spider systems. Following up on the sources at\nmultiple radio frequencies revealed that the sources exhibit\nfrequency-dependent eclipses, with longer eclipses observed at lower\nfrequencies. We place broad constraints on the eclipse medium, ruling out\ninduced Compton scattering and cyclotron absorption. Three sources are\nspatially consistent with optical sources in the Dark Energy Camera Plane\nSurvey imaging, which may contain the optical counterparts. Each field is\naffected by strong dust extinction, and follow-up with large telescopes is\nneeded to identify the true counterparts. Identifying potential radio\ncounterparts to four previously unassociated Fermi sources brings us closer to\nunderstanding the origin of the unexplained $\\gamma$-ray excess in the Galactic\nCentre."}
{"id": "2509.25962", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.25962", "abs": "https://arxiv.org/abs/2509.25962", "authors": ["Yago Lema-Capeans"], "title": "Search for UHE neutrinos from GRBs with the Pierre Auger Observatory", "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC\n  2025). 12 pages, 4 figures", "summary": "We report on the search for ultra-high-energy neutrinos from the prompt\nemission of gamma-ray bursts (GRBs) using Surface Detector (SD) data from Phase\nI of the Pierre Auger Observatory (2004-2021). A total of 570 GRBs occur within\nthe most neutrino-sensitive field of view of the SD, considering both\nEarth-skimming and downward-going detection channels. For this purpose, GRB\nneutrino emission has been modeled using the numerical software NeuCosmA,\nincorporating gamma-ray measurements and inferred parameters such as the jet\nLorentz factor and the minimum variability time scale. No neutrino candidates\nwere found, and upper limits were obtained by stacking the individual GRB\nneutrino fluences. These limits are complementary to those of IceCube and\nANTARES and provide the strongest constraints on prompt GRB neutrino fluence\nabove $10^{18}$ eV. Additionally, limits on GRB fluence in alternative models\nof neutrino production have been derived using Auger data."}
{"id": "2509.26068", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.26068", "abs": "https://arxiv.org/abs/2509.26068", "authors": ["Bastien Lacave"], "title": "Stereo observations of CTA 1 with SST-1M", "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC\n  2025), 2025", "summary": "CTA~1 is a composite supernova remnant featuring a shell structure and an\ninner Pulsar Wind Nebula. The shell is visible in the radio band, while Fermi\nhas detected the radio-quiet pulsar PSR J0007+7303 at its core. Gamma-ray\ndetectors such as LHAASO and VERITAS have detected TeV emission in the vicinity\nof the pulsar. However, the derived SEDs from LHAASO WCDA and VERITAS show\nsignificant discrepancies, which could be due to a complicated energy-dependent\nmorphology not accounted for in the spectral analysis, and different angular\nresolution of the two experiments. CTA~1 has been a target for dedicated\nobservations by the SST-1M telescopes, a pair of small-sized Imaging\nAtmospheric Cherenkov Telescopes (IACTs) capable of operating in both mono and\nstereo modes. Located at the Ond\\v{r}ejov Observatory in Czech Republic, these\ntelescopes are sensitive to the high energy range of the gamma-ray spectrum,\nspanning from 1 to 300 TeV. To investigate the very high-energy emission of\nCTA~1, the SST-1Ms have accumulated approximately 30 hours of selected\nobservations, aiming to further constrain the characteristics of the source's\nhigh energy emission, and to shed some light into the discrepancy between\ndifferent experiments."}
{"id": "2509.26147", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.26147", "abs": "https://arxiv.org/abs/2509.26147", "authors": ["Ryota Tomaru", "Chris Done", "Hirokazu Odaka"], "title": "The detection of high X-ray polarization from an accretion disc corona source and its modelling via Monte Carlo radiation transfer simulation", "comment": "8pages, 10 figures, Submitted to MNRAS", "summary": "We report an X-ray polarization degree (PD) of $8.8\\pm1.4\\%~(1\\sigma)$ from\nthe accretion-disc-corona (ADC) neutron-star system 2S 0921-630 (=V395 Car)\nobserved with the Imaging X-ray Polarimetry Explorer (IXPE). The PD increases\nwith energy, while the polarization angle (PA) varies significantly across the\nband. These trends are consistent with a high-inclination ADC geometry where\nthe vertically extended disc blocks direct sight of the central X-ray source,\nand the observed X-rays are those scattered in an equatorial disc wind. We also\nfind tentative PD variability in the 2--3 keV band. To interpret the\ntime-averaged polarization, we build spectropolarimetric models by Monte Carlo\nradiation transfer simulation with column density distribution of\nthermal-radiative wind launched by X-ray irradiation of the outer disc under an\naxisymmetric geometry. The model combines boundary-layer emission, its disc\nreflection, and the disc continuum, each with its intrinsic polarization.\nScattering of this composite spectrum in the wind reproduces both the observed\nPD and its increase with energy. However, the observed PA evolution is not\ncaptured, which may indicate departures from axisymmetry--e.g. misalignment\nbetween the inner disc (and/or neutron-star spin) and the outer disc/wind, or a\nweak disc warping."}
{"id": "2509.26152", "categories": ["astro-ph.HE", "gr-qc"], "pdf": "https://arxiv.org/pdf/2509.26152", "abs": "https://arxiv.org/abs/2509.26152", "authors": ["Avinash Tiwari", "Sajad A. Bhat", "MD Arif Shaikh", "Shashvath J. Kapaida"], "title": "Testing the nature of GW200105 by probing the frequency evolution of eccentricity", "comment": null, "summary": "GW200105 is a compact binary coalescence (CBC) event, consisting of a neutron\nstar and a black hole, observed in LIGO-Virgo-KAGRA's (LVK's) third observing\nrun (O3). Recent reanalyses of the event using state-of-the-art waveform models\nhave claimed observation of signatures of an eccentric orbit. It has\nnevertheless been pointed out in the literature that certain physical or\nmodified gravity effects could mimic eccentricity by producing a spurious\nnon-zero eccentricity value, at a given reference frequency, when recovered\nwith an eccentric waveform model. We recently developed a model-independent\nEccentricity Evolution Consistency Test (EECT, S. A. Bhat et al. 2025) to\nidentify such mimickers, by comparing the measured frequency\n$\\textit{evolution}$ of eccentricity, $e(f)$, with that expected from General\nRelativity (GR). In this $\\textit{Letter}$, we apply EECT to GW200105 and find\nthat it satisfies EECT within 68% confidence. Our analysis therefore lends\ncomplementary support in favour of the eccentricity hypothesis, while also\nproviding a novel test of the consistency of $e(f)$ with GR."}
{"id": "2509.26283", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.26283", "abs": "https://arxiv.org/abs/2509.26283", "authors": ["Jin-Peng Zhang", "Chen-Wei Wang", "Zheng-Hang Yu", "Shao-Lin Xiong", "Shu-Xu Yi", "Jia-Cong Liu", "Wang-Chen Xue", "Wen-Jun Tan", "Zi-Rui Zhang", "Rahim Moradi", "Hao-Xuan Guo", "Chao Zheng", "Yan-Qiu Zhang", "Yue Wang", "Sheng-Lun Xie", "Peng Zhang", "Yang-Zhao Ren", "Cheng-Kui Li", "Xiao-Bo Li", "Ce Cai", "Shuo Xiao", "Li-Ming Song", "Shuang-Nan Zhang"], "title": "On the Ultra-Long Gamma-Ray Transient GRB 250702B/EP250702", "comment": "16 pages, 6 figures. Originally submitted to ApJL on September 2,\n  2025. Comments welcome!", "summary": "GRB 250702B/EP250702a is an interesting long-duration gamma-ray transient\nwhose nature is in debate. To obtain a full picture in gamma-ray band, we\nimplement a comprehensive targeted search of burst emission in a wide window of\n30 days jointly with Insight-HXMT, GECAM and Fermi/GBM data within the ETJASMIN\nframework. In gamma-ray band, we find there is a 50-second precursor about 25\nhours before the 4-hour main burst, which generally consists of 4 emission\nepisodes. Remarkably, we find that the soft X-ray emission (after the main\nburst) decays as a power-law with start time aligning with the last episode of\nmain emission and index of -5/3 perfectly consistent with the canonical\nprediction of fallback accretion. We conclude that the properties of precursor,\nmain burst and the following soft X-ray emission strongly support the atypical\ncollapsar Ultra-Long Gamma-Ray Burst (ULGRB) scenario rather than the Tidal\nDisruption Event (TDE), and all these gamma-ray and soft X-ray emission\nprobably originate from relativistic jet whose luminosity is dominated by the\nfallback accretion rate during the death collapse of a supergiant star."}
{"id": "2509.26290", "categories": ["astro-ph.HE", "hep-ph"], "pdf": "https://arxiv.org/pdf/2509.26290", "abs": "https://arxiv.org/abs/2509.26290", "authors": ["Qi-Ling Chen", "Qiang Yuan", "Yi-Qing Guo", "Ming-Ming Kang", "Chao-Wen Yang"], "title": "Two-component diffuse Galactic gamma-ray emission revealed with Fermi-LAT", "comment": "Dedicated to the 76th birthday of the People's Republic of China", "summary": "The enigma of cosmic ray origin and propagation stands as a key question in\nparticle astrophysics. The precise spatial and spectral measurements of diffuse\nGalactic gamma-ray emission provide new avenues for unraveling this mystery.\nBased on 16 years of Fermi-LAT observations, we find that the diffuse gamma-ray\nspectral shapes are nearly identical for low energies (below a few GeV) but\nshow significant dispersion at high energies (above a few GeV) across the\nGalactic disk. We further show that the diffuse emission can be decomposed into\ntwo components, a universal spectral component dominating at low energies which\nis consistent with the expectation from interactions of background cosmic rays\nand the interstellar matter, and a spatially variant component dominating at\nhigh energies which is likely due to local accelerators. These findings suggest\nthat there is dual-origin of the Galactic diffuse emission, including the\n``cosmic ray sea'' from efficient propagation of particles and the ``cosmic ray\nislands'' from inefficient propagation of particles, and thus shed new light on\nthe understanding of the propagation models of Galactic cosmic rays."}
{"id": "2509.26418", "categories": ["astro-ph.HE", "hep-th"], "pdf": "https://arxiv.org/pdf/2509.26418", "abs": "https://arxiv.org/abs/2509.26418", "authors": ["Jiabao Liu", "Lucas Johns", "Hiroki Nagakura", "Masamichi Zaizen", "Shoichi Yamada"], "title": "Dynamical equilibria of fast neutrino flavor conversion", "comment": null, "summary": "Dense neutrino systems, which display collectivity mediated by the weak\ninteraction, have deep parallels with mean-field kinetic systems governed by\nother fundamental forces. We identify analogues in fast flavor conversion (FFC)\nof some time-honored nonlinear phenomena in plasmas and self-gravitating\nsystems. We focus in particular on nonlinear Landau damping and collisionless\nequilibria, which are likely important pieces of the unsolved puzzle of\nneutrino oscillations in core-collapse supernovae and neutron star mergers. Our\nanalysis additionally reveals the previously unexplored phenomenon of\nflavor-wave synchronization."}
{"id": "2509.26446", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.26446", "abs": "https://arxiv.org/abs/2509.26446", "authors": ["Ziqian Hua", "Zhiyuan Li"], "title": "Is the Peculiar Galactic Center Transient Swift J174610.4-290018 A Recurrent Nova?", "comment": "10 pages, 3 figures, submitted to AAS Journals", "summary": "Swift J174610.4-290018, a peculiar transient X-ray source originally\ndiscovered by the Swift satellite in February 2024 at the onset of its\noutburst, recently attracted intentional or coincident follow-up X-ray\nobservations using Swift, NuSTAR and Chandra. We have performed a comprehensive\nanalysis of the relevant X-ray data to investigate the spectral and temporal\nproperties of this source between October 2000 and July 2024. Archival Chandra\ndata reveal a plausible additional outburst in 2005, followed by a quiescent\nstate in the next $\\sim$19 years. The X-ray spectra in both the quiescent and\noutburst phases are consistent with a thermal plasma spectrum with relatively\nhigh temperatures ($\\sim$10 keV) and prominent emission lines from both neutral\nand highly-ionized iron. A previously proposed low-mass X-ray binary/accretion\ndisk corona scenario for Swift J174610, based on XRISM observations near the\npeak of the 2024 outburst, is examined against the newly derived X-ray\nproperties and is disfavored, in particular due to its difficulty in explaining\nthe quiescent state spectrum. Instead, we suggest a symbiotic binary/recurrent\nnova scenario, which gains support from many of the observed X-ray properties\nof Swift J174610 and a close comparison with the famous Galactic recurrent nova\nRS Oph. If confirmed, Swift J174610 would represent the first nova detected in\nthe Galactic center, offering new insights into the otherwise elusive\npopulation of massive white dwarfs as well as wide binaries in the close\nvicinity of Sgr A*. Our findings call for multi-wavelength follow-up\nobservations for this highly unusual X-ray source."}
{"id": "2509.25902", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.25902", "abs": "https://arxiv.org/abs/2509.25902", "authors": ["Kunal Bhardwaj", "Asen Christov", "Sergey Karpov"], "title": "A Photometric Classifier for Tidal Disruption Events in Rubin LSST", "comment": null, "summary": "Tidal Disruption Events (TDEs) are astrophysical phenomena arising when stars\nare disrupted by supermassive black holes. The Vera C. Rubin Observatory Legacy\nSurvey of Space and Time (LSST), with its unprecedented depth and cadence, will\ndetect thousands of TDEs, motivating the need for robust photometric\nclassifiers capable of efficiently distinguishing these events from other\nextragalactic transients. We aim to develop and validate a machine learning\npipeline for photometric TDE identification in LSST-scale datasets. Our\nclassifier is designed to provide high precision and recall, enabling the\nconstruction of reliable TDE catalogs for multi-messenger follow-up and\nstatistical studies. Using the second Extended LSST Astronomical Time Series\nClassification Challenge (ELAsTiCC2) dataset, we fit Gaussian Processes (GP) to\nlight curves for feature extraction (e.g., color, rise/fade times, GP length\nscales). We then train and tune boosted decision-tree models (XGBoost) with a\ncustom scoring function emphasizing high-precision recovery of TDEs. Our\npipeline is tested on a diverse simulation of transient and variable events,\nincluding supernovae, active galactic nuclei, and superluminous supernovae. We\nachieve high precision (up to 95%) while maintaining competitive recall (about\n72%) for TDEs, with minimal contamination from non-TDE classes. Key predictive\nfeatures include post-peak colors and GP hyperparameters, reflecting\ncharacteristic timescales and spectral behaviors of TDEs. Our photometric\nclassifier provides a practical and scalable approach to identifying TDEs in\nforthcoming LSST data. By capturing essential color and temporal properties\nthrough GP-based feature extraction, it enables efficient construction of clean\nTDE candidate samples."}
