{"id": "2512.19763", "categories": ["astro-ph.IM", "astro-ph.EP", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2512.19763", "abs": "https://arxiv.org/abs/2512.19763", "authors": ["Ben Jacobson-Bell", "Steve Croft", "Ellie White", "Andrew P. V. Siemion", "Matthew Lebofsky", "David H. E. MacMahon"], "title": "Breakthrough Listen Observations of 3I/ATLAS with the Green Bank Telescope at 1-12 GHz", "comment": "3 pages, 1 figure, submitted to RNAAS", "summary": "3I/ATLAS, an interstellar object, made its closest approach to Earth on 2025 December 19. On 2025 December 18, the Breakthrough Listen program conducted a technosignature search toward 3I/ATLAS using the 100 m Robert C. Byrd Green Bank Telescope at 1-12 GHz. We report a nondetection of candidate signals down to the 100 mW level."}
{"id": "2512.19886", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2512.19886", "abs": "https://arxiv.org/abs/2512.19886", "authors": ["Fawad Kirmani", "Arjun Karki", "Steve Rodney", "Kyle Lackey", "Varsha P. Kulkarni", "John R. Rose", "Justin Pierel"], "title": "Detecting Strongly-Lensed Supernovae in Wide-field Space Telescope Imaging via Deep Learning", "comment": "8 pages, 11 figures", "summary": "Gravitationally lensed supernovae (SNe) are extremely rare and fade quickly; as a result, they are challenging to detect. To identify lensed SNe in large imaging datasets, current surveys primarily rely on the {\\it magnification} effect of gravitational lensing -- searching for transients that appear brighter than expected \\cite{c3}. In this work, we present a proof-of-concept study that uses a deep neural network to classify previously detected transients. Instead of relying on magnification, this network aims to identify doubly-imaged SNe with small separations ($<0.6$ arcsec) based on the {\\it distorted shape} of the transient object. This proposed method is most applicable to space-based imaging surveys from wide-field imaging observatories such as the upcoming Roman Space Telescope. To train and test our network, we use archival Hubble Space Telescope (HST) imaging surveys. Due to the extreme rarity of lensed SNe, we cannot train a neural network on actual lensed SN data. Instead, we have used HST imaging data to generate simulated imaging datasets for both training and testing. Our simulations use astrophysical priors to define the separations, relative brightnesses, and colors of each multiply-imaged SN. We have also simulated false positives (image artifacts and unlensed supernovae), which are much more prevalent than true lensed SN. Our deep learning model is trained to identify lensed SNe from a single difference image (i.e., not using multiple epochs). This network achieves a recall score of 99\\% on simulated gravitationally lensed SNe. The network successfully distinguishes between single supernovae (SNe) and those with gravitationally lensed SNe, as well as images with zero SNe, achieving recall scores of 90\\% and 96\\% for single-SNe and zero-SNe images, respectively."}
{"id": "2512.20264", "categories": ["astro-ph.IM", "physics.comp-ph"], "pdf": "https://arxiv.org/pdf/2512.20264", "abs": "https://arxiv.org/abs/2512.20264", "authors": ["Hemant Shukla"], "title": "The AI Scaling Wall of Diminishing Returns: Of LLMs, Electric Dogs, and General Relativity", "comment": null, "summary": "LLMs are hitting the scaling wall - compute grows 10-100x while accuracy barely moves. This note quantifies the slowdown and argues that the next leap in AI will come not from bigger models, but from smarter, more efficient ones."}
{"id": "2512.19800", "categories": ["astro-ph.HE", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2512.19800", "abs": "https://arxiv.org/abs/2512.19800", "authors": ["Wynn C. G. Ho", "Lucien Kuiper", "Cristobal M. Espinoza", "Timothy Leon", "Bennett Waybright", "Sebastien Guillot", "Zaven Arzoumanian", "Slavko Bogdanov", "Alice K. Harding"], "title": "New and updated timing models for seven young energetic X-ray pulsars, including the Big Glitcher PSR J0537-6910", "comment": "16 pages, 17 figures; accepted for publication in MNRAS", "summary": "We present new timing models and update our previous ones for the rotational evolution of seven young energetic pulsars, including four of the top five in spin-down luminosity Edot among all known pulsars. For each of the six pulsars that were monitored on a regular basis by NICER, their rotation phase-connected timing model covers the entire period of NICER observations, in many cases from 2017-2025. For PSR J0058-7218, which was only identified in 2021, we extend the baseline of its timing model by 3 years and report detections of its first three glitches. The timing model for PSR J0537-6910 over the entire 8 years of NICER monitoring is presented, including a total of 23 glitches; we also report its spin frequency and pulsed spectrum from a 2016 NuSTAR observation. For PSR B0540-69, its complete timing model from 2015-2025 is provided, including a braking index evolution from near 0 to 1.6 during this period. The 8-year timing model for PSR J1412+7922 (also known as Calvera) is reported, which includes a position that is consistent with that measured from imaging. For PSR J1811-1925, we present its 3.5-year timing model. For PSR J1813-1749, its incoherent timing model is extended through early 2025 using new Chandra observations. For PSR J1849-0001, its 7-year timing model is provided, including a position that is consistent with and more accurate than its imaging position and its first glitch that is one of the largest ever measured. Our timing models of these seven X-ray pulsars enable their study at other energies and in gravitational wave data."}
{"id": "2512.19835", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.19835", "abs": "https://arxiv.org/abs/2512.19835", "authors": ["A. Archer", "P. Bangale", "J. T. Bartkoske", "W. Benbow", "Y. Chen", "J. L. Christiansen", "A. J. Chromey", "A. Duerr", "M. Escobar Godoy", "J. Escudero Pedrosa", "Q. Feng", "S. Filbert", "L. Fortson", "A. Furniss", "W. Hanlon", "O. Hervet", "C. E. Hinrichs", "J. Holder", "T. B. Humensky", "M. Iskakova", "W. Jin", "M. N. Johnson", "E. Joshi", "M. Kertzman", "M. Kherlakian", "D. Kieda", "T. K. Kleiner", "N. Korzoun", "S. Kumar", "M. J. Lang", "M. Lundy", "G. Maier", "C. E McGrath", "P. Moriarty", "R. Mukherjee", "W. Ning", "R. A. Ong", "M. Pohl", "E. Pueschel", "J. Quinn", "P. L. Rabinowitz", "K. Ragan", "P. T. Reynolds", "D. Ribeiro", "E. Roache", "I. Sadeh", "L. Saha", "H. Salzmann", "G. H. Sembroski", "B. Shen", "M. Splettstoesser", "A. K. Talluri", "J. V. Tucci", "J. Valverde", "V. V. Vassiliev", "D. A. Williams", "S. L. Wong", "T. Yoshikoshi"], "title": "VERITAS contributions to the 39th International Cosmic Ray Conference", "comment": null, "summary": "Compilation of papers presented by the VERITAS Collaboration at the 39th International Cosmic Ray Conference (ICRC), held July 14 through July 24, 2025 in Geneva, Switzerland."}
{"id": "2512.19862", "categories": ["astro-ph.HE", "hep-ex"], "pdf": "https://arxiv.org/pdf/2512.19862", "abs": "https://arxiv.org/abs/2512.19862", "authors": ["Jiri Kvita", "Petr Baron"], "title": "Unfolding the Energy Spectrum of Ultra-High-Energy Cosmic Rays Using Pierre Auger Open Data", "comment": "9 pages, 7 figures", "summary": "We reconstruct the energy spectrum of ultra-high-energy cosmic rays using the publicly released Pierre Auger Observatory data set. Since event-level Monte Carlo truth information is not included in the open data, we develop a consistent procedure to regenerate a pseudo-Monte Carlo sample directly from the published quantities: the registered event counts $N$, the unfolded spectrum $N_\\mathrm{corr}$, and the detector response matrix $R_{ij}$ from the Auger 2020 spectrum data analysis. Using the row-normalized response matrix and the published unfolded spectrum as a truth prior, we construct an absolute-level migration matrix and generate the event-by-event truth and reconstructed-level pairs by drawing from a two-dimensional probability distribution function. The resulting sample statistically replicates the detector response properties of the Pierre Auger Surface Detector. This pseudo-MC sample allows for the application of classical unfolding techniques (bin-by-bin and iterative Bayesian unfolding via RooUnfold) as well as a machine-learning-based unfolding using OmniFold. We demonstrate that using such publicly available information this approach allows the full unfolding procedure."}
{"id": "2512.19876", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.19876", "abs": "https://arxiv.org/abs/2512.19876", "authors": ["C. Malacaria", "S. N. Pike", "A. D'Aì", "G. L. Israel", "L. Ducci", "R. E. Rothschild", "L. Stella", "R. Amato", "E. Ambrosi", "J. B. Coley", "F. Fürst", "M. Imbrogno", "P. Kretschmar", "D. K. Maniadakis", "A. Papitto", "P. Pradhan", "A. Rouco Escorial", "A. Simongini", "J. Stierhof", "B. F. West", "N. Zalot"], "title": "Double-hump spectrum, pulse profile dip, and pulsed fraction spectra from the low-accretion regime in the X-ray pulsar MAXI J0655-013", "comment": "10 pages, accepted on A&A", "summary": "Accreting X-ray pulsars (XRPs) undergo different physical regimes depending on the mass accretion rate. Recent observations have shown a dramatic change in the emission properties of this class of sources observed at low luminosity. We explore the timing and spectral properties of the XRP MAXI J0655-013 observed in the low-luminosity regime (about 5x$10^{33}$ erg/s) to witness the corresponding spectral shape and pulse profiles. We employ recent $XMM$ and $NuSTAR$ pointed observations of the MAXI J0655-013 X-ray activity during the low-luminosity stage. We explore several spectral models to fit the data and test theoretical expectations of the dramatic transition of the spectral shape. We study the pulsating nature of the source and find a phase-connected timing solution. We explore the energy-resolved pulse profiles and the derived energy-dependence of different pulsed fraction estimators ($PF_{minmax}$ and $PF_{rms}$). We also obtain $NuSTAR$ pulsed fraction spectra (PFS) at different luminosity regimes. MAXI J0655-013 spectrum is well fitted by a double Comptonization model, in agreement with recent observational results and theoretical expectations that explain the observed spectrum as being composed of two distinct bumps, each dominated by different polarization modes. We measure a spin period of $1081.86\\pm0.02$ s, consistent with the source spinning-up compared to previous observations, yielding an upper limit for the magnetic field strength of B<9x$10^{13}$ G. The pulse profiles show a single broad peak interrupted by a sharp dip that coincides with an increase in the hardness ratio. For the low-luminosity observation, the $PF_{minmax}$ increases with energy up to $\\sim100\\%$ in the 10-30 keV band, while the $PF_{rms}$ remains steady at $\\sim60\\%$. The PFS obtained at high luminosity shows evidence of an iron $Kα$ emission line but no indications of a cyclotron line."}
{"id": "2512.19892", "categories": ["astro-ph.HE", "astro-ph.SR", "physics.plasm-ph"], "pdf": "https://arxiv.org/pdf/2512.19892", "abs": "https://arxiv.org/abs/2512.19892", "authors": ["Jens F. Mahlmann", "Logan Eskildsen", "Arno Vanthieghem", "Dawei Dai", "Lorenzo Sironi"], "title": "Superluminal Wave Activation at Relativistic Magnetized Shocks", "comment": "13 pages, 6 figures, submitted to ApJL", "summary": "Fast radio bursts (FRBs) are extremely energetic radio transients, some are generated in magnetar magnetospheres and winds. Despite a growing number of observations, their emission mechanisms remain elusive. It has recently been proposed that Alfvénic perturbations can convert into superluminal O-modes at magnetized shocks and propagate in the downstream as a radio signal. We validate this superluminal wave activation mechanism using pair-plasma theory and particle-in-cell simulations. Theory predicts two different downstream modes: non-propagating Alfvénic perturbations and propagating superluminal O-modes. Superluminal wave activation occurs if the frequency of upstream perturbations in the shock frame exceeds the downstream plasma frequency. 1D particle-in-cell simulations confirm wavenumber and frequency jumps across the shock for upstream perturbations with frequencies well above the plasma frequency. Our simulations model both monochromatic upstream waves and broadband spectra with the downstream plasma frequency acting like a high-pass filter for superluminal O-modes. We discuss implications for FRB generation in relativistic magnetized winds."}
{"id": "2512.19907", "categories": ["astro-ph.HE", "hep-ph", "nucl-th"], "pdf": "https://arxiv.org/pdf/2512.19907", "abs": "https://arxiv.org/abs/2512.19907", "authors": ["Gábor Kasza", "János Takátsy", "György Wolf"], "title": "Astrophysical constraints on the cold equation of state of the strongly interacting matter", "comment": "submitted to EPJ Special Topic \"High density nuclear matter\"", "summary": "At present, the only experimental access to the properties of cold, dense strongly interacting matter is provided by astrophysical observations. Neutron stars are the only known systems in the Universe that reach densities several times higher than normal nuclear density at nearly zero temperature, making them unique laboratories for studying dense matter. Since most neutron-star observables are sensitive to the equation of state (EOS), observational data place stringent constraints on the EOS of strongly interacting matter. In this work, we investigate constraints arising from the mass of the heaviest observed neutron star (a black widow pulsar), perturbative QCD calculations at asymptotically high densities, NICER mass-radius measurements, and the tidal deformability inferred from the binary neutron star merger GW170817. We parametrize the EOS and allow its parameters to vary freely, using observational data to constrain the admissible parameter space. We find that neutron-star observations significantly restrict the EOS of dense strongly interacting matter. While NICER has already provided measurements for five pulsars, the associated uncertainties remain relatively large. In contrast, the existence of very massive neutron stars and constraints on the tidal deformability emerge as particularly powerful probes of the EOS."}
{"id": "2512.20265", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.20265", "abs": "https://arxiv.org/abs/2512.20265", "authors": ["R. Amato", "M. Bachetti", "R. Soria", "A. Gúrpide", "M. Imbrogno", "C. Salvaggio", "R. Salvaterra", "M. Del Santo", "S. Scaringi", "P. Casella", "A. Wolter"], "title": "Super-Eddington Accretion through a Multiwavelength Lens: Searching for Counterparts of Ultraluminous X-ray Sources", "comment": "4 pages. White paper submitted to the ESO call \"Expanding Horizons: Transforming Astronomy in the 2040s\"", "summary": "Ultraluminous X-ray sources (ULXs) represent the closest and most accessible laboratories to study sustained super-Eddington accretion onto compact objects. Over the past decade, the discoveries of coherent pulsations in a few ULXs has proved that these systems can be powered by accreting neutron stars, while the most luminous and distant ones remain strong candidates for hosting intermediate-mass black holes. Despite the increasing number of available X-ray data and the significant progress in theoretical modeling and simulations, our understanding of ULXs remains incomplete. Key open questions include the nature and mass distribution of the compact objects, the type of the donor stars, the geometry of the accretion disc and its contribution to the observed broadband emission, the mechanisms responsible for the wide spectral and temporal phenomenology, the duration of the super-Eddington accretion phase and its feedback on the host-galaxy environment. Future ground-based facilities will play a crucial role in addressing these issues."}
{"id": "2512.20455", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.20455", "abs": "https://arxiv.org/abs/2512.20455", "authors": ["K. Nobleson", "Churchil Dwivedi", "Shantanu Desai", "Bhal Chandra Joshi", "Himanshu Grover", "Debabrata Deb", "Vaishnavi Vyasraj", "Kunjal Vara", "Hemanga Tahbildar", "Abhimanyu Susobhanan", "Mayuresh Surnis", "Aman Srivastava", "Shubhit Sardana", "Keitaro Takahashi", "Amarnath", "P. Arumugam", "Manjari Bagchi", "Neelam Dhanda Batra", "Manoneeta Chakraborty", "Shaswata Chowdhury", "Shebin Jose Jacob", "Jibin Jose", "Shubham Kala", "Ryo Kato", "M. A. Krishnakumar", "Kuldeep Meena", "Avinash Kumar Paladi", "Arul Pandian", "Kaustubh Rai", "Prerna Rana", "Manpreet Singh", "Jaikhomba Singha", "Adya Shukla", "Pratik Tarafdar", "Prabu Thiagraj", "Zenia Zuraiq"], "title": "The Indian Pulsar Timing Array Data Release 2: II. Customised Single-Pulsar Noise Analysis and Noise Budget", "comment": "21 pages,Submitted for review", "summary": "We present the results of customised single-pulsar noise analysis of 27 millisecond pulsars from the second data release of the Indian Pulsar Timing Array (InPTA-DR2). We model various stochastic noise sources present in the dataset using stationary Gaussian processes and estimate the noise budget of the InPTA-DR2 using Bayesian inference, involving model selection, Fourier harmonics selection, and parameter estimation for each pulsar. We check the efficacy of our noise characterisation by performing the Anderson-Darling test for Gaussianity on the noise-subtracted residuals. We find that all 11 pulsars with time baseline $\\lesssim2.5\\,\\text{yr}$ show Gaussian residuals and do not have evidence for any red noise process in the optimal model, except for PSR J1944$+$0907, which shows presence of DM noise. PSRs J0437$-$4715, J1909$-$3744 and J1939$+$2134 show preference for the most complicated noise model, having achromatic and chromatic red noise processes. Only 4 out of 15 pulsars with time baseline $\\gtrsim2.5\\,\\text{yr}$ show significant non-Gaussianity in noise-subtracted residuals. We suspect that this may require more advanced methods to model noise processes properly. A comparative study of six pulsars with data removed near solar conjunctions showed deviations from the parameter estimates obtained with the original dataset, indicating potential bias in red noise processes due to unmodeled solar-wind effects. The results presented in this work remain broadly consistent with the InPTA-DR1 noise budget, with better constraints obtained on noise processes for several pulsars and support for achromatic red noise in PSR J1012$+$5307 due to the extended time baseline."}
{"id": "2512.20594", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.20594", "abs": "https://arxiv.org/abs/2512.20594", "authors": ["Angelina Sherman", "Ke Fang", "Dan Hooper"], "title": "The Sensitivity of PUEO to Cosmogenic Neutrinos and Exotic Physics Scenarios", "comment": null, "summary": "Several observatories designed to detect ultrahigh-energy neutrinos are planned for the next decade. The most imminent of these is the Payload for Ultrahigh Energy Observations (PUEO), a long-duration balloon-based experiment that will provide unprecedented sensitivity to neutrinos with energies in the range of ~ 1 - 1000 EeV. In this work, we assess the scientific reach of PUEO. In particular, we evaluate the sensitivity of this observatory to cosmogenic neutrinos and, in turn, to the proton fraction of the ultrahigh-energy cosmic-ray spectrum. We also consider the potential of PUEO to probe scenarios in which neutrinos are produced through the decays of ultraheavy dark matter particles or are radiated from cosmic strings. We find that PUEO will be able to constrain the proton composition of ultrahigh-energy cosmic rays in scenarios that feature very strong source evolution and in which protons are accelerated to extremely high energies. Although gamma-ray observations are generally more sensitive to decaying particles than neutrino observations, PUEO is expected to set the strongest neutrino-detector constraints above 10^19 eV. PUEO will also provide the strongest constraints on some models of cosmic strings."}
