{"id": "2510.21919", "categories": ["astro-ph.HE", "astro-ph.CO", "hep-ph", "85A30"], "pdf": "https://arxiv.org/pdf/2510.21919", "abs": "https://arxiv.org/abs/2510.21919", "authors": ["Fabiola Cocchiararo", "Alessia Franchini", "Alessandro Lupi", "Alberto Sesana"], "title": "Suppressed \"lump\" EM signature in radiation pressure dominated accreting massive black hole binaries", "comment": "10 pages, 6 figures, A&A submitted", "summary": "We investigate the impact of radiation pressure on electromagnetic signatures\nof accreting massive black hole binaries (MBHBs) at milli-parsec separations,\nusing 3D hyper-Lagrangian resolution hydrodynamical simulations. We model\nbinaries embedded in a self-gravitating circumbinary disc that evolves\nfollowing an adiabatic equation of state, including viscous heating and\nblack-body cooling. Focusing on binaries with a total mass of $10^6 \\,\nM_{\\odot}$, eccentricities $e=0,0.45,0.9$ and mass ratios $q=1, 0.7$, we find\nthat radiation pressure significantly affects both the spectral energy\ndistributions (SEDs) and the light curves (LCs). The emission from the\nmini-discs shifts from the optical towards UV frequencies and with a peak\nluminosity orders of magnitude higher, while the circumbinary disc becomes\ncolder and dimmer as a result of its geometrically thinner configuration.\nTemporal variability is affected as well: near UV and soft-X ray fluxes are\nhigher and more variable. Crucially, radiation pressure suppresses the\ncharacteristic \"lump\" formation in equal-mass circular systems, while a lump is\nformed for higher eccentricities without imprinting any modulation on the flux.\nIn the circular case we still find a modulation on the cavity edge timescale at\na frequency $0.36 \\, f_{\\rm K}$, while in eccentric binaries, only robust\norbital period modulations ($f=1,2 \\, f_{\\rm K}$) are observed, with no\nmodulation associated with the cavity orbital motion. Moreover, the enhanced\nemission from the mini-discs and streams due to radiation pressure, one\nredshifted, results in brighter flux in the optical G band, proving\ndetectability of MBHBs signatures even at higher redshift ($z=0.6-1.0$). Our\nresults reveal that radiation pressure plays a crucial role in shaping MBHBs\nspectral and time-domain features, with implications for their identification\nin time-domain surveys."}
{"id": "2510.21930", "categories": ["astro-ph.HE", "astro-ph.IM", "gr-qc"], "pdf": "https://arxiv.org/pdf/2510.21930", "abs": "https://arxiv.org/abs/2510.21930", "authors": ["Amazigh Ouzriat", "Viola Sordini", "Francesco Di Renzo"], "title": "Characterizing Low-Latency Sky Localization in Multi-Detector Gravitational-Wave Networks", "comment": "14 pages, 17 figures. Submitted to A&A", "summary": "Low-latency analyses of gravitational-wave (GW) data from LIGO, Virgo, and\nKAGRA enable rapid detection of compact binary coalescences (CBC) and prompt\nsky localization, essential for electromagnetic follow-up in multi-messenger\nastronomy. We evaluate the performance and limitations of low-latency sky\nlocalization using BAYESTAR algorithm, and investigate the impact of\nlow-significance Virgo triggers. We inject simulated CBC signals into\nGaussian-stationary noise and into Virgo data from the second part of the third\nLIGO-Virgo observing run (O3b), then reconstruct skymaps across multiple\ndetector network configurations. Localization accuracy is assessed using\nPercentile-Percentile plots, the Jaccard index, and the Kullback-Leibler\ndivergence. Binary neutron star mergers are statistically consistent with ideal\ncalibration, showing deviations below 3$\\sigma$, particularly when Virgo is\nincluded in the network, whereas skymaps for neutron star--black hole and\nbinary black hole mergers tend to be overconfident. Adding a third detector\ngenerally improves accuracy, but the searched area can degrade when Virgo's\nsignal-to-noise ratio is low (SNR $\\leq$ 5). For high-SNR events, relying on\ntwo detectors can mislocalize the source. Excluding Virgo can therefore cause\nthe HL skymap to miss the true location when Virgo has strong antenna response,\nin such cases a three-detector configuration is required to recover the correct\nposition and avoid misleading multi-messenger follow-up. We introduce\ndiagnostics to flag problematic skymaps and apply them to O3 public alerts,\nrecovering simulation-predicted trends and flagging a few anomalous\nmorphologies. The results are relevant for improving rapid vetting of GW alerts\nand guiding observational strategies in multi-messenger astronomy."}
{"id": "2510.21988", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.21988", "abs": "https://arxiv.org/abs/2510.21988", "authors": ["O. Petruk", "R. Bandiera", "T. Kuzyo", "R. Brose", "A. Ingallinera"], "title": "On the acceleration of cosmic rays at the post-adiabatic shocks of supernova remnants", "comment": "submitted to A&A, comments are welcome", "summary": "When a supernova remnant (SNR) interacts with the dense material of an\ninterstellar cloud, its shock wave decelerates rapidly, and the post-shock\ntemperature drops to levels that permit efficient cooling of the shocked\nplasma. At this stage, the shock enters the post-adiabatic phase of its\nevolution. During this phase, the internal structure of the SNR undergoes\nsignificant changes, particularly in the immediate post-shock region, at\nspatial scales relevant to cosmic ray acceleration. Once the shock enters the\npost-adiabatic regime, the efficiency of diffusive shock acceleration increases\ndue to a higher plasma compression, to a change in the direction of the\nadvection velocity, and to an increased rate of momentum gain. As a result, the\nmomentum spectrum of relativistic particles hardens, deviating from a pure\npower law at high energies. Particles could reach higher maximum values\ncompared to classical predictions. We highlight the dynamics of post-adiabatic\nflows in SNRs, study their impact on particle acceleration, and present\nsupporting observational evidence in the radio band."}
{"id": "2510.22211", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.22211", "abs": "https://arxiv.org/abs/2510.22211", "authors": ["Jiazheng Zhu", "Ning Jiang", "Yibo Wang", "Tinggui Wang", "Luming Sun", "Shiyan Zhong", "Yuhan Yao", "Ryan Chornock", "Lixin Dai", "Jianwei Lyu", "Xinwen Shu", "Christoffer Fremling", "Erica Hammerstein", "Shifeng Huang", "Wenkai Li", "Bei You"], "title": "Ultraviolet Spectral Evidence for Ansky as a Slowly Evolving Featureless Tidal Disruption Event with Quasi-periodic Eruptions", "comment": "14 pages, 9 figures, accepted for publication in ApJL", "summary": "X-ray quasi-periodic eruptions (QPEs) are rare and enigmatic phenomena that\nincreasingly show a connection to tidal disruption events (TDEs). However, the\nrecently discovered QPEs in ZTF19acnskyy (\"Ansky\") appear to be linked to an\nactive galactic nucleus (AGN) rather than a TDE, as their slow decay and\nAGN-like variability differ markedly from that of typical TDEs. This finding\nmay imply broader formation channels for QPEs. To further investigate Ansky's\nnature, we obtained a timely ultraviolet (UV) spectrum, which reveals a\nfeatureless, TDE-like spectrum devoid of broad optical or UV emission lines.\nAdditionally, the steep UV continuum, fitted by a power law with an index of\n-2.6, aligns more closely with TDEs than with AGNs. Compared to other\nfeatureless TDEs, Ansky exhibits a significantly lower blackbody luminosity\n(10^43 erg s^-1) and much longer rise and decay timescales, suggesting a\ndistinct TDE subclass. An offset TDE involving an intermediate-mass black hole\nis unlikely, given its position consistent with the galactic center with a 3\nsigma upper limit of 54 pc. Instead, we propose that Ansky may result from the\ntidal disruption of a post-main-sequence star by a typical supermassive black\nhole. Our findings strengthen the growing evidence for TDE-QPE associations,\nalthough other formation channels for QPEs remain plausible and await future\nobservational efforts."}
{"id": "2510.21750", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2510.21750", "abs": "https://arxiv.org/abs/2510.21750", "authors": ["Thomas Boch", "Caroline Bot", "Pierre Fernique"], "title": "Generating background-corrected VPHAS+ HiPS with Montage", "comment": null, "summary": "We present a technique for creating background-corrected HiPS (Hierarchical\nProgressive Surveys) from VPHAS+ images using the Montage toolkit. By combining\nadvanced background correction methods and HiPS generation workflows, we\nproduced high-quality color HiPS from the VST Photometric H-alpha Survey of the\nSouthern Galactic Plane and Bulge (VPHAS+). These HiPS have been made publicly\navailable through the HiPS network and serve as an invaluable addition to the\nHiPS ecosystem for astronomers worldwide."}
{"id": "2510.22290", "categories": ["astro-ph.HE", "gr-qc", "hep-ph"], "pdf": "https://arxiv.org/pdf/2510.22290", "abs": "https://arxiv.org/abs/2510.22290", "authors": ["Thibeau Wouters", "Anna Puecher", "Peter T. H. Pang", "Tim Dietrich"], "title": "Analyzing GW231109_235456 and understanding its potential implications for population studies, nuclear physics, and multi-messenger astronomy", "comment": "13 pages, 7 figures, 4 tables", "summary": "We study the gravitational-wave trigger GW231109_235456, a sub-threshold\nbinary neutron star merger candidate observed in the first part of the fourth\nobserving run of the LIGO-Virgo-KAGRA collaboration. Assuming the trigger is of\nastrophysical origin, we analyze it using state-of-the-art waveform models and\ninvestigate the robustness of the inferred source parameters under different\nprior choices in Bayesian inference. We assess the implications for population\nstudies, nuclear physics, and multi-messenger astronomy. Analysing the\ncomponent masses, we find that GW231109_235456 supports the proposed double\nGaussian mass distribution of neutron star masses. Moreover, we find that the\nremnant most likely collapsed promptly to a black hole and that, because of the\nlarge distance, a possible kilonova connected to the merger was noticeably\ndimmer than AT2017gfo. In addition, we provide constraints on the equation of\nstate from GW231109_235456 alone, as well as combined with GW170817 and\nGW190425. In our projections for the future, we simulate a similar event using\nthe upcoming generation of gravitational-wave detectors. Our findings indicate\nthat we can constrain the neutron star radius with an accuracy of 400 meters\nusing the Einstein Telescope alone, or 300 meters when combined with the Cosmic\nExplorer, both at 90% credibility."}
{"id": "2510.21925", "categories": ["astro-ph.IM", "astro-ph.HE", "hep-ex"], "pdf": "https://arxiv.org/pdf/2510.21925", "abs": "https://arxiv.org/abs/2510.21925", "authors": ["Martin Ravn", "Christian Glaser", "Thorsten Glüsenkamp", "Ayca Öcelikkale", "Alan Coleman"], "title": "Likelihood Reconstruction for Radio Detectors of Neutrinos and Cosmic Rays", "comment": null, "summary": "Ultra-high-energy neutrinos and cosmic rays are excellent probes of\nastroparticle physics phenomena. For astroparticle physics analyses, robust and\naccurate reconstruction of signal parameters such as arrival direction and\nenergy is essential. Radio detection is an established detector concept\nexplored by many observatories; however, current reconstruction methods ignore\nbin-to-bin noise correlations, which limits reconstruction resolution and, so\nfar, has prevented calculations of event-by-event uncertainties. In this work,\nwe present a likelihood description of neutrino or cosmic-ray signals in radio\ndetectors with correlated noise, as present in all neutrino and cosmic-ray\nradio detectors. We demonstrate, with simulation studies of both neutrinos and\ncosmic-ray radio signals, that signal parameters such as energy and direction,\nincluding event-by-event uncertainties with correct coverage, can be obtained.\nThis method reduces reconstruction uncertainties and biases compared to\nprevious approaches. Additionally, the Likelihood can be used for event\nselection and enables differentiable end-to-end detector optimization. The\nreconstruction code is available through the open-source software NuRadioReco."}
{"id": "2510.22412", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.22412", "abs": "https://arxiv.org/abs/2510.22412", "authors": ["Arpan Aryam John", "Krushna Govind Shete", "Shabnam Iyyani", "Saptarshi Bej"], "title": "Multivariate Time Series Classification of Fermi-Detected Gamma-Ray Transients Using Convolutional-Recurrent Neural Networks", "comment": "19 pages, 11 Figures, under review", "summary": "Fermi Gamma-ray Space Telescope has detected a diverse range of gamma-ray\ntransients since its launch in 2008. Over the years, Fermi has accumulated an\nextensive public archive of transient events. Traditional classification\nmethods for these events typically rely on fixed thresholds, localisation\naccuracy, and characteristic light curve features. However, in the current era\nof time-critical, multi-wavelength, and multi-messenger astronomy, rapid and\nreliable classification is essential to enable timely follow-up and coordinated\nobservations. In this work, we develop and present two deep learning-based\nclassifiers that integrate convolutional and recurrent neural network\narchitectures. Using multivariate time-series inputs derived from Fermi-GBM\ndata, our models are trained to distinguish among four classes of gamma-ray\ntransients: Gamma-Ray Bursts (GRBs), Terrestrial Gamma-ray Flashes (TGFs),\nSolar Flares (SFLAREs), and Soft Gamma Repeaters (SGRs). Furthermore, the\nmodels are designed to flag events that do not conform to any of these\ncategories, providing a pathway for identifying potentially new or rare\ntransient types. Training was conducted using a carefully curated subset of\nhigh-confidence Fermi events. The resulting models achieve an overall\nclassification accuracy of 93%, and identify approximately 2.5% of the triggers\nas outliers of unknown origin. When applied to Fermi events with uncertain\nclassifications, our models assign 60% of them to the TGF category with over\n60% confidence. These results demonstrate that incorporating deep\nlearning-based classification into onboard or automated data pipelines can\nsignificantly enhance transient identification, minimize misclassification, and\nimprove the discovery potential of new phenomena in future high-energy\nastrophysics missions."}
{"id": "2510.22190", "categories": ["astro-ph.IM", "astro-ph.CO", "cs.LG"], "pdf": "https://arxiv.org/pdf/2510.22190", "abs": "https://arxiv.org/abs/2510.22190", "authors": ["M. S. Hossain", "M. S. H. Shahal", "A. Khan", "K. M. B. Asad", "P. Saikia", "F. Akter", "A. Ali", "M. A. Amin", "A. Momen", "M. Hasan", "A. K. M. M. Rahman"], "title": "RGC: a radio AGN classifier based on deep learning. I. A semi-supervised model for the VLA images of bent radio AGNs", "comment": "12 pages, 7 pages appendix, 6 figures, submitted to A&A", "summary": "Wide-angle tail (WAT) and narrow-angle tail (NAT) radio active galactic\nnuclei (RAGNs) are key tracers of dense environments in galaxy groups and\nclusters, yet no machine-learning classifier of bent RAGNs has been trained\nusing both unlabeled data and purely visually inspected labels. We release the\nRGC Python package, which includes two newly preprocessed labeled datasets of\n639 WATs and NATs derived from a publicly available catalog of visually\ninspected sources, along with a semi-supervised RGC model that leverages 20,000\nunlabeled RAGNs. The two labeled datasets in RGC were preprocessed using PyBDSF\nwhich retains spurious sources, and Photutils which removes them. The RGC model\nintegrates the self-supervised framework BYOL (Bootstrap YOur Latent) with the\nsupervised E2CNN (E2-equivariant Convolutional Neural Network) to form a\nsemi-supervised binary classifier. The RGC model, when trained and evaluated on\na dataset devoid of spurious sources, reaches peak performance, attaining an\naccuracy of 88.88% along with F1-scores of 0.90 for WATs and 0.85 for NATs. The\nmodel's attention patterns amid class imbalance suggest that this work can\nserve as a stepping stone toward developing physics-informed foundation models\ncapable of identifying a broad range of AGN physical properties."}
{"id": "2510.22453", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.22453", "abs": "https://arxiv.org/abs/2510.22453", "authors": ["D. Ł. Król", "G. Fabbiano", "M. Elvis", "A. Trindade Falcão", "R. Middei", "D. Rosario", "R. Davies", "T. Shimizu", "D. Hill"], "title": "Probing AGN-ISM Feedback through Extended X-ray Emission in ESO 137-G034", "comment": "submitted to ApJ", "summary": "We present a detailed analysis of the X-ray emission of the Compton-thick\n(CT) AGN ESO 137-G034 based on deep ($\\sim230$ ks) Chandra observations. As in\nother CT AGNs, the morphology of the emission is elongated, approximately\nfollowing the [O III] ionization bicone. With spatially resolved spectral\nmodeling, we show that the extended emission within the bi-cone regions { is\nmost readily explained} as from a mixture of photo-ionized gas and shock-heated\nplasma, reflecting the combined effects of radiative and kinematic AGN\nfeedback. By comparing the morphology of the { X-ray emission in narrow\nspectral bands and that of the 3 cm radio jet, we find suggestive evidence of\nthermal, possibly shocked emission associated with the SE termination of the\nradio jet. This interpretation is also supported by the lack of [O III]\nrelative to the $0.3-3.0$ keV flux in the inner $3^{\\prime\\prime}$ ($\\sim600$\npc) of the SE cone, which would be consistent with an additional thermal X-ray\ncomponent on top of the photonized emission of an outflowing wind. A similar\neffect is only seen within the inner $1^{\\prime\\prime}$ ($200$ pc) of the NW\ncone. In the radial profile of the [OIII]/X-ray flux ratio and the X-ray\nhardness ratio within the inner $\\sim3^{\\prime\\prime}$ ($\\sim600$ pc) of the SE\ncone we see an asymmetry, with no counterpart in the NW cone. We detect soft\nextended X-ray emission in the cross-cones which may originate from the\ninteraction of an embedded radio jet with a clumpy interstellar medium (ISM).\n}These results highlight the { importance of both} radiative and mechanical\nfeedback in shaping the circumnuclear environment of ESO 137-G034."}
{"id": "2510.22527", "categories": ["astro-ph.IM", "astro-ph.GA", "cs.LG"], "pdf": "https://arxiv.org/pdf/2510.22527", "abs": "https://arxiv.org/abs/2510.22527", "authors": ["Morgan Himes", "Samiksha Krishnamurthy", "Andrew Lizarraga", "Srinath Saikrishnan", "Vikram Seenivasan", "Jonathan Soriano", "Ying Nian Wu", "Tuan Do"], "title": "Multi-Modal Masked Autoencoders for Learning Image-Spectrum Associations for Galaxy Evolution and Cosmology", "comment": "8 pages, 3 figures, 1 table, accepted to NeurIPS 2025 Workshop ML4PS", "summary": "Upcoming surveys will produce billions of galaxy images but comparatively few\nspectra, motivating models that learn cross-modal representations. We build a\ndataset of 134,533 galaxy images (HSC-PDR2) and spectra (DESI-DR1) and adapt a\nMulti-Modal Masked Autoencoder (MMAE) to embed both images and spectra in a\nshared representation. The MMAE is a transformer-based architecture, which we\ntrain by masking 75% of the data and reconstructing missing image and spectral\ntokens. We use this model to test three applications: spectral and image\nreconstruction from heavily masked data and redshift regression from images\nalone. It recovers key physical features, such as galaxy shapes, atomic\nemission line peaks, and broad continuum slopes, though it struggles with fine\nimage details and line strengths. For redshift regression, the MMAE performs\ncomparably or better than prior multi-modal models in terms of prediction\nscatter even when missing spectra in testing. These results highlight both the\npotential and limitations of masked autoencoders in astrophysics and motivate\nextensions to additional modalities, such as text, for foundation models."}
{"id": "2510.22573", "categories": ["astro-ph.HE", "gr-qc", "hep-ph"], "pdf": "https://arxiv.org/pdf/2510.22573", "abs": "https://arxiv.org/abs/2510.22573", "authors": ["Jiang-Chuan Yu", "Yan Cao", "Zexin Hu", "Lijing Shao"], "title": "Detecting ultralight dark matter in the Galactic Center with pulsars around Sgr A*", "comment": null, "summary": "Ultralight dark matter (ULDM) model is a leading dark matter candidate that\narises naturally in extensions of the Standard Model. In the Galactic Center,\nULDM manifests as dense hydrogen-like boson clouds or self-gravitating soliton\ncores. We present the first study of the gravitational effects of these ULDM\nstructures on pulsar orbits around Sgr A*, using pulsar timing as a precision\ndynamical probe, based on a comprehensive and practical framework that includes\nvarious kinds of black hole and orbital parameters. Our analysis shows that\nlong-term pulsar monitoring -- one of the key objectives of future SKA science\n-- could detect a boson cloud with a total mass as low as $O(M_\\odot)$ for\nboson mass $m \\sim 10^{-18}\\,\\mathrm{eV}$, and probe a wide range of soliton\ncore masses in the lower-mass regime, assuming a conservative timing precision\nof $\\sigma_{\\mathrm{TOA}}=1\\,\\mathrm{ms}$."}
{"id": "2510.22900", "categories": ["astro-ph.IM", "astro-ph.GA", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2510.22900", "abs": "https://arxiv.org/abs/2510.22900", "authors": ["Noor Aftab", "Xunhe", "Zhang", "Sean Walker", "Dennis di Cicco", "David R. Mittelman", "Sanya Gupta", "Andrew K. Saydjari", "Mary Putman", "David Schiminovich"], "title": "The MDW Hα Sky Survey: Data Release 1", "comment": null, "summary": "The Mittelman-di Cicco-Walker (MDW) H$\\alpha$ Sky Survey is an\nautonomously-operated all-sky narrow-band (3nm) H$\\alpha$ imaging survey. The\nsurvey was founded by amateur astronomers and the northern sky (Decl. $\\geq$\n0$^\\circ$) is presented here in its second stage of refinement for academic\nuse. Each 3.6$\\times$3.6 sq. deg MDW field has 12 20-minute individual\nexposures with a pixel scale of 3.6\", a typical PSF of 6\", and a stack point\nsource depth of 16-17 magnitudes. The northern MDW Survey Data Release 1 (DR1)\nincludes: calibrated and raw mean and individual images, star-removed mean\nfields, and point source catalogs for all images matched to Data Release 1 of\nthe Panoramic Survey Telescope and Rapid Response System (Pan-STARRS1) and the\nINT Galactic Plane Survey (IGAPS). Our initial study of H$\\alpha$ filament\nwidths finds a typical FWHM of 30-45\" in the Lyra region. The matched catalogs\n(with a median match distance of ~0.5\"), combined with our distinctive\nnarrow-band photometry, are used to identify H$\\alpha$ variable and excess\nsources. These initial studies highlight some of the many scientific uses of\nthe MDW H$\\alpha$ survey."}
{"id": "2510.22698", "categories": ["astro-ph.HE", "astro-ph.SR", "gr-qc"], "pdf": "https://arxiv.org/pdf/2510.22698", "abs": "https://arxiv.org/abs/2510.22698", "authors": ["Yuan-Zhu Wang", "Yin-Jie Li", "Shi-Jie Gao", "Shao-Peng Tang", "Yi-Zhong Fan"], "title": "A new group of low-spin $50-70M_\\odot$ Black Holes and the high pair-instability mass cutoff", "comment": "8 pages, 5 figures. Comments are welcome", "summary": "Pair-instability supernovae (PISN) will not leave compact remnants and hence\nyield a mass gap of the black holes. Though a transition point of $\\sim\n45M_\\odot$ between low-spin and high-spin black holes groups had been inferred\nwith gravitational wave data since 2022 and then interpreted as the signature\nof the PISN mass gap, here we report the emergence of a new group of low-spin\nbut massive ($\\sim 50-70M_\\odot$) black holes, which are hard to produce via\nhierarchical mergers, in the latest GWTC-4.0 data. Correspondingly, the mass\ncutoff of the low-spin black holes shifts to $68.5^{+19.8}_{-18.5}M_\\odot$\n($90\\%$ credibility), which is consistent with the PISN model for a low\n$^{12}C(\\alpha,\\gamma)^{16}O$ reaction rate of $S_{300{\\rm keV}} \\sim 110~{\\rm\nkeV~b}$. Despite that the massive single-star collapse/dynamical capture origin\ncan not be reliably tested at this moment, a high pair-instability mass cutoff\n$M_{\\rm low}\\sim 70M_\\odot$ may be favored for its capability of accounting for\nthe rather low observation rate of hydrogen-less super-luminous supernovae."}
{"id": "2510.23219", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.23219", "abs": "https://arxiv.org/abs/2510.23219", "authors": ["Fraser Bradfield"], "title": "Development of the Reconstruction Procedure of the Fluorescence detector Array of Single-pixel Telescopes for measuring Ultra-High Energy Cosmic Rays", "comment": "PhD thesis, 280 pages, 168 figures", "summary": "The Fluorescence detector Array of Single-pixel Telescopes aims to deploy an\narray of simplified, autonomous fluorescence telescopes over an area of\n$\\sim60,000$ km$^{2}$ to observe ultra-high energy cosmic rays. The\nunprecedented size of such an array will enable measurements of cosmic rays\nwith energies above 10$^{20}$ eV with large statistics, providing new insights\ninto UHECR sources. With a single FAST telescope consisting of just four\nphotomultiplier tubes, traditional techniques to reconstruct observed extensive\nair showers are not applicable. Instead, FAST utilises a top-down approach\nwhere simulations are directly compared to data and the best match chosen via a\nmaximum likelihood estimation. This method, known as the \"top-down\nreconstruction (TDR)\", requires an accurate \"first guess\" of the shower\nparameters to be successful. In this work, improvements to the efficiency and\nprecision of the TDR are made and two different first guess estimation methods\nare investigated. The combined performance of a machine-learning-based first\nguess and improved TDR is shown to achieve resolutions in the shower arrival\ndirection, depth of shower maximum and shower energy of $\\sim2^\\circ$, $\\sim30$\ng cm$^{-2}$ and $\\sim7\\%$ respectively for simulated events observed from two\nor more locations. The improved reconstruction is then applied to data from the\ncurrent FAST prototype installations at the Pierre Auger Observatory and\nTelescope Array experiment. Using these results, the first measurements of the\nUHECR energy spectrum and composition by FAST are presented."}
{"id": "2510.22776", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.22776", "abs": "https://arxiv.org/abs/2510.22776", "authors": ["Zhen Xie", "Zhipeng Zhang", "Ruizhi Yang"], "title": "Prospects for Observing the Microquasar SS 433 with the LACT Array", "comment": "8 pages, 7 figures", "summary": "We investigate the observational capabilities of the upcoming LACT Cherenkov\ntelescope array for the microquasar SS 433 through detailed simulations. Our\nresults indicate that a detection significance of about 5-sigma can be achieved\nwith approximately 30 hours of observation. The array is capable of spatially\nresolving the eastern and western jets, and-based on the LHAASO spectral and\nmorphological findings-can distinguish the central hadronic component after\nroughly 100 h of observation. We further examine its ability to distinguish\nbetween the H.E.S.S. and LHAASO spectral models. These findings demonstrate\nLACT's strong potential to probe the spatial and spectral structure of SS 433\nat very high energies, providing valuable insights into particle acceleration\nin PeVatrons and the radiation mechanisms of microquasars."}
{"id": "2510.23339", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2510.23339", "abs": "https://arxiv.org/abs/2510.23339", "authors": ["Jonas G. Kühn", "Ruben Tandon", "Lucas Marquis", "Liurong Lin", "Derya Öztürk Çetni", "Iljadin Manurung", "Axel Potier", "Laurent Jolissaint", "Audrey Baur", "Daniele Piazza", "Mathias Brändli", "Martin Rieder"], "title": "The Programmable Liquid-crystal Active Coronagraphic Imager for the 4-m DAG telescope (PLACID) instrument: installation and commissioning update", "comment": "10 pages, 9 figures, SPIE Optics + Photonics: Techniques and\n  Instrumentation for Detection of Exoplanets XII (San Diego 2025), Paper\n  136270Z. arXiv admin note: substantial text overlap with arXiv:2408.10893", "summary": "The Programmable Liquid-crystal Active Coronagraphic Imager for the DAG\ntelescope (PLACID) instrument is a novel high-contrast direct imaging facility\nthat was recently installed on the new Turkish 4-m DAG telescope. In brief,\nPLACID consists in a fore-optics coronagraphic intermediate stage platform,\ninstalled in-between the TROIA XAO system and the DIRAC HAWAII-1RG focal-plane\narray. The PLACID instrument was delivered to ATASAM campus facilities in March\nof 2024, and transported to summit in October of 2024. In February of 2025, the\nPLACID optical breadboard was craned to the DAG observatory floor, and\nsuccessfully installed on the optical table of the diffraction-limited Nasmyth\nplatform of the 4-m telescope. Following the official DAG Acceptance milestone\nin the spring of 2025, Assembly, Integration and Validation (AIV) activities\nhave started in July of 2025, when PLACID was cabled up with all active\ncomponents fully interfaced and tested for functional integrity. When on-sky by\nearly 2026, PLACID will be the world's first active coronagraph system,\nfielding a customized spatial light modulator (SLM) acting as a dynamically\nprogrammable focal-plane phase mask (FPM) coronagraph from H- to Ks-band. This\nwill provide a wealth of novel options to observers, among which software-only\nabilities to change or re-align the FPM pattern in function of observational\nconditions or science requirements. Future features will include non-common\npath aberrations (NCPA) self-calibration, angular differential imaging (ADI)\ncoronagraphy for binary or triple stars, as well as coherent differential\nimaging (CDI). We hereby present the PLACID AIV activities that have taken\nplace over the last twelve months, and the next steps for commissioning the\ninstrument internally, and on-sky later this year."}
{"id": "2510.22891", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.22891", "abs": "https://arxiv.org/abs/2510.22891", "authors": ["Jia Ren", "Xiao-Yan Li", "Yun Wang", "Lu-Lu Zhang", "Da-Ming Wei", "Zi-Gao Dai", "Zhi-Ping Jin", "Da-Bin Lin"], "title": "Stellar Wind-Blown Bubbles as Environments for Late-Time Rebrightening of Gamma-Ray Burst Afterglows", "comment": "Submitted to ApJL, ASGARD Code public version 4.2-r1 well be released\n  in https://github.com/mikuru1096/ASGARD_GRBAfterglow after final check.\n  Comments and Feedbacks are wellcome", "summary": "We presented the multi-wavelength afterglow fitting results for three events\nthat exhibit late afterglow re-brightening behavior: EP240414a ($z=0.402$), GRB\n240529A ($z=2.695$), and GRB 240218A ($z=6.782$), which span a broad range of\nredshifts, from the local to the high-redshift universe. We prove that the\npeculiar afterglow light curves of three bursts can be well fitted by\nstructured jets propagated in free-to-shocked stellar wind environment of\nstellar wind blown bubbles. This scenario offers a self-consistent explanation\nfor the observed subclass of afterglows that exhibit rebrightening that\ncharacterized by steep rises and rapid decays. It also provides a unified\nsolution for such events and offers pathways to study both the jet generation\nmechanism and the propagation process of jets through the envelope of\nprogenitor. This study reveals that the structured jets produced by such events\nexhibit a narrow jet core and a steep angle-dependent energy decay index,\nsuggesting highly magnetized jets. The derived transition radii from free\nstellar winds to shocked stellar winds for all three events are smaller than\n0.5 pc, with statistical analysis of similar events indicating a median value\nof 0.1 pc, which conflicts with numerical simulation results. We anticipate\nthat future observations by EP/SVOM missions will enhance the understanding of\nanalogous events and further reveil information about progenitors and the\ncircum-environments."}
{"id": "2510.23400", "categories": ["astro-ph.IM", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2510.23400", "abs": "https://arxiv.org/abs/2510.23400", "authors": ["S. Riggi", "P. Romano", "A. Pilzer", "U. Becciani"], "title": "Solar flare forecasting with foundational transformer models across image, video, and time-series modalities", "comment": "15 pages, 4 figures", "summary": "We present a comparative study of transformer-based architectures for solar\nflare forecasting using heterogeneous data modalities, including images, video\nsequences, and time-series observations. Our analysis evaluates three recent\nfoundational models - SigLIP2 for image encoding, VideoMAE for spatio-temporal\nvideo representation, and Moirai2 for multivariate time-series forecasting -\napplied to publicly available datasets of solar magnetograms from the SDO/HMI\nmission and soft X-ray fluxes acquired by GOES satellites. All models are\ntrained and validated under consistent data splits and evaluation criteria,\nwith the goal of assessing the strengths and limitations of transformer\nbackbones across spatial and temporal representations of solar activity. We\ninvestigate multiple loss formulations (weighted BCE, focal, and\nscore-oriented) and training balance strategies to mitigate class imbalance\ntypical of flare datasets. Results show that while both SigLIP2 and VideoMAE\nachieve typical performance on image and video data (True Skill Statistic\nTSS~0.60-0.65), the time-series model Moirai2 reaches superior forecasting\nskill (TSS~0.74) using irradiance-based temporal evolution alone. These\nfindings highlight the potential of pretrained transformer architectures and\ncross-modal learning for advancing operational space weather forecasting,\npaving the way toward unified multimodal models that integrate visual and\ntemporal information."}
{"id": "2510.22910", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.22910", "abs": "https://arxiv.org/abs/2510.22910", "authors": ["Victoria A. Blackmon", "Maura A. McLaughlin", "De Zhao", "Jianping Yuan", "Qingdong Wu", "Chen-Chen Miao", "Meng-Yao Xue", "Di Li", "Wei-Wei Zhu"], "title": "Discovery and Timing Follow-Up of Two FAST-Discovered Pulsars from the FAST CRAFTS Survey", "comment": "9 pages, 4 figures, 2 tables", "summary": "We present the results of Green Bank Telescope (GBT) observations of two\npulsars discovered with the Five-hundred-meter Aperture Spherical Radio\nTelescope (FAST) during the 19-beam Commensal Radio Astronomy FasT Survey\n(CRAFTS). We highlight the first timing solutions, pulse profiles, flux\ndensities, and polarization measurements at 820 MHz for PSR J0535-0231, with a\nspin period of 415 ms, and PSR J1816-0518, with a spin period of 1.93 s, from a\nyear-long follow-up campaign. PSR J0535-0231 appears to be partially recycled,\nbut isolated, and likely belongs to the class of disrupted recycled pulsars\n(DRPs). We find that the two widely used electron density models, NE2001 and\nYMW16, both fall short of accurately modeling the line-of-sight to PSR\nJ0535-0231, as the maximum dispersion measure (DM) predicted by both models is\nlower than the pulsar's DM of 117.6 pc cm$^{-3}$. Finally, we place both pulsar\ndiscoveries in the context of other FAST pulsars discovered in the CRAFTS\nsurvey and of the currently known pulsar population, in general, and discuss\nways in which future FAST discoveries of faint, distant pulsars might\nfacilitate the development of improved versions of the aforementioned electron\ndensity models in certain regions of our Galaxy."}
{"id": "2510.23435", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2510.23435", "abs": "https://arxiv.org/abs/2510.23435", "authors": ["K. Huynh", "V. Bajaj", "J. Mack", "A. Calamida"], "title": "Improved UVIS Aperture Corrections derived from Focus Diverse PSF Maps", "comment": "40 pages, 23 figures", "summary": "In crowded fields, small-aperture photometry can reduce contamination errors\nfrom neighboring sources compared to larger aperture photometry. However, the\nUVIS encircled energy (EE) varies with detector position and focus variations\non orbital timescales for aperture radii less than 10 pixels ($\\sim$0.4\narcseconds). Using a set of focus-diverse empirical PSFs by Anderson (2018), we\ncompute 2D spatial maps of the aperture correction between 5-10 pixels and find\na maximum change of $\\sim$0.01 mag over all focus levels for a given detector\nposition. The upper-left and lower-right corners of the UVIS detector are more\nfocus-sensitive than the rest of the field of view, where the mean correction\nis systematically $\\sim$0.01 mag higher in Amp A for bluer filters (F275W,\nF336W, F438W) and $\\sim$0.01 mag higher in Amp D for redder filters (F606W,\nF814W) at all focus levels. We test the new aperture correction maps in\nglobular clusters, and we find reduced scatter, better agreement between the\ntwo CCDs, and a small shift in the absolute photometry when compared to a\nsingle (constant) aperture correction per image. These improvements are\nspecific to photometry with apertures $<$ 10 pixels in radius; results from\nlarger apertures are not affected. Using published EE tables can introduce\nsystematic uncertainties in absolute photometry due to its tendency to vary\nwith detector position and focus level, with larger errors for smaller\napertures. Users requiring photometric accuracy better than $\\sim$1% for small\napertures can use isolated stars in the individual FLT/FLC frames (or PSF\ncutouts at a similar detector position and focus level) to compute encircled\nenergy corrections and accurately account for the amount of flux at radii\nlarger than their photometric apertures."}
{"id": "2510.22914", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.22914", "abs": "https://arxiv.org/abs/2510.22914", "authors": ["Yang-Dong-Jun Ou", "Hou-Jun Lü", "Jia-Ming Chen", "Ben-Yang Zhu", "En-Wei Liang"], "title": "Constraint on the physical origin of GRB prompt emission via its non-detected diffuse neutrino emission", "comment": "9 pages, 4 figures, and 2 tables. Accepted for publication in ApJ", "summary": "The physical origin of prompt emission in gamma-ray bursts (GRBs) remains an\nopen question since it has been studied more than half a century. Three\nalternative models (i.e. dissipative photosphere, internal shock, and ICMART)\nhave been proposed to interpret the observations of GRB prompt emission, but\nnone of them can fully interpret all of the observational data collected so\nfar. The question is that what is the fraction of these three theoretical\nmodels in the prompt emission of GRB, respectively. In this paper, we propose\nto utilize an innovative method, and constrain the fraction of GRB prompt\nemission models via its non-detected diffuse neutrinos. By adopting two methods\n(e.g., summing up the individual GRB contributions and assumed luminosity\nfunctions of GRB) to calculate diffuse neutrino flux of GRBs for given the\nbenchmark parameters of $\\Gamma=300$ and $\\varepsilon_{p} \\text{/}\n\\varepsilon_{e}=10$, both approaches indicate that most GRBs should be\noriginated from the ICMART model. Moreover, we find that the fractions of the\ndissipative photosphere model, the internal shock model, and the ICMART model\nare constrained to be [0, $0.5\\%$], [0, $1.1\\%$], and [$98.9\\%$, 1],\nrespectively for the method of summing up the individual GRB contributions. For\nthe method of luminosity functions, the fractions of above three models are\nconstrained to be [0, $6.1\\%$], [0, $8.2\\%$], and [$91.8\\%$, 1], respectively.\nHowever, such fractions of different models are also dependent on the\nparameters of $\\Gamma$ and $\\varepsilon_{p} \\text{/} \\varepsilon_{e}$."}
{"id": "2510.23502", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2510.23502", "abs": "https://arxiv.org/abs/2510.23502", "authors": ["J. G. S. Lunde", "P. C. Breysse", "D. T. Chung", "K. A. Cleary", "C. Dickinson", "D. A. Dunne", "J. O. Gundersen", "S. E. Harper", "G. A. Hoerning", "H. T. Ihle", "J. W. Lamb", "T. J. Pearson", "T. J. Rennie", "N. -O. Stutzer"], "title": "Separation of gain fluctuations and continuum signals in total power spectrometers with application to COMAP", "comment": null, "summary": "We describe a time-domain technique for separating $1/f$ gain fluctuations\nand continuum signal for a total power spectrometer, such as the CO Mapping\nArray Project (COMAP) Pathfinder instrument. The $1/f$ gain fluctuations of\nsuch a system are expected to be common-mode across frequency channels. If the\ninstrument's system temperature is not constant across channels, a continuum\nsignal will exhibit a frequency dependence different from that of common-mode\ngain fluctuations. Our technique leverages this difference to fit a\nthree-parameter frequency model to each time sample in the time-domain data,\nseparating gain and continuum. We show that this technique can be applied to\nthe COMAP Pathfinder instrument, which exhibits a series of temporally stable\nresonant noise spikes that effectively act as calibrators, breaking the gain\ndegeneracy with continuum signals. Using both simulations and observations of\nJupiter, we explore the effect of a $1/f$ prior for the gain model. We show\nthat the model is capable of cleanly separating Jupiter, a bright continuum\nsource, from the gain fluctuations in the scan. The technique has two\napplications to COMAP. For the COMAP observations performing line intensity\nmapping (LIM), the technique better suppresses atmospheric fluctuations and\nforegrounds than the COMAP LIM pipeline. For the Galactic COMAP observations,\nwhich map Galactic continuum signals, the technique can suppress $1/f$ gain\nfluctuations while retaining all continuum signals. This is demonstrated by the\nlatest COMAP observations of $\\lambda$-Orionis, where our method produces far\ncleaner maps than a destriper alone, typically reducing the noise power by a\nfactor of 7 on beam scales and up to 15 on larger scales."}
{"id": "2510.22979", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.22979", "abs": "https://arxiv.org/abs/2510.22979", "authors": ["Rikiya Okazaki", "Shantanu Desai"], "title": "A test of Amati relation using HII galaxy distances", "comment": "9 pages, 5 figures", "summary": "We use model-independent luminosity distances of 186 HII galaxy observations\nto address the circularity problem in the Amati relation for Gamma-ray Bursts\n(GRBs). For this purpose, we used Artificial Neural Network based interpolation\nto reconstruct the luminosity distance corresponding to the GRB redshift. We\nthen use two independent GRB datasets to test the robustness of the Amati\nrelation at redshifts below $z=2.6$. Our best-fit Amati relation parameters are\nconsistent for the same datasets to within $1\\sigma$. The intrinsic scatters\nwhich we obtain for the two datasets of about 28\\% and 35\\%, are comparatively\nlarger. This implies that the Amati relation using HII galaxies as distance\nanchors cannot be used as a probe of precision cosmology."}
{"id": "2510.21930", "categories": ["astro-ph.HE", "astro-ph.IM", "gr-qc"], "pdf": "https://arxiv.org/pdf/2510.21930", "abs": "https://arxiv.org/abs/2510.21930", "authors": ["Amazigh Ouzriat", "Viola Sordini", "Francesco Di Renzo"], "title": "Characterizing Low-Latency Sky Localization in Multi-Detector Gravitational-Wave Networks", "comment": "14 pages, 17 figures. Submitted to A&A", "summary": "Low-latency analyses of gravitational-wave (GW) data from LIGO, Virgo, and\nKAGRA enable rapid detection of compact binary coalescences (CBC) and prompt\nsky localization, essential for electromagnetic follow-up in multi-messenger\nastronomy. We evaluate the performance and limitations of low-latency sky\nlocalization using BAYESTAR algorithm, and investigate the impact of\nlow-significance Virgo triggers. We inject simulated CBC signals into\nGaussian-stationary noise and into Virgo data from the second part of the third\nLIGO-Virgo observing run (O3b), then reconstruct skymaps across multiple\ndetector network configurations. Localization accuracy is assessed using\nPercentile-Percentile plots, the Jaccard index, and the Kullback-Leibler\ndivergence. Binary neutron star mergers are statistically consistent with ideal\ncalibration, showing deviations below 3$\\sigma$, particularly when Virgo is\nincluded in the network, whereas skymaps for neutron star--black hole and\nbinary black hole mergers tend to be overconfident. Adding a third detector\ngenerally improves accuracy, but the searched area can degrade when Virgo's\nsignal-to-noise ratio is low (SNR $\\leq$ 5). For high-SNR events, relying on\ntwo detectors can mislocalize the source. Excluding Virgo can therefore cause\nthe HL skymap to miss the true location when Virgo has strong antenna response,\nin such cases a three-detector configuration is required to recover the correct\nposition and avoid misleading multi-messenger follow-up. We introduce\ndiagnostics to flag problematic skymaps and apply them to O3 public alerts,\nrecovering simulation-predicted trends and flagging a few anomalous\nmorphologies. The results are relevant for improving rapid vetting of GW alerts\nand guiding observational strategies in multi-messenger astronomy."}
{"id": "2510.22997", "categories": ["astro-ph.HE", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2510.22997", "abs": "https://arxiv.org/abs/2510.22997", "authors": ["Liyang Chen", "Xiaofeng Wang", "Qinyu Wu", "Moira Andrews", "Joseph Farah", "Paolo Ochner", "Andrea Reguitti", "Thomas G. Brink", "Jujia Zhang", "Cuiying Song", "Jialian Liu", "Alexei V. Filippenko", "David J. Sand", "Irene Albanese", "Kate D. Alexander", "Jennifer Andrews", "K. Azalee Bostroem", "Yongzhi Cai", "Collin Christy", "Ali Esamdin", "Andrea Farina", "Noah Franz", "D. Andrew Howell", "Brian Hsu", "Maokai Hu", "Abdusamatjan Iskandar", "Liping Li", "Gaici Li", "Dongyue Li", "Wenxiong Li", "Jinzhong Liu", "Curtis McCully", "Megan Newsome", "Yuan Qi Ni", "Andrea Pastorello", "Estefania Padilla Gonzalez", "Jeniveve Pearson", "Haowei Peng", "Conor Ransome", "Manisha Shrestha", "Nathan Smith", "Bhagya Subrayan", "Giacomo Terreran", "Giorgio Valerin", "J. Vinkó", "Sergiy S. Vasylyev", "Letian Wang", "Zhenyu Wang", "Hao Wang", "J. Craig Wheeler", "Kathryn Wynn", "Danfeng Xiang", "Shengyu Yan", "Weimin Yuan", "Juan Zhang", "WeiKang Zheng", "Yu Zhang"], "title": "SN 2024iss: A Double-peaked Type IIb Supernova with Evidence of Circumstellar Interaction", "comment": "24 pages, 14 figures, submitted to A&A", "summary": "We present optical, ultraviolet, and X-ray observations of supernova (SN)\n2024iss, a Type IIb SN that shows a prominent double-peaked light curve. We\nmodeled the first peak with a semianalytical shock-cooling model and the X-ray\nemission with a free-free model. We compare the envelope radius and mass-loss\nrate with other Type IIb SNe to explore the relationships between the\nprogenitor envelope and the circumstellar material (CSM). The shock-cooling\npeak in the $V$-band light curve reached $M_V = -17.33\\pm 0.26$mag, while the\n$^{56}$Ni-powered second peak attained $M_V = -17.43\\pm 0.26$mag. Early spectra\nshow an photospheric velocity of $\\sim19,400\\,km\\,s^{-1}$ at 3.82days from the\nH$\\alpha$ P~Cygni profile. The Balmer lines persist at least +87 days after the\nexplosion, characterizing hydrogen-rich ejecta. Modeling the first light-curve\npeak suggests an extended envelope with a mass of $0.11\\pm0.04\\,M_{\\odot}$ and\na radius of $244\\pm43~R_{\\odot}$. Fitting the second light-curve peak with an\nArnett-like model indicates a typical $^{56}$Ni mass of $\n0.117\\pm0.013~M_{\\odot}$ and a relatively low ejecta mass of\n$1.272\\pm0.343\\,M_{\\odot}$. X-ray observations reveal bright thermal\nbremsstrahlung emission and indicate a mass-loss rate of $1.6\\times10^{-5}\\\nM_{\\odot} \\ \\rm{yr}^{-1}$. SN 2024iss occupies a transitional position between\nthe two subclasses of extended (eIIb) and compact (cIIb) Type IIb SNe. Its\nenvelope radius and pre-explosion mass-loss rate appear to be correlated as\ntheoretically predicted. The observational properties of SN 2024iss are\ncompatible with a binary interaction scenario being the dominant mechanism for\nenvelope stripping. Furthermore, the low column density of neutral hydrogen\nsuggests a compact CSM with an outer radius of $\\lesssim1.3\\times10^{14}$ cm,\nindicating that the progenitor star experienced eruptive mass loss within\n$\\sim4\\,yr$ of its terminal explosion."}
{"id": "2510.23029", "categories": ["astro-ph.HE", "gr-qc"], "pdf": "https://arxiv.org/pdf/2510.23029", "abs": "https://arxiv.org/abs/2510.23029", "authors": ["Hamza Rehman", "Saddam Hussain", "G. Abbas", "Tao Zhu"], "title": "Exploring the accelerating black holes from the observations of quasi-periodic oscillations in X-ray binaries", "comment": "11 pages, 3 figures, 3 tables", "summary": "Black holes in dense astrophysical environments, such as globular clusters or\nin the vicinity of other massive objects, may possess accelerations. Such\nacceleration would modulate the characteristics of the quasi-periodic\noscillations (QPOs) observed in X-ray black hole binaries. In this paper, we\nexplore the influence of spin-aligned acceleration of a black hole on QPOs\nobserved in X-ray binaries. For this purpose, we compute the fundamental\nfrequencies arising from the motion of test particles around an accelerating\n(spin-aligned) black hole and apply the relativistic precession, parametric\nresonance, and forced resonance models to establish their correspondence with\nseveral observed QPOs of X-ray binaries (GRO J1655-40, XTE J1550-564, XTE\nJ1859+226, GRS 1915+105, H1743-322, M82~X-1, and Sgr~A$^{*}$). We then employ\nthe Bayesian Markov-Chain Monte Carlo method to constrain the black hole\nparameters. Our results show no evidence for spin-aligned acceleration in any\nof the analyzed sources, suggesting that most of these X-ray binaries reside in\nisolated environments and therefore experience only small perturbations to the\nbackground spacetime geometries."}
{"id": "2510.23103", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.23103", "abs": "https://arxiv.org/abs/2510.23103", "authors": ["B. Molina", "P. Mróz", "P. V. De la Parra", "A. C. S. Readhead", "T. Surti", "M. F. Aller", "J. D. Scargle", "R. A. Reeves", "H. Aller", "M. C. Begelman", "R. D. Blandford", "Y. Ding", "M. J. Graham", "F. Harrison", "T. Hovatta", "I. Liodakis", "M. L. Lister", "W. Max-Moerbeck", "V. Pavlidou", "T. J. Pearson", "V. Ravi", "A. G. Sullivan", "A. Synani", "K. Tassis", "S. E. Tremblay", "J. A. Zensus"], "title": "A Search for Supermassive Black Hole Binary Candidates in 46-Year Radio Light Curves of 83 Blazars", "comment": "20 pages, 12 figures and 4 tables", "summary": "The combined University of Michigan Radio Astronomy Observatory (UMRAO) and\nOwens Valley Radio Observatory (OVRO) blazar monitoring programs at 14.5/15 GHz\nprovide uninterrupted light curves of $\\sim~46-50$ yr duration for 83 blazars,\nselected from amongst the brightest and most rapidly flaring blazars north of\ndeclination $-20^\\circ$. In a search for supermassive black hole binary (SMBHB)\ncandidates, we carried out tests for periodic variability using generalized\nLomb-Scargle (GLS), weighted wavelet-Z (WWZ), and sine-wave fitting (SWF)\nanalyses of this sample. We used simulations to test the effects of the power\nlaw spectrum of the power spectral density (PSD) on our findings, and show that\nthe irregular sampling in the observed light curves has very little effect on\nthe GLS spectra. Apparent periodicities and putative harmonics appear in all 83\nof the GLS spectra of the blazars in our sample. We tested the reality of these\napparent periodicities and harmonics with simulations, and found that in the\noverwhelming majority of cases they are due to the steep slope of the PSD, and\nshould therefore be treated with great caution. We find one new SMBHB\ncandidate: PKS 1309+1154, which exhibits a 17.9 year periodicity. The fraction\nof SMBHB candidates in our sample is $2.4_{-0.8}^{+3.2}\\%$."}
{"id": "2510.23113", "categories": ["astro-ph.HE", "hep-ph"], "pdf": "https://arxiv.org/pdf/2510.23113", "abs": "https://arxiv.org/abs/2510.23113", "authors": ["Longhua Qin", "Jiancheng Wang", "Chuyuan Yang", "Huaizhen Li", "Quangui Gao", "Ju Ma", "Ao Wang", "Weiwei Na", "Ming Zhou", "Zunli Yuan", "Chunxia Gu"], "title": "Revisiting Very High Energy Gamma-Ray Absorption in Cosmic Propagation under the Combined Effects of Axion-Like Particles and Lorentz Violation", "comment": "The paper has been submitted, and the revised version is in\n  preparation. Discussions are welcome", "summary": "Very high energy (VHE) gama rays above 100 GeV are expected to undergo\nsignificant attenuation during cosmic propagation due to pair production with\nthr extralactic background light (EBL). However, recent observations -\nparticulary the tentative detection of gamma ray burst GRB 221009A up to 18 TeV\nby LHASSO and up to 251 TeV by Carpet-2, challenge the predictions of classical\nEBL absorption models. These exceptionally high-energy photons suggest the\npossibility of new physics affecting photon propagation over cosmological\ndistances. In this context, the gamma-ray spectrum in the tens to hundreds of\nTeV range serves as a valuable probe for potential Lorentz invariance violation\n(LIV) effects or for modifications to photon attenuation due to axion-like\nparticles (ALPs) mixing with photons in cosmic magnetic fields. However, both\nLIV and ALPs explanations, when considered separately, face certain limitations\nin fully accounting for the observed transparency. In this paper, we propose a\nunified framework that combines the effects of ALPs and LIV to explain the\nunexpectedly high survival probability of VHE photons. Specifically, we\ninvestigate the multi-wavelength spectrum of GRB 221009A under this synergistic\nscenario, demonstrating that for photons at 18 TeV and 251 TeV, the combined\ninfluence of ALPs with coupling $g_{a\\gamma} = 13.353 \\times 10^{-11}\\\n\\mathrm{GeV}^{-1}$ and mass $m_a = 9.492 \\times 10^{-7}\\ \\mathrm{eV}$, together\nwith LIV characterized by energy scales $E_1 = 2.4~E_{\\rm Planck}$ for $n = 1$\n, can substantially enhance the photon survival probability. This synergy\noffers a compelling explanation for the observed VHE gamma-ray transparency in\nextreme astrophysical environments."}
{"id": "2510.23115", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.23115", "abs": "https://arxiv.org/abs/2510.23115", "authors": ["Zhiwei Chen", "Youjun Lu", "Hao Ma", "Qingbo Chu"], "title": "Luminosity Functions and Detectability of Binary Neutron Star Merger-nova Signals with Various Merger Remnants", "comment": "17 pages, 13 figures, accepted by MNRAS", "summary": "With the rapid advancements in next-generation ground-based gravitational\nwave (GW) detectors, it is anticipated that $10^3$-$10^5$ binary neutron star\n(BNS) mergers per year will be detected, with a significant fraction\naccompanied by observable merger-nova signals through future sky surveys.\nMerger-novae are typically powered by the radioactive decay of heavy elements\nsynthesized via the r-process. If the post-merger remnant is a long-lived\nrapid-rotating neutron star, the merger-nova can be significantly enhanced due\nto strong magnetized winds. In this paper, we generate mock BNS merger samples\nusing binary population synthesis model and classify their post-merger\nremnants--black hole (BH) and magnetar, (i.e., long-lived supramassive NS and\nstable NS), based on results from numerical simulations. We then construct\nmerger-nova radiation models to estimate their luminosity function. We find\nthat the luminosity function may exhibit a distinctive triple-peak structure,\nwith the relative positions and heights of these peaks depending on the\nequation of state (EOS) of the BNS. Furthermore, we estimate the average\nTarget-of-Opportunity (ToO) detection efficiency $\\langle f_{\\rm eff} \\rangle$\nwith the Chinese Space Station Telescope (CSST) and find that due to possible\nenhanced luminosity, the largest source redshift with $\\langle f_{\\rm eff}\n\\rangle>0.1$ can be enlarged from $z_{\\rm s}\\sim 0.5$ to $z_{\\rm s}\\sim 1-1.5$.\nBesides, we also generate the detectable mass spectrum for merger-novae by\n$\\langle f_{\\rm eff}\\rangle$, which may provide insights to the ToO searching\nstrategy."}
{"id": "2510.23126", "categories": ["astro-ph.HE", "hep-ph"], "pdf": "https://arxiv.org/pdf/2510.23126", "abs": "https://arxiv.org/abs/2510.23126", "authors": ["Claudio Galelli", "Lorenzo Caccianiga", "Lorenzo Apollonio", "Paolo Magnani", "Vincent Breton"], "title": "A volcanic chronosequence as a time-resolved paleo-detector array to study the cosmic-ray flux in the Late Pleistocene and Holocene", "comment": "5 Pages, 5 figures, 1 table", "summary": "We present a phenomenological study demonstrating the feasibility of using\nolivine xenoliths from the Cha\\^ine des Puys as a time-resolved paleo-detector\narray to probe the cosmic-ray flux over the last 40,000 years. This volcanic\nregion provides a unique chronosequence of samples brought to the surface by\nwell-dated eruptions. By modeling the expected density of nuclear recoil tracks\ninduced by cosmic-ray muons in olivine, we show that the signal is detectable\nand above backgrounds from natural radioactivity. We demonstrate that by\nanalyzing samples with different exposure ages, it is possible to construct a\ntime-differential measurement of the cosmic-ray flux. This method shows\nsensitivity to historical variations, such as the enhanced flux expected during\nthe Laschamp geomagnetic excursion ($\\sim$41~kyr) and the potential\ncontribution from nearby supernovae, for which we use the Antlia supernova\nremnant precursor as a benchmark. This work establishes a new application of\nthe paleo-detector technique for long-scale time-domain high-energy\nastrophysics and provides the direct scientific motivation for experimental\nefforts to measure these track records."}
{"id": "2510.23168", "categories": ["astro-ph.HE", "hep-ph"], "pdf": "https://arxiv.org/pdf/2510.23168", "abs": "https://arxiv.org/abs/2510.23168", "authors": ["Giacomo D'Amico", "Michele Doro", "Michela De Caria"], "title": "Recasting and Forecasting Dark Matter Limits Without Raw Data: A Generalized Algorithm for Gamma-Ray Telescopes", "comment": "Accepted for publication in Physics of the Dark Universe. This is the\n  author's accepted manuscript (AAM), prior to journal typesetting", "summary": "We present a novel method for both forecasting and recasting upper limits\n(ULs) on dark matter (DM) annihilation cross sections, $\\left< \\sigma v\n\\right>^{UL}$, or decay lifetime $\\tau^{LL}$ . The forecasting method relies\nsolely on the instrument response functions (IRFs) to predict ULs for a given\nobservational setup, without the need for full analysis pipelines. The\nrecasting procedure uses published ULs to reinterpret constraints for\nalternative DM models or channels. We demonstrate its utility across a range of\ncanonical annihilation channels, including $b\\bar{b}$, $W^+W^-$,\n$\\tau^+\\tau^-$, and $\\mu^+\\mu^-$, and apply it to several major gamma-ray\nexperiments, including MAGIC, \\textit{Fermi}-LAT, and CTAO. Notably, we develop\na recasting approach that remains effective even when the IRF is unavailable by\nextracting generalized IRF-dependent coefficients from benchmark channels. We\napply this method to reinterpret ULs derived from standard spectra (e.g.,\nPPPC4DMID) in terms of more recent DM scenarios, including a Higgsino-like\nmodel with mixed final states and spectra generated with the CosmiXs model.\nExtensive Monte Carlo simulations and direct comparison with published results\nconfirm the robustness and accuracy of our method, with discrepancies remaining\nwithin statistical uncertainties. The algorithm is generally applicable to any\nscenario where the expected signal model is parametric, offering a powerful\ntool for reinterpreting existing gamma-ray limits and efficiently exploring the\nDM parameter space in current and future indirect detection experiments."}
{"id": "2510.23287", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.23287", "abs": "https://arxiv.org/abs/2510.23287", "authors": ["The KM3NeT collaboration"], "title": "Can KM3-230213A be compatible with a cosmogenic origin?", "comment": "8 pages, 3 figures, Proceedings for the 39th International Cosmic Ray\n  Conference (ICRC2025)", "summary": "On the 13th February 2023 the KM3NeT/ARCA telescope observed a track-like\nevent compatible with a ultra-high-energy muon with an estimated energy of 120\nPeV, produced by a neutrino with an even higher energy, making it the most\nenergetic neutrino event ever detected. The reported equivalent flux suggest\nthe possible existence of a new diffuse component. A diffuse cosmogenic flux is\nexpected to originate from the interactions of ultra-high-energy cosmic rays\nwith ambient photon and matter fields. Here we show that this component can be\ncompatible with the reported flux level only integrating the cosmogenic\nemission, at least up to redshift ~$z = 6 $ and assuming a subdominant fraction\nof protons in the ultra-high-energy cosmic-ray flux, thus placing constraints\non known cosmic accelerators. These conditions impose constraints on known\ncosmic accelerators and open a window into an unexplored region of the Universe\nat this energy scale."}
{"id": "2510.23345", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.23345", "abs": "https://arxiv.org/abs/2510.23345", "authors": ["LHAASO Collaboration"], "title": "First detection of ultra-high energy emission from gamma-ray binary LS I +61 303", "comment": "13 pages, 5 figures", "summary": "We report the first detection of gamma-ray emission up to ultra-high-energy\n(UHE; $>$100 TeV) emission from the prototypical gamma-ray binary system LS I\n+61 303 using data from the Large High Altitude Air Shower Observatory\n(LHAASO). It is detected with significances of 9.2$\\sigma$ in WCDA (1.4--30.5\nTeV) and 6.2$\\sigma$ in KM2A (25--267 TeV); in KM2A alone we identify 16\nphoton-like events above 100 TeV against an estimated 5.1 background events,\ncorresponding to a 3.8$\\sigma$ detection. These results provide compelling\nevidence of extreme particle acceleration in LS I +61 303. Furthermore, we\nobserve orbital modulation at 4.0$\\sigma$ confidence between 25 and 100 TeV,\nand a hint of energy-dependent orbital modulation. These features can be\nunderstood in a composite scenario in which leptonic and hadronic processes\njointly contribute."}
{"id": "2510.23367", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.23367", "abs": "https://arxiv.org/abs/2510.23367", "authors": ["Aaron C. Trigg", "Eric Burns", "Michela Negro", "Suman Bala", "P. N. Bhat", "William H. Cleveland", "Dmitry D. Frederiks", "Adam Goldstein", "Boyan A. Hristov", "Daniel Kocevski", "Niccolò Di Lalla", "Stephen Lesage", "Bagrat Mailyan", "Eliza Neights", "Nicola Omodei", "Oliver J. Roberts", "Lorenzo Scotton", "Dmitry S. Svinkin", "Joshua Wood"], "title": "From Rare Events to a Population: Discovering Overlooked Extragalactic Magnetar Giant Flare Candidates in Archival Fermi Gamma-ray Burst Monitor Data", "comment": null, "summary": "Magnetar giant flares (MGFs) are rare, extremely bright bursts of gamma-rays\nfrom highly magnetized neutron stars. These events are challenging to identify\nbecause, at extragalactic distances, they can appear similar to other\nastrophysical phenomena. Only a handful have been confidently identified to\ndate, limiting our understanding of their origin and physical properties. This\nstudy focuses on expanding the sample of known events and enabling a more\ndetailed characterization of their observational features and intrinsic\nproperties, while introducing significant improvements in the methods used to\nidentify and analyze them. When applied to archival data from the Gamma-ray\nBurst Monitor (GBM) on the \\Fermi Gamma-ray Space Telescope, this approach\nadded four previously unidentified events the known sample, expanding the total\nto 13 MGFs. This demonstrates both the effectiveness of the method and the\nlikelihood that additional MGFs remain hidden in existing gamma-ray burst\ncatalogs. We utilize this expanded sample to gain a deeper understanding of the\nbroader population of MGFs. We develop a statistical modeling framework that\ncombines previously considered data with modern observations from Fermi/GBM.\nThe model accounts for instrumental sensitivity and the expected diversity in\nevent characteristics. We infer a volumetric rate of events above\n$1.2\\times10^{44}\\,\\rm{erg}$ of\n$R_{MGF}=5.5^{+4.5}_{-2.7}\\times10^5\\rm{Gpc^{-3}yr^{-1}}$. The results show\nthat individual magnetars must produce multiple flares throughout their\nlifetimes, reinforcing the idea that these are recurring phenomena rather than\nsingular explosive events. Expanding the sample of known MGFs improves our\nunderstanding of magnetars and their role in other astrophysical phenomena,\nincluding possible links to fast radio bursts, gravitational waves, and the\ncreation of heavy elements in extreme astrophysical environments."}
{"id": "2510.21925", "categories": ["astro-ph.IM", "astro-ph.HE", "hep-ex"], "pdf": "https://arxiv.org/pdf/2510.21925", "abs": "https://arxiv.org/abs/2510.21925", "authors": ["Martin Ravn", "Christian Glaser", "Thorsten Glüsenkamp", "Ayca Öcelikkale", "Alan Coleman"], "title": "Likelihood Reconstruction for Radio Detectors of Neutrinos and Cosmic Rays", "comment": null, "summary": "Ultra-high-energy neutrinos and cosmic rays are excellent probes of\nastroparticle physics phenomena. For astroparticle physics analyses, robust and\naccurate reconstruction of signal parameters such as arrival direction and\nenergy is essential. Radio detection is an established detector concept\nexplored by many observatories; however, current reconstruction methods ignore\nbin-to-bin noise correlations, which limits reconstruction resolution and, so\nfar, has prevented calculations of event-by-event uncertainties. In this work,\nwe present a likelihood description of neutrino or cosmic-ray signals in radio\ndetectors with correlated noise, as present in all neutrino and cosmic-ray\nradio detectors. We demonstrate, with simulation studies of both neutrinos and\ncosmic-ray radio signals, that signal parameters such as energy and direction,\nincluding event-by-event uncertainties with correct coverage, can be obtained.\nThis method reduces reconstruction uncertainties and biases compared to\nprevious approaches. Additionally, the Likelihood can be used for event\nselection and enables differentiable end-to-end detector optimization. The\nreconstruction code is available through the open-source software NuRadioReco."}
{"id": "2510.23219", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.23219", "abs": "https://arxiv.org/abs/2510.23219", "authors": ["Fraser Bradfield"], "title": "Development of the Reconstruction Procedure of the Fluorescence detector Array of Single-pixel Telescopes for measuring Ultra-High Energy Cosmic Rays", "comment": "PhD thesis, 280 pages, 168 figures", "summary": "The Fluorescence detector Array of Single-pixel Telescopes aims to deploy an\narray of simplified, autonomous fluorescence telescopes over an area of\n$\\sim60,000$ km$^{2}$ to observe ultra-high energy cosmic rays. The\nunprecedented size of such an array will enable measurements of cosmic rays\nwith energies above 10$^{20}$ eV with large statistics, providing new insights\ninto UHECR sources. With a single FAST telescope consisting of just four\nphotomultiplier tubes, traditional techniques to reconstruct observed extensive\nair showers are not applicable. Instead, FAST utilises a top-down approach\nwhere simulations are directly compared to data and the best match chosen via a\nmaximum likelihood estimation. This method, known as the \"top-down\nreconstruction (TDR)\", requires an accurate \"first guess\" of the shower\nparameters to be successful. In this work, improvements to the efficiency and\nprecision of the TDR are made and two different first guess estimation methods\nare investigated. The combined performance of a machine-learning-based first\nguess and improved TDR is shown to achieve resolutions in the shower arrival\ndirection, depth of shower maximum and shower energy of $\\sim2^\\circ$, $\\sim30$\ng cm$^{-2}$ and $\\sim7\\%$ respectively for simulated events observed from two\nor more locations. The improved reconstruction is then applied to data from the\ncurrent FAST prototype installations at the Pierre Auger Observatory and\nTelescope Array experiment. Using these results, the first measurements of the\nUHECR energy spectrum and composition by FAST are presented."}
