{"id": "2510.13946", "categories": ["astro-ph.HE", "physics.plasm-ph"], "pdf": "https://arxiv.org/pdf/2510.13946", "abs": "https://arxiv.org/abs/2510.13946", "authors": ["Rei Nishiura", "Tsuyoshi Inoue"], "title": "Bell Instability and Cosmic-Ray Acceleration in AGN Ultrafast Outflow Shocks", "comment": "19 pages, 11 figures. Comment Welcome", "summary": "We investigate magnetic-field amplification driven by the nonresonant hybrid\n(NRH or Bell) instability and its impact on cosmic-ray (CR) acceleration at\nreverse shocks of ultrafast outflows (UFOs) from active galactic nuclei (AGN).\nPrevious kinetic studies by particle-in-cell simulations have demonstrated that\nwhen maximum CR energy is near the injection scale, NRH instability efficiently\namplifies magnetic field up to the saturation level. However, the efficiency of\nNRH instability goes down as maximum energy increase since CR current is\ncarried by escaping CRs near the maximum energy. We employ a one-dimensional\nMHD--CR framework solving telegraph-type diffusion--convection equations to\ntrace the coupled evolution of CRs, magnetic fields, and shock dynamics under\nrealistic parameters. We find a distinct transition with magnetic field\nstrength: for weak background fields ($B_{0}\\!\\lesssim\\!10^{-4}\\,\\mathrm{G}$),\nNRH instability efficiently amplifies upstream turbulence, driving a\nself-regulated state where $E_{\\max}$ becomes independent of initial strength\nof magnetic turbulence. In contrast, for stronger background fields\n($B_{0}\\!\\gtrsim\\!10^{-3}\\,\\mathrm{G}$), the escaping CR current is too weak to\ndrive NRH instability, and magnetic turbulence further decays through\nparametric instabilities, potentially reducing the acceleration efficiency. We\ngive the physical interpretation for the transition and discuss conditions for\nPeV--EeV acceleration at UFO reverse shocks."}
{"id": "2510.13955", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.13955", "abs": "https://arxiv.org/abs/2510.13955", "authors": ["Vishal Tiwari", "Chi-Ho Chan", "Tamara Bogdanović", "Yan-Fei Jiang", "Shane W. Davis"], "title": "Radiation Magnetohydrodynamic Simulation of sub-Eddington Circumbinary Disk in a 10:1 Massive Black Hole Binary", "comment": "17 pages, 8 figures. Submitted to ApJ", "summary": "We present a global three-dimensional radiation magnetohydrodynamic (RMHD)\nsimulation of a circumbinary disk (CBD) around a massive black hole binary\n(MBHB) with a total mass $2 \\times 10^7\\,M_{\\odot}$ and mass ratio $0.1$,\nseparated by $100\\, GM_{\\rm tot}/c^2$. The inclusion of radiation makes the\ndisk thinner, denser, less eccentric at the inner edge, and more filamentary\nwhen compared to an otherwise identical locally isothermal MHD disk. The RMHD\ndisk has accretion rate $\\sim 0.23\\,\\dot{M}_{\\mathrm{Edd}}$ and produces\nthermal emission peaking in the near-UV/optical with a luminosity of $\\sim 1\\,\n\\% L_{\\rm {Edd }}$. Compared with an equal-mass binary with the same total\nmass, the thermal emission of the CBD around the unequal-mass binary is several\norders of magnitude brighter and much more variable at far-UV/soft X-rays\nfrequencies. Similarly, we find that the light curve associated with the $0.1$\nmass ratio binary exhibits dominant periodicity corresponding to 2 binary\norbits, compared to the equal-mass binary that shows periodicity at 2.5-5\nbinary orbits. Our results highlight the importance of radiation for the\nstructure and observational properties of MBHB circumbinary disks and have\nimplications for detecting electromagnetic counterparts to LISA gravitational\nwave precursors and for the heavier binaries targeted by the Pulsar Timing\nArrays."}
{"id": "2510.14031", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.14031", "abs": "https://arxiv.org/abs/2510.14031", "authors": ["Benedikt Schroer", "Damiano Caprioli", "Pasquale Blasi"], "title": "Investigating Nonlinear Landau Damping in Hybrid Simulations", "comment": "submitted to PRD, comments welcome", "summary": "Phenomenological studies of cosmic-ray self-confinement often hinge on the\nlinear theory for the growth rate of the streaming instability and for the\ndamping rate of the generated magnetic modes. Largely different expressions\nexist, especially for the rate of nonlinear Landau damping, which is often\nassumed to be the most important damping mechanism in warm ionized plasmas.\nUsing hybrid-PIC simulations in the resonant streaming instability regime, we\npresent a comprehensive assessment of nonlinear Landau damping and show that\nthe damping rate at a given scale depends on the power in magnetic fields on\nlarger scales. Furthermore, we find that an inverse cascade develops, which\nproduces magnetic fields on scales larger than the resonant ones. Here we\nextend previous results obtained for a mono-energetic distribution of\nnon-thermal particles to the case of broader CR distributions, as a first step\ntowards developing phenomenological models. Pre-existing turbulence of\nAlfv\\'enic nature at large scales severely affects the damping of waves\nproduced by low-energy CRs; depending on its amplitude, such a turbulence may\ninhibit the growth of streaming instability so that CRs are either\nself-confined at all energies or not at all."}
{"id": "2510.14037", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.14037", "abs": "https://arxiv.org/abs/2510.14037", "authors": ["Argyrios Loules", "Nektarios Vlahakis"], "title": "Exploring the impact of electromagnetic dissipation on ultra-relativistic plasma outflows", "comment": "5 pages, 2 figures, submitted to \"Memorie della Societ\\`a Astronomica\n  Italiana\"; Conference \"8th Heidelberg International Symposium on High-Energy\n  Gamma-Ray Astronomy (Gamma-2024)\"", "summary": "Ultra-relativistic plasma outflows are intrinsically connected with gamma-ray\nbursts. Over the years, a large number of analytical and numerical works has\nbeen devoted to understanding the intricacies of their complex dynamics, with\nmost of these past studies performed in the ideal MHD regime. We propose a\nself-similar formalism, based on the expansion of the equations of resistive\nrelativistic magnetohydrodynamics, for the description of these outflows in the\nvicinity of their symmetry axis and present semi-analytical solutions\ndescribing strongly relativistic jets in both the ideal and resistive MHD\nregimes. Our solutions provide a clear picture of the impact of electromagnetic\ndissipation on the acceleration and collimation mechanisms which determine the\nkinetic and morphological characteristics of these relativistic outflows. The\nresistive MHD solutions are compared to their ideal MHD counterparts, revealing\nthe key differences between the two regimes. Our comparative analysis sheds\nlight on the possible role of electromagnetic dissipation in shaping the\ndynamics of the ultra-relativistic outflows associated with gamma-ray bursts."}
{"id": "2510.13997", "categories": ["astro-ph.IM", "astro-ph.CO", "cs.LG", "stat.ML"], "pdf": "https://arxiv.org/pdf/2510.13997", "abs": "https://arxiv.org/abs/2510.13997", "authors": ["Huifang Lyu", "James Alvey", "Noemi Anau Montel", "Mauro Pieroni", "Christoph Weniger"], "title": "Dynamic SBI: Round-free Sequential Simulation-Based Inference with Adaptive Datasets", "comment": "15 pages, 5 figures, software available at:\n  https://github.com/dynamic-sbi", "summary": "Simulation-based inference (SBI) is emerging as a new statistical paradigm\nfor addressing complex scientific inference problems. By leveraging the\nrepresentational power of deep neural networks, SBI can extract the most\ninformative simulation features for the parameters of interest. Sequential SBI\nmethods extend this approach by iteratively steering the simulation process\ntowards the most relevant regions of parameter space. This is typically\nimplemented through an algorithmic structure, in which simulation and network\ntraining alternate over multiple rounds. This strategy is particularly well\nsuited for high-precision inference in high-dimensional settings, which are\ncommonplace in physics applications with growing data volumes and increasing\nmodel fidelity. Here, we introduce dynamic SBI, which implements the core ideas\nof sequential methods in a round-free, asynchronous, and highly parallelisable\nmanner. At its core is an adaptive dataset that is iteratively transformed\nduring inference to resemble the target observation. Simulation and training\nproceed in parallel: trained networks are used both to filter out simulations\nincompatible with the data and to propose new, more promising ones. Compared to\nround-based sequential methods, this asynchronous structure can significantly\nreduce simulation costs and training overhead. We demonstrate that dynamic SBI\nachieves significant improvements in simulation and training efficiency while\nmaintaining inference performance. We further validate our framework on two\nchallenging astrophysical inference tasks: characterising the stochastic\ngravitational wave background and analysing strong gravitational lensing\nsystems. Overall, this work presents a flexible and efficient new paradigm for\nsequential SBI."}
{"id": "2510.14127", "categories": ["astro-ph.HE", "gr-qc"], "pdf": "https://arxiv.org/pdf/2510.14127", "abs": "https://arxiv.org/abs/2510.14127", "authors": ["Pavan Chawhan", "Matthew D. Duez", "Francois Foucart", "Patrick Chi-Kit Cheong", "Nishad Muhammed"], "title": "Axisymmetric hydrodynamics in numerical relativity: treating coordinate singularity, artificial heating and modeling MHD instabilities", "comment": null, "summary": "Two-dimensional axisymmetric simulations of binary neutron star (BNS) merger\nremnant are a cheap alternative to 3D simulations. To maintain realism for\nsecular timescales, simulations must avoid accumulated errors from drifts in\nconserved quantities and artificial heating, and they must model turbulent\ntransport in a way that remains plausible throughout the evolution. It is also\ncrucial to avoid numerical artifacts due to the polar coordinate axis\nsingularity. Methods that behave well near the axis often break\nflux-conservative form of the hydrodynamic equations, resulting in significant\ndrifts in conserved quantities. We present a flux-conservative scheme that\nmaintains smoothness near the axis without sacrificing conservative formulation\nof the equations or incurring drifts in conserved global quantities. We compare\nthe numerical performance of different treatments of the hydrodynamic equations\nwhen evolving a hypermassive neutron star resembling the remnant of a BNS\nmerger. These simulations demonstrate that the new scheme combines the axis\nsmoothness of non-conservative methods with the mass and angular momentum\nconservation of other conservative methods on $\\sim$ $10^2$ ms timescales of\nviscous and neutrino-driven evolution. Because fluid profiles remain smooth in\nthe remnant interior, it is possible to remove artificial heating by evolving\nthe entropy density. We show how physical heating and cooling terms can be\neasily calculated from source terms of the conservative evolution variables and\ndemonstrate our implementation. Finally, we discuss and implement improvements\nto the effective viscosity scheme to better model the effect of\nmagnetohydrodynamic instabilities as the remnant evolves."}
{"id": "2510.14102", "categories": ["astro-ph.IM", "cs.AI", "cs.LG"], "pdf": "https://arxiv.org/pdf/2510.14102", "abs": "https://arxiv.org/abs/2510.14102", "authors": ["Nicolò Oreste Pinciroli Vago", "Juan Rafael Martínez-Galarza", "Roberta Amato"], "title": "Extracting latent representations from X-ray spectra. Classification, regression, and accretion signatures of Chandra sources", "comment": null, "summary": "The study of X-ray spectra is crucial to understanding the physical nature of\nastrophysical sources. Machine learning methods can extract compact and\ninformative representations of data from large datasets. The Chandra Source\nCatalog (CSC) provides a rich archive of X-ray spectral data, which remains\nlargely underexplored in this context. This work aims to develop a compact and\nphysically meaningful representation of Chandra X-ray spectra using deep\nlearning. To verify that the learned representation captures relevant\ninformation, we evaluate it through classification, regression, and\ninterpretability analyses. We use a transformer-based autoencoder to compress\nX-ray spectra. The input spectra, drawn from the CSC, include only\nhigh-significance detections. Astrophysical source types and physical summary\nstatistics are compiled from external catalogs. We evaluate the learned\nrepresentation in terms of spectral reconstruction accuracy, clustering\nperformance on 8 known astrophysical source classes, and correlation with\nphysical quantities such as hardness ratios and hydrogen column density\n($N_H$). The autoencoder accurately reconstructs spectra with 8 latent\nvariables. Clustering in the latent space yields a balanced classification\naccuracy of $\\sim$40% across the 8 source classes, increasing to $\\sim$69% when\nrestricted to AGNs and stellar-mass compact objects exclusively. Moreover,\nlatent features correlate with non-linear combinations of spectral fluxes,\nsuggesting that the compressed representation encodes physically relevant\ninformation. The proposed autoencoder-based pipeline is a powerful tool for the\nrepresentation and interpretation of X-ray spectra, providing a compact latent\nspace that supports both classification and the estimation of physical\nproperties. This work demonstrates the potential of deep learning for spectral\nstudies and uncovering new patterns in X-ray data."}
{"id": "2510.14134", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.14134", "abs": "https://arxiv.org/abs/2510.14134", "authors": ["Oluwashina K. Adegoke", "Javier A. Garcia", "Guglielmo Mastroserio", "Elias Kammoun", "Riley M. T. Connors", "James F. Steiner", "Fiona A. Harrison", "Douglas J. K. Buisson", "Joel B. coley", "Benjamin M. Coughenour", "Thomas Dauser", "Melissa Ewing", "Adam Ingram", "Erin Kara", "Edward Nathan", "Maxime Parra", "Daniel Stern", "John A. Tomsick"], "title": "The 2025 Failed Outburst of IGR J17091-3624: Spectral Evolution and the Role of Ionized Absorbers", "comment": "17 pages, 10 figures, 4 tables. Accepted for publication in ApJ", "summary": "IGR J17091-3624 is the only black hole X-ray binary candidate, aside from the\nwell-studied black hole system GRS 1915+105, observed to exhibit a wide range\nof structured variability patterns in its light curves. In 2025, the source\nunderwent a ``failed'' outburst: it brightened in the hard state but did not\ntransition to the soft state before returning to quiescence within a few weeks.\nDuring this period, IGR J17091-3624 was observed by multiple ground- and\nspace-based facilities. Here, we present results from six pointed NuSTAR\nobservations obtained during the outburst. None of the NuSTAR light curves\nshowed the exotic variability classes typical of the soft state in this source;\nhowever, we detected, for the first time, strong dips in the count rate during\none epoch, with a total duration of $\\sim4\\,\\mathrm{ks}$ as seen by NuSTAR.\nThrough spectral and timing analysis of all six epochs, we investigate the\nhard-state spectral evolution and the nature of the dips. A clear evolution of\nthe coronal properties with luminosity is observed over all six epochs, with\nclear signatures of relativistic disk reflection which remain largely unchanged\nacross the first five epochs. The first five epochs also show a strong and\nstable quasi-periodic oscillation (QPO) feature in the power spectra. The dips\nobserved in Epoch 5 are consistent with partial obscuration by ionized material\nwith a column density $N_{\\mathrm{H}} \\approx 2.0 \\times\n10^{23}\\,\\mathrm{cm^{-2}}$. We discuss possible origins for this material and\nplace constraints on the orbital parameters and distance of the system."}
{"id": "2510.14178", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2510.14178", "abs": "https://arxiv.org/abs/2510.14178", "authors": ["Nivedita Mahesh", "Judd D Bowman", "Bharat Gehlot", "Danny Jacobs"], "title": "Polarisation Performance of Offset Phase Antennas: A Study for FARSIDE", "comment": "22 pages, 14 figures, Accepted in PASA", "summary": "Several radio telescopes have been planned or proposed to be deployed on the\nLunar farside in the coming years. These will observe the unexplored ultra-long\nwavelengths of the electromagnetic spectrum from the lunar farside's unique\nradio-quiet and ionosphere-free environment. One such lunar radio array is the\nNASA-funded concept - the Farside Array for Radio Science Investigations of the\nDark Ages and Exoplanets (FARSIDE). FARSIDE will operate over 100~kHz to 40~MHz\nwith 128 spatially non-co-located orthogonal pairs of antenna nodes distributed\nover a 12 X 12 km area in a four-arm spiral configuration. Being on the lunar\nfarside, this radio interferometer will be deployed by tele-operated rovers.\nThe rover deployment mode could lead to a phase offset between each of the two\northogonally polarised antenna elements in the array, which are typically\nco-located. In this paper, we quantify the effects of such antenna phase\noffsets on the polarisation response and imaging performance of the lunar radio\narray. Modelling and analysing the FARSIDE dipole beams with and without\noffset, we find the latter leads to additional leakages into Stokes U and V\ncorresponding to Muller matrix terms of M2(0,1,2,3) and M3(0,1,2,3). Using a\ncustom simulation pipeline to incorporate all four Stokes beams of spatially\nco-located and non-co-located dipoles, we produce visibilities and simulated\nimages for the GLEAM (GaLactic and Extragalactic All-sky MWA) sky model through\nthe FARSIDE array. We find that for a pure Stokes I input sky, the output image\nmaximum Stokes V/I flux ratio for the offset case has increased to 2.5% versus\n0.05% for the co-located case. The additional Stokes V needs to be corrected\nsince the detection of Electron Cyclotron Maser (ECM) emissions from exoplanets\nrequires high-fidelity Stokes V measurements."}
{"id": "2510.14363", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.14363", "abs": "https://arxiv.org/abs/2510.14363", "authors": ["Lachlan Passenger", "Sharan Banagiri", "Eric Thrane", "Paul D. Lasky", "Angela Borchers", "Maya Fishbach", "Claire S. Ye"], "title": "Is GW231123 a hierarchical merger?", "comment": "9 pages, 2 figures", "summary": "The binary black hole merger GW231123 is both the most massive\ngravitational-wave event observed and has the highest component spins measured\nto date. The dimensionless spins of the more massive (primary) and less massive\n(secondary) black holes are measured to be $\\chi_1 = 0.90^{+0.10}_{-0.19}$ and\n$\\chi_2 = 0.80^{+0.20}_{-0.51}$ ($90\\%$ credible intervals), respectively. Its\nlarge mass and extremal spins are challenging to explain through standard\nbinary stellar physics, though a flurry of hypothetical scenarios have been\nproposed. Hierarchical assembly -- i.e., mergers of black holes that are\nthemselves formed from previous generations of mergers -- is generally a\npromising way to explain massive and rapidly spinning black holes. Here, we\ninvestigate the possibility that both GW231123 was assembled hierarchically in\na dense star cluster as the merger of two second-generation black holes. Taking\nthe inferred spin values at face value, we find that it is possible, though\nunlikely ($p\\lesssim 1\\%$), that a compact binary with both component spins\nlike GW231123 could form in a cluster from hierarchical assembly."}
{"id": "2510.14202", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.14202", "abs": "https://arxiv.org/abs/2510.14202", "authors": ["Edgar P. Vidal", "Alexander T. Gagliano", "Carolina Cuesta-Lazaro"], "title": "Hierarchical Simulation-Based Inference of Supernova Power Sources and their Physical Properties", "comment": "9 pages, 4 figures, Accepted at the 2025 Machine Learning and the\n  Physical Sciences (ML4PS) workshop at NeurIPS", "summary": "Time domain surveys such as the Vera C. Rubin Observatory are projected to\nannually discover millions of astronomical transients. This and complementary\nprograms demand fast, automated methods to constrain the physical properties of\nthe most interesting objects for spectroscopic follow up. Traditional\napproaches to likelihood-based inference are computationally expensive and\nignore the multi-component energy sources powering astrophysical phenomena. In\nthis work, we present a hierarchical simulation-based inference model for\nmulti-band light curves that 1) identifies the energy sources powering an event\nof interest, 2) infers the physical properties of each subclass, and 3)\nseparates physical anomalies in the learned embedding space. Our architecture\nconsists of a transformer-based light curve summarizer coupled to a\nflow-matching regression module and a categorical classifier for the physical\ncomponents. We train and test our model on $\\sim$150k synthetic light curves\ngenerated with $\\texttt{MOSFiT}$. Our network achieves a 90% classification\naccuracy at identifying energy sources, yields well-calibrated posteriors for\nall active components, and detects rare anomalies such as tidal disruption\nevents (TDEs) through the learned latent space. This work demonstrates a\nscalable joint framework for population studies of known transients and the\ndiscovery of novel populations in the era of Rubin."}
{"id": "2510.14529", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2510.14529", "abs": "https://arxiv.org/abs/2510.14529", "authors": ["Mehdy Lefkir", "Simon Vaughan", "Mike Goad", "Daniela Huppenkothen", "Phil Uttley"], "title": "The variability of active galaxies: I. Broad-band noise X-ray power spectra from XMM-Newton and Swift", "comment": "22 pages, 10 figures, under review at MNRAS (after the first round of\n  referee comments)", "summary": "Accreting supermassive black holes at the centres of galaxies are the engine\nof active galactic nuclei (AGN). X-ray light curves of unabsorbed AGN show\ndramatic random variability on timescales ranging from seconds to years. The\npower spectrum of the fluctuations is usually well-modelled with a power law\nthat decays as $1/f$ at low frequencies, and which bends to $1/f^{2-3}$ at high\nfrequencies. The timescale associated with the bend correlates well with the\nmass of the black hole and may also correlate with bolometric luminosity in the\n`X-ray variability plane'. Because AGN light curves are usually irregularly\nsampled, the estimation of AGN power spectra is challenging. In a previous\npaper, we introduced a new method to estimate the parameters of bending power\nlaw power spectra from AGN light curves. We apply this method to a sample of 56\nvariable and unabsorbed AGN, observed with XMM-Newton and Swift in the\n$0.3-1.5$ keV band over the past two decades. We obtain estimates of the bends\nin 50 sources, which is the largest sample of X-ray bends in the soft band. We\nalso find that the high-frequency power spectrum is often steeper than 2. We\nupdate the X-ray variability plane with new bend timescale measurements\nspanning from 7 min to 62 days. We report the detections of low-frequency bends\nin the power spectra of five AGN, three of which are previously unpublished: 1H\n1934-063, Mkn 766 and Mkn 279."}
{"id": "2510.14219", "categories": ["astro-ph.IM", "astro-ph.CO"], "pdf": "https://arxiv.org/pdf/2510.14219", "abs": "https://arxiv.org/abs/2510.14219", "authors": ["M. R. Young", "M. Adamic", "A. J. Anderson", "P. S. Barry", "B. A. Benson", "C. S. Benson", "E. Brooks", "J. E. Carlstrom", "T. Cecil", "C. L. Chang", "K. R. Dibert", "M. Dobbs", "K. Fichman", "M. Hollister", "K. S. Karkare", "G. K. Keating", "A. M. Lapuente", "M. Lisovenko", "D. P. Marrone", "D. Mitchell", "J. Montgomery", "T. Natoli", "Z. Pan", "A. Rahlin", "G. Robson", "M. Rouble", "G. Smecher", "V. Yefremenko", "C. Yu", "J. A. Zebrowski", "C. Zhang"], "title": "Design and Performance of the SPT-SLIM Receiver Cryostat", "comment": "6 pages, 6 figures, 1 table. Submitted to IEEE Transactions on\n  Applied Superconductivity (Proceedings of the 21st International Conference\n  on Low Temperature Detectors)", "summary": "The South Pole Telescope Shirokoff Line Intensity Mapper (SPT-SLIM) is a\nmillimeter-wavelength line-intensity mapping experiment, which was deployed on\nthe South Pole Telescope (SPT) during the 2024-2025 Austral summer season. This\npathfinder experiment serves to demonstrate the on-sky operation of multi-pixel\non-chip spectrometer technology. We report on the cryogenic performance of the\nSPT-SLIM receiver for the first year of commissioning observations. The\nSPT-SLIM receiver utilizes an Adiabatic Demagnetization Refrigerator (ADR) for\ncooling the focal plane of superconducting filterbank spectrometers to a\ntemperature of 150 mK. We demonstrate stable thermal performance of the focal\nplane module during observations consistent with thermal modeling, enabling a\ncryogenic operating efficiency above 80%. We also report on the receiver\ncontrol system design utilizing the Observatory Control System (OCS) platform\nfor automated cryogenic operation on the SPT."}
{"id": "2510.14544", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.14544", "abs": "https://arxiv.org/abs/2510.14544", "authors": ["M. Borchiellini", "D. Maurin", "M. Vecchi"], "title": "Revisiting electron-capture decay for Galactic cosmic-ray data", "comment": "23 pages, 7 figures, 6 tables (submitted to Astropart. Phys.)", "summary": "Electron-capture (EC) unstable species in Galactic cosmic rays constrain the\ntime elapsed between nucleosynthesis and acceleration. They have also been\nadvocated as tracers of reacceleration or gas inhomogeneities during their\ntransport. The number of EC-unstable species grows with mass, with an expected\nEC-decay impact more important for larger atomic number and lower energy. We\nrevisit the modelling of EC decay and its detectability in the context of\nrecent unmodulated low-energy (Voyager) and high-precision data for heavy\n(AMS-02) and very-heavy nuclei (ACE-CRIS, CALET and Super-TIGER). We solve the\ntransport equation for a multi-level configuration (up to any number of\nelectrons attached) in the diffusion and leaky-box models. Their decayed\nfractions are found to be qualitatively similar but with very different\nabsolute fluxes. We check that the standard two-level approximation, wherein\nthe cosmic-ray nucleus is fully ionised or with one electron attached, is\nsufficient for most situations. We find that the impact of EC-decay is\nnegligible in current data, except possibly for fluxes or ratios involving\n$^{51}$Cr, $^{55}$Fe, and Co. These conclusions are robust against significant\nuncertainties in the attachment and stripping cross-sections. This first\nanalysis calls for further investigation, as several forthcoming projects\n(e.g., TIGERISS) are targeting $Z>30$ cosmic rays."}
{"id": "2510.14220", "categories": ["astro-ph.IM", "astro-ph.CO"], "pdf": "https://arxiv.org/pdf/2510.14220", "abs": "https://arxiv.org/abs/2510.14220", "authors": ["K. R. Dibert", "M. Adamic", "A. J. Anderson", "P. S. Barry", "B. A. Benson", "C. S. Benson", "E. Brooks", "J. E. Carlstrom", "T. Cecil", "C. L. Chang", "M. Dobbs", "K. Fichman", "K. S. Karkare", "G. K. Keating", "A. M. Lapuente", "M. Lisovenko", "D. P. Marrone", "J. Montgomery", "T. Natoli", "Z. Pan", "A. Rahlin", "G. Robson", "M. Rouble", "G. Smecher", "V. Yefremenko", "M. R. Young", "C. Yu", "J. A. Zebrowski", "C. Zhang"], "title": "An On-Sky Atmospheric Calibration of SPT-SLIM", "comment": "7 pages, 7 figures, submitted to the 2025 International Workshop on\n  Low Temperature Detectors (LTD 2025) proceedings", "summary": "We present the methodology and results of the on-sky responsivity calibration\nof the South Pole Telescope Shirokoff Line Intensity Mapper (SPT-SLIM).\nSPT-SLIM is a pathfinder line intensity mapping experiment utilizing the\non-chip spectrometer technology, and was first deployed during the 2024-2025\nAustral Summer season on the South Pole Telescope. During the two-week on-sky\noperation of SPT-SLIM, we performed periodic measurements of the detector\nresponse as a function of the telescope elevation angle. Combining these data\nwith atmospheric opacity measurements from an on-site atmospheric tipping\nradiometer, simulated South Pole atmospheric spectra, and measured detector\nspectral responses, we construct estimates for the responsivity of SPT-SLIM\ndetectors to sky loading. We then use this model to calibrate observations of\nthe moon taken by SPT-SLIM, cross-checking the result against the known\nbrightness temperature of the Moon as a function of its phase."}
{"id": "2510.14636", "categories": ["astro-ph.HE", "hep-ex"], "pdf": "https://arxiv.org/pdf/2510.14636", "abs": "https://arxiv.org/abs/2510.14636", "authors": ["S. Shefali for the IceCube Collaboration"], "title": "Performance of the Prototype Station of the IceCube Surface Array Enhancement", "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC2025)", "summary": "The prototype station of the Surface Array Enhancement at the IceCube\nNeutrino Observatory has been taking data in its final design since 2023. This\nstation is part of the planned extension within the footprint of the existing\nsurface array, IceTop. One station consists of 8 scintillator detectors, 3\nradio antennas, and a central DAQ. The final upgrade of the scintillation\ndetectors and their firmware at the prototype station has extended the dynamic\nrange and increased the data-taking up-time, thereby expanding the observation\nwindow for air showers. This contribution will discuss the performance of the\nupgraded prototype station after commissioning and its angular resolution\ncapabilities when observing air showers with the scintillation detectors and in\ncoincidence with IceTop. Furthermore, the integration of additional stations\nduring the most recent deployment will be discussed."}
{"id": "2510.14484", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2510.14484", "abs": "https://arxiv.org/abs/2510.14484", "authors": ["Ioannis Apergis", "Daniel Bayliss", "Leonidas Asimakoulas", "Paul Chote", "James McCormac", "Morgan A. Mitchell", "Sam Gill", "Philip G. Steen", "Peter Wheatley"], "title": "High-Precision Photometry with a scientific CMOS Camera: I Lab Testing of the Marana camera", "comment": "27 pages, 25 figures, Accepted to RAS Techniques and Instruments", "summary": "Scientific CMOS cameras are becoming increasingly prevalent in modern\nobservational astronomy. We assess the ability of CMOS image sensors technology\nto perform high-precision photometry with a detailed laboratory\ncharacterization of the Marana 4.2BV-11 CMOS camera. We characterise the camera\nin the Fastest Frame Rate (FFR) and High Dynamic Range (HDR) modes. Our\nevaluation includes read noise, dark current, photo response and dark signal\nnon-uniformities, quantum efficiency and window transmittance. The read noise\nis found to be 1.577\\,e$^-$ for the FFR mode. For the HDR mode the read noise\nfloor is measured to be 1.571\\,e$^-$ for signal levels below approximately\n1800\\,e$^-$. The bias level shows dark signal non-uniformities with values of\n0.318\\,e$^-$ and 0.232\\,e$^-$ for FFR and HDR mode, respectively. Pixel well\ncapacity reached 2366 e$^-$pix$^{-1}$ for the FFR mode and 69026\ne$^-$pix$^{-1}$ with a dynamic range of 93\\,dB for the HDR mode. The camera\ndemonstrates good linearity, yielding linearity errors of 0.099\\,\\% for FFR\nmode and 0.122\\,\\% for HDR mode. The uniformity across the image arrays show a\nphoto response non-uniformity of 0.294\\,\\% for the FFR mode and 0.131\\,\\% for\nthe HDR mode. The dark current displays a noticeable glow pattern, resulting in\nmean dark current levels of $1.674\\pm0.011$\\, \\eps\\, for the FFR mode and\n$1.617\\pm0.008$\\,\\eps\\, for the HDR mode at a constant temperature of\n-25\\,$^\\circ$C. We measured the quantum efficiency across the visible spectrum,\nwith a peak of of >95\\,\\% at 560\\,nm. Our tests indicate that the Marana CMOS\ncamera is potentially capable of performing precise photometry."}
{"id": "2510.14715", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2510.14715", "abs": "https://arxiv.org/abs/2510.14715", "authors": ["Guobin Mou"], "title": "Numerical Studies on the Radio Afterglows in TDE (I): Forward Shock", "comment": null, "summary": "Recent long-term radio monitoring of tidal disruption events (TDEs) suggests\nthat radio afterglows are common. Most studies argue that these afterglows may\narise from forward shocks (FS) produced by the interaction between the TDE\noutflow and the hot, diffuse circumnuclear medium (CNM). Current theoretical\nmodels do not model the evolution of relativistic electrons in space, which\nintroduces uncertainties. Here we conducted hydrodynamic simulations to study\nthe hydrodynamic evolution of relativistic electrons, and calculated the\nsynchrotron spectra via radiative transfer. We focus on the FS scenario with\nnon-relativistic outflows, and various parameters of the outflow and CNM are\nexplored. A moderate outflow with kinetic energy of several $10^{50}$ erg in a\nGalactic center - like CNM can produce mJy-level radio afterglows at a distance\nof 100 Mpc. The self-absorption frequency exhibits a slow decline at early\ntimes and a rapid decrease at late times. We derived the temporal evolution of\nthe high-frequency radio flux, revealing its characteristic rise and decline\npattern. We also find that: (1) the radio spectra for narrow outflows are\nclearly anisotropic along different sight lines; (2) the FS parameters inferred\nfrom radio spectra using conventional analytical formulas deviate significantly\nfrom those in simulations, in which the inferred shock radii are half of those\nfrom simulations, and the inferred energies are an order of magnitude lower."}
{"id": "2510.14506", "categories": ["astro-ph.IM", "physics.pop-ph"], "pdf": "https://arxiv.org/pdf/2510.14506", "abs": "https://arxiv.org/abs/2510.14506", "authors": ["Michael A. Garrett", "Kathryn Denning", "Leslie I. Tennen", "Carol Oliver"], "title": "SETI Post-Detection Protocols: Progress Towards a New Version", "comment": "9 pages, 1 figure. Manuscript presented at the 76th International\n  Astronautical Congress (IAC), Sydney, Australia, 29 September - 3 October\n  2025, IAC 2025 congress proceedings, Paper ID 99704", "summary": "The International Academy of Astronautics (IAA) SETI Committee has long\nprovided guiding principles for responding to a potential detection of a SETI\nsignal. The foundational Declaration of Principles Concerning Activities\nFollowing the Detection of Extraterrestrial Intelligence, first formulated in\n1989, has been widely recognised by the international scientific community. A\nsupplemental set of draft protocols addressing the possibility of a reply to an\nextraterrestrial signal was prepared in 1995 by the IAA SETI Permanent\nCommittee, with both documents presented in a position paper to the UN\nCommittee on the Peaceful Uses of Outer Space in 2000. In keeping with the\nevolving landscape of SETI research, the IAA Declaration of Principles was\nstreamlined and updated in 2010. Recognising the need for continued adaptation,\nthe IAA SETI Committee established a Task Group in 2022 to re-examine the\nprotocols in light of recent advances in search methodologies, the expansion of\ninternational participation in SETI, and the increasing complexity of the\nglobal information environment. The Group recognises the living document nature\nof the protocols, which will require ongoing refinement to remain relevant and\neffective in a rapidly changing world. A draft revised Declaration of\nPrinciples was presented at the IAC 2024 in Milan, and initial feedback was\nreceived from the community, particularly members of the IAA SETI Committee.\nSince then, we have continued to seek broader community input in a structured\nprocess, refining the proposed updates based on further discussions and\nconsultations. A Revised Declaration of Principles, is presented here."}
{"id": "2510.14820", "categories": ["astro-ph.HE", "astro-ph.CO"], "pdf": "https://arxiv.org/pdf/2510.14820", "abs": "https://arxiv.org/abs/2510.14820", "authors": ["Emily M. Silich", "Jack Sayers", "Philip F. Hopkins", "Charles Romero", "Brian Mason", "John Orlowski-Scherer", "Craig L. Sarazin"], "title": "Exploring a cosmic ray inverse-Compton origin to the SZ-to-X-ray pressure deficit in the cool core cluster ZwCl 3146", "comment": "15 pages, 3 figures, submitted to ApJ", "summary": "We explore the possibility that inverse-Compton (IC) scattering of cosmic\nmicrowave background photons by $\\sim$GeV cosmic rays (CRs) injected by the\ncentral active galactic nucleus (AGN) in cool core (CC) clusters produces a\nnon-negligible continuum-like X-ray signal that is easily misinterpreted as\nintracluster medium (ICM) thermal bremsstrahlung continuum. This is\nparticularly relevant to the cooling flow problem--the lack of star formation\nrelative to X-ray-inferred ICM cooling rates. Using ZwCl 3146, a relaxed CC\nsystem at $z = 0.291$, we compare pressure profiles derived via X-rays and the\nthermal Sunyaev-Zel'dovich (SZ) effect. While SZ measurements probe only\nthermal ICM electrons, additional CR-IC emission would appear to boost the\nX-ray-inferred pressure. Relative to unity, we measure a $\\simeq30\\%$ decrement\nin $P_{SZ}/P_X$ within 100 kpc of the ZwCl 3146 center at a statistical\nsignificance of $\\simeq 3.3\\sigma$, consistent with predicted deficits from\nCR-IC contamination in reasonable models of central AGN-driven CR injection.\nX-ray spectral fits of a two-component model with thermal ICM and CR-IC\nemission are consistent with CR-IC as the cause of this deficit. We test\nalternative explanations and systematics that could drive such a decrement,\nwith the leading order systematics associated with halo triaxiality.\nCollectively, these systematics are unlikely to produce a $P_{SZ}/P_X$\ndecrement $\\gtrsim10\\%$. While our results establish that non-negligible CR-IC\nemission is plausible in ZwCl 3146, we stress that more detailed studies of\nlarger cluster samples are required to robustly assess whether CR-IC is\nrelevant to the cooling flow problem."}
{"id": "2510.14839", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2510.14839", "abs": "https://arxiv.org/abs/2510.14839", "authors": ["Zhongnan Dong", "Bin Ma", "Haoran Zhang", "Jinji Li", "Xu Yang", "Yi Hu", "Zhaohui Shang", "Michael C. B. Ashley"], "title": "Antarctic Infrared Binocular Telescope. I. System Overview, Laboratory Testing, and On-Sky Performance Evaluation", "comment": null, "summary": "Infrared time-domain surveys remain significantly underdeveloped compared\nwith their optical counterparts. We have developed the Antarctic Infrared\nBinocular Telescope (AIRBT) to study the dynamic infrared sky at Dome A,\nAntarctica, taking advantage of the superb infrared observational conditions at\nthis site. AIRBT consists of two identical 15 cm f/3 optical tube assemblies\nand two cost-effective indium gallium arsenide (InGaAs) cameras equipped with J\nand H filters, respectively. The cameras have 640 x 512 pixels with a size of\n15 micrometers, providing a scale of 6.9 arcseconds per pixel and a field of\nview of 1.22 x 0.97 square degrees. We characterize the performance of the\nInGaAs cameras, including bias, readout noise, dark current, nonlinearity, and\nphoton transfer curve. Our analysis highlights the distinct behaviors of InGaAs\ncameras compared with charge-coupled devices (CCDs). The bias and readout noise\nshow temperature dependence, and the noise measured from the photon transfer\ncurves has additional components that increase with exposure time. On-sky tests\nwere conducted in October 2022 including system calibration, limiting depth,\nand photometric precision. For a single 3-second exposure, we achieved 5-sigma\nlimiting magnitudes of 11.2 mag (Vega system) in J band and 9.7 mag in H band.\nThe best photometric precision reached 20 millimagnitudes at the bright end,\nwhich could be further improved to sub-percent levels through image stacking.\nAIRBT was installed at Dome A in January 2023, and scientific observations\nbegan as soon as darkness set in."}
{"id": "2510.14850", "categories": ["astro-ph.HE", "gr-qc"], "pdf": "https://arxiv.org/pdf/2510.14850", "abs": "https://arxiv.org/abs/2510.14850", "authors": ["Anna Neuweiler", "Henrique Gieg", "Henrik Rose", "Hauke Koehn", "Ivan Markin", "Federico Schianchi", "Liam Brodie", "Alexander Haber", "Vsevolod Nedora", "Mattia Bulla", "Tim Dietrich"], "title": "General-relativistic radiation magnetohydrodynamics simulations of binary neutron star mergers: The influence of spin on the multi-messenger picture", "comment": null, "summary": "The rich phenomenology of binary neutron star mergers offers a unique\nopportunity to test general relativity, investigate matter at supranuclear\ndensities, and learn more about the origin of heavy elements. As\nmulti-messenger sources, they emit both gravitational waves and electromagnetic\nradiation across several frequency bands. The interpretation of these signals\nrelies heavily on accurate numerical-relativity simulations that incorporate\nthe relevant microphysical processes. Using the latest updates of the BAM code,\nwe perform general-relativistic radiation magnetohydrodynamic simulations of\nbinary neutron star mergers with two different spin configurations. We adopt a\nstate-of-the-art equation of state based on relativistic mean-field theory\ndeveloped for dense matter in neutron star mergers. To capture both dynamical\nejecta and secular outflows from magnetic and neutrino-driven winds, we evolve\nthe systems up to $\\sim 100\\ \\rm ms$ after the merger at considerably high\nresolution with a grid spacing of $\\Delta x \\approx 93\\ \\rm m$ across the\nneutron stars. Our results show that the non-spinning configuration undergoes a\nmore violent merger, producing more ejecta with lower electron fraction and\nhigher velocities, while the spinning configuration forms a larger disk due to\nits higher angular momentum. Although the initial magnetic field amplification\nwithin $\\lesssim 10\\ \\rm ms$ after merger is similar in both systems, the\nnon-spinning system reaches stronger magnetic fields and higher energies at\nlater times. For a detailed view of the multi-messenger observables, we extract\nthe gravitational-wave signal and compute nucleosynthesis yields, the expected\nkilonova and afterglow light curves from our ejecta profiles."}
{"id": "2510.14879", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2510.14879", "abs": "https://arxiv.org/abs/2510.14879", "authors": ["V. Alfradique", "R. da Mata", "J. C. Rodríguez-Ramírez", "C. R. Bom"], "title": "Multi-wavelength analysis of the progenitor of GRB 230307A via Bayesian model comparison", "comment": "14 pages, 3 tables, 5 figures. Submitted to PRD", "summary": "GRB 230307A is one of the brightest long-duration gamma-ray bursts (GRBs)\never detected, yet its progenitor remains uncertain due to the variety of\nplausible astrophysical scenarios. In this work, we investigate four possible\nprogenitors for GRB 230307A: a binary neutron star (BNS), a neutron star--white\ndwarf (NS--WD) system, a neutron star--black hole (NS--BH) merger, and a tidal\ndisruption event (TDE) involving a white dwarf and a supermassive black hole.\nAdditionally, we explore three distinct central engine models powering the\nkilonova associated with the BNS: radioactive decay of $r$-process nuclei in a\ntwo-component ejecta model, a magnetar-driven model including magnetic dipole\nspin-down, and a combined model of magnetar spin-down with ${}^{56}$Ni\nradioactive decay. We perform Bayesian multi-wavelength light-curve analyses\nusing physically motivated models and priors, and evaluate model performance\nthrough Bayes factors and leave-one-out cross-validation (LOO) scores. Our\nresults show a statistical preference for a BNS or NS--WD progenitor producing\na kilonova powered by a magnetar and ${}^{56}$Ni decay, characterized by a\n${}^{56}$Ni mass of $\\sim4\\times10^{-4}\\,M_{\\odot}$ and an ejecta mass of\n$0.06\\,M_{\\odot}$. Furthermore, under the assumption of a BNS origin within\nthis model, we infer binary component masses of $m_{1} =\n1.81^{+0.46}_{-0.61}\\,M_{\\odot}$ and $m_{2} = 1.61^{+0.65}_{-0.41}\\,M_{\\odot}$,\nwith a dimensionless tidal deformability of $\\tilde{\\Lambda} =\n471^{+318}_{-395}$. From the component mass posteriors, we infer that the\nobserved offset can be explained by a natal kick as long as the systemic\nvelocity is nearly aligned with the pre-kick orbital motion. In this case, the\nrequired kick velocity (co-moving frame) and binary separation range within\n$v'_{\\mathrm{k}}\\sim100$--$150~\\mathrm{km\\,s^{-1}}$, and\n$a_0\\sim2$--$3~R_{\\odot}$, respectively."}
{"id": "2510.14908", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2510.14908", "abs": "https://arxiv.org/abs/2510.14908", "authors": ["Isabel S. Sands", "Philip F. Hopkins", "Sam B. Ponnada"], "title": "Fermi Bubbles Without AGN: Gamma-Ray Bubbles in MHD Galaxy Formation Simulations with Full Cosmic Ray Spectra", "comment": "8 pages, 5 figures", "summary": "For the first time, we show in MHD simulations with cosmological initial\nconditions that bi-lobed gamma-ray outflows similar to the Fermi bubbles can\nform from star formation and supernova feedback, without involvement from\nactive galactic nuclei (AGN). We use simulations run with full MHD and\ndynamical, on-the-fly multi-species cosmic ray transport in MeV-TeV energy bins\nto model gamma-ray emission in Milky Way-mass spiral galaxies from neutral pion\ndecay, relativistic non-thermal Bremsstrahlung, and inverse Compton scattering.\nWe find that these gamma-ray outflows are present in all three Milky-Way mass\nsimulated galaxies. The amplitude, shape, and the composition of the gamma-ray\nspectrum of these bubbles fluctuates over time, with lepton-dominated and\nhadron-dominated phases. Spectra in which there is O(1) more gamma-ray flux\nfrom inverse Compton scattering than neutral pion decay are a good fit to the\nmeasured Fermi-LAT spectrum. Additionally, these simulations predict\nmulti-wavelength features in soft x-rays and synchrotron radio, potentially\nproviding new observational signatures that can connect the circumgalactic\nmedium to cosmic ray physics and activity in the galactic center."}
{"id": "2510.14938", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2510.14938", "abs": "https://arxiv.org/abs/2510.14938", "authors": ["Rashid Sunyaev", "Ildar Khabibullin", "Eugene Churazov", "Marat Gilfanov", "Pavel Medvedev", "Sergey Sazonov"], "title": "X-ray panorama of the SS433/W50 complex by SRG/eROSITA", "comment": "12+2 pages, 9 figures, submitted to A&A", "summary": "Galactic microquasar SS433 and the radio nebula W50 surrounding it present a\nprototypical example of a hyper-Eddington binary system shaping its ambient\ninterstellar medium via energetic outflows. In this paper, we present X-ray\nobservations of the SS433/W50 complex by the eROSITA telescope onboard the SRG\nspace observatory. These data provide images of the entire nebula characterized\nby a very large dynamic range and allow spectral analysis of the diffuse X-ray\nemission. In particular, these data illustrate a close connection between the\nthermal and non-thermal components of W50 on scales ranging from sub-parsecs,\nrepresented by narrow X-ray bright filaments, to the entire extent $\\gtrsim\n100\\,{\\rm pc}$ of the nebula. These data also allow us to fully characterize a\npair of nearly symmetric, sharp-edged, elongated structures aligned with the\norbital axis of the binary system, which lack radio counterparts, but are\nprominent in very high energy gamma-ray emission. The resulting multifaceted\npicture of the interaction between energetic outflows and the surrounding\nmedium paves the way for future focused multiwavelength observations and\ndedicated numerical simulations."}
{"id": "2510.14202", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.14202", "abs": "https://arxiv.org/abs/2510.14202", "authors": ["Edgar P. Vidal", "Alexander T. Gagliano", "Carolina Cuesta-Lazaro"], "title": "Hierarchical Simulation-Based Inference of Supernova Power Sources and their Physical Properties", "comment": "9 pages, 4 figures, Accepted at the 2025 Machine Learning and the\n  Physical Sciences (ML4PS) workshop at NeurIPS", "summary": "Time domain surveys such as the Vera C. Rubin Observatory are projected to\nannually discover millions of astronomical transients. This and complementary\nprograms demand fast, automated methods to constrain the physical properties of\nthe most interesting objects for spectroscopic follow up. Traditional\napproaches to likelihood-based inference are computationally expensive and\nignore the multi-component energy sources powering astrophysical phenomena. In\nthis work, we present a hierarchical simulation-based inference model for\nmulti-band light curves that 1) identifies the energy sources powering an event\nof interest, 2) infers the physical properties of each subclass, and 3)\nseparates physical anomalies in the learned embedding space. Our architecture\nconsists of a transformer-based light curve summarizer coupled to a\nflow-matching regression module and a categorical classifier for the physical\ncomponents. We train and test our model on $\\sim$150k synthetic light curves\ngenerated with $\\texttt{MOSFiT}$. Our network achieves a 90% classification\naccuracy at identifying energy sources, yields well-calibrated posteriors for\nall active components, and detects rare anomalies such as tidal disruption\nevents (TDEs) through the learned latent space. This work demonstrates a\nscalable joint framework for population studies of known transients and the\ndiscovery of novel populations in the era of Rubin."}
