{"id": "2511.11787", "categories": ["astro-ph.IM", "cs.CV", "cs.LG"], "pdf": "https://arxiv.org/pdf/2511.11787", "abs": "https://arxiv.org/abs/2511.11787", "authors": ["Sultan Hassan", "Sambatra Andrianomena", "Benjamin D. Wandelt"], "title": "Towards Mitigating Systematics in Large-Scale Surveys via Few-Shot Optimal Transport-Based Feature Alignment", "comment": "5 pages, 3 figures, accepted to NeurIPS Workshop on Unifying Representations in Neural Models (UniReps 2025)", "summary": "Systematics contaminate observables, leading to distribution shifts relative to theoretically simulated signals-posing a major challenge for using pre-trained models to label such observables. Since systematics are often poorly understood and difficult to model, removing them directly and entirely may not be feasible. To address this challenge, we propose a novel method that aligns learned features between in-distribution (ID) and out-of-distribution (OOD) samples by optimizing a feature-alignment loss on the representations extracted from a pre-trained ID model. We first experimentally validate the method on the MNIST dataset using possible alignment losses, including mean squared error and optimal transport, and subsequently apply it to large-scale maps of neutral hydrogen. Our results show that optimal transport is particularly effective at aligning OOD features when parity between ID and OOD samples is unknown, even with limited data-mimicking real-world conditions in extracting information from large-scale surveys. Our code is available at https://github.com/sultan-hassan/feature-alignment-for-OOD-generalization."}
{"id": "2511.11806", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2511.11806", "abs": "https://arxiv.org/abs/2511.11806", "authors": ["J. K. M. Viuho", "A. A. Djupvik", "A. N. Sørensen", "D. Kumar", "P. Steiner", "J. P. U. Fynbo", "S. Armas", "M. I. Andersen"], "title": "KDP as a thermal blocking filter - Deep near IR observations with a warm narrow band filter", "comment": "16 pages, 8 figures, 6 tables. Submitted to PASP", "summary": "Ground-based astronomy suffers from strong atmospheric line- and thermal continuum emission, at the near infrared (NIR, 0.7-1.1$μ$m), and short-wave infrared (SWIR, 1.1-2.5$μ$m) wavelengths. The thermal continuum emission increases exponentially towards the red sensitivity cutoff of the state-of-the-art 2.5$μ$m cutoff SWIR detectors. Given availability of an optical quality shortpass filter material with strong blocking density in the SWIR, lower cost instrumentation, and higher performance filters could be designed. We demonstrate monopotassium dihydrogen phosphate (KDP, chemical formula KH$_2$PO$_4$) as a strong candidate for this purpose. KDP is fully transparent at wavelengths from ultraviolet to 1.3$μ$m, but becomes highly opaque at wavelengths >2$μ$m. We demonstrate on-sky use of KDP by improving performance of a cryogenic broadband filter with known off-band thermal leak, and using a non-cryogenic narrow band filter for deep observation. KDP reduces the sky background by 4.5 magnitudes in the leaky Z-band filter we use. Our 4nm wide, central wavelength 1.191$μ$m narrowband filter in combination with KDP reduces the sky surface brightness by three magnitudes compared to a J broadband. We find a sky surface brightness of 18.5mag arcsec$^{-2}$ at 1.191$μ$m, and interpret it as the airglow continuum. KDP is an excellent thermal blocker, when its temperature is maintained above its Curie point at 123K. Below Curie point, KDP transforms its crystal structure, degrading its otherwise good imaging properties."}
{"id": "2511.12195", "categories": ["astro-ph.IM", "physics.soc-ph"], "pdf": "https://arxiv.org/pdf/2511.12195", "abs": "https://arxiv.org/abs/2511.12195", "authors": ["Johannes Buchner"], "title": "High-impact Scientific Software in Astronomy and its creators", "comment": "This is metascience - research about research in astrophysics. Resubmitted to BAAS after 2 positive referee reports", "summary": "In the last decades, scientific software has graduated from a hidden side-product to a first-class member of the astrophysics literature. We aim to quantify the activity and impact of software development for astronomy, using a systematic survey. Starting from the Astrophysics Source Code Library and the Journal of Open Source Software, we analyse 3432 public git-based scientific software packages. Paper abstract text analysis suggests seven dominant themes: cosmology, data reduction pipelines, exoplanets, hydrodynamic simulations, radiative transfer spectra simulation, statistical inference and galaxies. We present key individual software contributors, their affiliated institutes and countries of high-impact software in astronomy & astrophysics. We consider the number of citations to papers using the software and the number of person-days from their git repositories, as proxies for impact and complexity, respectively. We find that half of the mapped development is through US-affiliated institutes, and a large number of high-impact projects are led by a single person. Our results indicate that there are currently over 200 people active on any given day to improve software in astronomy."}
{"id": "2511.12262", "categories": ["astro-ph.IM", "hep-ex"], "pdf": "https://arxiv.org/pdf/2511.12262", "abs": "https://arxiv.org/abs/2511.12262", "authors": ["Mario Bertaina", "Matteo Battisti", "JEM-EUSO collaboration"], "title": "Implications of Mini-EUSO measurements for a space-based observation of UHECRs", "comment": null, "summary": "Mini--EUSO (Multiwavelength Imaging New Instrument for the Extreme Universe Space Observatory, known as \\emph{UV atmosphere} in the Russian Space Program) is the first mission of the JEM-EUSO program on board the International Space Station. It was launched in August 2019 and it is operating since October 2019 being located in the Russian section (Zvezda module) of the station and viewing our planet from a nadir-facing UV-transparent window. The instrument is based on the concept of the original JEM-EUSO mission and consists of an optical system employing two Fresnel lenses of 25 cm each and a focal surface composed of 36 Multi-Anode Photomultiplier tubes, 64 channels each, for a total of 2304 channels with single photon counting sensitivity and an overall field of view of 44$^\\circ \\times $44$^\\circ$. Mini-EUSO can map the night-time Earth in the near UV range (predominantly between 290 nm and 430 nm), with a spatial resolution of about 6~km and different temporal resolutions of 2.5~$μ$s, 320~$μ$s and 41 ms. Mini-EUSO observations are extremely important to better assess the potential of a space-based detector in studying Ultra-High Energy Cosmic Rays (UHECRs) such as K-EUSO and POEMMA. In this contribution we focus the attention on the results of the UV measurements and we place them in the context of UHECR observations from space, namely the estimation of exposure for the planned M-EUSO (Multi-messenger Extreme Universe Space Observatory) mission."}
{"id": "2511.11796", "categories": ["astro-ph.HE", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2511.11796", "abs": "https://arxiv.org/abs/2511.11796", "authors": ["Beatrice Giudici", "Michael Gabler", "Hans-Thomas Janka"], "title": "Hydrodynamic instabilities in long-term three-dimensional simulations of neutrino-driven supernovae of 13 red supergiant progenitors", "comment": "29 pages, 20 figures, 5 tables. Submitted to MNRAS", "summary": "We present long-term three-dimensional (3D) simulations of Type-IIP supernovae (SNe) for 13 non-rotating, single-star, red-supergiant (RSG) progenitors with zero-age-main-sequence masses between 12.5 M$_{\\odot}$ and 27.3 M$_{\\odot}$. The explosions were modelled with a parametric treatment of neutrino heating to obtain defined energies, ${}^{56}$Ni yields, and neutron-star properties in agreement with previous results. Our 3D SN models were evolved from core bounce until 10 days to study how the large-scale mixing of chemical elements depends on the progenitor structure. Rayleigh-Taylor instabilities (RTIs), which grow at the (C+O)/He and He/H interfaces and interact with the reverse shock forming after the SN shock has passed the He/H interface, play a crucial role in the outward mixing of ${}^{56}$Ni into the hydrogen envelope. We find most extreme ${}^{56}$Ni mixing and the highest maximum ${}^{56}$Ni velocities in lower-mass (LM) explosions despite lower explosion energies, and the weakest ${}^{56}$Ni mixing in the 3D explosions of the most massive RSGs. The efficiency of radial ${}^{56}$Ni mixing anti-correlates linearly with the helium-core mass and correlates positively with the magnitude of a local maximum of $ρr^3$ in the helium shell. This maximum causes shock deceleration and therefore facilitates high growth factors of RTI at the (C+O)/He interface in the LM explosions. Therefore fast-moving ${}^{56}$Ni created by the asymmetric neutrino-heating mechanism is carried into the ubiquitous RT-unstable region near the He/H interface and ultimately far into the envelopes of the exploding RSGs. Our correlations may aid improving mixing prescriptions in 1D SN models and deducing progenitor structures from observed SN properties."}
{"id": "2511.12353", "categories": ["astro-ph.IM", "physics.soc-ph"], "pdf": "https://arxiv.org/pdf/2511.12353", "abs": "https://arxiv.org/abs/2511.12353", "authors": ["Yuan-Sen Ting", "Alberto Accomazzi", "Tirthankar Ghosal", "Tuan Dung Nguyen", "Rui Pan", "Zechang Sun", "Tijmen de Haan"], "title": "AstroMLab 5: Structured Summaries and Concept Extraction for 400,000 Astrophysics Papers", "comment": "16 pages, 4 figures, 7 tables. Accepted to AACL-IJCNLP 2025 WASP Workshop", "summary": "We present a dataset of 408,590 astrophysics papers from arXiv (astro-ph), spanning 1992 through July 2025. Each paper has been processed through a multi-stage pipeline to produce: (1) structured summaries organized into six semantic sections (Background, Motivation, Methodology, Results, Interpretation, Implication), and (2) concept extraction yielding 9,999 unique concepts with detailed descriptions. The dataset contains 3.8 million paper-concept associations and includes semantic embeddings for all concepts. Comparison with traditional ADS keywords reveals that the concepts provide denser coverage and more uniform distribution, while analysis of embedding space structure demonstrates that concepts are semantically dispersed within papers-enabling discovery through multiple diverse entry points. Concept vocabulary and embeddings are publicly released at https://github.com/tingyuansen/astro-ph_knowledge_graph."}
{"id": "2511.11863", "categories": ["astro-ph.HE", "astro-ph.IM", "cs.LG"], "pdf": "https://arxiv.org/pdf/2511.11863", "abs": "https://arxiv.org/abs/2511.11863", "authors": ["Ole König", "Daniela Huppenkothen", "Douglas Finkbeiner", "Christian Kirsch", "Jörn Wilms", "Justina R. Yang", "James F. Steiner", "Juan Rafael Martínez-Galarza"], "title": "Modeling X-ray photon pile-up with a normalizing flow", "comment": "Accepted in Machine Learning and the Physical Sciences Workshop, NeurIPS 2025", "summary": "The dynamic range of imaging detectors flown on-board X-ray observatories often only covers a limited flux range of extrasolar X-ray sources. The analysis of bright X-ray sources is complicated by so-called pile-up, which results from high incident photon flux. This nonlinear effect distorts the measured spectrum, resulting in biases in the inferred physical parameters, and can even lead to a complete signal loss in extreme cases. Piled-up data are commonly discarded due to resulting intractability of the likelihood. As a result, a large number of archival observations remain underexplored. We present a machine learning solution to this problem, using a simulation-based inference framework that allows us to estimate posterior distributions of physical source parameters from piled-up eROSITA data. We show that a normalizing flow produces better-constrained posterior densities than traditional mitigation techniques, as more data can be leveraged. We consider model- and calibration-dependent uncertainties and the applicability of such an algorithm to real data in the eROSITA archive."}
{"id": "2511.12356", "categories": ["astro-ph.IM", "astro-ph.SR", "cs.CE", "physics.comp-ph", "quant-ph"], "pdf": "https://arxiv.org/pdf/2511.12356", "abs": "https://arxiv.org/abs/2511.12356", "authors": ["Rasmit Devkota", "John H. Wise"], "title": "QuaRT: A toolkit for the exploration of quantum methods for radiation transport", "comment": "7 pages, submitted to Journal of Open Source Software", "summary": "QuaRT is a Python library for quantum simulation of radiative transfer in astrophysical and cosmological problems. It features a novel angular redistribution methodology for lattice Boltzmann methods which improves the isotropy of simulations of objects such as stars in non-scattering media."}
{"id": "2511.11887", "categories": ["astro-ph.HE", "gr-qc"], "pdf": "https://arxiv.org/pdf/2511.11887", "abs": "https://arxiv.org/abs/2511.11887", "authors": ["Francois Foucart"], "title": "Disk mass predictions for binary neutron star mergers: limitations of proposed symbolic regression models", "comment": "5p, 2 figures", "summary": "Modeling disk formation and mass ejection in binary neutron star systems is an important component in the construction of models for the electromagnetic signals powered by these events. Most models rely on analytical formulae for the disk mass and dynamical ejecta that are fitted to the results of numerical simulations, yet these fits have large uncertainties that significantly limit our ability to extract information from merger observations. In a recent manuscript, Darc et al claim that disk mass formulae constructed using symbolic regression outperform existing formulae and robustly extend to regions of the parameter space outside of the fitting region. I show here that the improvement over the most directly comparable existing model comes mostly from the use of different error measures in optimizing the fitting parameters. For the limited training data used so far, that existing fitting formula has a performance similar to symbolic regression models when optimized over the same error measure. More importantly, I show that many of the formulae obtained through symbolic regression provide unphysical results when used over the whole range of parameters relevant to the modeling of binary neutron star mergers, making them dangerous to use within parameter estimation pipelines. I conclude that fitting formulae with more physics input (e.g. Lund et al 2025), albeit certainly imperfect, remain safer to use in data analysis than these symbolic regression results. Symbolic regression results used in conjunction with careful physics-based vetting may however outperform them in the future."}
{"id": "2511.12364", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2511.12364", "abs": "https://arxiv.org/abs/2511.12364", "authors": ["Matteo Battisti"], "title": "The X-$γ$ detector onboard the POEMMA-Balloon with Radio payload", "comment": null, "summary": "The POEMMA-Balloon with Radio (PBR) is a NASA mission designed to study Ultra-High-Energy Cosmic Rays and Very-High-Energy Neutrinos from a balloon platform. Serving as a precursor to the planned POEMMA satellite mission, PBR will be launched aboard a NASA Super Pressure Balloon for a flight at of 33 km altitude in Spring 2027 from Wanaka, New Zealand. The unique conditions of low pressure and high altitude will enable in-situ observations of High-Altitude Horizontal Air Showers (HAHAs), a poorly understood class of nearly horizontal Extensive Air Showers induced by cosmic rays skimming the Earth's atmosphere without reaching the ground. Due to the lower atmospheric grammage at these altitudes, HAHAs develop more gradually compared to typical downward-going EASs, with interaction lengths on the order of 100 km. This slow development allows balloon-borne instruments to probe the early stages of cosmic ray shower evolution. At these early stages, high-energy electrons and positrons from the electromagnetic component of the shower can generate X-rays and gamma rays via synchrotron radiation. The X-$γ$ detector onboard PBR is designed to measure these photons across a broad energy range. The instrument consists of four sub-detectors, each optimized for different overlapping energy bandfrom tens of keV to MeV. The current design utilizes CsI(Tl)/NaI(Tl) scintillating crystals coupled with SiPMs for photon detection. To suppress background noise, the detectors are enclosed within an anti-coincidence system to reject charged particle events. The X-$γ$ detector is aligned with PBR's primary instruments, the Fluorescence Camera and the Cherenkov Camera, within a 30$^\\circ$ field of view, overlapping with both imaging cameras. It will operate in a triggered mode, with the possibility to receive signals from the other instruments to check for simultaneous events."}
{"id": "2511.11936", "categories": ["astro-ph.HE", "hep-ph"], "pdf": "https://arxiv.org/pdf/2511.11936", "abs": "https://arxiv.org/abs/2511.11936", "authors": ["Stefano Profumo", "Aria Koul", "Anika Malladi", "Ben Schmitt"], "title": "Through the Heliospheric Lens: Directional Deflection of High-Energy Cosmic-Ray Electrons and Positrons", "comment": "22 pages, 9 figures", "summary": "We investigate how the large-scale heliosphere alters the arrival directions of high-energy cosmic-ray electrons and positrons and ask if and when this \"heliospheric lens\" can be ignored for anisotropy and source-association studies - an especially timely topic given, for instance, the persistent cosmic-ray positron fraction and its unknown origin. Using a modular back-tracing framework, we explore a set of widely used magnetic-field descriptions - from a Parker spiral baseline to more structured configurations that include latitudinal wind contrasts, Smith-Bieber-type azimuthal strengthening, and tilted or wavy heliospheric current sheets. Across these models the picture is consistent: most bending is accumulated within the inner tens of astronomical units and decreases rapidly with energy. Field choices and solar-cycle geometry set the overall normalization, with stronger spiral winding or a more highly tilted current sheet producing larger deflections at the same energy. Differences between electrons and positrons are most apparent at lower energies, where drift histories and current-sheet encounters diverge, and become increasingly small at multi-TeV energies. We summarize these trends with a practical threshold energy describing when heliospheric bending falls below an instrument's angular resolution, and we verify that our conclusions are robust to numerical settings. For current instruments, heliospheric effects can usually be treated as a small correction at the highest energies, while sub-TeV analyses benefit from a calibrated envelope that accounts for plausible field configurations during the observing epoch."}
{"id": "2511.12481", "categories": ["astro-ph.IM", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2511.12481", "abs": "https://arxiv.org/abs/2511.12481", "authors": ["Zhao-Jun Yan", "Huan-Yuan Shan", "Zhen-Ya Zheng", "Xi-Yan Peng", "Zhao-Xiang Qi", "Chun Xu", "Lin Lin", "Xin-Rong Wen", "Chun-Yan Jiang", "Li-Xin Zheng", "Jing Zhong", "Fang-Ting Yuan", "Zhen-Lei Chen", "Wei Chen", "Mao-Chun Wu", "Zhen-Sen Fu", "Ke-Xin Li", "Lin Nie", "Chao Liu", "Nan Li", "Qiao Wang", "Zi-Huang Cao", "Shuai Feng", "Guo-Liang Li", "Lei Wang", "Cheng-Liang Wei", "Xiao-Bo Li", "Zhang Ban", "Xun Yang", "Yu-Xi Jiang", "De-Zi Liu", "Yong-He Chen", "Xiao-Hua Liu", "Fang Xu", "Xue Cheng", "Yue Su", "Tong-Fang Duan", "Chao Qi", "Na Li", "Geng Zheng", "Chong Ma", "Jing Tang", "Ran Li"], "title": "Mock Observations for the CSST Mission: Multi-Channel Imager--Instrument Simulation", "comment": "28 pages, 21 figures, accepted by RAA", "summary": "The Chinese Space Station Survey Telescope (CSST), a two-meter aperture astronomical space telescope under China's manned space program, is equipped with multiple back-end scientific instruments. As an astronomical precision measurement module of the CSST, the Multi-Channel Imager (MCI) can cover a wide wavelength range from ultraviolet to near-infrared with three-color simultaneous high-precision photometry and imaging, which meets the scientific requirements for various fields. The diverse scientific objectives of MCI require not only a robust airborne platform, advanced optical systems, and observing facilities but also comprehensive software support for scientific operations and research. To this end, it is essential to develop realistic observational simulation software to thoroughly evaluate the MCI data stream and provide calibration tools for future scientific investigations. The MCI instrument simulation software will serve as a foundation for the development of the MCI data processing pipeline and will facilitate improvements in both hardware and software, as well as in the observational operation strategy, in alignment with the mission's scientific goals. In conclusion, we present a comprehensive overview of the MCI instrument simulation and some corresponding performances of the MCI data processing pipeline."}
{"id": "2511.12362", "categories": ["astro-ph.HE", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2511.12362", "abs": "https://arxiv.org/abs/2511.12362", "authors": ["D. Farias", "C. Gall", "V. A. Villar", "K. Auchettl", "K. M. de Soto", "A. Gagliano", "W. B. Hoogendam", "G. Narayan", "A. Sedgewick", "S. K. Yadavalli", "Y. Zenati", "C. R. Angus", "K. W. Davis", "J. Hjorth", "W. V. Jacobson-Galán", "D. O. Jones", "C. D. Kilpatrick", "M. J. Bustamante Rosell", "D. A. Coulter", "G. Dimitriadis", "R. J. Foley", "A. Gangopadhyay", "H. Gao", "M. E. Huber", "L. Izzo", "J. L. Johnson", "A. L. Piro", "A. Rest", "C. Rojas-Bravo", "M. R. Siebert", "K. Taggart", "S. Tinyanont"], "title": "Characterization of type Ibn SNe", "comment": "25 pages, 13 figures, 7 tables", "summary": "Type Ibn supernovae (SNe) are characterized by narrow helium (He I) lines from photons produced by the unshocked circumstellar material (CSM). About 80 SNe Ibn have been discovered to date, and only a handful have extensive observational records. Thus, many open questions regarding the progenitor system and the origin of the CSM remain. Here we investigate potential correlations between the spectral features of the prominent He I $λ$5876 line and the optical and X-ray light curve properties of SNe Ibn. We compile the largest sample of 61 SNe Ibn to date, of which 24 SNe have photometric and spectroscopic data from the Young Supernova Experiment and 37 SNe have archival data sets. We fit 24 SNe Ibn with sufficient photometric coverage ($B$ to $z$ bands) using semi-analytical models from MOSFiT. We demonstrate that the light curves of SNe Ibn are more diverse than previous analyses suggest, with absolute $r$-band peak magnitudes of $-19.4\\pm0.6$~mag and rise (from $-10$ days to peak) and decay-rates (from peak to +10 days) of $-0.08\\pm0.06$ and $0.08\\pm0.03$ mag/day, respectively. We find that the majority of SNe Ibn in the sub-sample are consistent with a low-energy explosion ($<10^{51}$ erg) of a star with a compact envelope surrounded by $\\sim$0.1 M$_{\\odot}$ of helium-rich CSM. The inferred ejecta masses are small ($\\sim 1$ M$_{\\odot}$) and expand with a velocity of $\\sim$5000 km/s. Our spectroscopic analysis shows that the mean velocity of the narrow component of the He I lines, associated to the CSM, peaks at $\\sim1100$ km/s. The mean CSM and ejecta masses inferred for a sub-sample of SNe Ibn indicate that their progenitors are not massive ($\\sim10$ M$_{\\odot}$), single stars at the moment of explosion, but are likely binary systems. This agrees with the detection of potential companion stars of SNe Ibn progenitors, and the inferred CSM properties from stellar evolution models."}
{"id": "2511.12483", "categories": ["astro-ph.IM", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2511.12483", "abs": "https://arxiv.org/abs/2511.12483", "authors": ["Zhao-Jun Yan", "Jun Yin", "Lei Hao", "Shi-Yin Shen", "Wei Chen", "Shuai Feng", "Yi-Fei Xiong", "Chun Xu", "Xin-Rong Wen", "Lin Lin", "Chao Liu", "Lin Long", "Zhen-Lei Chen", "Mao-Chun Wu", "Xiao-Bo Li", "Zhang Ban", "Xun Yang", "Yu-Xi Jiang", "Guo-Liang Li", "Ke-Xin Li", "Jian-Jun Chen", "Nan Li", "Cheng-Liang Wei", "Lei Wang", "Bai-Chuan Ren", "Jun Wei", "Jing Tang", "Ran Li"], "title": "Mock Observations for the CSST Mission: Integral Field Spectrograph--Instrument Simulation", "comment": "24 pages, 17 figures, accepted by RAA", "summary": "The Chinese Space Station Survey Telescope (CSST) is a next-generation Stage-IV facility renowned for its wide field of view, high image quality, and multi-band observational capabilities. Among the five instruments onboard the CSST, the Integral Field Spectrograph (IFS) offers the unique ability to simultaneously capture spatial and spectral information across a field of view of no less than $6^{''}\\times6^{''}$. Key advantages of the IFS include a high spatial resolution of $0.2^{''}$ and a broad spectral coverage from 350 to 1000 nm, making it an ideal instrument for studying physical processes in the vicinity of supermassive black holes within galaxies. To more accurately assess the technical and scientific performance of the CSST-IFS, it is essential to develop a simulation tool that incorporates realistic effects from all optical components. Such a simulation will form an integral part of the CSST-IFS data and pipeline system, enabling the development of the data reduction pipeline well ahead of actual observations. This paper presents an end-to-end simulation workflow for the CSST-IFS, incorporating a wide range of instrumental effects that may influence its spectral and imaging performance. The simulation accounts for optical diffraction effects introduced by all components, such as image slicers and slit array, as well as sub-pixel effects from gratings. It also includes various detector noises, frame-shifting effects, and charge-transfer inefficiency. Real observational conditions--such as target Doppler shift, cosmic rays, and other in-orbit operational effects--are also considered. We describe the technical implementation of the simulation and present results that quantitatively characterize key instrument parameters."}
{"id": "2511.12466", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.12466", "abs": "https://arxiv.org/abs/2511.12466", "authors": ["Manoj Ghising", "Nirpat Subba", "Mohammed Tobrej", "Binay Rai", "Bikash Chandra Paul"], "title": "Spectral-Timing Evolution of a Black hole X-ray binary Swift J1727.8-1613: Linking Disk Reflection and Type-C QPO Frequency During the 2023 Outburst", "comment": "Accepted for publication in JHEAP journal, 13 pages, 10 figures and 3 tables", "summary": "We present a comprehensive spectral-timing analysis of a BHXB Swift J1727.8$-$1613 during its 2023 outburst, using five pointed \\textit{NuSTAR} observations sampling the luminous hard-intermediate state. Broadband 3-79 keV spectroscopy employs a physically motivated model combining a cool truncated disk (\\texttt{diskbb}), relativistic reflection (\\texttt{relxill} in reflection-only mode), and Comptonized continuum (\\texttt{nthComp}) to probe the inner accretion geometry around a rapidly spinning black hole ($a_\\ast\\!=\\!0.98$) at moderate inclination. Simultaneous timing analysis reveals type-C quasi-periodic oscillations (QPOs) with novel coherence evolution: the quality factor ($Q$) exhibits a striking non-monotonic dependence on both QPO frequency and luminosity, peaking near $ν_{\\rm QPO}\\!\\sim\\!1.2$~Hz and declining at both lower and higher frequencies. This turnover directly constrains Lense-Thirring precession geometry, implying optimal coherence at intermediate truncation radius. A tight photon-index-QPO-frequency correlation demonstrates that spectral softening and frequency rise are concurrent signatures of inward truncation-radius motion. The triadic luminosity evolution-rising disk and Compton, declining reflection-traces precession-driven geometry changes and corona beaming effects. Interpreting disk-normalization variability as apparent-area changes rather than physical radius swings provides new insight into disk-corona boundary layers. These quantitative results provide strong evidence for global Lense-Thirring precession regulation of both timing and spectral properties, establishing Swift J1727.8$-$1613 as a benchmark source for understanding accretion-geometry physics during black hole state transitions."}
{"id": "2511.13030", "categories": ["astro-ph.IM", "astro-ph.EP"], "pdf": "https://arxiv.org/pdf/2511.13030", "abs": "https://arxiv.org/abs/2511.13030", "authors": ["Stephen Catsamas", "Sarah Caddy", "Michele Trenti", "Benjamin Metha", "Simon Barraclough", "Robert Mearns", "Airlie Chapman", "Rachel Webster"], "title": "Thermal infrared characterization of spatially unresolved resident space objects: Prospects from analytical two-component modeling", "comment": "33 pages, 13 figures. To be published in Advances in Space Research", "summary": "In this work we investigate the potential of a thermal infrared (IR) space telescope to remotely characterize the component temperatures of a satellite. With the rapid increase in the number of objects launched in recent years, the ability to detect, track, identify and determine the intent of satellites has become of increasing importance. Spectral modeling of satellites from multi-wavelength photometry in the thermal IR is a technique that has the potential to derive information about the temperature and operational status of a satellite in orbit, without the requirement to spatially resolve the target. Previous work has focused on determination of a single/effective temperature for a Resident Space Objects (RSOs) - such as satellites, asteroids, debris and rocket bodies - from remote observations, obtaining mixed results in terms of ability to classify objects. To progress, we explore a two-greybody component spectral model. Using this analytical model, we investigate which temperature characteristics may be identified from unresolved multi-wavelength photometric observations as a function of the signal-to-noise ratio, under the assumption of Poisson noise-dominated data. With this instrument-agnostic framework, we then quantify the potential of this model to discriminate between RSOs with a single temperature (e.g. natural rocks) versus human-made satellites with a chassis and deployed solar panels where significant component temperature differences exist under typical orbital configurations. Last, we comment on promising prospects of this model for applications to existing and future space telescope observations to characterize RSOs from spatially unresolved photometry"}
{"id": "2511.12477", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.12477", "abs": "https://arxiv.org/abs/2511.12477", "authors": ["Yanan Wang", "Zikun Lin", "Linhui Wu", "Weihua Lei", "Shuyuan Wei", "Shuang-Nan Zhang", "Long Ji", "Santiago del Palacio", "Ranieri D. Baldi", "Yang Huang", "Jifeng Liu", "Bing Zhang", "Aiyuan Yang", "Rurong Chen", "Yangwei Zhang", "Ailing Wang", "Lei Yang", "Panos Charalampopoulos", "David R. A. Williams-Baldwin", "Zhu-Heng Yao", "Fu-Guo Xie", "Defu Bu", "Hua Feng", "Xinwu Cao", "Hongzhou Wu", "Wenxiong Li", "Erlin Qiao", "Giorgos Leloudas", "Joseph P Anderson", "Xinwen Shu", "Dheeraj R. Pasham", "Hu Zou", "Matt Nicholl", "Thomas Wevers", "Tomas E. Muller-Bravo", "Jing Wang", "Jianyan Wei", "Yu-Lei Qiu", "Weijian Guo", "Claudia P. Gutierrez", "Mariusz Gromadzki", "Cosimo Inserra", "Lydia Makrygianni", "Francesca Onori", "Tanja Petrushevska", "Diego Altamirano", "Lluis Galbany", "Miguel Perez-Torres", "Ting-Wan Chen"], "title": "Detection of disk-jet co-precession in a tidal disruption event", "comment": "76 pages, 13 figures (initial submission; in press at Science Advances)", "summary": "Theories and simulations predict that intense spacetime curvature near black holes bends the trajectories of light and matter, driving disk and jet precession under relativistic torques. However, direct observational evidence of disk-jet co-precession remains elusive. Here, we report the most compelling case to date: a tidal disruption event (TDE) exhibiting unprecedented 19.6-day quasi-periodic variations in both X-rays and radio, with X-ray amplitudes exceeding an order of magnitude. The nearly synchronized X-ray and radio variations suggest a shared mechanism regulating the emission regions. We demonstrate that a disk-jet Lense-Thirring precession model successfully reproduces these variations while requiring a low-spin black hole. This study uncovers previously uncharted short-term radio variability in TDEs, highlights the transformative potential of high-cadence radio monitoring, and offers profound insights into disk-jet physics."}
{"id": "2511.13094", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2511.13094", "abs": "https://arxiv.org/abs/2511.13094", "authors": ["Hong-Bang Liu", "Zu-Ke Feng", "Huan-Bo Feng", "Di-Fan Yi", "Li-Rong Xie", "Yan-Jun Xie", "Zong-Wang Fan", "Jin Zhang", "Wen-Jin Xie", "Xue-Feng Huang", "Wei Deng", "Fei Xie", "Dong Wang", "Zi-Li Li", "Hui Wang", "Ran Chen", "Shi-Qiang Zhou", "Kai Chen", "Jin Li", "Qian Liu", "Shi Chen", "Rui-Ting Ma", "Bin-Long Wang", "Zhen-Yu Tang", "Hang-Zhou Li", "Bo Peng", "Shu-Lin Liu", "Xiang-Ming Sun", "Yang-Heng Zheng", "En-Wei Liang"], "title": "Wide-Field X-ray Polarimetry for High Energy Astronomical Transients: First results of the pathfinder CXPD Cubesat Mission", "comment": null, "summary": "The Low Energy Polarization Detector (LPD) is a key component of the next-generation large-scale Gamma-Ray Burst polarimeter, POLAR-2. It is designed for polarization observations of transient sources in the soft X-ray energy range with a wide field of view (FOV). To validate the key technologies required for wide-FOV X-ray polarization measurements, the Cosmic X-ray Polarization Detector (CXPD) CubeSat was developed as a prototype for the LPD. The CXPD is equipped with two Gas Microchannel Plate Pixel Detectors (GMPDs) that measure X-ray polarization via the photoelectric effect, where ejected photoelectrons produce ionization tracks in the gas which are imaged to reconstruct their emission directions. Laboratory calibrations of the modulation factor and energy spectra were successfully performed using linear polarized X-ray sources at 2.98 keV, 4.51 keV, 6.40 keV, and 8.05 keV. Since its launch in June 2023, the CXPD has successfully completed critical in-orbit technology verification. It has also performed polarization observations of two bright X-ray sources Sco X-1 and the transient Swift J1727.8-1613 yielding constraints on their polarization degrees and angles. Notably, this was the first time that an anti-coincidence detector had been implemented in an X-ray polarimeter, enabling in-orbit verification of the charged-particle background rejection algorithm. These results demonstrate the feasibility of wide-field soft X-ray polarization measurements and provide essential guidance for the development of the LPD for the POLAR-2 mission, thereby advancing the frontier of X-ray polarization astronomy."}
{"id": "2511.12716", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.12716", "abs": "https://arxiv.org/abs/2511.12716", "authors": ["Joanna M. Rankin", "Vyacheslav Zakharenko", "Oleg Ulyanov", "Ihor Kravtsov", "Pratik Kumar", "Jean-Mathias Griessmeier", "N. D. Ramesh Bhat", "Geoff Wright", "Patrick Weltevrede", "Fabian Jankowski", "Jerome Petri", "Gilles Theureau"], "title": "Pulsar B1237+25 Aberration/Retardation Analysis from Decimeter to Decameter Wavelength: Challenge to \"Radius-to-Frequency Mapping\"", "comment": "Main paper with unpublished appendix", "summary": "PSR B1237+25 is perhaps the canonical example of a pulsar with a core/double cone profile. Moreover, it is bright with little spectral turnover, and its profile perhaps uniquely remains undistorted by scattering far into the decametric band. Here we assemble more than a dozen of the highest quality profiles (30 MHz to 5 GHz) from half a dozen observatories, where possible polarimetric. The pulsar's 2.6$^{\\circ}$ core component marks the magnetic axis longitude, and we confirm that this point coincides both with the linear polarization angle inflection point and the zero-crossing of its antisymmetric circular signature -- thus providing the possibility to estimate emission heights over a very broad band using aberration/retardation (A/R). We then carefully fit the profile components with Gaussians to identify and study the subtle asymmetries produced by A/R. We find a consistent A/R in the pulsar's profiles of some 0.5$^{\\circ}$ longitude or 2 ms -- corresponding to a putative conal emission height of 200-400 km -- with a formal error of about 100 km. Our analysis finds no evidence whatsoever for an emission height increase with wavelength, the so-called ``radius-to-frequency mapping''. Nor do we find any significant difference in A/R effect between the outer and inner cones."}
{"id": "2511.13224", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2511.13224", "abs": "https://arxiv.org/abs/2511.13224", "authors": ["Devina Mohan", "Anna M. M. Scaife"], "title": "Natural gradient descent for improving variational inference based classification of radio galaxies", "comment": "Accepted to Machine Learning and the Physical Sciences Workshop, NeurIPS 2025", "summary": "Bayesian neural networks (BNNs) are most commonly optimised with first-order optimisers such as stochastic gradient descent. However, when optimising for parameters of probabilistic models, incorporating second order information during optimisation can lead to a more direct path in the distribution space and faster convergence. In this work we examine whether using natural gradient descent can improve the performance of variational inference based classification of radio galaxies. We use the Improved Variational Online Newton (iVON) algorithm and compare its performance against a recent benchmark for BNNs for radio galaxy classification. We find that iVON results in better uncertainty calibration out of all the methods previously considered while providing similar predictive performance to the best performing inference methods such as Hamiltonian Monte Carlo and Bayes by Backprop based variational inference. Models trained with iVON can distinguish far out-of-distribution optical galaxy data, but they cannot reliably detect radio galaxy images from a telescope with different resolution and sensitivity. We find that the cold posterior effect persists in the models trained with iVON. Our results suggest that the choice of the optimiser can lead to qualitatively different solutions and future work using probabilistic neural network models should carefully consider the inductive biases being encoded through the optimisation process, in addition to the data, architecture and inference method."}
{"id": "2511.13008", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.13008", "abs": "https://arxiv.org/abs/2511.13008", "authors": ["Jongho Park", "Kazuya Takahashi", "Kenji Toma", "Kazuhiro Hada", "Masanori Nakamura", "Hung-Yi Pu", "Keiichi Asada", "Paul T. P. Ho", "Motoki Kino", "Tomohisa Kawashima", "Minchul Kam", "Kunwoo Yi", "Ilje Cho"], "title": "Helical Magnetic Field in the Acceleration--Collimation Zone of the M87 Jet", "comment": "28 pages, 21 figures, 1 table, accepted for publication in the Astrophysical Journal Letters", "summary": "Relativistic jets from supermassive black holes are expected to be magnetically launched and guided, with magnetic energy systematically converted to bulk kinetic energy throughout an extended acceleration-collimation zone (ACZ). A key prediction of magnetohydrodynamic (MHD) models is a transition from poloidally dominated fields near the engine to toroidally dominated fields downstream, yet direct tests within the ACZ are hampered by weak polarization and strong Faraday rotation. We report quasi-simultaneous, high-sensitivity, multifrequency very long baseline interferometric polarimetry of M87 spanning 1.4-24.4GHz. We present high-fidelity, Faraday rotation-corrected maps of intrinsic linear polarization that continuously resolve the ACZ in the de-projected distance range of ~9e3 to ~3.6e5 gravitational radii from the black hole. The maps reveal pronounced north-south asymmetries in fractional linear polarization and electric vector position angle (EVPA), peaking in the inner ACZ at a projected distance of ~20mas along the jet and remaining prominent out to ~100mas. These signatures are best reproduced by models with a large-scale, ordered helical field that retains a substantial poloidal component-contrary to the rapid toroidal dominance expected under steady, ideal MHD. This tension implies ongoing magnetic dissipation that limits toroidal buildup over the ACZ. The handedness of the helix provides an independent constraint on the black hole's spin direction, supporting a spin vector oriented away from the observer, consistent with the orientation inferred from horizon-scale imaging. Farther downstream, the asymmetries diminish, and the EVPA and fractional polarization distributions become more symmetric; we tentatively interpret this as evolution toward a more poloidally dominated configuration, while noting current sensitivity and dynamic-range limits."}
{"id": "2511.13377", "categories": ["astro-ph.IM", "eess.SP"], "pdf": "https://arxiv.org/pdf/2511.13377", "abs": "https://arxiv.org/abs/2511.13377", "authors": ["Amélie Canin", "Cédric Févotte", "Nicolas Dobigeon", "Dries Van De Putte", "Takashi Onaka", "Olivier Berné"], "title": "PDRs4All XX. Haute Couture: Spectral stitching of JWST MIRI-IFU cubes with matrix completion", "comment": null, "summary": "MIRI is the imager and spectrograph covering wavelengths from $4.9$ to $27.9$ $μ$m onboard the James Webb Space Telescope (JWST). The Medium-Resolution Spectrometer (MRS) consists of four integral field units (IFU), each of which has three sub-channels. The twelve resulting spectral data cubes have different fields of view, spatial, and spectral resolutions. The wavelength range of each cube partially overlaps with the neighboring bands, and the overlap regions typically show flux mismatches which have to be corrected by spectral stitching methods. Stitching methods aim to produce a single data cube incorporating the data of the individual sub-channels, which requires matching the spatial resolution and the flux discrepancies. We present Haute Couture, a novel stitching algorithm which uses non-negative matrix factorization (NMF) to perform a matrix completion, where the available MRS data cubes are treated as twelve sub-matrices of a larger incomplete matrix. Prior to matrix completion, we also introduce a novel pre-processing to homogenize the global intensities of the twelve cubes. Our pre-processing consists in jointly optimizing a set of global scale parameters that maximize the fit between the cubes where spectral overlap occurs. We apply our novel stitching method to JWST data obtained as part of the PDRs4All observing program of the Orion Bar, and produce a uniform cube reconstructed with the best spatial resolution over the full range of wavelengths."}
{"id": "2511.13148", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2511.13148", "abs": "https://arxiv.org/abs/2511.13148", "authors": ["Jakob Beise", "María Durán de las Heras", "Segev BenZvi", "Spencer Griswold", "Nora Valtonen-Mattila", "Evan O'Connor", "David Barba-González", "Erin O'Sullivan"], "title": "Prospects for detecting periodic or sharp fast-time features in the supernova neutrino lightcurve with IceCube", "comment": "Presented at the XIX International Conference on Topics in Astroparticle and Underground Physics (TAUP 2025)", "summary": "Neutrinos produced in core-collapse supernova offer a direct probe into the hydrodynamics and energy transport mechanisms during the collapse and play a pivotal role in the shock revival and success of the supernova explosion. Fast-time features of the neutrino luminosity and energy spectrum encode information about phenomena such as turbulence, convection, shock revival and potential quark-hadron phase transitions. In this study, we explore the detection capabilities of large-volume neutrino telescopes with a focus on IceCube and the planned extension IceCube-Gen2. Furthermore, we consider the effect on the detection sensitivity from wavelength shifters through enhanced light collection.\n  A variety of models predict periodic fast-time features in supernova light curves; to quantify their detectability without relying on specific models, we investigate the detector response to a generic parameterisation of such features. We find that independent of feature frequency, IceCube-Gen2 instrumented with wavelength shifters has sensitivity to weaker modulations ($>25\\%$ amplitude) as compared to only the strongest modulations ($>50\\%$ amplitude) with IceCube. In addition, we examine the sensitivity of the neutrino lightcurve to sharp features from a quark-hadron phase transition. Phase transitions leading to a quark star remnant are detectable with IceCube at $5σ$ up to the edge of the Galaxy, and throughout the Small Magellanic Cloud with IceCube-Gen2 equipped with wavelength-shifters. In contrast, models collapsing into a black hole are observable only within the Galaxy, covering $41\\%$ of the CCSNe population for IceCube and nearly all ($91\\%$) for IceCube-Gen2 complemented by wavelength shifters. These results highlight the potential of IceCube-Gen2 for detecting Galactic sources more reliably and with greater reach."}
{"id": "2511.11863", "categories": ["astro-ph.HE", "astro-ph.IM", "cs.LG"], "pdf": "https://arxiv.org/pdf/2511.11863", "abs": "https://arxiv.org/abs/2511.11863", "authors": ["Ole König", "Daniela Huppenkothen", "Douglas Finkbeiner", "Christian Kirsch", "Jörn Wilms", "Justina R. Yang", "James F. Steiner", "Juan Rafael Martínez-Galarza"], "title": "Modeling X-ray photon pile-up with a normalizing flow", "comment": "Accepted in Machine Learning and the Physical Sciences Workshop, NeurIPS 2025", "summary": "The dynamic range of imaging detectors flown on-board X-ray observatories often only covers a limited flux range of extrasolar X-ray sources. The analysis of bright X-ray sources is complicated by so-called pile-up, which results from high incident photon flux. This nonlinear effect distorts the measured spectrum, resulting in biases in the inferred physical parameters, and can even lead to a complete signal loss in extreme cases. Piled-up data are commonly discarded due to resulting intractability of the likelihood. As a result, a large number of archival observations remain underexplored. We present a machine learning solution to this problem, using a simulation-based inference framework that allows us to estimate posterior distributions of physical source parameters from piled-up eROSITA data. We show that a normalizing flow produces better-constrained posterior densities than traditional mitigation techniques, as more data can be leveraged. We consider model- and calibration-dependent uncertainties and the applicability of such an algorithm to real data in the eROSITA archive."}
{"id": "2511.13156", "categories": ["astro-ph.HE", "astro-ph.GA", "astro-ph.SR", "gr-qc"], "pdf": "https://arxiv.org/pdf/2511.13156", "abs": "https://arxiv.org/abs/2511.13156", "authors": ["Zhi Li", "Jiancheng Yu"], "title": "Observational properties of a Schwarzschild black hole surrounded by a Dehnen-type dark matter halo", "comment": "14 pages, 11 figures", "summary": "This study investigates the accretion process and observational signatures of thin accretion disks around a Schwarzschild black hole (BH) embedded in a Dehnen-type dark matter (DM) halo. We examine the influence of the density ρ_{s} and radius r_{s} of the DM halo on key disk properties, including the energy flux, temperature distribution, and emission spectrum. Our results show that all three of these quantities decrease with increasing ρ_{s} or r_{s}. Furthermore, by generating and analyzing both direct and secondary images of the accretion disk, we explore how the observational inclination angle and the DM halo parameters ρ_{s} and rs affect image profiles. Finally, the observed flux distributions are presented for different inclination angles. Our findings indicate that the accretion disk becomes colder and dimmer as the DM halo parameters increase, highlighting the significant role of DM in shaping BH observables."}
{"id": "2511.13148", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2511.13148", "abs": "https://arxiv.org/abs/2511.13148", "authors": ["Jakob Beise", "María Durán de las Heras", "Segev BenZvi", "Spencer Griswold", "Nora Valtonen-Mattila", "Evan O'Connor", "David Barba-González", "Erin O'Sullivan"], "title": "Prospects for detecting periodic or sharp fast-time features in the supernova neutrino lightcurve with IceCube", "comment": "Presented at the XIX International Conference on Topics in Astroparticle and Underground Physics (TAUP 2025)", "summary": "Neutrinos produced in core-collapse supernova offer a direct probe into the hydrodynamics and energy transport mechanisms during the collapse and play a pivotal role in the shock revival and success of the supernova explosion. Fast-time features of the neutrino luminosity and energy spectrum encode information about phenomena such as turbulence, convection, shock revival and potential quark-hadron phase transitions. In this study, we explore the detection capabilities of large-volume neutrino telescopes with a focus on IceCube and the planned extension IceCube-Gen2. Furthermore, we consider the effect on the detection sensitivity from wavelength shifters through enhanced light collection.\n  A variety of models predict periodic fast-time features in supernova light curves; to quantify their detectability without relying on specific models, we investigate the detector response to a generic parameterisation of such features. We find that independent of feature frequency, IceCube-Gen2 instrumented with wavelength shifters has sensitivity to weaker modulations ($>25\\%$ amplitude) as compared to only the strongest modulations ($>50\\%$ amplitude) with IceCube. In addition, we examine the sensitivity of the neutrino lightcurve to sharp features from a quark-hadron phase transition. Phase transitions leading to a quark star remnant are detectable with IceCube at $5σ$ up to the edge of the Galaxy, and throughout the Small Magellanic Cloud with IceCube-Gen2 equipped with wavelength-shifters. In contrast, models collapsing into a black hole are observable only within the Galaxy, covering $41\\%$ of the CCSNe population for IceCube and nearly all ($91\\%$) for IceCube-Gen2 complemented by wavelength shifters. These results highlight the potential of IceCube-Gen2 for detecting Galactic sources more reliably and with greater reach."}
{"id": "2511.13263", "categories": ["astro-ph.HE", "nucl-th"], "pdf": "https://arxiv.org/pdf/2511.13263", "abs": "https://arxiv.org/abs/2511.13263", "authors": ["Yoonhak Nam", "Kazuyuki Sekizawa"], "title": "Vortex creep heating in neutron star cooling with direct Urca processes in heavy neutron stars", "comment": "20 pages, 14 figures, 1 table", "summary": "Old, thermally bright neutron stars imply internal heating at late times. Among candidate mechanisms, vortex creep heating (VCH) provides a robust link between spin-down and frictional dissipation in the pinned inner-crust superfluid, yet its interplay with fast DUrca cooling in massive stars remains insufficiently explored.\n  We (i) implement VCH in our cooling code and validate it; (ii) identify the physically consistent domain where the steady-state form $L_{\\text{h}}=J|\\dotΩ_\\infty|$ applies; (iii) quantify how $(B,P_0)$ regulate observable VCH signatures under DUrca cooling; and (iv) introduce a 3D representation that resolves degeneracies hidden in standard 2D projections.\n  Cooling is computed with BSk24 and APR EoS, standard pairing gaps, and iron/carbon envelopes. VCH is modeled with $J\\simeq10^{42.9\\text{--}43.8}$ erg s, and a quantum-creep coverage fraction $f_{\\text{Q}}(t)$ diagnoses when steady-state heating is valid. We survey $B=10^{10\\text{--}13}$ G and $P_0=10$--$570$ ms for $1.4$ and $2.0\\,M_\\odot$, and compare with a curated set of ordinary pulsars with measured $(P,\\dot P)$.\n  Results: (1) Our implementation reproduces published VCH bands. (2) The $(B,P_0)$ validity boundary follows magnetic-dipole spin-down, confirming consistency with $|\\dotΩ|$. (3) DUrca+VCH maintains $T_{\\text{s}}^\\infty\\gtrsim10^5$ K for $B\\gtrsim10^{11-12}$ G up to $P_0\\sim10^2$ ms. (4) The 3D representation shows that sources appearing coincident in $(t,T_{\\text{s}}^\\infty)$ occupy distinct $B$-layers, removing degeneracies.\n  VCH can substantially reshape late-time thermal states when spin-down power remains high; its observability depends chiefly on $(B,P_0)$ rather than on mass alone. We provide a practical $(B,P_0)$ validity map for $L_{\\text{h}}=J|\\dotΩ_\\infty|$ and advocate treating $B$ as a co-equal axis in cooling analyses. (Shortened due to the arXiv words limit.)"}
{"id": "2511.13265", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.13265", "abs": "https://arxiv.org/abs/2511.13265", "authors": ["Yu-Hao Zhang", "Liang-Duan Liu", "Ze-Xin Du", "Guang-Lei Wu", "Jing-Yao Li", "Yun-Wei Yu"], "title": "TransFit-CSM: A Fast, Physically Consistent Framework for Interaction-Powered Transients", "comment": "19 pages 10 figures", "summary": "We present TransFit-CSM, a fast and physically consistent framework for modeling interaction-powered transients. The method self-consistently couples the ejecta circumstellar medium (CSM) shock dynamics to radiative diffusion from a moving heating boundary tied to the shocks, so that both the photon escape path and the effective diffusion time evolve with radius and time. We solve the mass and momentum equations for the forward and reverse shocks together with the diffusion equation in the unshocked CSM. TransFit-CSM reproduces the canonical sequence of an early dark phase, a diffusion-mediated rise and peak, and a post-interaction cooling tail, and it clarifies why Arnett-like peak scalings break down in optically thick CSM. The framework is well suited for Bayesian inference and constrains physical parameters of the ejecta and CSM from bolometric or joint multi-band light curves. Applications to SN 2006gy and SN 2010jl yield accurate fits and physically interpretable posteriors, highlighting the dominant role of pre-supernova mass loss in shaping the observables. Because it is both computationally efficient and physically grounded, TransFit-CSM bridges simple analytic prescriptions and radiation-hydrodynamic simulations, enabling population-level inference for current and future time-domain surveys."}
{"id": "2511.13314", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.13314", "abs": "https://arxiv.org/abs/2511.13314", "authors": ["J. Quirola-Vásquez", "P. G. Jonker", "A. J. Levan", "D. B. Malesani", "F. E. Bauer", "N. Sarin", "G. P. Lamb", "A. Martin-Carrillo", "J. Sánchez-Sierras", "M. Fraser", "L. Izzo", "M. E. Ravasio", "D. Mata Sánchez", "M. A. P. Torres", "J. N. D. van Dalen", "A. P. C. van Hoof", "J. A. Chacón", "S. Littlefair", "V. S. Dhillon", "L. Cotter", "G. Corcoran", "R. A. J. Eyles-Ferris", "P. T. O'Brien", "D. Stern", "V. D'Elia", "D. H. Hartmann"], "title": "Unveiling the nature of the Einstein Probe transient EP 241021a", "comment": "21 pages, 15 Figures (+3 in an Appendix), accepted for publication in MNRAS", "summary": "We present a multi-wavelength analysis of the fast X-ray transient EP 241021a, discovered by the Wide-field X-ray Telescope aboard the \\emph{Einstein Probe} satellite on 2024 October 21. The event was not detected in gamma-rays. Follow-up observations from $\\sim$1.5 to 100 days post-trigger were obtained across X-ray, UV, optical, near-infrared, and radio bands with ground- and space-based facilities. The redshift is constrained to $z = 0.7485$ from prominent optical spectral features. The optical light curve shows complex evolution: an initial $\\sim t^{-0.7}$ decay, followed by a rapid re-brightening peaking at day 7.7 with $\\sim t^{-1.7}$ decay, and a third phase peaking near day 19 with $\\sim t^{-1.3}$ decay. The spectral energy distribution (SED) and its temporal evolution are consistent with a mix of non-thermal and thermal components. Early optical-to-X-ray spectral indices agree with optically thin synchrotron emission, while steepening of the optical SED after $\\sim$20 days indicates either a shift in emission mechanism or the emergence of an additional component. Although broad-lined absorption features are absent, comparisons with type Ic-BL supernovae suggest a SN contribution at late times, suggesting a collapsar origin for EP 241021a. The likely SN in EP 241021a appears to require an additional energy source beyond $^{56}$Ni decay. These results support the view that some fast X-ray transients detected by the \\emph{Einstein Probe} arise from massive stellar explosions."}
{"id": "2511.13317", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2511.13317", "abs": "https://arxiv.org/abs/2511.13317", "authors": ["Hanxiao Xia", "Ziming Wang", "Jianghua Wu", "Yue Fang", "Shiyu Du"], "title": "Multiple Components and Spectral Evolution of BL Lacertae as Revealed by Multiwavelength Variability and SED Modeling", "comment": "24 pages, 10 figures, 5 tables, submitted to ApJ", "summary": "BL Lac has entered an active state since 2020, with multiwavelength observations revealing intense flares. In this study, we conducted 12-night multicolor optical monitoring using an 85 cm telescope from 2020 September to 2024 June and collected long-term broad-band archived data from radio to $γ$-rays. Intraday variabilities were detected on four nights, and most of them exhibited a bluer-when-brighter behavior. Both clockwise and counterclockwise spectral hysteresis loops were found within a single night. However, no reliable intraband time lag was detected for the intranight variabilities. On long timescales, the cross-correlation analysis shows that the variations of the optical, X-ray, and $γ$-ray bands do not reveal an obvious time delay, while the variations in the radio bands lagged them by about 370 days. The measured time lags suggest two distinct emission regions respectively responsible for the optical to $γ$-ray radiation and for the radio radiation, with a spatial separation of approximately $4.50\\times10^{19}\\ \\rm cm$. We modeled the broad-band spectral energy distributions during four flaring epochs and one quiescent epoch, and found evidence for the possible persistent existence of a very high energy emission region. We also confirmed a spectral evolution of the source from an intermediate synchrotron peaked BL Lac object to a low synchrotron peaked BL Lac object."}
{"id": "2511.13633", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.13633", "abs": "https://arxiv.org/abs/2511.13633", "authors": ["T. Mondal", "S. Razzaque", "JC. Joshi", "S. Majumder", "D. Bose"], "title": "Multi Messenger Study of GRB 221009A with VHE Gamma-ray and Neutrino Afterglow from a Gaussian Structured Jet", "comment": "16 pages, 10 figures", "summary": "Recent detections of very-high-energy (VHE; $\\gtrsim 100$~GeV) emission from GRB afterglows, notably the unprecedented brightness of GRB~221009A observed by LHAASO, reveal emission components beyond the standard electron synchrotron model. Multi-TeV photons motivate synchrotron self-Compton and possibly hadronic contributions, while the non-detection of coincident neutrinos by IceCube/KM3NeT/GRAND200k constrains the microphysical parameters, jet kinetic energy and ambient medium density. We model the VHE afterglow of GRB 221009A with an external forward shock from a Gaussian structured jet in a uniform density medium. This angular structure reproduces the extreme TeV output at an off-axis angle but without demanding large energies as in a top-hat jet. We also compute the corresponding $pγ$ neutrino flux in the PeV-EeV energies and derive a time-integrated upper limit based on the effective areas of IceCube Gen2 and GRAND200k, providing the contributions of individual GRBs to the neutrino events. The predicted neutrino flux for GRB 221009A with model parameters inferred from multi-wavelength spectral energy distribution lies below the sensitivities of these detectors. Even under highly optimistic microphysical conditions, our correlation analysis infers that the events from this GRB are of order $\\sim 0.1$ for upcoming GRAND200k. We also compare neutrino fluxes for on-axis and off-axis viewing geometries and find that jet orientation alone can introduce nearly an order of magnitude variation in the signal. Thus, our studies imply that a GRB both brighter and closer than GRB 221009A would be crucial for any neutrino detections by upcoming neutrino telescopes. Future GRB detections by the CTA will provide important constraints on their geometry, radiation mechanisms, and any potential associated neutrino signals."}
{"id": "2511.13686", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.13686", "abs": "https://arxiv.org/abs/2511.13686", "authors": ["N. Cruz-Sanchez", "E. A. Saavedra", "F. A. Fogantini", "F. García", "J. A. Combi"], "title": "The hard ultraluminous state of NGC 5055 ULX X-1", "comment": "Accepted for publication in Astronomy & Astrophysics", "summary": "We present the results of the first broadband X-ray analysis of the ultraluminous X-ray source NGC 5055 ULX X-1, combining simultaneous data from XMM$-$Newton and NuSTAR missions, with a combined exposure time of $\\sim$100 ks across the $0.3-20$ keV energy range. The source exhibits a stable flux across the entire exposure with no detectable pulsations by any instrument on their X-ray light curves, placing pulsed-fraction upper limits of 10% and 32% for XMM$-$Newton and NuSTAR, respectively. The X-ray spectrum is dominated by two thermal components consistent with the emission from an accretion disk, and shows a weak high-energy tail above 10 keV, with no statistical requirement for an additional nonthermal component. The unabsorbed $0.3-20$ keV luminosity is ${\\sim}2\\times10^{40}$ erg s$^{-1}$, evidencing the ULX nature of the source. The parameters obtained from spectral modeling are consistent with the hard ultraluminous state. Despite the fact that a neutron-star accretor cannot be ruled out by the available data, under the assumption that the compact object in NGC 5055 ULX X-1 is a black hole accreting through a geometrically thick, radiation-pressure-supported disk that drives an optically thick wind, we constrained its putative mass to $11-26$ M$_{\\odot}$."}
