{"id": "2510.08654", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.08654", "abs": "https://arxiv.org/abs/2510.08654", "authors": ["A. Pathania", "K. K. Singh", "S. K. Singh", "A. Tolamatti", "B. B. Singh", "K. K. Yadav"], "title": "Identification of Gamma Ray Pulsar Candidates in the \\emph{Fermi}-LAT 4FGL-DR4 Unassociated Sources Using Supervised Machine Learning", "comment": "16 Pages, 8 Figures, 7 Tables, Accepted in Astroparticle Physics\n  Journal", "summary": "The Large Area Telescope (LAT) on board the \\emph{Fermi} Gamma-ray Space\nTelescope has been continuously providing good quality\n  survey data of the entire sky in the high energy range from 30 MeV to 500 GeV\nand above since August 2008. A succession of gamma-ray\n  source catalogs is published after a comprehensive analysis of the\n\\emph{Fermi}--LAT data. The most recent release of data in the\n  fourth \\emph{Fermi}--LAT catalog of gamma-ray sources (4FGL-DR4), based on\nthe first 14 years of observations in the energy band\n  50 MeV-1 TeV, contains 7195 sources. A large fraction ($\\sim$ 33\\%) of this\npopulation has no known counterparts in the lower wave\n  bands. Such high energy gamma-ray sources are referred to as unassociated or\nunidentified. An appropriate classification of these\n  objects into known type of gamma-ray sources such as the active galactic\nnuclei or pulsars is essential for population studies and\n  pointed multi-wavelength observations to probe the radiative processes. In\nthis work, we perform a detailed classification of the\n  unassociated sources reported in the 4FGL-DR4 catalog using two supervised\nmachine learning techniques-Random Forest and\n  Extreme Gradient Boosting. We mainly focus on the identification of new\ngamma-ray pulsar candidates by making use of different\n  observational features derived from the long-term observations with the\n\\emph{Fermi}--LAT and reported in the incremental 4FGL-DR4 catalog.\n  We also explore the effects of data balancing approach on the classification\nof the \\emph{Fermi}--LAT unassociated sources."}
{"id": "2510.08707", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.08707", "abs": "https://arxiv.org/abs/2510.08707", "authors": ["Yossef Zenati", "Conrado Albertus Torres", "Joseph Silk", "M. Ángeles Pérez-García"], "title": "Neutrino signal from the hadron-quark phase transition in the conversion of Neutron Stars into Quark Stars", "comment": "Comments are welcome, submitted to PLB", "summary": "We calculate in a 1D General Relativistic (GR) hydrodynamic simulation the\nneutrino luminosity in an astrophysical scenario where a neutron star (NS)\ndisplays a hadron-quark phase transition (HQPT) into a Quark Star (QS).\nDeconfinement is triggered once the central density exceeds a critical\nthreshold above $\\sim 3n_0$ being $n_0$, saturation density. We use\ndescriptions based on DD2 and the MIT Bag model equations of state (EOSs). We\naccount for neutrinos using a microphysics forward emission model including\n$e^-e^+$ annihilation, plasmon decay, nucleon (N) modified (or direct) Urca\nprocesses, and $NN$ bremsstrahlung, and, for the post transition, the quark\ndirect Urca and an opacity-based leakage scheme with GR redshift. We find that\nthe neutrino light curve generically develops a short $\\simeq$10-50 ms,\nspectrally harder feature near deconfinement, appearing as either a prompt\nshoulder or a distinct secondary peak. Heavy lepton neutrinos result in a\ndelayed peak with respect to the previous. We identify three diagnostics that\nare only mildly degenerate with hadronic uncertainties: (i) an enhanced\npeak-to-plateau ratio $R_{\\rm pp}$ sourced by latent-heat release, (ii) a\ncharacteristic lag $\\Delta t$ between the collapse rise and the HQPT feature\nthat tracks the central density trajectory, and (iii) a flavor hardening\n$\\Delta\\!\\langle E_\\nu\\rangle$ driven by quark-matter phase space. After MSW\nflavor conversion, these signatures remain detectable with current experiments.\nFor a Galactic event ($d\\sim 10$ kpc), IceCube and Hyper-K should resolve the\nHQPT feature and distinguish it from both no transition NS collapse and\ncanonical core-collapse supernova (CCSN) templates."}
{"id": "2510.08764", "categories": ["astro-ph.HE", "gr-qc"], "pdf": "https://arxiv.org/pdf/2510.08764", "abs": "https://arxiv.org/abs/2510.08764", "authors": ["Colter J. Richardson", "Anthony Mezzacappa", "Kya Schluterman", "Haakon Andresen", "Eric J. Lentz", "Pedro Marronetti", "Daniel Murphy", "Michele Zanolin"], "title": "Low-Frequency Gravitational Waves in Three-Dimensional Core-Collapse Supernova Models", "comment": "19 pages, 19 figures", "summary": "We discuss the low-frequency gravitational wave signals from three\nstate-of-the-art three-dimensional core-collapse supernova models produced with\nthe \\textsc{Chimera} supernova code. We provide a detailed derivation of the\ngravitational wave signal sourced from the anisotropic emission of neutrinos\nand provide the total (fluid sourced and neutrino sourced) gravitational waves\nsignal generated in our models. We discuss the templatablity of this\nlow-frequency signal, which is useful for future work involving matched\nfiltering for signal detection and parameter estimation."}
{"id": "2510.08848", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.08848", "abs": "https://arxiv.org/abs/2510.08848", "authors": ["Nicholas S. Conroy", "Michi Bauböck", "Vedant Dhruv", "Daeyoung Lee", "Chi-kwan Chan", "Abhishek V. Joshi", "Ben Prather", "Charles F. Gammie"], "title": "Event Horizon Telescope Pattern Speeds in the Visibility Domain", "comment": null, "summary": "The Event Horizon Telescope is preparing to produce time sequences of black\nhole images, or movies. In anticipation, we developed an autocorrelation\ntechnique to measure apparent rotational motion using the image-domain pattern\nspeed $\\Omega_p$. Here, we extend this technique to the visibility domain and\nintroduce the visibility amplitude pattern speed $\\Omega_{\\mathrm{VA}}$. We\nshow that in the Illinois v3 library of EHT source models,\n$\\Omega_{\\mathrm{VA}}$ depends on the source inclination, black hole mass,\nblack hole spin, accretion state (MAD or SANE), and baseline length, and then\nprovide approximate fits for this dependence. We show that\n$\\Omega_{\\mathrm{VA}}$ is particularly sensitive to baseline length for MAD\n(strongly magnetized) models, and that the slope of this dependence can be used\nto constrain black hole spin. As with $\\Omega_p$, models predict that\n$\\Omega_{\\mathrm{VA}}$ is well below the Keplerian frequency in the emission\nregion for all model parameters. This is consistent with the idea that\n$\\Omega_{\\mathrm{VA}}$ measures an angular phase speed for waves propagating\nthrough the emission region. Finally, we identify the information that would be\nprovided by space-based millimeter VLBI such as the proposed BHEX mission."}
{"id": "2510.08636", "categories": ["astro-ph.IM", "astro-ph.EP"], "pdf": "https://arxiv.org/pdf/2510.08636", "abs": "https://arxiv.org/abs/2510.08636", "authors": ["Ryan Felton", "Caleb Scharf", "Stuart Bartlett", "Nathalie A. Cabrol", "Victoria Da Poian", "Diana Gentry", "Jian Gong", "Adrienne Hoarfrost", "Manil Maskey", "Floyd Nichols", "Conor A. Nixon", "Tejas Panambur", "Joseph Pasterski", "Anton S. Petrov", "Anirudh Prabhu", "Brenda Thomson", "Hamed Valizadegan", "Kimberley Warren-Rhodes", "David Wettergreen", "Michael L. Wong", "Anastasia Yanchilina"], "title": "Foundation Models for Astrobiology: Paper I -- Workshop and Overview", "comment": "39 pages, 6 figures, 2 tables, 1 glossary, 4 supplemental pages", "summary": "Advances in machine learning over the past decade have resulted in a\nproliferation of algorithmic applications for encoding, characterizing, and\nacting on complex data that may contain many high dimensional features.\nRecently, the emergence of deep-learning models trained across very large\ndatasets has created a new paradigm for machine learning in the form of\nFoundation Models. Foundation Models are programs trained on very large and\nbroad datasets with an extensive number of parameters. Once built, these\npowerful, and flexible, models can be utilized in less resource-intensive ways\nto build many different, downstream applications that can integrate previously\ndisparate, multimodal data. The development of these applications can be done\nrapidly and with a much lower demand for machine learning expertise. And the\nnecessary infrastructure and models themselves are already being established\nwithin agencies such as NASA and ESA. At NASA this work is across several\ndivisions of the Science Mission Directorate including the NASA Goddard and\nINDUS Large Language Models and the Prithvi Geospatial Foundation Model. And\nESA initiatives to bring Foundation Models to Earth observations has led to the\ndevelopment of TerraMind. A workshop was held by the NASA Ames Research Center\nand the SETI Institute, in February 2025, to investigate the potential of\nFoundation Models for astrobiological research and to determine what steps\nwould be needed to build and utilize such a model or models. This paper shares\nthe findings and recommendations of that workshop, and describes clear\nnear-term, and future opportunities in the development of a Foundation Model\n(or Models) for astrobiology applications. These applications would include a\nbiosignature, or life characterization, task, a mission development and\noperations task, and a natural language task for integrating and supporting\nastrobiology research needs."}
{"id": "2510.08926", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2510.08926", "abs": "https://arxiv.org/abs/2510.08926", "authors": ["Laura W. Brenneman", "Daniel R. Wilkins", "Anna Ogorzałek", "Daniele Rogantini", "Andrew C. Fabian", "Javier A. García", "Anna Juráňová", "Misaki Mizumoto", "Hirofumi Noda", "Ehud Behar", "Rozenn Boissay-Malaquin", "Matteo Guainazzi", "Takashi Okajima", "Erika Hoffman", "Noa Keshet", "Jelle Kaastra", "Erin Kara", "Makoto Yamauchi"], "title": "A Sharper View of the X-ray Spectrum of MCG--6-30-15 with XRISM, XMM-Newton and NuSTAR", "comment": "27 pages, 14 figures. Accepted for publication in ApJ", "summary": "We present a time-averaged spectral analysis of the 2024 XRISM observation of\nthe narrow-line Seyfert-1 galaxy MCG--6-30-15, taken contemporaneously with\nXMM-Newton and NuSTAR. Our analysis leverages a unique combination of broadband\nand high-resolution X-ray spectroscopy to definitively isolate and characterize\nboth broad and narrow emission and absorption features in this source. The\nbest-fitting model for the joint spectral analysis is very well described by\nreflection from the inner accretion disk illuminated by a compact corona,\nmodified by multi-zone ionized absorption from an outflowing wind along the\nline of sight. The XRISM/Resolve data confirm that a strong,\nrelativistically-broadened Fe K$\\alpha$ emission line is required in order to\nobtain an adequate model fit. The Resolve data additionally verify the presence\nof a $v_{\\rm out} \\sim 2300$ km/s component of this outflowing wind, find\ntentative evidence for a $v_{\\rm out} \\sim 20,000$ km/s wind component, and\nindicate that the reflection from distant, neutral material may originate in a\nnon-uniform structure rather than the traditional torus of AGN unification\nschemes. Though a rapid prograde black hole spin is statistically preferred by\nthe best-fitting model, consistent with previous results, the AGN flux\nvariability over the course of the observation complicates the interpretation\nof the time-averaged spectra. This insight, clarified by the combination of\nhigh signal-to-noise and high spectral resolution in the joint dataset,\nemphasizes the importance of time-resolved, high-resolution spectral analysis\nin unambiguously measuring the physical properties of variable AGN."}
{"id": "2510.08643", "categories": ["astro-ph.IM", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2510.08643", "abs": "https://arxiv.org/abs/2510.08643", "authors": ["Yong Yu", "Meiting Yang", "Zhengjun Shang", "Liangliang Wang", "Jing Yang", "Zhenghong Tang", "Jianhai Zhao", "Massinissa Hadjara"], "title": "The Astronomical Plate Digitization at SHAO", "comment": "4 pages, 10 figures, conference", "summary": "The digitization of historical astronomical plates is essential for\npreserving century-long observational data. This work presents the development\nand application of the specialized digitizers at the Shanghai Astronomical\nObservatory (SHAO), including technical details, international collaborations,\nand scientific applications on the plates."}
{"id": "2510.09046", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2510.09046", "abs": "https://arxiv.org/abs/2510.09046", "authors": ["Ting Yu", "Hongyu Gong", "Zhifu Gao", "Zhongli Zhang", "Zhigang Wen", "Yujie Wang", "Tao An"], "title": "A study of 80 known pulsars at 185 MHz using MWA incoherent drift-scan observations", "comment": "16 pages, 9 figures, accepted for publication in MNRAS", "summary": "A systematic study of 80 known pulsars observed at 185 MHz has been conducted\nusing archival incoherent-sum data from the Murchison Widefield Array (MWA).\nThe dataset comprises 48 drift-scan observations from the MWA Voltage Capture\nSystem, covering approximately 30,000 square degrees of sky with sensitivities\nreaching about 8 mJy in the deepest regions. An optimized PRESTO-based search\npipeline was deployed on the China SKA Regional Centre infrastructure. This\nenabled the detection of 80 known pulsars, representing a 60 percent increase\nover the previous census. Notably, this includes 30 pulsars with first-time\ndetections at this frequency, of which pulse profiles and flux densities are\npresented. Spectral, scattering, and pulse-width properties were examined for\nthe sample, providing observational constraints on low-frequency turnover,\npropagation effects, and width-period relations. This study highlights the\nvalue of wide-field, low-frequency time-domain surveys for constraining pulsar\nemission and propagation, offering empirical insights that may inform future\nobservations with instruments such as SKA-Low."}
{"id": "2510.09119", "categories": ["astro-ph.IM", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2510.09119", "abs": "https://arxiv.org/abs/2510.09119", "authors": ["Nina Kessler", "Timea Csengeri", "David Cornu", "Sylvain Bontemps", "Laure Bouscasse"], "title": "Identification of molecular line emission using Convolutional Neural Networks", "comment": null, "summary": "Complex organic molecules (COMs) are observed to be abundant in various\nastrophysical environments, in particular toward star forming regions they are\nobserved both toward protostellar envelopes as well as shocked regions.\nEmission spectrum especially of heavier COMs may consists of up to hundreds of\nlines, where line blending hinders the analysis. However, identifying the\nmolecular composition of the gas leading to the observed millimeter spectra is\nthe first step toward a quantitative analysis. We develop a new method based on\nsupervised machine learning to recognize spectroscopic features of the\nrotational spectrum of molecules in the 3mm atmospheric transmission band for a\nlist of species including COMs with the aim to obtain a detection probability.\nWe used local thermodynamic equilibrium (LTE) modeling to build a large set of\nsynthetic spectra of 20 molecular species including COMs with a range of\nphysical conditions typical for star forming regions. We successfully designed\nand trained a Convolutional Neural Network (CNN) that provides detection\nprobabilities of individual species in the spectra. We demonstrate that the\nproduced CNN-model has a robust performance to detect spectroscopic signatures\nfrom these species in synthetic spectra. We evaluate its ability to detect\nmolecules according to the noise level, frequency coverage, and line-richness,\nand also test its performance for incomplete frequency coverage with high\ndetection probabilities for the tested parameter space, and no false\npredictions. Ultimately, we apply the CNN-model to obtain predictions on\nobservational data from the literature toward line-rich hot-core like sources,\nwhere detection probabilities remain reasonable with no false detection. We\nprove the use of CNNs facilitating the analysis of complex millimeter spectra\nboth on synthetic spectra as well as first tests on observational data."}
{"id": "2510.09066", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.09066", "abs": "https://arxiv.org/abs/2510.09066", "authors": ["Jiahui Huang", "Ken Ohsuga", "Hua Feng", "Hui Li"], "title": "3D Moving-mesh Hydrodynamical Simulations of Wind/Jet Driven Ultraluminous X-ray Source Bubbles", "comment": "13 pages, 11 figures, 2 tables, submitted to PASJ", "summary": "We perform 3 dimensional moving-mesh hydrodynamical simulations of bubble\nnebulae around ultraluminous X-ray sources, using state-of-the-art software\nAREPO. We use a Monte-Carlo method to inject outflows with uniform mass outflow\nrate and momentum, in a conical funnel with a specific half opening angle.\nSimulation results show that the morphology of the bubble is determined by the\ninitial momentum of the outflows, while the mechanical power of the outflows\nonly influences the size of the bubble without changing its shape. Low\nmechanical power also results in a short cooling timescale of the system,\nleading to an early collapse of the bubble shell. The half opening angle of the\noutflows and the viewing angle of the system determine the observed bubble\neccentricity together. Compared with the observational morphology of the ULX\nbubble sources NGC 55 ULX-1 and NGC 1313 X-2, our simulation favors the fact\nthat the high velocity outflows of the accretion disks in these two systems are\nconfined in a narrow funnel region."}
{"id": "2510.09362", "categories": ["astro-ph.IM", "astro-ph.SR", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.09362", "abs": "https://arxiv.org/abs/2510.09362", "authors": ["Sankalp Gilda"], "title": "deep-REMAP: Probabilistic Parameterization of Stellar Spectra Using Regularized Multi-Task Learning", "comment": "14 pages. Accepted for publication in RASTI", "summary": "In the era of exploding survey volumes, traditional methods of spectroscopic\nanalysis are being pushed to their limits. In response, we develop deep-REMAP,\na novel deep learning framework that utilizes a regularized, multi-task\napproach to predict stellar atmospheric parameters from observed spectra. We\ntrain a deep convolutional neural network on the PHOENIX synthetic spectral\nlibrary and use transfer learning to fine-tune the model on a small subset of\nobserved FGK dwarf spectra from the MARVELS survey. We then apply the model to\n732 uncharacterized FGK giant candidates from the same survey. When validated\non 30 MARVELS calibration stars, deep-REMAP accurately recovers the effective\ntemperature ($T_{\\rm{eff}}$), surface gravity ($\\log \\rm{g}$), and metallicity\n([Fe/H]), achieving a precision of, for instance, approximately 75 K in\n$T_{\\rm{eff}}$. By combining an asymmetric loss function with an embedding\nloss, our regression-as-classification framework is interpretable, robust to\nparameter imbalances, and capable of capturing non-Gaussian uncertainties.\nWhile developed for MARVELS, the deep-REMAP framework is extensible to other\nsurveys and synthetic libraries, demonstrating a powerful and automated pathway\nfor stellar characterization."}
{"id": "2510.09101", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.09101", "abs": "https://arxiv.org/abs/2510.09101", "authors": ["Angelina Sherman", "Nestor Mirabal", "David Guevel", "Ke Fang", "Kohta Murase", "Elizabeth Hays"], "title": "Sub-Threshold Fermi-LAT Sources in the Vicinity of KM3-230312A", "comment": null, "summary": "The KM3NeT collaboration has recently reported the detection of an\nextraordinary ultra-high-energy neutrino event with an energy of 220 PeV.\nUltrahigh energy neutrinos and gamma-rays are co-produced in ultrahigh energy\ncosmic-ray interactions. The ultrahigh energy gamma-rays produced alongside the\nKM3NeT neutrino may quickly cascade down to lower energies due to interactions\nwith intergalactic photons and magnetic fields. Because of this, the KM3NeT\nneutrino could be accompanied by an observable GeV - TeV gamma-ray signal. We\ninvestigate the data collected by the Large Area Telescope (LAT) on-board the\n\\textit{Fermi} Gamma-ray Space Telescope for transient and sub-threshold\ngamma-ray sources in the vicinity of the KM3NeT neutrino. We find three\nsub-threshold sources with TS $\\gtrsim 16$ within $3.5^{\\circ}$ of the neutrino\nevent not included in any existing \\textit{Fermi}-LAT catalogs. One of the\nthree, J0616.1-0428, is a transient sub-threshold gamma-ray source that appears\nonly after the neutrino observation, but may be the unrelated flaring of a\nnearby microquasar. Another sub-threshold source, J0621.1-0610, also exhibits\nfluctuations in gamma-rays immediately following the neutrino observation, and\nmay be coincident with a radio blazar. We note that the number of sub-threshold\nsources observed around the KM3NeT neutrino could be expected at another sky\nregion of the same Galactic latitude, and that the fluctuations they exhibit\nappear to be consistent with background."}
{"id": "2510.09533", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2510.09533", "abs": "https://arxiv.org/abs/2510.09533", "authors": ["Fabrizio Giordano", "Yago Ascasibar", "Luca Cortese", "Ivan Valtchanov", "Bruno Merín"], "title": "Hierarchical Progressive Survey (HiPS) format: moving from visualisation to scientific analysis", "comment": "Accepted for publication in A&A", "summary": "Context. In the current era of multi-wavelength and multi-messenger\nastronomy, international organisations are actively working on the definition\nof new standards for the publication of astronomical data, and substantial\neffort is devoted to make them available through public archives. Aims. We\npresent a set of tools that allow user-friendly access and basic scientific\nanalysis of observations in Hierarchical Progressive Survey (HiPS) format, and\nwe use them to gauge the quality of representative skymaps at ultraviolet,\noptical, and infrared wavelengths. Methods. We apply a fully-automatic\nprocedure to derive aperture photometry in 10 different bands for the 323\nnearby galaxies in the Herschel Reference Sample (HRS), and compare its results\nwith the rigorous analyses involving specialised knowledge and human\nintervention carried out by the HRS team. Results. Our experiment shows that 9\nof the 10 skymaps considered preserve the original quality of the data, and the\nphotometric fluxes returned by our pipeline are consistent with the HRS\nmeasurements within a few per cent. In the case of Herschel PACS maps at 100\n{\\mu}m, we uncovered a systematic error that we ascribe to an inconsistent\ncombination of data products with different spatial resolution. For the\nremaining skymaps, the estimated statistical uncertainties provide a realistic\nindication of the differences with respect to the HRS catalogue. Conclusions.\nIn principle, the currently available HiPS skymaps in Flexible Image Transport\nSystem (FITS) format allow to carry out broadband photometric analyses with an\naccuracy of the order of a few percent, but some level human intervention is\nstill required. In addition to assessing data quality, we also propose a series\nof recommendations to realise the full potential of the HiPS format for the\nscientific analysis of large astronomical data sets."}
{"id": "2510.09261", "categories": ["astro-ph.HE", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2510.09261", "abs": "https://arxiv.org/abs/2510.09261", "authors": ["F. McNeill", "S. A. Sim", "C. E. Collins", "L. J. Shingles", "R. Damgaard", "A. Sneppen", "J. H. Gillanders"], "title": "Light Travel Time Effects in Kilonova Models", "comment": null, "summary": "The extremely rapid evolution of kilonovae results in spectra that change on\nan hourly basis. These spectra are key to understanding the processes occurring\nwithin the event, but this rapid evolution is an unfamiliar domain compared to\nother explosive transient events, such as supernovae. In particular, the most\nobvious P Cygni feature in the spectra of AT2017gfo -- commonly attributed to\nstrontium -- possesses an emission component that emerges after, and ultimately\noutlives, its associated absorption dip. This delay is theorised to arise from\nreverberation effects, wherein photons emitted earlier in the kilonova's\nevolution are scattered before reaching the observer, causing them to be\ndetected at later times. We aim to examine how the finite speed of light -- and\ntherefore the light travel time to an observer -- contributes to the shape and\nevolution of spectral features in kilonovae. Using a simple model, and tracking\nthe length of the journey photons undertake to an observer, we are able to test\nthe necessity of accounting for this time delay effect when modelling\nkilonovae. In periods where the photospheric temperature is rapidly evolving,\nwe show spectra synthesised using a time independent approach are visually\ndistinct from those where these time delay effects are accounted for.\nTherefore, in rapidly evolving events such as kilonovae, time dependence must\nbe taken into account."}
{"id": "2510.09559", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.09559", "abs": "https://arxiv.org/abs/2510.09559", "authors": ["Adrien Picquenot", "Fabio Acero", "Valeria Olivares", "Michela Negro", "Gabriel W. Pratt"], "title": "Direct observation of the X-ray counterpart of the Hα filaments and of the sloshing spiral in the Perseus galaxy cluster", "comment": "submitted to ApJL", "summary": "Deep Chandra observations of the Perseus galaxy cluster have allowed for the\ndiscovery of X-ray counterparts to the H{\\alpha} filamentary structures and of\na sloshing spiral. However, both components are extremely faint, and their\nstudy is largely hindered by the volume-filling hot intracluster medium (ICM).\nUsing the Poisson General Morphological Component Analysis (pGMCA) algorithm, a\nblind source separation method adapted for Poissonian statistics, we were able\nto extract detailed, clean morphological maps of these components. We then\nintroduced a template fitting method to investigate their spectral\ncharacteristics. We report the first direct observation of about 1.35 keV\nlow-energy emission from the sloshing spiral, and produce the most detailed and\nunpolluted map of the X-rays filaments thus far obtained."}
{"id": "2510.09569", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.09569", "abs": "https://arxiv.org/abs/2510.09569", "authors": ["F. Poidevin", "S. L. West", "C. M. B. Omand", "R. Könyves-Tóth", "S. Schulze", "L. Yan", "T. Kangas", "I. Pérez-Fournon", "S. Geier", "J. Sollerman", "P. J. Pessi", "C. M. Gutiérrez", "T. -W. Chen", "K-Ryan Hinds", "R. Marques-Chaves", "R. Shirley", "C. Jimenez Angel", "R. Lunnan", "D. A. Perley", "N. Sarin", "Y. Yao", "R. Dekany", "J. Purdum", "A. Wold", "R. R. Laher", "M. J. Graham", "M. M. Kasliwal", "T. Jegou Du Laz"], "title": "SN 2021lwz: Another Exotic Luminous and Fast Evolving Optical Type Ic Broad-Lined Supernova ?", "comment": "submitted to A&A, 26 pages, 21 figures, 10 tables", "summary": "Context. Current large-scale, high-cadence surveys, such as the Zwicky\nTransient Facility (ZTF), provide detections of new and rare types of\ntransients and supernovae whose physical origins are not well understood. Aims.\nWe investigate the nature of SN 2021lwz at a redshift z=0.065, an overluminous\nsupernova (SN) of absolute magnitude, $M_{g} \\sim -20.1$ AB, falling in the\nlower range of superluminous supernovae (SLSNe) luminosities, and discovered in\na faint dwarf galaxy with an absolute magnitude of $M_{g} \\simeq -14.5$ AB.\nMethods. SN 2021lwz is studied using optical spectroscopy, photometry and\nimaging linear polarimetry obtained during several follow-up campaigns. All the\ndata are used to analyse and model the evolution of the explosion. Comparisons\nwith other SNe of well known or rarer types are investigated. Results. SN\n2021lwz belongs to the rare class of rapidly evolving transients. The\nbolometric light curve rises in about 7 days to a peak luminosity of about 5\nx10^{43} erg/s, at a rate of 0.2 mag/day close to the peak. Spectroscopy\nmodeling reveals more similarities with a normal Type Ic-like SN than with a\nSLSN before peak, showing broadened lines after peak. Light curve modeling\nshows that the Arnett model of the bolometric light curve using a radioactive\nsource ($^{56}$ Ni) is not able to reasonably explain the light curve\nevolution. A magnetar model seems more appropriate, suggesting that the\nexplosion of low ejecta mass ($M_{\\rm ej} \\sim 0.24 ~M_\\odot$) took place in a\nlow mass ($M \\sim 10^{6.66}~M_\\odot$) dwarf galaxy of specific star-formation\nrate about ten times larger than typical star-forming galaxies. Conclusions.\nGiven its spectroscopic properties and the low ejecta mass needed to model its\nlight-curve, SN 2021lwz does not match with many core-collapse H-poor SNe\nTypes. It shares similarities with rarer transients like SN 2014ft, iPTF 16asu\nand SN 2018gep."}
