{"id": "2511.15756", "categories": ["astro-ph.IM", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2511.15756", "abs": "https://arxiv.org/abs/2511.15756", "authors": ["Gleb Berloff", "Natalia G. Berloff"], "title": "A Unified Analytic Framework for Microlensing Caustics: Geode Solutions and Hyper--Catalan Signatures", "comment": "22 pages, 3 figures, Supplementary Information is available by request to the first author", "summary": "We give a preparation-invariant analytic description of image formation near microlensing caustics. After a local Weierstrass preparation at any multiple image (order $d\\ge2$), the lens mapping reduces to a single geode variable $m$ satisfying $m=U\\,\\varphi(m)$, where $U$ is a prepared source coordinate and $\\varphi$ is an image-side kernel. The coefficients of $m(U)$ obey closed Hyper-Catalan (HC) recurrences, allowing termwise derivatives and truncation control from the characteristic system. We also use the same form for a short HC predictor-corrector: evaluate the series within its certified radius and apply a brief Newton polish near the boundary. We define an HC signature (first nonzero kernel coefficients) and an HC spectrum (branch points and analyticity radius $ρ_U$), which quantify sparsity, stiffness, and safe evaluation domains. The construction covers folds and cusps of any global degree. On a binary fold and cusp, an artificial decic with a resonant unit, and two triple-lens cusps of a challenging geometry, HC seeds plus a few Newton steps recover the exact images to machine precision within the certified domain and maintain continuity under continuation. The resulting single-series templates (with $(\\mathrm{Sig}_R,ρ_U)$ metadata) are ready for photometric and astrometric modeling."}
{"id": "2511.15788", "categories": ["astro-ph.IM", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2511.15788", "abs": "https://arxiv.org/abs/2511.15788", "authors": ["Theophilus Ansah-Narh", "Jordan Lontsi Tedongmo", "Joseph Bremang Tandoh", "Nia Imara", "Ezekiel Nii Noye Nortey"], "title": "Decoding the Radio Sky: Bayesian Ensemble Learning and SVD-Based Feature Extraction for Automated Radio Galaxy Classification", "comment": "30 pages, 10 figures", "summary": "The classification of radio galaxies is central to understanding galaxy evolution, active galactic nuclei dynamics, and the large-scale structure of the universe. However, traditional manual techniques are inadequate for processing the massive, heterogeneous datasets generated by modern radio surveys. In this study, we present a probabilistic machine learning framework that integrates Singular Value Decomposition (SVD) for feature extraction with Bayesian ensemble learning to achieve robust, scalable radio galaxy classification. The SVD approach effectively reduces dimensionality while preserving key morphological structures, enabling efficient representation of galaxy features. To mitigate class imbalance and avoid the introduction of artefacts, we incorporate a Local Neighbourhood Encoding strategy tailored to the astrophysical distribution of galaxy types. The resulting features are used to train and optimize several baseline classifiers: Logistic Regression, Support Vector Machines, LightGBM, and Multi-Layer Perceptrons within bagging, boosting, and stacking ensembles governed by a Bayesian weighting scheme. Our results demonstrate that Bayesian ensembles outperform their traditional counterparts across all metrics, with the Bayesian stacking model achieving a classification accuracy of 99.0% and an F1-score of 0.99 across Compact, Bent, Fanaroff-Riley Type I (FR-I), and Type II (FR-II) sources. Interpretability is enhanced through SHAP analysis, which highlights the principal components most associated with morphological distinctions. Beyond improving classification performance, our framework facilitates uncertainty quantification, paving the way for more reliable integration into next-generation survey pipelines. This work contributes a reproducible and interpretable methodology for automated galaxy classification in the era of data-intensive radio astronomy."}
{"id": "2511.15823", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2511.15823", "abs": "https://arxiv.org/abs/2511.15823", "authors": ["Rachel Akeson", "Gregory P. Dubois-Felsmann", "Brendan P. Crill", "Andreas L. Faisst", "Tamim Fatahi", "Candice M. Fazar", "Tatiana Goldina", "Daniel C. Masters", "Christina Nelson", "Roberta Paladini", "Harry I. Teplitz", "Gabriela Torrini", "Phani Velicheti", "Matthew L. N. Ashby", "Dan Avner", "Yoonsoo P. Bach", "James J. Bock", "Sean Bruton", "Sean A. Bryan", "Tzu-Ching Chang", "Shuang-Shuang Chen", "Ari J. Cukierman", "O. Dore", "C. Darren Dowell", "Spencer Everett", "Richard M. Feder", "Zhaoyu Huai", "Howard Hui", "Woong-Seob Jeong", "Young-Soo Jo", "Phil M. Korngut", "Yuna G. Kwon", "Bomee Lee", "Gary J. Melnick", "Giulia Murgia", "Chi H. Nguyen", "Milad Pourrahmani", "Zafar Rustamkulov", "Volker Tolls", "Pao-Yu Wang", "Yujin Yang", "Michael Zemcov"], "title": "The SPHEREx Image and Spectrophotometry Processing Pipeline", "comment": "15 pages, 1 figure, submitted to the Astrophysical Journal Supplement Series", "summary": "In this paper, we describe the SPHEREx image and spectrophotometry data processing pipeline, an infrastructure and software system designed to produce calibrated spectral images and photometric measurements for NASA's SPHEREx mission. SPHEREx is carrying out a series of four all-sky spectrophotometric surveys at 6.15 arcsecond resolution in 102 spectral channels spanning 0.75 to 5 microns. The pipeline which will deliver the flux- and wavelength-calibrated data products deriving from these surveys has been developed and is operated by the SPHEREx Science Data Center at Caltech/IPAC in collaboration with the SPHEREx Science Team. Here we describe the framework and modules used in the pipeline, along with the data products, which are available at the NASA/IPAC Infrared Science Archive."}
{"id": "2511.16076", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2511.16076", "abs": "https://arxiv.org/abs/2511.16076", "authors": ["Lingyi Kong", "Jiangpei Dou", "Wei Guo", "Mingming Xu", "Shu Jiang", "Bo Chen"], "title": "Optimization design and analysis for the mechanical test platform of scientific probe module of the Cool Planet Imaging Coronagraph", "comment": "15 pages,24 fqures, published in Shock and Vibration", "summary": "This paper optimizes the design and analysis of the mechanical test platform for the scientific probe module of the Cool Planet Imaging Coronagraph, which is the fifth part of the China Space Station survey Telescope. First, according to the module layout and economic requirements, the preliminary structural design of the module mechanical test platform is carried out, and the stiffness sensitive parameters of the assembly are identified to determine the optimization parameters. The Central Composite Design method is used to design the test platform, and a third-order regression model is constructed for response surface analysis. The third-order response surface model of the fundamental frequency and amplitude of the test platform is obtained by fitting the test data with the least squares method, and the structure of the module mechanical test platform is determined. The modal analysis is carried out to determine the fundamental frequency and vibration modes of the mechanical test platform. The vibration response of the platform is simulated by sine, random and swept frequency vibration simulations. The response surface fitting algorithm is verified by the test platform swept frequency test. The agreement between the response surface fitting algorithm and the experiment is good. The fundamental frequency of the test platform is 436.2Hz (>300Hz), which meets the design index requirements of the test platform and can accurately guide the optimization design work. At the same time, it provides the theoretical basis and design method for the structural design of the Chinese manned space station."}
{"id": "2511.15776", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.15776", "abs": "https://arxiv.org/abs/2511.15776", "authors": ["A. Uryson"], "title": "Iron Nuclei in Ultra-High Energy Cosmic Rays Near the Earth", "comment": "5 pages, 1 figure. The talk at the 38-th Russian Cosmic Ray Conference, July 2024, Moscow", "summary": "The propagation of cosmic iron nuclei with energies above 10^19 eV from their sources to the Galaxy is discussed by assuming that cosmic rays at ultra-high energies are of extragalactic origin. In extragalactic space, cosmic nuclei interact with background emissions and inevitably fragment. An analysis is performed of the fraction of iron nuclei reaching the Earth and how its energy depends on the distance from cosmic ray sources. It is found that energies of iron nuclei can be used to determine restriction on the distances from their sources"}
{"id": "2511.16212", "categories": ["astro-ph.IM", "hep-ex"], "pdf": "https://arxiv.org/pdf/2511.16212", "abs": "https://arxiv.org/abs/2511.16212", "authors": ["Francesco Saverio Cafagna"], "title": "The Fluorescence Camera for the PBR mission", "comment": "ICRC 2025 conference proceeding", "summary": "The Probe Of Extreme Multi-Messenger Astrophysics (POEMMA) Balloon with Radio (PBR) is an instrument designed to be borne by a NASA suborbital Super Pressure Balloon (SPB), in a mission planned to last as long as 50 days. The PBR instrument consists of a 1.1 m aperture Schmidt telescope, similar to the POEMMA design, with two cameras in its hybrid focal surface: a Fluorescence Camera (FC) and a Cherenkov Camera (CC), both mounted on a frame that can be tilted to point from nadir up to 13 degrees above the horizon. The FC camera is designed to detect the fluorescence emission of Extensive Air Showers produced by Ultra-High Energy Cosmic Rays from sub-orbital altitudes. This measurement will validate the detection strategy for future space-based missions, such as POEMMA. The FC will be made of 4 Photo Detection Modules (PDMs), each consisting of a 6x6 matrix of 64-channel Multi Anode PhotoMulTipliers (MAPMT), for a grand total of 2304 pixels for each PDM. Custom-designed SPACIROC-3 ASICs perform single photoelectron counting on each pixel as well as charge integration on groups of 8 pixels to measure extremely bright or fast signals, reaching a double pulse resolution in the order of 10 ns for a 1 microsecond acquisition gate. A field flattener lens and a BG3 filter, to match the wavelength range of interest (300-400 nm), are mounted in front of the PDM. The camera will be able to detect showers in a field of view of 24x24 square degrees, with a pixel size on ground corresponding to 115 m. Details on the camera design and implementation will be given, along with the expected performance and the state of the construction."}
{"id": "2511.15793", "categories": ["astro-ph.HE", "gr-qc", "hep-ex", "hep-ph"], "pdf": "https://arxiv.org/pdf/2511.15793", "abs": "https://arxiv.org/abs/2511.15793", "authors": ["Ming-Yu Lei", "Bei Zhou", "Xiaoyuan Huang"], "title": "How Bright in Gravitational Waves are Millisecond Pulsars for the Galactic Center GeV Gamma-Ray Excess? A Systematic Study", "comment": "Main text 12 pages 3 figs; Appendix 4 pages 4 figs; Comments are welcome!", "summary": "The existence of dark matter (DM) is supported by various macroscopic observations, but its microscopic nature remains elusive. The Galactic Center GeV gamma-ray excess (GCE) has been a leading candidate signal for particle dark matter annihilation. However, an unresolved population of millisecond pulsars (MSPs) in the bulge provides the alternative explanation for the excess. Identifying these MSPs in electromagnetic bands is difficult due to source confusion, pulse broadening, and extinction. Gravitational waves (GWs) provide a complementary probe: a steadily rotating, non-axisymmetric MSP emits a nearly monochromatic GW signal in the sensitive band of ground-based detectors, with amplitude set by its ellipticity. In this work, we systematically investigate the GW emission from the MSP population proposed to explain the GCE and its detectability with current and future detectors. We consider three major scenarios for the origin of ellipticity and model the population properties of these MSPs. We also consider both isolated MSPs and MSPs in binary systems, as well as Doppler effects in the detection. We find that while the signal is below the reach of current interferometers, next-generation detectors such as the Einstein Telescope (ET) and Cosmic Explorer (CE) can detect a fraction of those MSPs, offering a novel test of the MSP interpretation of the GCE. Future directed searches toward the Galactic Center with continued improvements in sensitivities will either uncover this long-sought MSP population or place stringent limits on their ellipticities and abundance, with important implications for both the astrophysical and dark-matter interpretations of the GCE."}
{"id": "2511.16256", "categories": ["astro-ph.IM", "astro-ph.CO"], "pdf": "https://arxiv.org/pdf/2511.16256", "abs": "https://arxiv.org/abs/2511.16256", "authors": ["Saptarshi Sarkar", "Tirthankar Roy Choudhury"], "title": "Accelerating Reionization Constraints: An ANN-Emulator Framework for the SCRIPT Semi-numerical Model", "comment": "22 pages, 5 figures. To be submitted to JCAP", "summary": "Constraining the Epoch of Reionization (EoR) with physically motivated simulations is hampered by the high cost of conventional parameter inference. We present an efficient emulator-based framework that dramatically reduces this bottleneck for the photon-conserving semi-numerical code SCRIPT. Our approach combines (i) a reliable coarse-resolution MCMC to locate the high-likelihood region (exploiting the large-scale convergence of SCRIPT) with (ii) an adaptive, targeted sampling strategy to build a compact high-resolution training set for an artificial neural network based emulator of the model likelihood. With only $\\approx 10^3$ high-resolution simulations, the trained emulators achieve excellent predictive accuracy ($R^2 \\approx 0.97$--$0.99$) and, when embedded within an MCMC framework, reproduce posterior distributions from full high-resolution runs. Compared to conventional MCMC, our pipeline reduces the number of expensive simulations by a factor of $\\sim 100$ and lowers total CPU cost by up to a factor of $\\sim 70$, while retaining statistical fidelity. This computational speedup makes inference in much higher-dimensional models tractable (e.g., those needed to incorporate JWST and upcoming 21 cm datasets) and provides a general strategy for building efficient emulators for next generation of EoR constraints."}
{"id": "2511.15975", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.15975", "abs": "https://arxiv.org/abs/2511.15975", "authors": ["Zachary G. Lane", "Ryan Ridden-Harper", "Sofia Rest", "Armin Rest", "Conor L. Ransome", "Qinan Wang", "Clarinda Montilla", "Micaela Steed", "Igor Andreoni", "Patrick Armstrong", "Peter J. Brown", "Jeffrey Cooke", "David A. Coulter", "Ori Fox", "James Freeburn", "Marco Galoppo", "Avishay Gal-Yam", "Jared A. Goldberg", "Christopher Harvey-Hawes", "Rebekah Hounsell", "Brayden Leicester", "Itai Linial", "Thomas Moore", "Pierre Mourier", "Anya E. Nugent", "David O'Neill", "Hugh Roxburgh", "Koji Shukawa", "Stephen J. Smartt", "Nathan Smith", "Ken W. Smith", "Sebastian Vergara Carrasco", "V. Ashley Villar", "Tal Wasserman", "Zenati Yossef", "Erez Zimmerman"], "title": "SN 2019vxm: A Shocking Coincidence between Fermi and TESS", "comment": "25 pages, 9 figures. Submitted to The Astrophysical Journal", "summary": "Shock breakout and, in some cases, jet-driven high-energy emission are increasingly recognized as key signatures of the earliest phases of core-collapse supernovae, especially in Type IIn systems due to their dense, interaction-dominated circumstellar environments. We present a comprehensive photometric analysis of SN 2019vxm, a long-duration, luminous Type IIn supernova, $M_V^{}=-21.41\\pm0.05\\;{\\rm mag}$, observed from X-ray to near-infrared. SN 2019vxm is the first superluminous supernovae Type IIn to be caught with well-sampled TESS photometric data on the rise and has a convincing coincident X-ray source at the time of first light. The high-cadence TESS light curve captures the early-time rise, which is well described by a broken power law with an index of $n=1.41\\pm0.04$, significantly shallower than the canonical $n=2$ behavior. From this, we constrain the time of first light to within 7.2 hours. We identify a spatial and temporal coincidence between SN 2019vxm and the X-ray transient GRB191117A, corresponding to a $3.3σ$ association confidence. Both the short-duration X-ray event and the lightcurve modeling are consistent with shock breakout into a dense, asymmetric circumstellar medium, indicative of a massive, compact progenitor such as a luminous blue variable transitioning to Wolf-Rayet phase embedded in a clumpy, asymmetric environment."}
{"id": "2511.16391", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2511.16391", "abs": "https://arxiv.org/abs/2511.16391", "authors": ["Anne O'Connor", "Harish Khandrika"], "title": "WFC3/UVIS EPER CTE 2009-2025", "comment": "15 pages, 6 figures", "summary": "In this report, we examine the behavior of Charge Transfer Efficiency (CTE) on the WFC3/UVIS detector over time as computed by the Extended Pixel Edge Response (EPER) technique, using internal calibration data acquired from 2009 through 2025. We find that the CTE has continued to decline as expected, with a steeper loss rate for lower signal levels. The lowest signal level (160e-) has continued to decline at a rate of 0.0001 per year, with a total overall decline of 0.0015. Analyses from 2016 and 2020 found that the rate of decline was not well fit by a linear function. This report verifies the rate of decline is instead better fit by a quadratic function (which results in the smallest min. and max. residuals, on average) or a cubic function (which has the best \"goodness of fit\" $χ^2$ and $R^2$ values). We continue to see periodic oscillations of the residuals around all three fit lines (linear, quadratic, and cubic) on which we perform a Lomb-Scargle periodogram analysis of the residuals. We find a periodicity of about 8 years for the residuals around the linear fit lines and about 9 years for the quadratic and cubic fit lines."}
{"id": "2511.16206", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2511.16206", "abs": "https://arxiv.org/abs/2511.16206", "authors": ["Yingkang Zhang", "Tao An", "Xiang Ji", "Zhenya Zheng", "Yuanqi Liu", "Qiqi Wu", "Ruqiu Lin", "Shilong Liao"], "title": "A pilot VLBI study of the SQUAB quasar sample featuring multiple Gaia detections", "comment": "15 pages, 9 figures, accepted by A&A", "summary": "Our previous work identified a class of SDSS quasars exhibiting multiple Gaia detections, classifying them as candidates for various astrophysical systems such as quasar-star pairs, dual quasars, and gravitationally lensed quasars. In this paper, we present a pilot VLBI study targeting a radio-bright subsample and report the first high-resolution imaging results. By leveraging the milliarcsecond-scale resolution of VLBI and its precise astrometric coordination incorporating with Gaia, we aim to refine the classification of these multiple matched sources, search for potential dual AGNs, and assess the efficacy of the combined Gaia-VLBI approach in resolving ambiguous quasar systems. We cross-matched the SQUAB quasar sample with the FIRST and NVSS catalogs, identifying 18 radio-emitting sources. The three brightest were selected for dual-frequency (1.6 and 4.9 GHz) VLBA observations. We performed VLBI imaging at both Gaia positions, constructed spectral index maps, and estimated brightness temperatures to characterize the radio morphology and physical properties. For the three target sources, our VLBI observations reveal compact radio structures consistent with single AGN at the primary Gaia positions. No significant emission is detected at the secondary Gaia locations. These results support the interpretation of the sources as quasar$-$star pairs, in line with earlier studies. This pilot study demonstrates the value of radio-VLBI high-resolution follow-ups on Gaia-selected quasar systems with multiple counterparts, showing how they can unambiguously reveal the true nature of these systems and help remove contaminants from dual AGN candidate samples."}
{"id": "2511.16392", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2511.16392", "abs": "https://arxiv.org/abs/2511.16392", "authors": ["Anne O'Connor", "Varun Bajaj"], "title": "WFC3/IR Geometric Distortion - Time Evolution of Linear Terms w.r.t. Gaia DR3", "comment": "24 pages, 12 figures", "summary": "We examine the relative offsets of the linear terms in the geometric distortion between WFC3/IR and the Gaia DR3 catalog using the Mikulski Archive for Space Telescopes (MAST) pipeline WFC3/IR to Gaia DR3 alignment solutions to assess temporal stability over the lifetime of the WFC3 instrument (2009-2024). We find a period of increased uncertainty and offsets in the rotation term between 2018 and 2021, as seen in a previous analysis of WFC3/UVIS linear geometric distortion (O'Connor et al., 2024), corresponding with a period of increased jitter. We find a similar pattern of increased uncertainty between 2018 and 2021 in the skew offsets to Gaia DR3, as well. We find no significant linear temporal evolution in the rotation, skew, or scale offsets between the WFC3/IR IDCTAB distortion solution and Gaia DR3 over the 16-year lifetime of the WFC3 instrument; however, we do see temporal evolution in the shift offsets (the difference -in pixels- between the IDCTAB and Gaia WCS positions), which are dominated by telescope pointing inaccuracy external to the WFC3/IR geometric distortion solution. For observers requiring high-precision astrometry, we continue to recommend that observers verify or improve image alignment using the tweakreg routine."}
{"id": "2511.16246", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.16246", "abs": "https://arxiv.org/abs/2511.16246", "authors": ["Sixuan Zhang", "Tsunefumi Mizuno", "Tomohisa Kawashima", "Chris Done", "Yasushi Fukazawa", "Hiromitsu Takahashi", "Ryusei Komine", "Koudai Takebayashi", "Ken Ohsuga"], "title": "Constraining the Corona Geometry of Cyg X-1 with Broad Band Spectrum and Polarimetric Analysis Based on Observations in May 2022", "comment": "19 pages, 11 figures, 5 tables", "summary": "Cygnus X-1 (Cyg X-1) exhibited a low hard state in 2022, observed by several missions. The IXPE reported that the polarization angle is aligned with the radio jet and gave a polarization degree approximately 4 times higher than the general expectations of $1\\%$ through the analysis of the time-integrated data with a simple spectral model, indicating that the disk inclination is higher than a canonical value of about $30^{\\circ}$. Many subsequent theoretical studies employed a non-standard model to explain this high PD. Here, we revisit the disk/corona spectrum through a detailed joint analysis using IXPE, NuSTAR, and NICER data. By investigating the time variability of the spectrum, we find that the two-Comptonization components model can better reproduce the data than the one-Comptonization component model originally adopted. We observed a lower disk photon temperature of about 0.15 keV. Detailed simulation suggests that lowering the disk temperature by a factor of 2 increases the PD by roughly 2 percentage points in the IXPE 2--8 keV band for a slab-like corona geometry, helping to reconcile the observed high PD with theoretical predictions. However, The simulated PDs are still significantly lower than the observed ones - even for a rather high $60^{\\circ}$ inclination. We also investigated the polarization properties of a simple wedge-shaped corona with a truncated disk and a sandwiching slab corona. We find that the slab corona predicts an apparent energy dependence in PD while PA remains constant in the IXPE band, in agreement with the observed polarization. Therefore, we suggest that Cyg X-1 in 2022 May exhibits a two-Comptonization coronal emission with different optical depths, and the hard one is in a sandwiching slab geometry. We also discuss how the polarization is affected by other parameters of the black hole and the corona."}
{"id": "2511.16411", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2511.16411", "abs": "https://arxiv.org/abs/2511.16411", "authors": ["Jay Anderson", "Sylvia Baggett"], "title": "How Single-Star Guiding affects HST's Pointing Stability", "comment": "17 pages, 12 figures, 2 tables, WFC3 Instrument Science Report", "summary": "HST is designed to use two guide stars (GSs) in the fine-guidance sensors (FGSs) to maintain its pointing and tracking during exposures. The primary GS holds the boresight fixed and the secondary GS keeps the orientation fixed. However, HST is also able to track using only a single GS by fixing the boresite on one star and maintaining the orientation using the available gyro(s). We evaluate the pointing quality achieved in this latter case, when one GS and one gyro (RGM, a.k.a., reduced gyro mode) are used. We find that in 1GS-RGM, there is indeed more drift during the course of an orbit than when two guide stars are used, but the drift is much smaller than was seen in previous times of sub-optimal gyro performance. We quantify the 1GS-RGM drift seen in recent archival GO data and in images from a test calibration program and find that (a) for exposures < 500 sec, the PSF quality in 1GS is indistinguishable from that of 2GS and (b) over the course of full orbits (~2500 sec), the drift in four of five cases was less than 0.2 pixel and ~0.4 pix in the other case. Such a drift is marginally detectable in observations, but it should have a marginal impact on most science programs, since the variation in the PSF caused by drift is smaller than the PSF variations with focus and with location on the detector. For observers who wish to correct drift effects, we show that the use of a perturbed PSF during post-acquisition data analysis removes essentially all astrometric residuals, even for drift levels up to ~0.5 pix, as well as most of the photometric residuals."}
{"id": "2511.16314", "categories": ["astro-ph.HE", "astro-ph.EP", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2511.16314", "abs": "https://arxiv.org/abs/2511.16314", "authors": ["Shigenobu Hirose"], "title": "Thermal equilibrium curves of accretion disks driven by magnetorotational instability", "comment": "This paper is based on an invited talk presented at the 87th Fujihara Seminar: The 50th Anniversary Workshop of the Disk Instability Model in Compact Binary Stars (DIM50TH2025), held on 22--26 September 2025 in Tomakomai, Japan. It has been accepted for publication in PoS (Proceedings of Science), and is scheduled to appear in February 2026 at https://pos.sissa.it/493/", "summary": "Analogous to the HR diagram for stars, the thermal equilibrium curve encodes the thermodynamics of accretion disks by expressing the local balance between heating -- primarily via viscous dissipation -- and cooling -- typically through radiative transfer. These curves are commonly plotted as surface density versus effective temperature. When an S-shaped locus appears, local annuli become bistable, and limit-cycle oscillations arise when the external mass-transfer rate falls within an unstable band. This behavior underpins the disk instability model for recurring outbursts in cataclysmic variables. This paper reviews first-principles thermal equilibrium curves for accretion disks driven by magnetorotational instability (MRI), with emphasis on dwarf novae. Unlike the parameterized $α$-viscosity approach, the curves are obtained by solving the governing equations with radiation magnetohydrodynamics simulations, thereby reproducing S-shaped loci without prescribing $α$. The disk instability in dwarf-nova systems and the physical origin of angular-momentum transport (shear stresses) are also briefly reviewed. Notes on the stability of radiation-dominated accretion flows are included in the Appendix."}
{"id": "2511.16505", "categories": ["astro-ph.IM", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2511.16505", "abs": "https://arxiv.org/abs/2511.16505", "authors": ["Juan Cortina", "Alejo Cifuentes-Santos", "Tarek Hassan", "Fernando Frias"], "title": "A Butterfly's Eye Camera for Intensity Interferometry with Cherenkov Telescopes", "comment": "19 pages, 11 figures, accepted for publication in PASP", "summary": "In recent years, imaging atmospheric Cherenkov telescopes (IACTs) have emerged as promising platforms for optical interferometry through the use of intensity interferometry. IACTs combine large segmented mirrors, photodetectors with nanosecond-scale time response capable of detecting signals from just a few photo-electrons, and array configurations with baselines of hundreds of meters. As a result, all major IACT facilities have now been upgraded to function also as optical intensity interferometers, achieving sensitivities an order of magnitude better than their predecessor, the Narrabri Stellar Intensity Interferometer. However, further improvements in sensitivity are currently limited by key IACT design constraints, namely the combination of poor optical quality and small focal ratios. Here we present three practical implementations of the \"I3T concept\", in which segments of the IACT primary mirror are focused onto different pixels of its camera. This approach yields several unexpected but significant advantages. Optics with larger focal ratios allow to integrate narrow-band optical filters, while lower photon fluxes enable to deploy next-generation photodetectors operating in photon-counting mode. We demonstrate that this so-called \"Butterfly's Eye\" configuration enhances the sensitivity of IACT-based intensity interferometers by a factor between 4 and 6. Moreover, as originally envisioned, the I3T design introduces imaging capabilities on angular scales from 2 to 40 milliarcseconds, unlocking new scientific opportunities such as direct surface imaging of nearby red giants. Besides, realistic simulations show that it can have a transformative impact on at least two key science cases: imaging the earliest stages of nova ejecta, and measuring the oblateness and circumstellar disks of fast-rotating stars."}
{"id": "2511.16437", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.16437", "abs": "https://arxiv.org/abs/2511.16437", "authors": ["A. Marino", "F. Coti Zelati", "K. Alabarta", "D. M. Russell", "Y. Cavecchi", "N. Rea", "S. K. Rout", "T. Di Salvo", "J. Homan", "Á. Jurado-López", "L. Ji", "R. Soria", "T. D. Russell", "Y. L. Wang", "A. Anitra", "M. C. Baglio", "H. Feng", "S. Fijma", "S. Guillot", "Y. F. Huang", "G. Illiano", "M. Imbrogno", "C. Jin", "F. Lewis", "Y. F. Liang", "M. J. Liu", "R. Ma", "G. Mastroserio", "S. E. Motta", "J. U. Ness", "E. Parent", "A. Patruno", "P. Saikia", "L. Tao", "M. Veresvarska", "X. P. Xu", "W. Yuan", "G. B. Zhang", "Z. J. Zhang"], "title": "Aql X-1 from dawn 'til dusk: the early rise, fast state transition and decay of its 2024 outburst", "comment": "13 pages, 9 figures, submitted to A&A", "summary": "Transient Low-Mass X-ray Binaries (LMXBs) are usually first detected by all-sky X-ray monitors when they enter new outbursts, typically at X-ray luminosities above $\\sim$10$^{36}$ erg/s. Observations of these sources during the early rise of the outbursts have so far been very limited. However, the launch of the Einstein Probe (EP) has greatly improved our ability to detect fainter X-ray activity, unlocking access to the outburst early rise. In September 2024, EP detected the early onset of a new outburst from the neutron star LMXB Aql X-1, catching the source at a luminosity below 10$^{35}$ erg/s. In this paper we present results from a comprehensive, multi-wavelength campaign of this event, combining data from EP, NICER, NuSTAR, Swift and Las Cumbres Observatory covering the full outburst from its early rise through its decay. By comparing X-ray and optical light curves obtained with Las Cumbres Observatory during the initial rise, we show that the start of the X-ray emission lagged the optical rise by, at most, 3 days. Time-resolved X-ray spectroscopy revealed how the geometry and the physical properties of the accretion flow evolve during this early stage of the outburst, as well as at higher luminosities as the source transitioned through the canonical X-ray spectral states - hard, intermediate and soft. These data show that the source underwent a very rapid, about 12-h long, transition from the hard to the soft state about two weeks after the optical onset of the outburst. The evolution of the temperature and physical sizes of both the inner region of the disk and a black body near the NS surface suggest that at the state transition, a boundary and spreading layer likely formed. We discuss these results in the context of time-scales for outburst evolution and state transitions in accreting neutron stars and black holes."}
{"id": "2511.16556", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2511.16556", "abs": "https://arxiv.org/abs/2511.16556", "authors": ["Jong-Seo Kim", "Jakob Roth", "Jongho Park", "Jack D. Livingston", "Philipp Arras", "Torsten A. Enßlin", "Michael Janssen", "J. Anton Zensus", "Andrei P. Lobanov"], "title": "Bayesian polarization calibration and imaging in very long baseline interferometry", "comment": "submitted to A&A", "summary": "Extracting polarimetric information from very long baseline interferometry (VLBI) data is demanding but vital for understanding the synchrotron radiation process and the magnetic fields of celestial objects, such as active galactic nuclei (AGNs). However, conventional CLEAN-based calibration and imaging methods provide suboptimal resolution without uncertainty estimation of calibration solutions, while requiring manual steering from an experienced user. We present a Bayesian polarization calibration and imaging method using Bayesian imaging software resolve for VLBI data sets, that explores the posterior distribution of antenna-based gains, polarization leakages, and polarimetric images jointly from pre-calibrated data. We demonstrate our calibration and imaging method with observations of the quasar 3C273 with the VLBA at 15 GHz and the blazar OJ287 with the GMVA+ALMA at 86 GHz. Compared to the CLEAN method, our approach provides physically realistic images that satisfy positivity of flux and polarization constraints and can reconstruct complex source structures composed of various spatial scales. Our method systematically accounts for calibration uncertainties in the final images and provides uncertainties of Stokes images and calibration solutions. The automated Bayesian approach for calibration and imaging will be able to obtain high-fidelity polarimetric images using high-quality data from next-generation radio arrays. The pipeline developed for this work is publicly available."}
{"id": "2511.16448", "categories": ["astro-ph.HE", "astro-ph.CO", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2511.16448", "abs": "https://arxiv.org/abs/2511.16448", "authors": ["Anne E Blackwell", "Joel N Bregman", "Sophia Chan Davis"], "title": "Tracing Early Cosmic Chemical Enrichment: A Uniform XMM-Newton Survey of Metallicity in Galaxy Groups and Clusters", "comment": null, "summary": "Observed metal abundances in the intracluster medium (ICM) of galaxy groups and clusters, $Z_{ICM}$, exceed what is expected from present-day stellar populations alone. Galaxy clusters are presumed to be near closed-box systems, allowing constraints to be placed on the origins of metals and stellar populations responsible for $Z_{ICM}$. We present a uniform XMM-Newton survey of 26 galaxy groups and clusters, measuring radial metallicity profiles and relating $Z_{ICM}$ with the stellar fraction $M_*/M_{gas}$. We determine $Z_{ICM}$ via spectral fitting across multiple annuli finding a best fit of $Z_{ICM} = -0.08^{+0.07}_{-0.07}\\, log\\left(\\frac{M_*}{M_{gas}}\\right) + 0.30^{+0.06}_{-0.06}$ with intrinsic scatter $σ_p = 0.09^{+0.02}_{-0.01}$. We use closed-box chemical evolution models to estimate the metallicity yield from observable stellar populations, incorporating updated supernova yields and corrections for metals locked in remnants, $Z_* = (1.14 \\pm 0.52) \\, log\\left(1 + \\frac{M_*}{M_{gas}}\\right)$. Our results demonstrate that present-day stellar populations systematically underpredict $Z_{ICM}$, with an inferred excess component increasing in systems with low $M_*/M_{gas}$. This trend supports the need for an early enrichment population (EEP) distinct from visible stars, $Z_{EEP}$. We find this necessity holds when reconsidering the closed-box assumption by removing all galaxy groups, potential leaky systems, deriving $Z_{EEP}$ within $1σ$ when including and excluding groups. Three systems (NGC1132, NGC5098, and NGC4325) deviate from the survey trend, exhibiting steep negative radial metallicity gradients and unusually low $Z_{ICM}$. We posit these systems to be late-forming whose ICM enrichment reflects only recent stellar populations. Our analysis quantifies the necessity of an EEP and provides trends for testing cluster chemical evolution models."}
{"id": "2511.16506", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.16506", "abs": "https://arxiv.org/abs/2511.16506", "authors": ["Zoha Laraib", "Sherwood Richers"], "title": "Two-beam Multiparticle Many-body simulations of Inhomogeneous FFI", "comment": "15 pages, 14 figures", "summary": "Neutrino flavor evolution in dense astrophysical environments is inherently nonlinear and sensitive to many-body (MB) quantum effects beyond the mean-field (MF) approximation. Existing MB studies are constrained by small system sizes, closed boundaries, and highly idealized symmetry assumptions. We present a unified tensor-network framework that enables simulations of inhomogeneous and anisotropic flavor evolution under conditions relevant to core-collapse supernovae and neutron-star mergers. Within this framework, we examine the effects of inhomogeneity, boundary conditions, and convergence with resolution for multiple neutrino distributions, allowing direct comparison of these setups under one consistent formulation. In our simulations, many-body systems equilibrate earlier than their mean-field counterparts while approaching similar final flavor states. Enlarging the interaction region allows open boundaries to reproduce closed-system behavior, but only when the beams begin superimposed and interact continuously. By contrast, initially separated configurations develop entanglement more slowly, interact over longer times, and equilibrate to a flavor content that differs from that obtained from initially superimposed calculations."}
{"id": "2511.16507", "categories": ["astro-ph.HE", "astro-ph.SR", "nucl-th"], "pdf": "https://arxiv.org/pdf/2511.16507", "abs": "https://arxiv.org/abs/2511.16507", "authors": ["Luis E. Rodríguez", "Andreas Reisenegger", "Denis González-Caniulef", "Cristóbal Petrovich", "George Pavlov", "Sébastien Guillot", "Oleg Kargaltsev", "Blagoy Rangelov"], "title": "Neutron star heating vs. HST observations", "comment": null, "summary": "Passively cooling neutron stars (NSs) should reach undetectably low surface temperatures $T_s<10^4$ K in less than $10^7$ yr. However, HST observations have revealed likely thermal UV emission from the Gyr-old millisecond pulsars PSR~J0437$-$4715 and PSR~J2124$-$3358, and from the $\\sim10^{7-8}$ yr-old classical pulsars PSR~B0950$+$08 and PSR~J0108$-$1431, implying $T_s\\sim10^5$ K and the need for heating mechanisms. We compute the thermal evolution of these NSs including rotochemical heating (RH) in the core with normal or Cooper-paired matter, vortex creep (VC) in the inner crust, and crustal heating through nuclear reactions, and compare the results with observations and with the upper limit for PSR~2144$-$3933. No single mechanism explains all sources. The high temperature of PSR~J0437$-$4715 can be reproduced by RH with a large Cooper pairing gap $Δ_i\\sim1.5$ MeV for either neutrons or protons, but this requires an unrealistically short initial period $P_0\\lesssim1.8$ ms to activate the same mechanism in PSR~B0950$+$08. Conversely, the latter can be explained by RH with modified Urca reactions in normal matter or by VC with an excess angular momentum $J\\sim3\\times10^{43}$ erg,s, but these models underpredict PSR~J0437$-$4715. A model combining RH with a large pairing gap and VC matches both pulsars and is consistent with the upper limits for the remaining three. It further predicts that their temperatures should lie close to these limits, suggesting that deeper or broader-wavelength observations would provide a strong test of this scenario."}
{"id": "2511.16631", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.16631", "abs": "https://arxiv.org/abs/2511.16631", "authors": ["Haihao Shi", "Zhenyang Huang", "Junda Zhou", "Guoliang Lü", "Xuefei Chen"], "title": "A Core-Collapse Supernova Neutrino Parameterization with Enhanced Physical Interpretability", "comment": "48 pages, 31 figures, It has been accepted by APJS", "summary": "We introduce a novel parameterization of supernova neutrino energy spectra with a clear physical motivation. Its central parameter, $τ(t)$, quantifies the characteristic thermal-diffusion area during the explosion. When applied to the historic SN1987A data, this parameterization yields statistically significant fits and provides robust constraints on the unobserved low-energy portion of the spectrum. Beyond this specific application, we demonstrate the model's power on a suite of 3D core-collapse supernova simulations, finding that the temporal evolution of $τ(t)$ distinctly separates successful from failed explosions. Furthermore, we constrain the progenitor mass of SN 1987A to approximately 19 solar masses by applying Smoothed Isotonic Regression, while noting the sensitivity of this estimate to observational uncertainties. Moreover, in these simulations, $τ(t)$ and the gravitational-wave strain amplitude display a strong, synergistic co-evolution, directly linking the engine's energetic evolution to its geometric asymmetry. This implies that the thermodynamic state of the explosion is imprinted not only on the escaping neutrino flux, but also recorded in the shape of the energy spectrum. Our framework therefore offers a valuable tool for decoding the detailed core dynamics and multi-messenger processes of future galactic supernovae."}
{"id": "2511.16648", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.16648", "abs": "https://arxiv.org/abs/2511.16648", "authors": ["Ignacio Magaña Hernandez", "Katelyn Breivik"], "title": "Lucky Strikes: On the Origins of GW190814 Through Isolated Binary Evolution", "comment": "14 pages, 6 figures", "summary": "The asymmetric nature of GW190814, particularly its mass ratio ($q \\approx 1/10$), has made its astrophysical origin elusive. We explore isolated binary evolution as a potential explanation for GW190814's formation. Using the binary population synthesis code COSMIC, and the backpop sampling technique to map the observed parameters of GW190814 to the initial conditions of Zero Age Main Sequence binary stars while simultaneously inferring the astrophysical prescriptions for common envelope evolution, stable mass transfer and natal kick kinematics that are needed for its formation and eventual merger. We find that the initial conditions for the binary stellar population that forms GW190814 do not stand out significantly from massive star populations observed in the Local Group. Our backpop simulations recover a dominant formation pathway where the first Roche overflow phase includes a common envelope evolution and the second Roche overflow phase remains stable. Our findings suggest that natal kicks imparted during compact object formation play the strongest role in forming GW190814-like systems. Specifically, our models require a low magnitude first natal kick (independent of direction) that prevents the binary from unbinding and a large second natal kick with its direction in the plane of the orbit and toward the binary's center of mass. The second natal kick strength and direction crucially increases the orbital eccentricity, leading to shorter delay times, and thus enabling mergers within a Hubble time. We estimate the chance probability for GW190814-like events that experience such a lucky kick and find that it occurs in $\\sim20\\%$ of systems if natal kicks are randomly oriented. We discuss the astrophysical implications for the formation of asymmetric GW190814-like systems under the context of binary stellar evolution."}
