{"id": "2510.01207", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.01207", "abs": "https://arxiv.org/abs/2510.01207", "authors": ["Aman Kaushik", "Yash Bhargava", "Sudip Bhattacharyya", "Maurizio Falanga"], "title": "Probing the accreting millisecond X-ray pulsar SAX J1808.4-3658 using the evolution of its spectral and aperiodic timing properties", "comment": "Accepted for publication in ApJ, 19 pages, 3 tables, 8 figures", "summary": "Understanding accretion components in neutron star (NS) low mass X-ray binary\n(LMXB) systems is important to probe fundamental aspects of accretion mechanism\nand evolution of the system constraining its physical properties. Here, we\npresent spectral and aperiodic timing analyses of the NICER and AstroSat data\nfrom the accretion powered millisecond X-ray pulsar (AMXP) SAX J1808.4-3658\nduring its 2022 outburst. We find that emissions from a softer accretion disk\nand a harder, centrally located, compact, partially covering, Comptonizing\ncorona explains the continuum spectra from the source throughout the outburst.\nThe disk inner edge temperature, the coronal electron temperature and photon\nindex are found to be around ~ 0.5-0.9 keV, a few keV and ~ 1.1-1.8,\nrespectively, during the entire outburst. We also find an intrinsic atomic\nhydrogen medium in the system, which substantially and systematically evolved\nthroughout the outburst. We detect two broadband aperiodic features (~ 0.004-2\nHz; ~ 10-100 Hz), with the former having a significant hard lag of ~ 11 ms\nbetween 1.5-10.0 keV and 0.5-1.5 keV photons. We conclude that both the disk\nphotons and the photons up-scattered by the corona contributed to each\naperiodic feature, with the disk and the corona contributing more to the low\nand high frequency ones, respectively."}
{"id": "2510.01208", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.01208", "abs": "https://arxiv.org/abs/2510.01208", "authors": ["Aman Kaushik", "Sayantan Bhattacharya", "Sudip Bhattacharyya"], "title": "Spin period evolution and X-ray spectral characteristics of the SMC pulsar SXP 46.6", "comment": "Accepted for publication in PRD, 10 pages, 8 figures, 1 table", "summary": "We characterize the Small Magellanic Cloud (SMC) pulsar SXP 46.6 using NuSTAR\nobservations conducted in 2017. The spin period (P) of this neutron star\ndecreased from its discovered value of 46.6 s to a value of 45.984(1) s,\nindicating a spin-up at the rate of \\dot{P} = -1.13 x 10^{-9} s s^{-1}. This\nspin-up rate is used to calculate a high pulsar magnetic field value of 2.25 x\n10^{13} G. This process also gives a low magnetic field value, which we rule\nout here by constraining the inner accretion disk radius to be less than the\nradius of the innermost stable circular orbit. The pulse profile, analyzed in\nsoft, hard, and broad X-ray bands, shows a double-peaked structure, consistent\nwith pencil beam emission from two antipodal hot spots on the neutron star\nsurface. We also perform spin phase-resolved spectroscopy for the first time,\nrevealing spectral variations across different phases of the pulsar's rotation.\nThese results offer new insights into the long-term spin evolution and emission\nproperties of SXP 46.6."}
{"id": "2510.01338", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.01338", "abs": "https://arxiv.org/abs/2510.01338", "authors": ["P. Gandhi", "D. M. Russell", "M. C. Baglio", "Y. Bhargava", "R. Duncan", "A. Gúrpide", "C. O. Heinke", "C. Knigge", "K. S. Long", "T. J. Maccarone", "G. Mastroserio", "T. D. Russell", "A. W. Shaw", "A. J. Tetarenko", "F. M. Vincentelli", "E. S. Borowski", "D. A. H. Buckley", "P. Casella", "C. Dashwood Brown", "G. C. Dewangan", "R. I. Hynes", "S. Markoff", "J. A. Tomsick", "K. Alabarta", "F. Carotenuto", "E. Carver", "N. Castro-Segura", "P. Charles", "F. Lewis", "J. A. Paice", "D. Pawar", "M. E. Ressler", "S. K. Rout", "P. Saikia", "T. Shahbaz", "G. R. Sivakoff"], "title": "Infrared Synchrotron Emission in the Soft State of GX 339-4 and the Mid-Infrared/X-ray Luminosity Plane of Black Hole X-ray Binaries", "comment": "Submitted on 2025 Sep 26", "summary": "Progress in understanding the growth of accreting black holes remains\nhampered by a lack of sensitive coordinated multiwavelength observations. In\nparticular, the mid-infrared (MIR) regime remains ill-explored except for\njet-dominant states. Here, we present comprehensive follow-up of the black hole\nX-ray binary GX 339-4 during a disc-dominated state in its 2023/24 outburst as\npart of a multi-wavelength campaign coordinated around JWST/MIRI. The X-ray\nproperties are fairly typical of soft accretion states, with a high-energy\nComptonised tail. The source is significantly detected between 5-10$\\mu$m,\nalbeit at a faint flux level requiring MIR compact jet emission to be quenched\nby a factor of $\\sim$300 or more relative to previous hard-state detections.\nThe MIRI spectrum can be described as a simple power-law with slope $\\alpha$ =\n+0.39$\\pm$0.07 ($F_\\nu$ $\\propto$ $\\nu^\\alpha$), but surprisingly matches\nneither the radio/sub-mm nor the optical broadband slopes. Significant MIR\nstochastic variability is detected. Synchrotron radiation from the same medium\nresponsible for high-energy Comptonisation can self-consistently account for\nthe observed MIRI spectral-timing behaviour, offering new constraints on the\nphysical conditions in the soft-state accretion disc atmosphere/corona.\nAlternative explanations, including a circumbinary disc or emission from a warm\nwind, fail to cleanly explain either the spectral properties or the\nvariability. Multiwavelength timing cross-correlations show a puzzlingly long\nMIR lag relative to the optical, though at limited significance. We compile\narchival MIR and X-ray luminosities of transient black hole systems, including\npreviously unreported detections of GX 339-4. These trace the evolution of the\nMIR-to-X-ray flux ratio with accretion state, and also reveal high MIR\nluminosities for GX 339-4 across all states. (abridged)"}
{"id": "2510.01340", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.01340", "abs": "https://arxiv.org/abs/2510.01340", "authors": ["Yuan Li", "Gwenael Giacinti", "Siming Liu"], "title": "Discovery of diffuse gamma-ray emission in the vicinity of G172.8+1.5: An old supernova remnant with different turbulence properties", "comment": "14 pages, 7 figures. Submitted to ApJ", "summary": "We report the detection of high-energy $\\gamma$-ray emission in the vicinity\nof G172.8+1.5, which is debated as a Supernova remnant (SNR) or an ionized\nhydrogen (H$_{\\rm{II}}$) region. Using 16-yr Pass 8 data from Fermi Large Area\nTelescope (Fermi-LAT), we found the GeV emission can be described by two\nextended sources with different photon spectra. Among them, the much more\nextended $\\gamma$-ray source SrcA with a Power-law spectrum is spatially\ncoincident with a giant neutral Hydrogen shell structure and several OB stars\ninside a huge H$_{\\rm{II}}$ region. The softer Log-Parabola spectra\n$\\gamma$-ray source SrcB is spatially coincident with a star-forming region\nwith several OB stars, maser sources and IR sources. Gas observation results\ndisplay a dense molecular cloud surrounding SrcB in the velocity range of\n[-25,-5] km s$^{-1}$. The possible origins of $\\gamma$-ray emission are\ndiscussed, including CRs escaped from SNR shock surface and illuminated nearby\nMC, the young massive star clusters associated with the star-forming region and\na pulsar halo generated by an invisible energetic pulsar inside the SNR.\nFurthermore, under the hadronic scenario, the measured diffusion coefficient in\nthe compact SrcB region is significantly lower than that of the more extended\nSrcA. This suppression is likely attributed to cosmic-ray-driven instabilities,\nwhich reduce the diffusion efficiency in the vicinity of the source relative to\nthe standard conditions in the interstellar medium (ISM). Future advanced\nanalysis from LHAASO observation results would help distinguish the origins of\n$\\gamma$-ray emission in this region and clarify the nature of this source."}
{"id": "2510.01215", "categories": ["astro-ph.IM", "astro-ph.EP", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2510.01215", "abs": "https://arxiv.org/abs/2510.01215", "authors": ["David Kipping"], "title": "Solar Hegemony: M-Dwarfs Are Unlikely to Host Observers Such as Ourselves", "comment": "Submitted to AAS Journals", "summary": "With no firm evidence for life beyond our solar system, inferences about the\npopulation observers such as ourselves rests upon the Earth as a single input,\nat least for now. Whilst the narrative of our home as a 'humdrum' system has\nbecome ingrained in the public psyche via Sagan, there are at least two\nstriking facts about our existence which we know are certainly unusual. First,\nthe stelliferous period spans ~10Tyr - yet here we are living in the first 0.1%\nof that volume. Second, over three-quarters of all stars are low-mass M-dwarfs,\nstars with no shortage of rocky habitable-zone planets - and yet, again, our\nexistence defies this trend, previously dubbed the Red Sky Paradox. Two\nplausible resolutions are that a) stars below a certain mass, $M_{crit}$, do\nnot produce observers, and, b) planets have a truncated temporal window for\nobservers, $T_{win}$, negating the longevity advantage of M-dwarfs. We develop\na Bayesian model that encompasses both datums and jointly explores the two\nresolutions covariantly. Our analysis reveals that 1) the hypothesis that these\nobservations are mere luck is disfavored with an overwhelming Bayes factor of\n~1600; 2) some truncation of low-mass stars is indispensable, lowering\n$T_{win}$ alone cannot well-explain the observations; and, 3) the most\nconservative limit on $M_{crit}$ occurs when fixing $T_{win}=10$Gyr, yielding\n$M_{crit}>0.34 M_{\\odot}$ [$0.74 M_{\\odot}$] to 2$\\sigma$ [1$\\sigma$]. Our work\nchallenges the tacit assumption of M-dwarfs being viable seats for observers\nand, indirectly, even life."}
{"id": "2510.01369", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.01369", "abs": "https://arxiv.org/abs/2510.01369", "authors": ["Samy Kaci", "Gwenael Giacinti", "Felix Aharonian", "Jie-Shuang Wang"], "title": "Microquasars as the major contributors to Galactic cosmic rays around the \"knee\"", "comment": "5 pages, 4 figures", "summary": "Recently, LHAASO detected a gamma-ray emission extending beyond\n$100\\,\\rm{TeV}$ from 4 sources associated to powerful microquasars. We propose\nthat such sources are the main Galactic PeVatrons and investigate their\ncontribution to the proton and gamma-ray fluxes by modeling their entire\npopulation. We find that the presence of only $\\sim10$ active powerful\nmicroquasars in the Galaxy at any given time is sufficient to account for the\nproton flux around the knee and to provide a very good explanation of\ncosmic-ray and gamma-ray data in a self-consistent picture. The $10\\,\\rm{TeV}$\nbump and the $300\\,\\rm{TeV}$ hardening in the cosmic-ray spectrum naturally\nappear, and the diffuse background measured by LHAASO above a few tens of\n$\\rm{TeV}$ is accounted for. This supports the paradigm in which cosmic rays\naround the knee are predominantly accelerated in a very limited number of\npowerful microquasars."}
{"id": "2510.01299", "categories": ["astro-ph.IM", "cs.AI"], "pdf": "https://arxiv.org/pdf/2510.01299", "abs": "https://arxiv.org/abs/2510.01299", "authors": ["Dmitriy Kostunin", "Elisa Jones", "Vladimir Sotnikov", "Valery Sotnikov", "Sergo Golovachev", "Alexandre Strube"], "title": "Enhancing the development of Cherenkov Telescope Array control software with Large Language Models", "comment": "EuCAIFCon 2025 proceedings", "summary": "We develop AI agents based on instruction-finetuned large language models\n(LLMs) to assist in the engineering and operation of the Cherenkov Telescope\nArray Observatory (CTAO) Control and Data Acquisition Software (ACADA). These\nagents align with project-specific documentation and codebases, understand\ncontextual information, interact with external APIs, and communicate with users\nin natural language. We present our progress in integrating these features into\nCTAO pipelines for operations and offline data analysis."}
{"id": "2510.01476", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.01476", "abs": "https://arxiv.org/abs/2510.01476", "authors": ["F. Rösch", "M. Kadler", "E. Ros", "L. Ricci", "M. A. Gurwell", "T. Hovatta", "N. R. MacDonald", "A. C. S. Readhead"], "title": "Pinpointing the location of the gamma-ray emitting region in the FSRQ 4C+01.28", "comment": null, "summary": "The FSRQ 4C+01.28 is a bright and highly variable radio and $\\gamma$-ray\nemitter. We aim to pinpoint the location of the $\\gamma$-ray emitting region\nwithin its jet in order to derive strong constraints on $\\gamma$-ray emission\nmodels for blazar jets. We use radio and $\\gamma$-ray data obtained with ALMA,\nOVRO, SMA and Fermi/LAT to study the cross-correlation between $\\gamma$-ray and\nmulti-frequency radio light curves. Moreover, we employ VLBA observations at 43\nGHz over a period of around nine years to study the parsec-scale jet\nkinematics. To pinpoint the location of the $\\gamma$-ray emitting region, we\nuse a model in which outbursts shown in the $\\gamma$-ray and radio light curves\nare produced when moving jet components pass through the $\\gamma$-ray emitting\nand the radio core regions. We find two bright and compact newly ejected jet\ncomponents that are likely associated with a high activity period visible in\nthe $\\gamma$-ray and radio light curves. The kinematic analysis of the VLBA\nobservations leads to a maximum apparent jet speed of $\\beta_{app}=19\\pm10$ and\nan upper limit on the viewing angle of $\\phi$ < 4 deg. We determine the power\nlaw indices that are characterizing the jet geometry, brightness temperature\ndistribution, and core shift to be $l=0.974\\pm0.098$, $s=-3.31\\pm0.31$, and\n$k_r=1.09\\pm0.17$, which are in agreement with a conical jet in equipartition.\nA cross-correlation analysis shows that the radio light curves follow the\n$\\gamma$-ray light curve. We pinpoint the location of the $\\gamma$-ray emitting\nregion with respect to the jet base to the range of $2.6\\,\\mathrm{pc}\\leq\nd_\\gamma\\leq20\\,\\mathrm{pc}$. Our derived observational limits places the\nlocation of $\\gamma$-ray production in 4C+01.28 beyond the expected extent of\nthe broad-line region (BLR) and therefore challenges blazar-emission models\nthat rely on inverse Compton up-scattering of seed photons from the BLR."}
{"id": "2510.01316", "categories": ["astro-ph.IM", "gr-qc"], "pdf": "https://arxiv.org/pdf/2510.01316", "abs": "https://arxiv.org/abs/2510.01316", "authors": ["Polina Petrov", "Levi Schult", "Stephen R. Taylor", "Nihan Pol", "Nima Laal", "Maria Charisi", "Chung-Pei Ma"], "title": "Expectations for the first supermassive black-hole binary resolved by PTAs II: Milestones for binary characterization", "comment": "Submitted to Physical Review D", "summary": "Following the recent evidence for a gravitational wave (GW) background found\nby pulsar timing array (PTA) experiments, the next major science milestone is\nresolving individual supermassive black hole binaries (SMBHBs). The detection\nof these systems could arise via searches using a power-based GW anisotropy\nmodel or a deterministic template model. In Schult et al. 2025, we compared the\nefficacy of these models in constraining the GW signal from a single SMBHB\nusing realistic, near-future PTA datasets, and found that the full-signal\ndeterministic continuous wave (CW) search may achieve detection and\ncharacterization first. Here, we continue our analyses using only the CW model\ngiven its better performance, focusing now on characterization milestones. We\nexamine the order in which CW parameters are constrained as PTA data are\naccumulated and the signal-to-noise ratio (S/N) grows. We also study how these\nparameter constraints vary across sources of different sky locations and GW\nfrequencies. We find that the GW frequency and strain are generally constrained\nat the same time (or S/N), closely followed by the sky location, and later the\nchirp mass (if the source is highly evolving) and inclination angle. At fixed\nS/N, sources at higher frequencies generally achieve better precision on the GW\nfrequency, chirp mass, and sky location. The time (and S/N) at which the signal\nbecomes constrained is dependent on the sky location and frequency of the\nsource, with the effects of pulsar terms and PTA geometry playing crucial roles\nin source detection and localization."}
{"id": "2510.01614", "categories": ["astro-ph.HE", "gr-qc"], "pdf": "https://arxiv.org/pdf/2510.01614", "abs": "https://arxiv.org/abs/2510.01614", "authors": ["Yi Shuen C. Lee", "Marek J Szczepańczyk", "Tanmaya Mishra", "Margaret Millhouse", "Andrew Melatos"], "title": "Dedicated-frequency analysis of gravitational-wave bursts from core-collapse supernovae with minimal assumptions", "comment": "19 pages, 9 figures, accepted for publication in Physical Review D", "summary": "Gravitational-wave (GW) emissions from core-collapse supernovae (CCSNe)\nprovide insights into the internal processes leading up to their explosions.\nTheory predicts that CCSN explosions are driven by hydrodynamical instabilities\nlike the standing accretion shock instability (SASI) or neutrino-driven\nconvection, and simulations show that these mechanisms emit GWs at low\nfrequencies ($\\lesssim 0.25 \\,{\\rm kHz}$). Thus the detection of low-frequency\nGWs, or lack thereof, is useful for constraining explosion mechanisms in CCSNe.\nThis paper introduces the dedicated-frequency framework, which is designed to\nfollow-up GW burst detections using bandpass analyses. The primary aim is to\nstudy whether low-frequency (LF) follow-up analyses, limited to $\\leq 256\n\\,{\\rm Hz}$, constrain CCSN explosion models in practical observing scenarios.\nThe analysis dataset comprises waveforms from five CCSN models with different\nstrengths of low-frequency GW emissions induced by SASI and/or neutrino-driven\nconvection, injected into the Advanced LIGO data from the Third Observing Run\n(O3). Eligible candidates for the LF follow-up must satisfy a benchmark\ndetection significance and are identified using the coherent WaveBurst (cWB)\nalgorithm. The LF follow-up analyses are performed using the BayesWave\nalgorithm. Both cWB and BayesWave make minimal assumptions about the signal's\nmorphology. The results suggest that the successful detection of a CCSN in the\nLF follow-up analysis constrains its explosion mechanism. The\ndedicated-frequency framework also has other applications. As a demonstration,\nthe loudest trigger from the SN 2019fcn supernova search is followed-up using a\nhigh-frequency (HF) analysis, limited to $\\geq 256 \\,{\\rm Hz}$. The trigger has\nnegligible power below $256 \\, {\\rm Hz}$, and the HF analysis successfully\nenhances its detection significance."}
{"id": "2510.01317", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.01317", "abs": "https://arxiv.org/abs/2510.01317", "authors": ["Levi Schult", "Polina Petrov", "Stephen R. Taylor", "Nihan Pol", "Nima Laal", "Maria Charisi", "Chung-Pei Ma"], "title": "Expectations for the first supermassive black-hole binary resolved by PTAs I: Model efficacy", "comment": "25 pages, 6 figures, 3 tables. Submitted to Physical Review D", "summary": "One of the most promising targets for Pulsar Timing Arrays (PTAs) is\nidentifying an individual supermassive black hole binary (SMBHB) out of the\npopulation of binaries theorized to produce a gravitational wave background\n(GWB). In this work, we emulate an evolving PTA dataset, complete with an\nincreasing number of pulsars and timing baseline, into which we inject a single\nbinary on top of a Gaussian GWB signal. We vary the binary's source parameters,\nincluding sky position and frequency, and create an ensemble of simulated\ndatasets with which we assess current Bayesian binary search techniques. We\napply two waveform-based template models and a frequency-resolved anisotropy\nsearch to these simulations to understand how they compare in their detection\nand characterization abilities. We find that a template-based search including\nthe full gravitational-wave signal structure (i.e., both Earth and pulsar\neffects of an incident GW) returns the highest Bayes Factors (BF), exceeding\nour estimator's capabilities by (S/N)~9-19, and has the most robust parameter\nestimation. Our anisotropy model attains a realization-median BF>10 at\n7<(S/N)<15. Interestingly, despite being a deterministic model, the Earth-term\ntemplate struggles to detect and characterize low-frequency binaries (5 nHz).\nThese binaries require higher (S/N)~16-19 to reach the same BF threshold. This\nis likely due to neglected confusion effects between the pulsar and Earth\nterms. By contrast, the frequency-resolved anisotropy model shows promise for\nparameter estimation despite treating a binary's GW signal as excess\ndirectional GW power without phase modeling. Sky location and frequency\nparameter constraints returned by the anisotropy model are only surpassed by\nthe Earth term template model at (S/N)~12-13. Milestones for a first detection\nusing the full-signal GW model are included in a companion paper (Petrov et al.\n2025)."}
{"id": "2510.01739", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.01739", "abs": "https://arxiv.org/abs/2510.01739", "authors": ["L. Foffano", "M. Tavani"], "title": "Exploring GRB Afterglows in the TeV Era: New Diagnostics of Particle Acceleration", "comment": "Proceedings of the 39th International Cosmic Ray Conference\n  -ICRC2025-, Geneva, Switzerland", "summary": "The TeV gamma-ray band is essential for probing the most extreme particle\nacceleration processes in the Universe. The recent detections of gamma-ray\nbursts (GRBs) at these energies offer an incredible opportunity to investigate\nthe origins of such transient events in an unprecedented way. In this\npresentation, we analyze the afterglows of these GRBs by modeling their\nsynchrotron and inverse Compton emission within an optimized relativistic\nfireball framework. By comparing observational data with theoretical\npredictions, we constrain key model parameters and track their temporal\nevolution. The comparison of different TeV-detected GRBs reveals an intriguing\nvariety among them, potentially reflecting differences in the particle\nacceleration processes that have to be very fast and able to accelerate to\nlarge energies. We discuss how late-time afterglow observations of X-ray and\nGeV-TeV emissions are crucial for providing diagnostics into the physics of\nGRBs. At this scope, we also present the most updated results of the AGILE\ntelescope, which support our interpretation. Finally, we highlight theoretical\npredictions for future TeV observations and their implications for\nunderstanding these extreme cosmic explosions."}
{"id": "2510.01371", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2510.01371", "abs": "https://arxiv.org/abs/2510.01371", "authors": ["C. M. Cordun", "M. A. Brentjens", "H. K. Vedantham", "M. Mevius"], "title": "An improved algorithm for separating clock delays from ionospheric effects in radio astronomy", "comment": "9 pages, 7 figures", "summary": "Context: Low-frequency radio observations are heavily impacted by the\nionosphere, where dispersive delays can outpace even instrumental clock\noffsets, posing a serious calibration challenge. Especially below 100 MHz,\nphase unwrapping difficulties and higher-order dispersion effects can\ncomplicate the separation of ionospheric and clock delays. Aims: We address\nthis challenge by introducing a method for reliably separating clock delays\nfrom ionospheric effects, even under mediocre to poor ionospheric conditions\nencountered near solar maximum. Methods: The approach employs a key technique:\nwe modelled our likelihood space using the circular Gaussian distribution (von\nMises random variable) rather than non-circular distributions that suffer from\n$2\\pi$ phase ambiguities. This ensures that noisier data are weighted less\nheavily than cleaner data during the fitting process. Results: The method\nreliably separates clock delays and ionospheric terms that vary smoothly in\ntime whilst providing a good fit to the data. A comparison with the\nclock-ionosphere separation approach used in standard LOFAR data processing\nshows that our technique achieves significant improvements. In contrast to the\nold algorithm, which often fails to return reliable results below 100 MHz even\nunder good ionospheric conditions, the new algorithm consistently provides\nreliable solutions across a wider range of conditions. Conclusions: This new\nalgorithm represents a significant advance for large-scale surveys, offering a\nmore dependable way to study ionospheric effects and furthering research in\nionospheric science and low-frequency radio astronomy."}
{"id": "2510.01742", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.01742", "abs": "https://arxiv.org/abs/2510.01742", "authors": ["Stella Boula", "Fabrizio Tavecchio", "Gianluigi Bodo", "Nektarios Vlahakis", "Paolo Coppi", "Agnese Costa", "Alberto Sciaccaluga"], "title": "Instabilities at recollimation shocks in MHD jets", "comment": "16 pages, 19 figures, submitted to A&A", "summary": "AGN jet structure and stability remain uncertain; recollimation shocks are\nlinked to morphology and variability, but the role of downstream instabilities\nis still unclear. We aim to investigate how jet magnetization and other\nphysical parameters influence the development of instabilities beyond the first\nrecollimation shock. In particular, we focus on identifying the conditions\nunder which the centrifugal instability (CFI) is effective. We perform\nhigh-resolution 2D and 3D simulations using the relativistic\nmagnetohydrodynamics code PLUTO. The jets are initialized with a conical\ngeometry and propagate into an ambient medium, and we follow by axisymmetric\nsimulations how they evolve towards a steady-state. In 2D we explore a range of\nmagnetizations (from 0 to 1), pressure contrasts, and inertia ratios to\ncharacterize the formation and evolution of recollimation shocks. The results\nare further evaluated using linear stability analysis to assess the growth and\nsuppression of CFI. Finally, we perform 3D simulations of unstable and stable\njets. We discuss how the different parameters of the axisymmetric steady\nsolutions influence the location and strength of recollimation. We find that,\neven in moderately magnetized jets, $\\sigma$=0.1, the CFI can still develop\nunder suitable local conditions and disrupt the jet structure. This instability\nis governed by the jet radius, curvature, Lorentz factor, and magnetization,\nand is not always predictable from injection conditions. While magnetization\ncan delay or locally suppress instability growth, it does not guarantee\nlong-term jet stability. Our 3D results highlight the limitations of 2D models\nin capturing non-axisymmetric and nonlinear effects, and underline the complex\ninterplay between magnetic confinement and destabilizing mechanisms. These\nfindings have implications for interpreting variability, and polarization\nstructure in AGN jets."}
{"id": "2510.01405", "categories": ["astro-ph.IM", "astro-ph.EP", "astro-ph.GA", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2510.01405", "abs": "https://arxiv.org/abs/2510.01405", "authors": ["Omer Eldadi", "Gershon Tenenbaum", "Abraham Loeb"], "title": "Advancing Interstellar Science: A Global Framework for Comprehensive Study of Interstellar Objects", "comment": "1 figure", "summary": "The operation of the Vera C. Rubin Observatory's Legacy Survey of Space and\nTime (LSST) marks a transformative moment in humanity's capacity to detect and\ncharacterize interstellar objects (ISOs). With projections indicating an\nincrease from a few detections per decade to potentially one every few months,\nhumanity stands at the threshold of unprecedented scientific opportunity\noffering revolutionary insights into the nature of rocky materials, building\nblocks of life and technological products from other star systems. This white\npaper proposes the establishment of the United Nations Committee on\nInterstellar Objects (UNCIO), a specialized body designed to coordinate global\nscientific research, maximize observational coverage, and ensure optimal\nscientific return from these extraordinary objects from outside the solar\nsystem through systematic investigation in cosmochemistry, astrobiology,\nplanetary sciences, fundamental physics, advanced technologies and materials\nscience. The proposed framework addresses critical gaps in our current\ninternational infrastructure: the absence of coordinated detection,\nclassification and intercept capabilities, insufficient protocols for rapid\nscientific response and international policy decisions to time-sensitive\nobservations, and the need for effective science communication to maintain\ngovernment and public support for these ambitious investigations and global\nthreats to Earth. Drawing from successful international collaborations in areas\nsuch as the International Space Station (ISS) and the European Organization for\nNuclear Research (CERN), UNCIO would operate through a dual structure: an\nexecutive board for time-critical scientific decisions and an expanded\ncommittee for comprehensive stakeholder representation. This initiative is not\nmerely aspirational but urgently practical."}
{"id": "2510.01773", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2510.01773", "abs": "https://arxiv.org/abs/2510.01773", "authors": ["M. Kunert-Bajraszewska", "D. Kozieł-Wierzbowska", "D. Stern", "A. Krauze", "N. Zafar", "T. Connor", "M. J. Graham"], "title": "Identifying tidal disruption events among radio transient galaxies", "comment": "21 pages, 7 figures, 5 tables; accepted for publication in A&A", "summary": "We present the optical and infrared properties of a sample of 24 radio\ntransient sources discovered in the Very Large Array Sky Survey (VLASS).\nPrevious studies of their radio emission showed that these sources resemble\nyoung gigahertz-peaked spectrum (GPS) radio sources, but are less powerful and\ncharacterized by low-power jets. The bursts of radio activity in most cases are\nlikely due to intrinsic changes in the accretion processes. However, for a few\nsources in this sample, we cannot rule out the possibility that their radio\nvariability results from a tidal disruption event (TDE). In this work, we\nextend our analysis to the optical and infrared regimes, confirming that our\nsample of radio transients is not homogeneous in terms of their optical and\ninfrared properties either. The host galaxies of most of these sources are\nmassive ellipticals with emission dominated by active galactic nuclei (AGN).\nThey host supermassive black holes (SMBHs) with masses typical of radio-loud\nAGNs ($\\rm >10^7\\,M_{\\odot}$), but exhibit very low accretion activity. In\ncontrast, the sources for which a TDE origin is suspected are either pure\nstar-forming galaxies or show significant ongoing star formation, similar to\nradio-selected optically-detected TDEs. Additionally, two of them exhibit\ninfrared flares characteristic of TDEs, while the remaining sources do not\ndisplay significant variability outside the radio regime. Moreover, the\nevolution of their radio brightness in the W3/radio diagnostic diagram, which\nwe employ in our analysis, also sets our TDE candidates apart from the rest of\nthe sample and resembles the radio variability seen in optically discovered\nTDEs with radio emission. Finally, based on our findings, we hypothesize that\nthe mid-IR/radio relation can serve as a tool to distinguish between radio\ntransients caused by TDEs and those originating from intrinsic AGN variability."}
{"id": "2510.01785", "categories": ["astro-ph.IM", "cs.MS"], "pdf": "https://arxiv.org/pdf/2510.01785", "abs": "https://arxiv.org/abs/2510.01785", "authors": ["Xiaopo Cheng", "Akshay Subramaniam", "Shixun Wu", "Noah Brenowitz"], "title": "cuHPX: GPU-Accelerated Differentiable Spherical Harmonic Transforms on HEALPix Grids", "comment": null, "summary": "HEALPix (Hierarchical Equal Area isoLatitude Pixelization) is a widely\nadopted spherical grid system in astrophysics, cosmology, and Earth sciences.\nIts equal-area, iso-latitude structure makes it particularly well-suited for\nlarge-scale data analysis on the sphere. However, implementing high-performance\nspherical harmonic transforms (SHTs) on HEALPix grids remains challenging due\nto irregular pixel geometry, latitude-dependent alignments, and the demands for\nhigh-resolution transforms at scale. In this work, we present cuHPX, an\noptimized CUDA library that provides functionality for spherical harmonic\nanalysis and related utilities on HEALPix grids. Beyond delivering substantial\nperformance improvements, cuHPX ensures high numerical accuracy, analytic\ngradients for integration with deep learning frameworks, out-of-core\nmemory-efficient optimization, and flexible regridding between HEALPix,\nequiangular, and other common spherical grid formats. Through evaluation, we\nshow that cuHPX achieves rapid spectral convergence and delivers over 20 times\nspeedup compared to existing libraries, while maintaining numerical\nconsistency. By combining accuracy, scalability, and differentiability, cuHPX\nenables a broad range of applications in climate science, astrophysics, and\nmachine learning, effectively bridging optimized GPU kernels with scientific\nworkflows."}
{"id": "2510.01872", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.01872", "abs": "https://arxiv.org/abs/2510.01872", "authors": ["R. Moradi", "Y. Wang", "F. Rastegarnia", "E. S. Yorgancioglu", "Shu-Xu Yi", "B. Eslam Panah", "S. N. Zhang"], "title": "Constraining the Neutron-Star Equation of State via Short Gamma-Ray Burst X-ray Afterglows", "comment": "Accepted for publication in The Astrophysical Journal (ApJ)", "summary": "Recent observations from NICER in X-rays and LIGO/Virgo in gravitational\nwaves have provided critical constraints on the mass, radius, and tidal\ndeformability of neutron stars, imposing stringent limits on the equation of\nstate (EOS) and the behavior of ultra-dense matter. However, several key\nparameters influencing the EOS, such as the maximum mass of neutron stars,\nspin-down rates, and the potential role of exotic matter in their cores, remain\nsubject of ongoing debate. Here we present a new approach to constraining the\nEOS by analyzing the X-ray afterglows of some short gamma-ray bursts, focusing\non \"the internal plateau\" phase and its abrupt decay, which reflect the\nspin-down and possible collapse of a supra-massive neutron star into a black\nhole. By linking critical neutron star masses with black hole formation\ncriteria and the observational data from Swift's BAT and XRT instruments with\ncompact object models, we explore three representative EOSs that range from\n\"soft\" to \"stiff\". Our result supports a maximum mass for neutron stars of\napproximately 2.39 solar masses at the threshold of black hole formation. This\nconclusion holds under assumptions of magnetar-powered X-ray plateaus, constant\nradiative efficiency, isotropic emission, and full Kerr black hole energy\nextraction; deviations could influence the inferred results. Our results\ndemonstrate the critical role of neutron star/black hole physics in probing\ndense nuclear matter and provide a novel framework for exploring extreme\nastrophysical environments."}
{"id": "2510.01882", "categories": ["astro-ph.IM", "physics.ins-det"], "pdf": "https://arxiv.org/pdf/2510.01882", "abs": "https://arxiv.org/abs/2510.01882", "authors": ["Victor Rollano", "Martino Calvo", "Alejandro Pascual Laguna", "David Rodriguez", "Maria Teresa Magaz", "Beatriz Aja", "Luisa de la Fuente", "Daniel Granados", "Alessandro Monfardini", "Alicia Gomez"], "title": "Cross-Polarization Reduction in Kinetic Inductance Detectors Based on Quasi-Lumped Resonators", "comment": null, "summary": "Kinetic Inductance Detectors (KIDs) have emerged as a leading technology for\nmillimeter- and submillimeter-wave astronomy due to their high sensitivity,\nnatural multiplexing capabilities and scalable fabrication. In\npolarization-sensitive applications-such as Cosmic Microwave Background (CMB)\nstudies-cross-polarization, or unintended response to the orthogonal\npolarization, poses a significant limitation to measurement fidelity. This work\ninvestigates the origin of cross-polarization in meandered Lumped Element KIDs\n(LEKIDs), with particular emphasis on the role of parasitic currents in the\ninterdigitated capacitor. A comparative study between conventional LEKIDs and a\nquasi-lumped resonator design is presented, demonstrating that removing the\ncapacitive element may improve cross-polarization discrimination, confirming\nthe capacitor's contribution to polarization leakage."}
{"id": "2510.02079", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.02079", "abs": "https://arxiv.org/abs/2510.02079", "authors": ["Giovanni Stel", "Gabriele Ponti", "Nathalie Degenaar", "Lara Sidoli", "Sandro Mereghetti", "Kaya Mori", "Tong Bao", "Giulia Illiano", "Samaresh Mondal", "Mark Reynolds", "Chichuan Jin", "Tianying Lian", "Shifra Mandel", "Simone Scaringi", "Shuo Zhang", "Grace Sanger-Johnson", "Rudy Wijnands", "Jon M. Miller", "Jamie Kennea", "Zhenlin Zhu"], "title": "The Very Faint X-ray Transient 4XMM J174610.7-290020 at the Galactic center", "comment": "11 pages, 9 figures. Recently submitted to A&A", "summary": "Very Faint X-ray Transients (VFXTs) are a class of X-ray binary systems that\nexhibit occasional outbursts with peak X-ray luminosities (L_X< 1e36 erg s^-1)\nmuch lower than typical X-ray transients. On 22nd February 2024, during its\ndaily Galactic center monitoring, Swift-XRT detected a VFXT, 7 arcmin from Sgr\nA* dubbing it Swift J174610--290018. We aim to characterize the outburst that\noccurred in 2024, and a second, distinct outburst in 2025, to understand the\nnature and accretion flow properties of this new VFXT. Swift-XRT light curves\nare used to constrain the duration of the two events. We carried out X-ray\nspectral analysis exploiting XMM and NuSTAR data. We used Chandra and XMM\nobservations of the last 25 years to constrain the quiescent luminosity of the\nsource. During the 2024 outburst, which lasted about 50 days, the source\nreached a luminosity in the 2-10 keV band of L_X = 1.2e35 erg s^-1 (assuming it\nis located at the Galactic center). The 2025 outburst is shorter (about 5\ndays), and reached L_X = 9e34 erg s^-1. The spectral features of the source\ninclude an excess at 6.5-7 keV, which can be associated either with a single\nreflection line or with the ionized Fe XXV and XXVI lines. The same source was\nidentified in both the XMM and Chandra catalogs of point sources (known as 4XMM\nJ174610.7--290020). During previous detections, the source displayed luminosity\nlevels ranging from L_X= 2e32 to L_X = 3e34 erg s^-1 between 2000 and 2010.\nMoreover, it exhibited a potential type I X-ray burst in 2004. The analysis of\nthe outbursts and the potential type I burst strongly suggests the neutron star\nlow mass X-ray binary (NS-LMXB) nature of the VFXT. The source can be described\nby an accretion disk corona (as has been recently proposed by the XRISM/Xtend\nanalysis). This scenario explains the overall low luminosity of this transient\nand the peculiar iron lines in the spectrum."}
{"id": "2510.02016", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2510.02016", "abs": "https://arxiv.org/abs/2510.02016", "authors": ["Merlin Kole", "Nicolas de Angelis", "Jiang He", "Hongbang Liu", "Jianchao Sun", "Fei Xie", "Jimmy Zaid"], "title": "Design and Scientific Prospects of the POLAR-2 Mission", "comment": "Submitted for Publication to Innovations in Space Research Technology", "summary": "The POLAR-2 mission consists of 3 instruments designed with the combined aim\nof producing a deeper understanding of Gamma-Ray Bursts. To achieve this,\nPOLAR-2 relies on polarisation measurements and, for the first time will\nprovide these using 2 separate polarimeter detectors. The first of these is a\npayload optimised to perform Compton polarimetry measurements in the 40-1000\nkeV energy range using a combination of plastic scintillators and SiPMs. The\ndevelopment of this payload, the design of which is based on lessons learned\nfrom the POLAR mission, included optimization of plastic scintillator design.\nIn addition, its development included detailed characterization, space\nqualification and radiation damage and mitigation strategies for the large\nnumber of silicon photo-multipliers included in the design. We will present\nthese along with an overview of the readout electronics. These electronics were\ndeveloped with flexibility in mind, as well as low cost and low power\nconsumption. As such, its design is of interest beyond this polarimeter and is\nalso used on the spectrometer instrument of POLAR-2 where it is used to read\nout an array of GAGG:Ce scintillators. This readout, in combination with a\ncoded mask, allows this secondary instrument to provide detailed spectral and\nlocalization measurements. The final instrument used in the mission aims to use\ngas-based detectors to perform polarization measurements in the keV energy\nregion. The novelty of this design is that it will be optimized to use these\nfor wide field of view observations. The combination of the three instruments\nwill allow to perform detailed spectral, localization and polarization\nmeasurements of these transient phenomena together for the first time. Here we\nprovide an overview of the technologies employed in the mission along with\ndetailed predictions on its capabilities after its launch currently foreseen in\n2027."}
{"id": "2510.02132", "categories": ["astro-ph.HE", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2510.02132", "abs": "https://arxiv.org/abs/2510.02132", "authors": ["Elvira Cruz-Cruz", "Christopher S. Kochanek"], "title": "The Progenitor of the S147 Supernova Remnant", "comment": "13 pages, 13 figures, submitted to ApJ October 1st, 2025", "summary": "The supernova remnant (SNR) S147 contains the pulsar PSR J0538+2817 and a\nlikely unbound binary companion, HD 37424. It is the only good Galactic\ncandidate for a binary unbound by a core-collapse supernova (SN). Using Gaia\nDR3 parallaxes and photometry, we select the stars local to SNR S147 in a\ncylinder with a projected radius of $100$ pc and a parallax range of $0.614 <\n\\varpi < 0.787$ mas (a length of $\\simeq 360$ pc). We individually model the\nmost luminous of these stars. The two most luminous single stars are the\nunbound binary companion, HD 37424, and HD 37367, with estimated masses of\n$(13.51\\pm0.05) M_{\\odot}$ and $(14.30\\pm0.09) M_{\\odot}$, respectively. The\ntwo most luminous binary systems are the spectroscopic binary HD 37366 and the\neclipsing binary ET Tau that have primary masses of $(20.9\\pm0.12) M_{\\odot}$\nand $(16.7\\pm0.09) M_{\\odot}$, respectively. We model the Gaia color-magnitude\ndiagram (CMD) of this local stellar population using both single stars and a\nmodel consisting of noninteracting binaries using Solar metallicity PARSEC\nisochrones. For both models, the estimated age distributions of the $439$\n$M_{G} < 0$ mag stars favor a high mass progenitor of\n$21.5M_{\\odot}-41.1M_{\\odot}$ for the SN."}
{"id": "2510.02203", "categories": ["astro-ph.HE", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2510.02203", "abs": "https://arxiv.org/abs/2510.02203", "authors": ["Nikki Yat Ning Wang", "Dmitry Shishkin", "Noam Soker"], "title": "Jittering jets in stripped-envelope core-collapse supernovae", "comment": "It will be submitted in two days to allow for comments (including\n  missing references)", "summary": "Using the one-dimensional stellar evolution code MESA, we find that all our\nmodels in the initial mass range of 12-40 Mo, regardless of whether they have\nhydrogen-rich, hydrogen-stripped, or helium+hydrogen-stripped envelopes, have\nat least one significant strong convective zone in the inner core, which can\nfacilitate the jittering-jets explosion mechanism (JJEM). We focus on\nstripped-envelope CCSN progenitors that earlier studies of the JJEM did not\nstudy, and examine the angular momentum parameter j=rVconv, where r is the\nradius of the layer and Vconv is the convective velocity according to the\nmixing length theory. In all models, there is at least one prominent convective\nzone with j>2e15 cm^2/s inside the mass coordinate that is the maximum baryonic\nmass of a neutron star (NS), m=2.65 Mo. According to the JJEM, convection in\nthese zones seeds instabilities above the newly born NS, leading to the\nformation of intermittent accretion disks that launch pairs of jittering jets,\nwhich in turn explode the star. Our finding is encouraging for the JJEM,\nalthough it does not show that the intermittent accretion disks indeed form. We\nstrengthen the claim that, according to the JJEM, there are no failed CCSNe and\nthat all massive stars explode. In demonstrating the robust convection in the\ninner core of stripped-envelope CCSN progenitors, we add to the establishment\nof the JJEM as the primary explosion mechanism of CCSNe."}
{"id": "2510.02233", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.02233", "abs": "https://arxiv.org/abs/2510.02233", "authors": ["K. I. Perez", "E. V. Gotthelf", "J. P. Halpern"], "title": "Noisy Timing Behavior is a Feature of Central Compact Object Pulsars", "comment": "14 pages, 6 figures, submitted to ApJ", "summary": "We present a timing study of the three known central compact object (CCO)\npulsars, isolated cooling neutron stars in supernova remnants, using Chandra,\nXMM-Newton and NICER observations spanning two decades. Relative to canonical\nyoung pulsars, CCOs are spinning down at a very slow rate $|\\dot f| <10^{-15}$\ns$^{-2}$, implying a surface dipole magnetic field strength $B_s < 10^{11}$ G\nthat is too weak to account for their X-ray emitting hot spots. Two CCO pulsars\nwith sufficiently long monitoring, 1E 1207.4$-$5209 and PSR J0821$-$4300, are\nseen to deviate from steady spin-down; their timing residuals can be modeled by\none or more glitches in $f$ and $\\dot f$, or alternatively by extreme timing\nnoise. For the third CCO pulsar, PSR J1852+0400, the sparse temporal coverage\nwas insufficient to detect such effects. Glitch activity and timing noise in\nlarge samples of rotation-powered pulsars correlate best with $\\dot f$, while\nthe timing irregularities of the first two CCOs are extreme compared to pulsars\nof the same $\\dot f$. Nevertheless, timing activity in CCOs may arise from\nproperties that they share with other young but more energetic pulsars: high\ninternal temperature, strong buried magnetic field and superfluid behavior.\nAlternatively, continuing low-level accretion of supernova debris is not ruled\nout as a source of timing noise in CCOs."}
{"id": "2510.02301", "categories": ["astro-ph.HE", "astro-ph.GA", "physics.plasm-ph"], "pdf": "https://arxiv.org/pdf/2510.02301", "abs": "https://arxiv.org/abs/2510.02301", "authors": ["Andrew G. Sullivan", "Roger D. Blandford", "Anna Synani", "Philipe V. de la Parra", "Noémie Globus", "Mitchell C. Begelman", "Anthony C. S. Readhead"], "title": "Relativistic Jets and Winds in Radio-Identified Supermassive Black Hole Binary Candidates", "comment": "13 pages, 8 figures, submitted to ApJ", "summary": "Supermassive black hole binary systems (SMBHBs) are thought to emit the\nrecently discovered nHz gravitational wave background; however, not a single\nindividual nHz source has been confirmed to date. Long-term radio-monitoring at\nthe Owens Valley Radio Observatory has revealed two potential SMBHB candidates:\nblazars PKS 2131-021 and PKS J0805-0111. These sources show periodic flux\ndensity variations across the electromagnetic spectrum, signaling the presence\nof a good clock. To explain the emission, we propose a generalizable jet model,\nwhere a mildly relativistic wind creates an outward-moving helical channel,\nalong which the ultra-relativistic jet propagates. The observed flux variation\nfrom the jet is mostly due to aberration. The emission at lower frequency\narises at larger radius and its variation is consequently delayed, as observed.\nOur model reproduces the main observable features of both sources and can be\napplied to other sources as they are discovered. We make predictions for radio\npolarization, direct imaging, and emission line variation, which can be tested\nwith forthcoming observations. Our results motivate future numerical\nsimulations of jetted SMBHB systems and have implications for the fueling,\nstructure, and evolution of blazar jets."}
{"id": "2510.01317", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.01317", "abs": "https://arxiv.org/abs/2510.01317", "authors": ["Levi Schult", "Polina Petrov", "Stephen R. Taylor", "Nihan Pol", "Nima Laal", "Maria Charisi", "Chung-Pei Ma"], "title": "Expectations for the first supermassive black-hole binary resolved by PTAs I: Model efficacy", "comment": "25 pages, 6 figures, 3 tables. Submitted to Physical Review D", "summary": "One of the most promising targets for Pulsar Timing Arrays (PTAs) is\nidentifying an individual supermassive black hole binary (SMBHB) out of the\npopulation of binaries theorized to produce a gravitational wave background\n(GWB). In this work, we emulate an evolving PTA dataset, complete with an\nincreasing number of pulsars and timing baseline, into which we inject a single\nbinary on top of a Gaussian GWB signal. We vary the binary's source parameters,\nincluding sky position and frequency, and create an ensemble of simulated\ndatasets with which we assess current Bayesian binary search techniques. We\napply two waveform-based template models and a frequency-resolved anisotropy\nsearch to these simulations to understand how they compare in their detection\nand characterization abilities. We find that a template-based search including\nthe full gravitational-wave signal structure (i.e., both Earth and pulsar\neffects of an incident GW) returns the highest Bayes Factors (BF), exceeding\nour estimator's capabilities by (S/N)~9-19, and has the most robust parameter\nestimation. Our anisotropy model attains a realization-median BF>10 at\n7<(S/N)<15. Interestingly, despite being a deterministic model, the Earth-term\ntemplate struggles to detect and characterize low-frequency binaries (5 nHz).\nThese binaries require higher (S/N)~16-19 to reach the same BF threshold. This\nis likely due to neglected confusion effects between the pulsar and Earth\nterms. By contrast, the frequency-resolved anisotropy model shows promise for\nparameter estimation despite treating a binary's GW signal as excess\ndirectional GW power without phase modeling. Sky location and frequency\nparameter constraints returned by the anisotropy model are only surpassed by\nthe Earth term template model at (S/N)~12-13. Milestones for a first detection\nusing the full-signal GW model are included in a companion paper (Petrov et al.\n2025)."}
