{"id": "2512.06066", "categories": ["astro-ph.HE", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2512.06066", "abs": "https://arxiv.org/abs/2512.06066", "authors": ["John D. Monnier", "Yinuo Han", "Michael F. Corcoran", "Sanne Bloot", "Joseph R. Callingham", "William Danchi", "Philip G. Edwards", "Lincoln Greenhill", "Kenji Hamaguchi", "Matthew J. Hankins", "Ryan Lau", "Jon M. Miller", "Anthony F. J. Moffat", "Garreth Ruane", "Christopher M. P. Russell", "Anthony Soulain", "Samaporn Tinyanont", "Peter Tuthill", "Jason J. Wang", "Peredur M. Williams"], "title": "Revealing the accelerating wind in the inner region of the colliding-wind binary WR 112", "comment": "28 pages; 12 figures; 6 tables; Accepted Astronomical Journal (AJ)", "summary": "Colliding winds in massive binaries generate X-ray-bright shocks, synchrotron radio emission, and sometimes even dusty \"pinwheel\" spirals. We report the first X-ray detections of the dusty WC+O binary system WR 112 from Chandra and Swift, alongside 27 years of VLA/ATCA radio monitoring and new diffraction-limited Keck images. Because we view the nearly circular orbit almost edge-on, the colliding-wind zone alternates between heavy Wolf-Rayet wind self-absorption and a near-transparent O-star wind foreground each 20-yr orbit, producing phase-locked radio and X-ray variability. This scenario leads to a prediction that the radio spectral index is flatter from a larger non-thermal contribution around the radio intensity maximum, which is indeed observed. Existing models that assume a single dust-expansion speed fail to reproduce the combined infrared geometry and radio light curve. Instead, we require an accelerating post-shock flow that climbs from near-stationary to ~1350 km/s in about one orbital cycle, naturally matching the infrared spiral from about 5\" down to within 0.1\", while also fitting the phase of the radio brightening. These kinematic constraints supply critical boundary conditions for future hydrodynamic simulations, which can link hot-plasma cooling, non-thermal radio emission, X-ray spectra, and dust formation in a self-consistent framework. WR 112 thus joins WR 140, WR 104, and WR 70-16 (Apep) as a benchmark system for testing colliding-wind physics under an increasingly diverse range of orbital architectures and physical conditions."}
{"id": "2512.06077", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2512.06077", "abs": "https://arxiv.org/abs/2512.06077", "authors": ["M. Laurenti", "F. Tombesi", "P. Condò", "M. Gaspari", "F. Nicastro", "E. Torresi", "A. Luminari", "E. Piconcelli", "L. Zappacosta", "K. Fukumura", "G. Lanzuisi", "R. Serafinelli", "M. Dadina", "M. Cappi", "R. Middei", "F. Arevalo Gonzalez", "F. Di Salvo"], "title": "A Song of Lines and Winds: Tracing the Signatures of AGN Outflows in X-rays", "comment": "12 pages, 9 figures, 1 table, Accepted for publication in Astronomy and Astrophysics", "summary": "Ultra-fast outflows (UFOs) are highly ionized, mildly relativistic winds seen in the X-ray spectra of active galactic nuclei (AGN) and are thought to contribute to AGN feedback and galaxy evolution. We investigate UFO signatures by analyzing a broad collection of published detections. Our final sample comprises 122 robust (> 2$σ$) UFO detections in 57 AGN, spanning wide ranges in redshift, luminosity, black hole mass, and Eddington ratio. By combining phenomenological and photoionization modeling of the absorption features, we characterize empirical correlations among UFO properties. We find that line width, equivalent width, and outflow velocity are positively correlated, indicating that the broadest and strongest absorption lines trace the fastest winds, although the $\\upsilon_\\mathrm{out} - σ$ trend is comparatively weak. The large inferred velocity dispersions, often exceeding the uncertainty on the centroid velocity, must be included when estimating wind energetics and scaling relations. From the velocity constraints we derive lower limits on the launching radii, finding a minimum distance consistent with the innermost stable circular orbit of a weakly or non-rotating Schwarzschild black hole. We also assess for the first time how UFO properties depend on AGN class: differences between Seyferts and quasars, bridged by narrow-line Seyfert 1 galaxies, appear to be driven mainly by black hole mass and luminosity. The observed co-variation of velocity, width, and equivalent width supports a picture of clumpy, multi-component winds propagating through a thermally unstable multiphase medium within the chaotic cold accretion (CCA) cycle, and is consistent with both magnetically and line-driven acceleration. High-resolution X-ray spectroscopy with missions such as XRISM and NewAthena will be crucial to resolve the structure, kinematics, and physical origin of these flows."}
{"id": "2512.06316", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2512.06316", "abs": "https://arxiv.org/abs/2512.06316", "authors": ["N. Mankatwit", "P. Thongkonsing", "S. Loekkesee", "P. Chainakun", "W. Luangtip", "S. Sanpa-arsa"], "title": "Revealing Hidden Repeaters in the CHIME/FRB Catalog: Semi-Supervised Insights into the Fast Radio Burst Population", "comment": "16 pages, 9 figures, 4 tables, accepted (2025 December 5) by MNRAS", "summary": "Fast radio bursts (FRBs) are millisecond-duration extragalactic transients, observationally classified as repeaters or nonrepeaters. This classification may be biased, as some apparently non-repeating sources could simply have undetected subsequent bursts. To address this, we develop a semi-supervised learning framework to identify distinguishing features of repeaters using primary observational parameters from the Blinkverse database, which draws from the CHIME/FRB Catalogs. The framework combines labeled data (known repeaters and confidently classified non-repeaters) with unlabeled sources previously flagged as non-repeaters but exhibiting repeater-like characteristics. We employ uniform manifold approximation and projection with a nearest-neighbor scheme to select potential candidates, followed by semi-supervised classification using five base estimators, including random forest, support vector machine, logistic regression, AdaBoost, and Gradient boost. Each model is fine-tuned through cross-validation, and a voting strategy among the five models is employed to enhance robustness. All models achieve consistently high performance, identifying dispersion measure, peak frequency, and fluence as the most discriminative features. Repeaters tend to show lower dispersion measures, higher peak frequencies, and higher fluences than non-repeaters. We also identify a set of candidate repeaters, several of which are consistent with prior independent studies. Our approach can identify 36 additional repeater candidates that conventional methods may have missed. Finally, the results highlight dispersion measure as a key discriminator between repeaters and non-repeaters, revealing a tension between physical and instrumental origins-either environmental effects, if the two populations arise from distinct progenitors, or detection bias, as nearby sources are more easily observed."}
{"id": "2512.06394", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.06394", "abs": "https://arxiv.org/abs/2512.06394", "authors": ["M. Xu", "J. Li", "C. F. Xiao", "H. H. Qiu"], "title": "Rebrightenings of gamma-ray burst afterglows from an increasing magnetic inclination angle of a nascent magnetar", "comment": "7 pages, 3 figures, 1 table, A&A, in press", "summary": "A nascent magnetar, accompanying a gamma-ray burst (GRB) explosion, releases enormous rotational energy via magnetic dipole radiation. The energy loss rate of the magnetar is determined by the strength of the magnetic field at the pole. We investigated the effect of the magnetic inclination angle on the energy loss rate. The released energy is injected into the GRB jet and shapes the light curves of GRB afterglow. Different evolutionary approaches lead to different curves shapes.A shallow decay phase in GRB X-ray afterglow may result from energy injection from a magnetar with a fixed inclination angle. A two-plateau phase may result from a decreasing inclination angle scenario. In this study, we considered an increasing inclination angle scenario. The energy loss rate of the magnetar increases as the magnetic inclination angle grows. Our analysis reveals that as the lost rotational energy injected into the GRB jet increases, rebrightening phases occur in the GRB afterglows. The rebrightening features are slight and short-lived. The observed afterglow rebrightening of GRB 170822A and GRB 230414B can be well explained within our framework. Some GRB X-ray afterglows that exhibit slight and early rebrightenings may result from an increasing magnetic inclination angle of a nascent magnetar."}
{"id": "2512.05999", "categories": ["astro-ph.IM", "physics.flu-dyn"], "pdf": "https://arxiv.org/pdf/2512.05999", "abs": "https://arxiv.org/abs/2512.05999", "authors": ["Leonard Storcks", "Tobias Buck"], "title": "Solver-in-the-Loop Applications in Astrophysical (Magneto)hydrodynamics", "comment": null, "summary": "We present two promising applications of training machine learning models inside a differentiable astrophysical (magneto)hydrodynamics simulator. First, we address the problem of slow convergence in hydrodynamical simulations of wind-blown bubbles with radiative cooling. We demonstrate that a learned cooling function can recover high-resolution dynamics in low-resolution simulations. Secondly, we train a convolutional neural network to correct 2D magnetohydrodynamics simulations of a specific blast wave problem. These case studies pave the way for the principled application of more general machine learning models inside astrophysical simulators. The code is available open source under https://github.com/leo1200/eurips25corr."}
{"id": "2512.06503", "categories": ["astro-ph.HE", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2512.06503", "abs": "https://arxiv.org/abs/2512.06503", "authors": ["A. Phosrisom", "R. P. Breton", "C. J. Clark", "M. Burgay", "J. Strader", "L. Chomiuk", "K. V. Sokolovsky", "I. Molina", "R. Urquhart", "M. R. Kennedy", "S. J. Wagner", "V. S. Dhillon", "O. G. Dodge", "B. W. Stappers", "T. Thongmeearkom"], "title": "Optical Study of TRAPUM Pulsars and Modelling of the Redbacks: PSR J1036$-$4353 and PSR J1803$-$6707", "comment": "Accepted for publication in Monthly Notices of the Royal Astronomical Society. 19 pages, 10 figures", "summary": "The Transients and Pulsars with MeerKAT (TRAPUM) project discovered eight binary millisecond pulsars in its first shallow \\textit{L}-band survey of unidentified \\textit{Fermi} $γ$-ray sources using the MeerKAT radio telescope. We conducted follow-up observations using ULTRACAM on the New Technology Telescope at the La Silla Observatory to search for the optical counterpart to the pulsar companions. We found two redback companions, in PSRs J1803$-$6707 and J1036$-$4353, and provided upper limits for the other pulsar binaries. We used the \\texttt{Icarus} code to fit the redback's light curves using various irradiation models. The asymmetric double-peak light curves of PSR~J1036$-$4353 are best fit with diffusion and convection models. Comparing the two prescriptions of irradiation and gravity darkening, models with post-irradiation gravity darkening provide superior fits (particularly for lower gravity-darkening exponents), suggesting that the irradiation energy is deposited deep in the stellar photosphere. PSR~J1803$-$6707, on the other hand, displayed variability in the amplitude of its irradiation-dominated light curves over a time scale of a few months. This effect can be modelled only if the companion's filling, irradiation temperature, and convection coefficients are allowed to vary over time. Had the star been closer to filling its Roche lobe, like in the cases of the known transitional millisecond pulsars J1023+0038 and J1227$-$4853, this 4.1 per~cent variation in the volume-averaged filling of the star would have caused it to experience a state change to form an active accretion disc."}
{"id": "2512.06149", "categories": ["astro-ph.IM", "astro-ph.EP"], "pdf": "https://arxiv.org/pdf/2512.06149", "abs": "https://arxiv.org/abs/2512.06149", "authors": ["Corey Spohn", "Sarah Steiger", "Alex R. Howe"], "title": "yieldplotlib: A unified library for exoplanet yield code visualizations", "comment": "6 pages, 4 figures, submitted to the Journal of Open Source Software (JOSS)", "summary": "NASA's next flagship observatory, the Habitable Worlds Observatory (HWO), aims to detect and charaterize ~25 habitable zone planets. The total number of habitable zone planets detected is referred to as the exo-Earth \"yield'' and accurate yield estimates will be critically important to the mission's success. Tools like the Altruistic Yield Optimizer (AYO) and EXOSIMS provide these yield estimates but differ in language, methods, and outputs. yieldplotlib provides a unified library that can visualize the inputs and outputs of these yield codes in a complete, descriptive, and accessible way."}
{"id": "2512.06622", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2512.06622", "abs": "https://arxiv.org/abs/2512.06622", "authors": ["Xiurui Zhao", "Luca Comisso", "Stefano Marchesi", "Marco Ajello", "Elias Kammoun", "Yue Shen", "Qiaoya Wu"], "title": "Fast X-ray Variability from the Coronae of Supermassive Black Holes", "comment": "13 pages, 5 figures, 2 tables, accepted to ApJL", "summary": "We present the first systematic study of short-timescale X-ray variability in radio-quiet active galactic nuclei (AGN), utilizing archival Chandra observations of approximately 3,000 broad-line AGN selected from the SDSS and DESI spectroscopic surveys. We identify 14 AGN exhibiting rapid (on timescales of tens of kiloseconds) X-ray flux variations by factors of two or more that are statistically significant ($p\\le6\\times10^{-4}$), indicative of fast coronal variability. By converting minimum variability timescales to light-crossing times, we place upper limits on the sizes of the variable coronal regions, finding typical scales of $\\lesssim10^{-4}$~pc. The coronal variable region size upper limits of an AGN in our sample are found to be much smaller than the typical coronal sizes inferred from microlensing, suggesting that its corona is composed of localized, transient structures rather than smooth, homogeneous plasmas. Such efficient magnetic energy dissipation in compact volumes is consistent with expectations for magnetically dominated coronae and is supported by recent general relativistic magnetohydrodynamic simulations. Future high-throughput X-ray observatories will enable the detection of even faster coronal variability, providing direct constraints on the physical mechanisms driving plasma energization and flux fluctuation near supermassive black holes. Our results suggest that luminous AGN hosting massive black holes are prime targets for probing the small-scale structure and dynamics of AGN coronae."}
{"id": "2512.06254", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2512.06254", "abs": "https://arxiv.org/abs/2512.06254", "authors": ["X. Li", "K. Adamek", "M. Giles", "W. Armour"], "title": "FIP-TOI: Fast Imaging Pipeline for Pulsar Localisation with a Transient-Oriented Radio Astronomical Imager", "comment": null, "summary": "Rapid localisation of celestial transients like pulsars requires efficient short-timescale imaging. In radio astronomy, Fast Imaging Pipeline (FIP) addresses this need by reconstructing radio astronomical images and identifying candidates statistically. The FIP comprises imaging and localisation components but conventional radio astronomical imagers, optimised for longer integrations, limit its efficiency. To overcome this limitation, a Transient-Oriented Imager (TOI) is developed based on Singular Value Decomposition (SVD) and parallelised on NVIDIA GPUs using CUDA. Integrating the TOI with an advanced transient detector, FITrig, forms the FIP-TOI enabling real-time and high-precision localisation of pulsar candidates. For 4K x 4K-pixel images, FIP-TOI accelerates localisation by roughly tenfold compared to a pipeline using the standard imager WSClean. Testing on diverse datasets -- including fields with multiple pulsars, an on-and-off pulsar, and a pulsar exhibiting intensity changes -- FIP-TOI demonstrates robust performance across all scenarios."}
{"id": "2512.06803", "categories": ["astro-ph.HE", "gr-qc"], "pdf": "https://arxiv.org/pdf/2512.06803", "abs": "https://arxiv.org/abs/2512.06803", "authors": ["Fan Zhou", "Jiewei Huang", "Yuehang Li", "Zhenyu Zhang", "Yehui Hou", "Minyong Guo", "Bin Chen"], "title": "Non-thermal Synchrotron Emission and Polarization Signatures during Black Hole Flux Eruptions", "comment": "22 pages, 15 figures, 1 table", "summary": "In this work, we investigate synchrotron emission and the observational signatures of anisotropic non-thermal electrons during magnetic-flux eruptions in a magnetically arrested disk, using 3D GRMHD simulations. Non-thermal electrons are assumed to be energized from the thermal background through magnetic reconnection, with pitch-angle distributions modeled as beamed or loss-cone types, alongside an isotropic case for comparison. The results show that non-thermal emission can produce pronounced flux outbursts and localized brightening during eruptions, while the associated increase in optical depth can suppress the linear polarization fraction. Introducing pitch-angle anisotropy further reshapes the angular distribution of the intrinsic emissivity and modulates its contribution to various observable signatures. Our results demonstrate that anisotropic non-thermal electrons are essential for a physically complete interpretation of black hole image variability."}
{"id": "2512.07300", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2512.07300", "abs": "https://arxiv.org/abs/2512.07300", "authors": ["Kai-Yang Lin", "Chih-Yi Wen", "Homin Jiang", "Jen-Hung Wang", "Sujin Eie", "Shih-Hao Wang", "Yao-Huan Tseng", "Hsien-Chun Tseng", "Ue-Li Pen"], "title": "Back-End System of BURSTT", "comment": "submitted to PASP", "summary": "The Bustling Universe Radio Survey Telescope in Taiwan (BURSTT) is a new-generation wide-angle radio telescope specifically designed to survey Fast Radio Bursts (FRBs), energetic millisecond-duration pulses of unknown extragalactic origin. To realize its scientific potential, which includes detecting approximately 50 FRBs per year and sub-arcsecond localization capability, the system is designed to perform real-time beamforming and pulse search over the \\SI{60}{\\degree} $\\times$ \\SI{120}{\\degree} field of view. This paper provides a detailed account of the design, implementation, and performance validation of the BURSTT back-end System. The system employs an efficient multi-stage processing architecture: initial beamforming is executed on the Xilinx ZCU216 RF System-on-Chip (RFSoC) platform; data is then transferred to Intel Xeon servers, where AVX-512 and AMX instruction sets are utilized for the second stage of beamforming and channelization, achieving high computational efficiency to ensure real-time capability. A highly optimized \\texttt{bonsai} de-dispersion algorithm performs a real-time pulse search and triggering across 256 beams, which, upon detection, issues commands to the distributed outrigger system to save voltage data for very-long baseline interferometry (VLBI) precise localization. System performance has been validated through beamforming tests using bright radio sources and real-time detection of known pulsars, confirming the high fidelity of the signal processing pipeline."}
{"id": "2512.06972", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.06972", "abs": "https://arxiv.org/abs/2512.06972", "authors": ["V. D. Borisov", "I. A. Kudryashov"], "title": "Anisotropic Diffusion Modeling of Cosmic-Ray Lepton Propagation", "comment": "Submitted to Physical Review D", "summary": "We analyze DAMPE and H.E.S.S. measurements of the total cosmic-ray electron-positron spectrum, together with the AMS-02 positron fraction, using an anisotropic, spatially varying diffusion framework. The diffusion-tensor components are computed via numerical integration of test-particle trajectories in a prescribed Galactic magnetic-field model. We show that accounting simultaneously for the spatial dependence and anisotropy of the diffusion tensor yields an accurate description of the local electron and positron data up to TeV energies. The inferred injection spectral index, $Γ=-2.169$, is fully consistent with expectations from diffusive shock-acceleration theory. Within this framework, the observed spectral softening arises naturally from enhanced energy losses experienced by leptons propagating over larger distances along the regular magnetic field."}
{"id": "2512.07341", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2512.07341", "abs": "https://arxiv.org/abs/2512.07341", "authors": ["S. J. Tingay", "N. Hurley-Walker", "K. Ross", "T. J. Galvin", "J. Morgan", "B. Venville"], "title": "Limits on Unintended Radio Emission from Geostationary and Geosynchronous Satellites in the SKA-Low Frequency Range", "comment": "23 pages, accepted to PASA", "summary": "We search data from the GLEAM-X survey, obtained with the Murchison Widefield Array (MWA) in 2020, for the presence of radio frequency interference from distant Earth-orbiting satellites, in the form of unintended emissions similar to those recently seen from objects in Low Earth Orbits (LEO). Using the GLEAM-X Dec = 1.6 degree pointing, which is stationary in azimuth (on the local Meridian) and elevation (near the celestial Equator), the very wide field of view of the MWA maintains custody of a large number of satellites in geostationary and geosynchronous (GEO) orbits in this direction for long periods of time. We use one night of GLEAM-X data in the 72 - 231 MHz frequency range to form stacked images at the predicted coordinates of up to 162 such satellites, in order to search for unintended radio emission. In the majority of cases, we reach 4 sigma upper limits of better than 1 mW Equivalent Isotropic Radiated Power (EIRP) in a 30.72 MHz bandwidth (dual polarisation), with the best limits below 10 uW. No convincing evidence for unintended emissions at these detection thresholds was found. This study builds on recent work showing an increasing prevalence of unintended emissions from satellites in LEO. Any such emission from objects in GEO could be a significant contributor to radio frequency interference experienced by the low frequency Square Kilometre Array and warrants monitoring. The current study forms a baseline for comparisons to future monitoring."}
{"id": "2512.06975", "categories": ["astro-ph.HE", "astro-ph.SR", "hep-ph"], "pdf": "https://arxiv.org/pdf/2512.06975", "abs": "https://arxiv.org/abs/2512.06975", "authors": ["Daniele Fargion", "Omar Tibolla", "Pier Giorgio De Sanctis Lucentini", "Sara Turriziani", "Sarah Kaufmann", "Danila Sopin", "Maxim Yu. Khlopov"], "title": "Over-abundant gamma-like signals around Solar disk shadows by twin bent and smeared muon and electron pairs secondaries, versus rare local TeV gamma", "comment": "9 pages, 7 figures, ICRC 2025", "summary": "Cosmic rays with energies of tens of TeV and above, skimming the Sun, could fragment into pions. The resulting gamma photons and muons, as well as subsequent electron pairs, will reach us in the form of gamma or electromagnetic air-showers , gamma-like air-showers on Earth. Their multiple presence may soon be observed and disentangled by the LHAASO telescope array."}
{"id": "2512.06316", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2512.06316", "abs": "https://arxiv.org/abs/2512.06316", "authors": ["N. Mankatwit", "P. Thongkonsing", "S. Loekkesee", "P. Chainakun", "W. Luangtip", "S. Sanpa-arsa"], "title": "Revealing Hidden Repeaters in the CHIME/FRB Catalog: Semi-Supervised Insights into the Fast Radio Burst Population", "comment": "16 pages, 9 figures, 4 tables, accepted (2025 December 5) by MNRAS", "summary": "Fast radio bursts (FRBs) are millisecond-duration extragalactic transients, observationally classified as repeaters or nonrepeaters. This classification may be biased, as some apparently non-repeating sources could simply have undetected subsequent bursts. To address this, we develop a semi-supervised learning framework to identify distinguishing features of repeaters using primary observational parameters from the Blinkverse database, which draws from the CHIME/FRB Catalogs. The framework combines labeled data (known repeaters and confidently classified non-repeaters) with unlabeled sources previously flagged as non-repeaters but exhibiting repeater-like characteristics. We employ uniform manifold approximation and projection with a nearest-neighbor scheme to select potential candidates, followed by semi-supervised classification using five base estimators, including random forest, support vector machine, logistic regression, AdaBoost, and Gradient boost. Each model is fine-tuned through cross-validation, and a voting strategy among the five models is employed to enhance robustness. All models achieve consistently high performance, identifying dispersion measure, peak frequency, and fluence as the most discriminative features. Repeaters tend to show lower dispersion measures, higher peak frequencies, and higher fluences than non-repeaters. We also identify a set of candidate repeaters, several of which are consistent with prior independent studies. Our approach can identify 36 additional repeater candidates that conventional methods may have missed. Finally, the results highlight dispersion measure as a key discriminator between repeaters and non-repeaters, revealing a tension between physical and instrumental origins-either environmental effects, if the two populations arise from distinct progenitors, or detection bias, as nearby sources are more easily observed."}
{"id": "2512.07012", "categories": ["astro-ph.HE", "astro-ph.GA", "hep-ph"], "pdf": "https://arxiv.org/pdf/2512.07012", "abs": "https://arxiv.org/abs/2512.07012", "authors": ["Daniele Fargion", "Pier Giorgio De Sanctis Lucentini", "Sara Turriziani", "Danila Sopin", "Maxim Yu. Khlopov"], "title": "SS433 PeV neutron jet feeding the far TeV gamma beam", "comment": "8 pages, 2 figures", "summary": "The SS433 is a well-known binary system with an internal black hole, which is stripping mass from an orbiting companion of ten solar masses, at a hundred of light-seconds away. The black hole and its accretion disk fuel a thin precessing jet, whose spirals are well-observed. Surprisingly, disconnected gamma-ray tails have recently been discovered by H.E.S.S., HAWC and LHAASO, hundreds of light-years away and with energies of tens of TeV. We suggest that tens PeV neutron burst jets were ejected from the SS433 system over the past century. These beams of ultra high-energy PeVatron neutrons, by their in-flight beta decay and Inverse Compton scattering, could be the source of the enigmatic, distant and disconnected tens of TeV gamma-ray beams. These ultra-relativistic PeV neutron jets could have been formed during one of the system's rare and intense tidal eruptions, when tens of PeV protons collide CV October 2025 with thermal ultraviolet photons, creating delta resonances. Their decay into secondary neutron beams of tens of PeV is well consistent with observations. Alternative models appear uncompetitive."}
{"id": "2512.07042", "categories": ["astro-ph.HE", "astro-ph.CO", "hep-ex", "hep-ph"], "pdf": "https://arxiv.org/pdf/2512.07042", "abs": "https://arxiv.org/abs/2512.07042", "authors": ["D. Fargion"], "title": "Paucity of downward UHE neutrino tracks in IceCube versus unexpected huge KM3-230213A event: solving the puzzles?", "comment": "8 pages, 6 figures", "summary": "Recently the ARCA array detector published the down-ward-horizontal event: the KM3-230213A. It appeared as the most energetic neutrino ever observed: about 200 PeV (2 10^17 eV) up to EeV (10^18 eV) energy. This huge value, is puzzling. It is not statistically consistent with several upper bound derived by two greater and longer life detectors: by IceCube and in particular by AUGER array. Asymmetry in recent IceCube neutrino alert tracks upward and downward at same horizontal angles as ARCA one, suggest that they are mostly polluted atmospheric muon bundles. This paucity also disfavor the skimming neutrino interpretation by ARCA. We suggest that the array floating and bending in the deep sea may lead, sometime, to a misleading geometry that is pointing to a wrong arrival angle direction: a much less horizontal muon (neutrino) track respect to a much real one, more inclined and vertical, due to atmospheric muon bundle or charmed single event. Contrary to present argument, if such a rare event would be soon rediscovered in data or re-observed, it would open the road to a new guaranteed Tau neutrino Astronomy. At EeV energy such upward tau air-showers should shine AUGER telescopes or blaze future satellite in Space. A previous model in astrophysics considered energetic neutrino E>>100 EeV, neutrino scattering, onto cosmic, relic, light mass ones. Their ultra-relativistic Z boson resonance formation and its decay in flight would produce hadron UHECR relics around tens-hundred EeV energy. Explaining how sources located at far distances, above the usual GZK hundred Mpc, cut off ones, may shine and cluster in AUGER or TA data."}
{"id": "2512.07066", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.07066", "abs": "https://arxiv.org/abs/2512.07066", "authors": ["Bailey Sykes", "Bernhard Müller"], "title": "Trends in gravitational wave emission in axisymmetric simulations of rotating core-collapse supernovae", "comment": "21 pages, 16 figures, submitted to PRD", "summary": "The quantitative impact of strong rotation on the amplitudes and frequencies of the post-bounce gravitational wave (GW) signal from core-collapse supernovae (CCSNe) is still not fully understood. To study trends in frequencies and amplitudes, and possibly spectacular phenomena like resonant amplification, we perform a series of axisymmetric long-duration magnetohydrodynamic CCSN simulations of a 17 $M_\\odot$ progenitor using a finely spaced grid in initial rotation rate from 0.29 rad/s to 3.48 rad/s. We find that these rotating models produce GWs at frequencies of up to 3 kHz, higher than in typical non-rotating models in the literature. The high frequencies arise due to small polar radii of rapidly rotating proto-neutron stars and stabilization by angular momentum gradients at lower latitude. GW frequencies and amplitudes tend to decrease with faster rotation. Different from two complementary simulations without magnetic fields, the magnetohydrodynamic models are characterized by an absence of p-modes above the dominant high-frequency emission band. We find no indication of resonant mode amplification for any rotation rate, although a temporo-spatial and space-frequency analysis reveals some interesting couplings of quadrupolar motions across the proto-neutron star and the gain region. We find that linear mode analysis based on the spherically averaged structure becomes unsuitable in this regime of rapid rotation. More advanced perturbative techniques need to be developed to study the mode structure and mode interaction in the collapse of rapidly rotating massive stars."}
{"id": "2512.07105", "categories": ["astro-ph.HE", "hep-ph"], "pdf": "https://arxiv.org/pdf/2512.07105", "abs": "https://arxiv.org/abs/2512.07105", "authors": ["Hajime Sotani", "Ankit Kumar"], "title": "Universal relation involving fundamental modes in two-fluid dark matter admixed neutron stars", "comment": null, "summary": "We systematically investigate the fundamental oscillation frequencies of dark matter admixed neutron stars, focusing on models with self-interacting fermionic dark matter that couples to normal matter solely through gravity. The analysis is carried out within a two-fluid formalism under the relativistic Cowling approximation, where the perturbation equations follow from the linearized energy-momentum conservation laws of both components. We find that the mass-scaled fundamental frequencies of the nuclear (dark) fluid in dark core (halo) configurations exhibit a remarkably tight correlation with the total stellar compactness. This universality persists across the dark matter parameter space explored in this study and is largely insensitive to the choice of nuclear equation of state. In contrast, we also find the breakdown of such universality with the tidal deformability, i.e, the same frequencies show substantial deviations from universality when expressed in terms of the tidal deformability. These contrasting behaviors highlight possible observational imprints of dark matter in neutron star interiors."}
{"id": "2512.07140", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.07140", "abs": "https://arxiv.org/abs/2512.07140", "authors": ["F. Y. Wang", "H. T. Lan", "Z. Y. Zhao", "Q. Wu", "Y. Feng", "S. X. Yi", "Z. G. Dai", "K. S. Cheng"], "title": "Evidence of young magnetars in massive binary embedded in a supernova remnant as sources of active fast radio bursts", "comment": "15 pages, 6 figures, 1 table, submitted", "summary": "Fast radio bursts (FRBs) are intense pulses with unknown origins. A subclass of repeating FRBs show some common features, such as associated compact persistent radio sources (PRSs), high burst rates, and large host-galaxy dispersion measures (DMs). Meanwhile, they show diverse DM and rotation measure (RM) variations, which cannot be explained by current models. A unified model urgently needs to be established. Here we show the first evidence for a supernova remnant surrounding the FRB 20190520B source. We then demonstrate that the five active repeating FRB sources associated with PRSs can be understood within a single model in which central objects are young magnetars in massive binary systems embedded in supernova remnants. This model naturally predicts distinct variations of DM and RM for repeating FRBs. Crucially, young magnetar wind nebulae can generate bright PRSs. As a magnetar becomes older, the luminosity of a PRS will fade, which can naturally explain less-luminous PRSs for some active FRBs. Our results support a unified population of active FRBs in dynamic magnetized environments."}
{"id": "2512.07214", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.07214", "abs": "https://arxiv.org/abs/2512.07214", "authors": ["Hyesung Kang", "Dongsu Ryu", "Jeongbhin Seo"], "title": "Simulation Study of Binary Mergers of Galaxy Clusters I: Properties of Merger Shocks and Radio Emission", "comment": "25 pages, 12 figures, submitted to ApJ", "summary": "We investigate binary mergers of galaxy clusters and the resulting radio relics using three-dimensional simulations. The initial setup consists of two idealized, spherical subclusters with a mass ratio below three, each permeated by turbulent magnetic fields, and we follow their mergers with a high-order accurate magnetohydrodynamic (MHD) code. In parallel, we track the acceleration of cosmic-ray electrons (CRe) via diffusive shock acceleration (DSA) at merger-driven shocks, together with radiative cooling and Fermi-II (turbulent) acceleration in the postshock region, employing a high-order Fokker-Planck solver. Synchrotron emission is computed from the simulated CRe distribution and magnetic fields. In this paper, we detail these numerical approaches and present the first results obtained with them. Two prominent axial shocks emerge along the merger axis; the shock ahead of the heavier subcluster systematically attains a higher Mach number, although it is more compact, than that ahead of the lighter subcluster. Turbulent magnetic fields--both inherited from the initial condition and amplified during the merger--produce patchy, fine-scale structures in the radio surface brightness. Because of the combined effects of turbulent acceleration, spatially nonuniform magnetic fields, and the curved geometry of merger shocks, the volume-integrated radio spectra show deviations from the canonical power-law steepening expected for a planar shock with a uniform field. Reacceleration of preexisting fossil CRe enhances the surface brightness. Our results highlight the coupled roles of merger dynamics, MHD turbulence, and CRe physics in shaping up the observed properties of radio relics in cluster outskirts."}
{"id": "2512.07233", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.07233", "abs": "https://arxiv.org/abs/2512.07233", "authors": ["Hao Zhou", "Jia Ren", "Chen-Wei Wang", "Xing Liu", "Bin-Yang Liu", "Andrew J. Levan", "Jillian Rastinejad", "Jin-Jun Geng", "Hao Wang", "Peter K. Blanchard", "Wen-fai Fong", "Benjamin Gompertz", "Daniele B. Malesani", "Charles D. Kilpatrick", "Gavin P. Lamb", "Brian D. Metzger", "Matt Nicholl", "Nial R. Tanvir", "Yun Wang", "Yu Rong", "Run-Duo Liang", "Zhi-Xing Ling", "Dong Xu", "Zhi-Ping Jin", "Da-Ming Wei"], "title": "EP241217a: a likely Type II GRB with an achromatic bump at z = 4.59", "comment": "26 pages, 10 figures, 4 tables", "summary": "EP241217a is an X-ray transient detected by the Einstein Probe (EP) lasting for about 100 seconds and without accompanying $γ$-ray detection. The optical spectroscopy reveals the redshift of EP241217a is 4.59. By combining the $γ$-ray upper limit provided by GECAM-C, there is a considerable possibility that EP241217a is a typical Type II gamma-ray burst (GRB), but it is fainter than the detection threshold of any available $γ$-ray monitors (i.e., $E_{γ,{\\rm iso}}\\lesssim10^{53}$ erg). The X-ray light curve exhibits a plateau lasting for $\\sim5\\times10^4$ seconds. However, the joint analysis with optical data suggests the presence of an achromatic bump peaking at $\\sim3\\times10^4$ s after the trigger, indicating the actual duration of the X-ray plateau may be significantly shorter than it appears. To interpret the achromatic bump, we adopt the scenario of a mildly relativistic jet coasting in a wind-like medium and encountering a rapid density enhancement of the circumburst medium, which is likely induced by the the interaction of the progenitor's stellar wind and the interstellar medium. However, this model cannot fully explain observed data, and some issues do exist, e.g., the observed spectrum is harder than the model prediction. Consequently, we conclude that the scenario of a mildly relativistic jet coasting in the wind-like medium cannot explain all observed features of EP241217a. In addition, some alternative models commonly invoked to explain X-ray plateaus are discussed, but there are more or less issues when they are applied to EP241217a. Therefore, further theoretical modeling is encouraged to explore the origin of EP241217a."}
{"id": "2512.07239", "categories": ["astro-ph.HE", "astro-ph.EP", "astro-ph.GA", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2512.07239", "abs": "https://arxiv.org/abs/2512.07239", "authors": ["Jiro Shimoda", "Katsuaki Asano", "Shu-ichiro Inutsuka"], "title": "Interplay between Escaping Cosmic Rays and Interstellar Medium: Driving of Galactic Winds and Shaping the Local Proton Spectrum", "comment": "11 pages, 12 figures, submitted to ApJ", "summary": "We study the effects of escaping cosmic rays (CRs) on the interstellar medium (ISM) around their source with spherically symmetric CR-hydrodynamical simulations taking into account the evolution of the CR energy spectrum, radiative cooling, and thermal conduction. We show how the escaping CRs accelerate and heat the ISM fluid depending on the CR diffusion coefficient. The CR heating effects are potentially responsible for the recent observations of the unexpected H$α$ and [OIII]$λ$5007 lines in old supernova remnants. The implied gas outflow by CRs can be comparable to the Galactic star formation rate, compatible with the Galactic wind required for the metal-polluted halo gas and the production of eROSITA bubbles. Assuming a locally suppressed CR diffusion and a few nearby CR sources in the Local Bubble, we also propose alternative interpretations for the Galactic CR proton spectrum around the Earth measured with CALET, AMS02, and Voyager I."}
{"id": "2512.07290", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.07290", "abs": "https://arxiv.org/abs/2512.07290", "authors": ["Chao-Ming Li", "Ruo-Yu Liu", "Huirong Yan"], "title": "Diagnosing Interstellar Magnetic Turbulence with TeV Pulsar Halos", "comment": "9 pages, 6 figures", "summary": "Interstellar magnetic field is essential in various astrophysical phenomena and processes. Pulsar halos are a recently discovered class of TeV gamma-ray sources formed by escaping electrons/positrons from pulsars. The morphology of the halo is regulated by the diffusion of those escaping particles, and hence carries information of the interstellar magnetic field. We suggest that the morphology of TeV pulsar halos can be used as a novel probe of the properties of interstellar magnetic field around the pulsar, such as the Alfvénic Mach number and the mean direction. We establish a theoretical relation between these quantities and the observational features of the halo's morphology based on the anisotropic diffusion model, and show how X-ray observations of the pulsar halos can further improve the diagnosis of the magnetic field."}
{"id": "2512.07291", "categories": ["astro-ph.HE", "astro-ph.CO", "gr-qc", "hep-th"], "pdf": "https://arxiv.org/pdf/2512.07291", "abs": "https://arxiv.org/abs/2512.07291", "authors": ["Jitumani Kalita", "Debaprasad Maity"], "title": "Revisiting PBH Accretion, Evaporation and Their Cosmological Consequences", "comment": "35 pages, 14 figures", "summary": "Primordial black holes (PBHs) provide a unique probe of the early Universe. Their cosmological evolution is governed by the competition between mass accretion and Hawking evaporation. In this paper we look into the details impact of accretion. Most of the earlier analysis relied on non-relativistic accretion models. In this work, we reinvestigate this in a fully relativistic framework for Kerr PBHs in the radiation-dominated era. We derive relativistic accretion rate and compute spin-dependent efficiency $λ_{\\text{Kerr}}(a_*)$. Using this result, we construct coupled evolution equations for the PBH mass and spin that include both relativistic accretion and spin-dependent evaporation. Our analysis shows that relativistic accretion significantly increases PBH masses and consequently suppresses their spins, causing all PBHs to become effectively Schwarzschild well before evaporation. These effects strengthen the Big Bang Nucleosynthesis (BBN) bound on the initial PBH mass by a factor of $\\sim 4$--$5$, reduce the mass required for survival to the present epoch to $\\sim 2.7\\times 10^{14}\\,\\mathrm{g}$, and shift the viable particle like DM parameter space. Notably the early accretion induced spin-down effect further washes out the well known high-frequency, spin-induced feature in the high frequency stochastic gravitational-wave background, modifying predictions for future detectors."}
{"id": "2512.07466", "categories": ["astro-ph.HE", "gr-qc"], "pdf": "https://arxiv.org/pdf/2512.07466", "abs": "https://arxiv.org/abs/2512.07466", "authors": ["A. Karakonstantakis", "W. Kluźniak"], "title": "Surface temperature of an accretion disk around a wormhole Kerr-mimicker", "comment": "7 pages, 4 figures, submitted to A&A", "summary": "It has been suggested that spinning wormholes may mimic Kerr black holes in astronomical sources such as X-ray binaries and supermassive compact objects in centers of galaxies. With recent advances in instrumentation this could be tested if clear differences between wormhole and black hole accretion were identified. We aim to quantitatively determine the extent to which the orbital properties of test particles in the gravity of a spinning wormhole may differ from those of a Kerr black hole. We seek to find an observable related to disk accretion that would be clearly different for Kerr black holes and Kerr-like wormholes. We use the standard Lagrangian approach to derive the orbital properties of test particles from an effective potential. We use standard thin disk theory to infer the disk surface temperature. We find that at a given circumferential radius the physical quantities relating to circular orbits in the equatorial plane are exactly the same for the spinning wormhole and a black hole of the same mass and angular momentum, if only the two space-time metrics differ in the g_rr component alone. However, for a wormhole there are no orbits of radius less than that of its throat. Non-circular orbits, bound or unbound, are affected by the radial distance function; in particular, the angle of apsidal precession in Kerr-like wormholes will differ from that in Kerr black holes. A Kerr-like wormhole is a perfect black hole mimicker in relation to the orbital properties in the equatorial plane. The angular velocity, specific energy, specific angular momentum, and Lense-Thirring precession rate are the same for a Kerr black hole and a Kerr-like wormhole in circular orbits of the same circumference. We find that the area of the (geometrically thin) accretion disk is different, and this yields a visibly suppressed disk temperature for traversable wormholes with a sufficiently wide throat."}
{"id": "2512.07688", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.07688", "abs": "https://arxiv.org/abs/2512.07688", "authors": ["Mukesh Kumar Singh", "Ben G. Patterson", "Stephen Fairhurst"], "title": "Observability of eccentricity in a population of merging compact binaries", "comment": "17 pages, 5 figures", "summary": "We investigate the prospects of observing residual eccentricity in a population of compact binaries by calculating the power in the eccentric harmonics, following the methodology in arXiv:2411.04187. Although most observed compact binary coalescences are expected to circularize before entering the sensitivity band of the ground-based gravitational-wave (GW) detectors, dynamical interactions in dense star clusters can lead to a fraction of these binaries with non-negligible eccentricity at the time of detection. To quantify the observability of eccentricity, we simulate a population of merging compact binaries and identify those which have sufficient power in sub-dominant eccentric harmonics to be clearly distinguishable from quasi-circular systems. We consider a binary black hole (BBH) population derived from globular cluster simulations with residual eccentricity distribution obtained from Cluster Monte Carlo (CMC) catalogs as well as a fiducial log-uniform model. Assuming the LIGO-Virgo network of GW detectors with their sensitivities achieved during LIGO-Virgo-KAGRA (LVK) Observing Run (O4), we find that the BBH population with measurable eccentricity will have a significantly higher median eccentricity $e_{\\mathrm{10Hz}}\\sim 0.3$ (with $90\\%$ range: $0.1 - 0.5$) and signal-to-noise ratio (SNR) $\\sim 20$ ($90\\%$ range: $13 - 57$) compared to the observable population of BBHs. We compare our predictions of the regions of parameter space where eccentricity is detectable with the claimed observations of eccentricity in GW events from third Gravitational Wave Transient Catalog (GWTC-3)."}
{"id": "2512.07719", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.07719", "abs": "https://arxiv.org/abs/2512.07719", "authors": ["Xiao-Hong Zhao"], "title": "Multi-Wavelength Afterglows as Diagnostic Probes of Dense Circumburst Medium in GRBs", "comment": "15 pages, 6 figures, accepted for publication in ApJ", "summary": "Gamma-ray bursts (GRBs) are generally believed to occur in environments where the surrounding medium is either a uniform interstellar medium (ISM) or, in some cases, a dense stellar wind from a massive progenitor. Recently, GRB 191019A has been proposed to originate within the accretion disk of an active galactic nucleus (AGN), suggesting that some GRBs may occur in extremely dense environments, although this interpretation remains under debate. This scenario has drawn considerable attention, as AGN disks are promising sites that can host progenitors of both long and short GRBs, and whose dense, gas-rich environment could significantly influence jet propagation and afterglow emission. Yet, our theoretical understanding of the resulting afterglow signatures in such environments is limited, and further systematic exploration is required. In this study, we investigate how multi-wavelength afterglow light curves can be utilized as diagnostic tools to probe the nature of the circumburst environment. Our results show that in dense environments, GRB afterglows exhibit distinct frequency-dependent behaviors. For jets with large opening angles, the X-ray light curve displays a shallow decay or bump due to a transition from synchrotron to SSC dominance, while the optical and high-energy (GeV) light curves follow typical power-law decays. On the other hand, for small opening angles, the light curves exhibit wavelength-dependent jet breaks: the GeV and optical bands break simultaneously, while the X-ray break is delayed as the SSC component gradually compensates for the fading synchrotron component. These signatures provide potential diagnostics of GRBs occurring in dense media such as AGN disks."}
{"id": "2512.07731", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.07731", "abs": "https://arxiv.org/abs/2512.07731", "authors": ["H. Dereli-Bégué", "A. Pe'er", "D. Bégué", "F. Ryde", "A. Gowri"], "title": "X-ray Analysis of Gamma-Ray Burst Flares and Underlying Afterglows: Insights into Origin of Flares", "comment": "Submitted to ApJ", "summary": "Gamma-ray burst (GRB) X-ray light curves exhibit a variety of complex temporal structures, such as flares and plateaus. The origin of flares seen in many GRB early afterglows is still uncertain. Here, we analyze a sample of 89 GRBs, 61 of them with flares, both with and without a \"plateau\" phase. We fit the Swift-XRT light curves with synchrotron emission from a forward shock propagating into either a constant-density ISM or a stellar wind, and flares on top of that. We find that the flare light curves are not symmetric, with a decay time that is $\\sim$five times longer than the rise time. We do not find any differences in flare properties between GRBs with and without a \"plateau\" phase. Moreover, additional afterglow properties such as the electron power-law index and the end time of the plateau are consistent between bursts with and without flares. These results strongly indicate that flares originate from a mechanism distinct from that producing the plateau and afterglow. When looking at the prompt emission properties, we do find some tendencies: GRBs with flares tend to be brighter and longer lasting than GRBs without flares. We therefore conclude that, unlike plateaus, flares are unlikely to arise from an external origin and are more plausibly associated with prolonged central engine activity that lasts longer than the main episode that produces the prompt phase. As the plateau cannot have the same origin, this result excludes models of late-time energy injection as the source of the GRB plateau."}
{"id": "2512.07781", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.07781", "abs": "https://arxiv.org/abs/2512.07781", "authors": ["Leandro Abaroa", "Gustavo E. Romero", "Valentí Bosch-Ramon"], "title": "Microquasar remnants as hidden PeVatrons", "comment": "Accepted as Letter in Astronomy and Astrophysics. 4 pages + appendix", "summary": "The Large High Altitude Air Shower Observatory (LHAASO) has revealed numerous ultrahigh-energy gamma-ray sources of unknown origin. We propose that a fraction of them can be explained by microquasar remnants, i.e., binary systems where mass transfer has ceased and the central engine is quenched. Cosmic rays injected during the active phase of a microquasar may remain confined within its cocoon and subsequently interact with nearby molecular clouds, producing bright gamma-ray emission through $pp$ collisions. Remnants of former super-Eddington systems can act as dark PeVatrons, releasing particles up to $\\sim$10 PeV that illuminate surrounding clouds producing gamma rays reaching hundreds of TeV. This scenario provides a natural explanation for several unidentified Galactic LHAASO sources."}
