{"id": "2510.16108", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.16108", "abs": "https://arxiv.org/abs/2510.16108", "authors": ["Annarita Ierardi", "Gor Oganesyan", "Stefano Ascenzi", "Marica Branchesi", "Biswajit Banerjee", "Samuele Ronchini"], "title": "Early X-ray emission of short Gamma-Ray Bursts: insights into physics and multi-messenger prospects", "comment": "Submitted to A&A", "summary": "Early X-ray emission of Gamma-Ray Bursts (GRBs) traces the transition between\nthe prompt emission and the afterglow radiation, and its rapid flux decline is\noften interpreted as the tail of the prompt emission. As such, it can offer\ninsights into the emission mechanisms active during the prompt emission and the\nphysics of GRB jets. In this work, we focus on merger-driven GRBs, which are\nsources of gravitational waves (GWs) detectable by ground-based\ninterferometers, such as LIGO, Virgo, and KAGRA. We present a systematic\nanalysis of the early X-ray emission ($t < 10^3 \\ \\mathrm{s}$) of a sample of\n16 merger-driven GRB candidates detected by the Neil Gehrels Swift Observatory\n(hereafter, Swift). We performed a time-resolved spectral analysis of soft and\nhard X-ray data (0.3-150 keV) by fitting two curved spectral models to the\nspectra: a physical synchrotron model and an empirical smoothly broken power\nlaw model. We characterized the evolution of the peak energy and bolometric\nflux, and derived the intrinsic properties of the 10 bursts with measured\nredshift. We discovered a tight correlation between the rest-frame peak energy\nof the spectra and the isotropic-equivalent luminosity. Specifically, we\nobtained $\\nu_{c,z} \\propto L_{\\rm iso}^{(0.64 \\pm 0.03)}$ when adopting the\nsynchrotron model, and $E_{p,z} \\propto L_{\\rm iso}^{(0.58 \\pm 0.04)}$ when\nadopting the smoothly broken power law. Both relations were extrapolated to the\ntypical prompt emission energies and well describe the properties of short GRBs\ndetected in the MeV gamma-rays. These results suggest a common origin for the\nprompt and steep-decay emissions in merger-driven GRBs, and rule out\nhigh-latitude emission as the dominant process shaping the early X-ray tails.\nFinally, we assessed the detectability of these sources with the Wide-field\nX-ray Telescope onboard the Einstein Probe mission."}
{"id": "2510.16109", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.16109", "abs": "https://arxiv.org/abs/2510.16109", "authors": ["Ioannis Liodakis", "Sudip Chakraborty", "Frédéric Marin", "Steven R. Ehlert", "Thibault Barnouin", "Pouya M. Kouch", "Kari Nilsson", "Elina Lindfors", "Tapio Pursimo", "Georgios F. Paraschos", "Riccardo Middei", "Anna Trindade Falcão", "Svetlana Jorstad", "Iván Agudo", "Yuri Y. Kovalev", "Jacob J. Casey", "Laura Di Gesu", "Philip Kaaret", "Dawoon E. Kim", "Fabian Kislat", "Ajay Ratheesh", "M. Lynne Saade", "Francesco Tombesi", "Alan Marscher", "Francisco José Aceituno", "Giacomo Bonnoli", "Víctor Casanova", "Gabriel Emery", "Juan Escudero Pedrosa", "Daniel Morcuende", "Jorge Otero-Santos", "Alfredo Sota", "Vilppu Piirola", "Rumen Bachev", "Anton Strigachev", "George A. Borman", "Tatiana S. Grishina", "Vladimir A. Hagen-Thorn", "Evgenia N. Kopatskaya", "Elena G. Larionova", "Daria A. Morozova", "Sergey S. Savchenko", "Ekaterina V. Shishkina", "Ivan S. Troitskiy", "Yulia V. Troitskaya", "Andrey A. Vasilyev", "Alexey V. Zhovtan", "Ioannis Myserlis", "Mark Gurwell", "Garrett Keating", "Ramprasad Rao", "Sincheol Kang", "Sang-Sung Lee", "Sanghyun Kim", "Whee Yeon Cheong", "Hyeon-Woo Jeong", "Chanwoo Song", "Shan Li", "Myeong-Seok Nam", "Diego Álvarez-Ortega", "Carolina Casadio", "Emmanouil Angelakis", "Alexander Kraus", "Jenni Jormanainen", "Vandad Fallah Ramazani", "Chien-Ting Chen", "Enrico Costa", "Eugene Churazov", "Riccardo Ferrazzoli", "Giorgio Galanti", "Ildar Khabibulin", "Stephen L. O'Dell", "Luigi Pacciani", "Marco Roncadelli", "Oliver J. Roberts", "Paolo Soffitta", "Douglas A. Swartz", "Fabrizio Tavecchio", "Martin C. Weisskopf", "Irina Zhuravleva"], "title": "Detection of Compton scattering in the jet of 3C 84", "comment": "21 pages, 13 figure, 1 Table, accepted for publication in APJL", "summary": "3C 84 is the brightest cluster galaxy in the Perseus Cluster. It is among the\nclosest radio-loud active galaxies and among the very few that can be detected\nfrom low frequency radio up to TeV $\\gamma$-rays. Here we report on the first\nX-ray polarization observation of 3C~84 with the Imaging X-ray Polarimetry\nExplorer, for a total of 2.2 Msec that coincides with a flare in $\\gamma$-rays.\nThis is the longest observation for a radio-loud active galaxy that allowed us\nto reach unprecedented sensitivity, leading to the detection of an X-ray\npolarization degree of $\\rm\\Pi_X=4.2\\pm1.3\\%$ ($\\sim3.2\\sigma$ confidence) at\nan X-ray electric vector polarization angle of $\\rm\n\\psi_X=163^{\\circ}\\pm9^{\\circ}$, that is aligned with the radio jet direction\non the sky. Optical polarization observations show fast variability about the\njet axis as well. Our results strongly favor models in which X-rays are\nproduced by Compton scattering from relativistic electrons -- specifically\nSynchrotron Self-Compton -- that takes places downstream, away from the\nsupermassive black hole."}
{"id": "2510.16121", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.16121", "abs": "https://arxiv.org/abs/2510.16121", "authors": ["Prasiddha Arunachalam", "Phillip Macias", "Ryan. J. Foley"], "title": "GRB 230307A Formed No Dust or Was Not a Binary Neutron Star Merger", "comment": "13 pages, 4 figures, 5 Tables", "summary": "We present a new analysis of the JWST infrared spectra of GRB 230307A (AT\n2023vfi), a long gamma-ray burst (GRB) with an infrared excess and spectral\nlines suggestive of significant heavy $r$-process production. The spectra,\ntaken 29 and 61~days after the GRB trigger, have blackbody-like continua with\n$T_{\\rm eff} \\approx 550$ K and an emission line near $2.1$ $\\mu$m, previously\nattributed to [Te III]. This line identification has been used as evidence for\nan $r$-process-powered kilonova (KN), despite no KN model producing a\nblackbody-like spectrum at late times. Such an infrared continuum could be\nemitted by newly formed dust, and we model the thermal emission to infer dust\nproperties, including composition and mass. We find that the emission requires\nat least 3--$6 \\times 10^{-3}$~M$_{\\odot}$ of carbon or silicate dust, which is\ninconsistent with $r$-process yields expected from a neutron star merger.\nAlternatively, the continuum could be from $2\\times 10^{-3}$~M$_{\\odot}$ of\nmetallic iron dust, which is mildly consistent (at 3$\\sigma$) with KN models,\nbut such dust is unlikely to form in the expanding ejecta. GRB 230307A's low\nlate-time luminosity also constrains the amount of radioactive $^{56}$Ni\nproduced to $<2.6 \\times 10^{-3}$~M$_{\\odot}$ (3$\\sigma$). No KN model can\nsimultaneously form the necessary dust for the infrared continuum and heavy\nelements for the [Te III] line. We conclude that the blackbody continuum is not\ndue to dust emission, or GRB 230307A did not originate from a binary\ncompact-object merger."}
{"id": "2510.16124", "categories": ["astro-ph.HE", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2510.16124", "abs": "https://arxiv.org/abs/2510.16124", "authors": ["M. C. Baglio", "K. Alabarta", "D. M. Russell", "N. Masetti", "M. M. Messa", "T. Muñoz Darias", "F. M. Vincentelli", "S. K. Rout", "P. Saikia", "A. Gabuya", "V. Chavushyan", "T. Al Qaissieh", "A. Palado"], "title": "Tracking optical variability and outflows across the accretion states of the black hole transient MAXI J1820+070", "comment": "Accepted for publication in A&A", "summary": "We present a study of the minute-timescale optical variability and\nspectroscopic outflow signatures in the black hole X-ray binary MAXI J1820+070\nduring its 2018 outburst and re-brightenings. Minute-cadence, multi-filter\noptical light curves were obtained with the Las Cumbres Observatory network and\nthe Al Sadeem Observatory (UAE) over 2018-2020, complemented by X-ray data from\nSwift/BAT, XRT, and MAXI. We also acquired contemporaneous low-resolution\noptical spectra with the 2.1 m OAN San Pedro Martir and OAGH Cananea telescopes\n(Mexico) and the 1.5 m G.D. Cassini telescope at Loiano (Italy). The optical\nfractional rms peaks in the hard state and is dominated by short-timescale\nflickering that strengthens toward longer wavelengths, suggesting that the\nvariability is jet-driven. In this scenario, inflow fluctuations inject\nvelocity perturbations at the jet base (internal shock model). The variability\nis quenched in the soft state, with any residual signal likely linked to\naccretion-flow fluctuations. This behaviour supports the accretion-ejection\ncoupling in black hole binaries and shows that the jet's variability signature\nextends to optical wavelengths in all hard states. In the faintest hard states,\nresidual optical variability may instead trace cyclo-synchrotron emission from\nthe hot flow. The spectra show double-peaked emission lines and tentative\ncold-wind signatures during the hard state. Such winds were reported during the\nmain 2018 outburst; here we find evidence of their presence also in later\nre-brightenings. Their absence in the soft state likely reflects stronger disc\nionisation from the higher X-ray flux, suppressing low-ionisation optical\nfeatures."}
{"id": "2510.16164", "categories": ["astro-ph.HE", "astro-ph.EP"], "pdf": "https://arxiv.org/pdf/2510.16164", "abs": "https://arxiv.org/abs/2510.16164", "authors": ["Jackson D. Taylor", "Emmanuel Fonseca", "Lankeswar Dey", "Sergey Zharikov", "Aida Kirichenko", "Joseph Glaser", "Gabriella Agazie", "Akash Anumarlapudi", "Anne M. Archibald", "Zaven Arzoumanian", "Paul T. Baker", "Paul R. Brook", "H. Thankful Cromartie", "Kathryn Crowter", "Megan E. DeCesar", "Paul B. Demorest", "Timothy Dolch", "Elizabeth C. Ferrara", "William Fiore", "Gabriel E. Freedman", "Nate Garver-Daniels", "Peter A. Gentile", "Deborah C. Good", "Jeffrey S. Hazboun", "Ross J. Jennings", "Megan L. Jones", "David L. Kaplan", "Matthew Kerr", "Michael T. Lam", "Duncan R. Lorimer", "Jing Luo", "Ryan S. Lynch", "Alexander McEwen", "Maura A. McLaughlin", "Natasha McMann", "Bradley W. Meyers", "Cherry Ng", "David J. Nice", "Timothy T. Pennucci", "Benetge B. P. Perera", "Nihan S. Pol", "Henri A. Radovan", "Scott M. Ransom", "Paul S. Ray", "Ann Schmiedekamp", "Carl Schmiedekamp", "Brent J. Shapiro-Albert", "Ingrid H. Stairs", "Kevin Stovall", "Abhimanyu Susobhanan", "Joseph K. Swiggum", "Haley M. Wahl"], "title": "Searching for Exotrojans in Pulsar Binary Systems", "comment": "18 pages, 5 figures, 2 tables; submitted to ApJ", "summary": "Trojan asteroids are found in the equilateral triangle Lagrange points of the\nSun-Jupiter system in great number, though they also exist less prolifically in\nother Sun-planet systems. Despite up to planetary mass Trojans being predicted\nin extrasolar systems (i.e. exotrojans), they remain largely unconfirmed,\nthough with recent strong candidate evidence emerging. We turn the current\nsearch for exotrojans to radio pulsars with low-mass companions\n($\\sim0.01\\,\\rm{M}_\\odot$) using accurately measured pulse times of arrival.\nWith techniques developed for detecting the reflex motion of a star due to a\nlibrating Trojan, we place reasonable mass constraints ($\\sim\n1\\,\\rm{M}_\\oplus$) on potential exotrojans around binary pulsars observed in\nthe NANOGrav 15-year data set. We find weak evidence consistent with\n$\\sim1\\,\\rm{M}_{\\rm J}$ exotrojans in the PSR~J0023+0923 and PSR~J1705$-$1903\nsystems, though the signals likely have a different, unknown source. We also\nplace a libration-independent upper mass constraint of $\\sim8$\\,M$_{\\rm J}$ on\nexotrojans in the PSR~1641+8049 binary system by looking for an inconsistency\nbetween the times of superior conjunction as measured by optical light curves\nand those predicted by radio timing."}
{"id": "2510.16030", "categories": ["astro-ph.IM", "astro-ph.EP"], "pdf": "https://arxiv.org/pdf/2510.16030", "abs": "https://arxiv.org/abs/2510.16030", "authors": ["Keidai Iiyama", "Grace Gao"], "title": "Trade-off Analysis for Lunar Augmented Navigation Service (LANS) Constellation Design", "comment": "Submitted to the NAVIGATION: Journal of the Institute of Navigation", "summary": "The establishment of a sustainable human presence on the Moon demands robust\npositioning, navigation, and timing (PNT) services capable of supporting both\nsurface and orbital operations. This paper presents a comprehensive trade-off\nanalysis of lunar frozen-orbit constellations for the Lunar Augmented\nNavigation Service (LANS), focusing on how the number of satellites and orbital\nparameters influence coverage, position dilution of precision (PDOP), orbit\ndetermination accuracy, receiver noise, and orbit insertion cost. Three\nWalker-constellation families based on frozen elliptical and circular orbits\nare examined to characterize their relative advantages across different\nsemi-major axes and inclinations. Results show that larger semi-major axes\nenhance both polar and global coverage, though the optimal inclination depends\non the constellation type and target service region. The south elliptical lunar\nfrozen orbit (ELFO) Walker constellation provides superior performance for\npolar coverage and PDOP, whereas the circular lunar frozen orbit (CLFO) Walker\nconfiguration achieves the best global uniformity. Orbit determination errors\nand receiver noise both increase with larger semi-major axes and higher\ninclinations, reflecting weaker geometric observability and reduced received\nsignal power at apolune for eccentric orbits. Orbit insertion analysis reveals\nclear trade-offs among transfer duration, characteristic energy ($C_3$) at\ntrans-lunar injection, and insertion $\\Delta V$: shorter transfers require\nhigher insertion $\\Delta V$, while low-energy transfers achieve smaller $\\Delta\nV$ at the cost of months-long durations and higher $C_3$. These findings\nprovide a systematic framework for designing LANS constellations for both\nregional and global coverage."}
{"id": "2510.16170", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.16170", "abs": "https://arxiv.org/abs/2510.16170", "authors": ["Paolo Lipari"], "title": "Charged pion chain decay and the cosmic ray positron flux", "comment": "11 pages 6 figures", "summary": "The study of the cosmic ray positron flux has attracted intense attention in\nrecent years, especially because the observations suggest that it could receive\ncontributions from sources such as pulsars or the self--annihilation or decay\nof dark matter particles. The main known source of relativistic positrons, that\nform the background to possible additional contributions, is the chain decay of\n$\\pi^+$ produced in the inelastic interactions of cosmic rays with interstellar\nand circumstellar gas. The shape of the energy spectrum of positrons produced\nin these pion decays can be calculated exactly and is well known. However,\nsurprisingly, some estimates of the contribution of the standard mechanism to\nthe positron flux have adopted an incorrect spectral shape of the positron\nproduced in these decays, following an error present in a 1997 paper of\nMoskalenko and Strong. In this work we report this error, discuss its origin,\nand estimate its impact on the numerical results."}
{"id": "2510.16110", "categories": ["astro-ph.IM", "astro-ph.CO"], "pdf": "https://arxiv.org/pdf/2510.16110", "abs": "https://arxiv.org/abs/2510.16110", "authors": ["Kaili Cao"], "title": "Linear Image Regridding and Coaddition with Oversampled Point Spread Functions: Lessons from 1D", "comment": "22 pages, 11 figures, submitted to ApJL", "summary": "Image regridding and coaddition have a wide range of applications in\nastronomical observations. {\\sc Imcom}, an algorithm that provides control over\npoint spread function (PSF) and noise in coadded images, has been found to meet\nthe stringent requirements of weak gravitational lensing cosmology with the\nforthcoming Nancy Grace Roman Space Telescope. In this work, I introduce a new\nalgorithm, Fast {\\sc Imcom}, which outperforms traditional {\\sc Imcom} in terms\nof both efficiency and quality. After explaining the underlying philosophy and\nmathematical formalism, I conduct systematic comparisons between {\\sc Imcom}\nand Fast {\\sc Imcom} in terms of PSF reconstruction in 1D. While a 2D\nimplementation is beyond the scope of this paper, I demonstrate how to\ngeneralize Fast {\\sc Imcom} to 2D and discuss practical issues involved. This\nnew algorithm has the potential of reducing both the computational costs and\nstorage requirements (current estimates are $\\sim 100\\,{\\rm M}$ core hours and\n$\\sim 1.5 \\,{\\rm PB}$, respectively) of the Roman High Latitude Imaging Survey\n(HLIS) by an order of magnitude. Meanwhile, it provides implications for the\ndithering patterns of Roman surveys. I also address potential applications of\nFast {\\sc Imcom} beyond the Roman HLIS, with focus on other weak lensing\nprograms and Roman time domain surveys; the actual range of use cases is likely\nbeyond what is discussed here."}
{"id": "2510.16239", "categories": ["astro-ph.HE", "astro-ph.SR", "gr-qc", "nucl-th"], "pdf": "https://arxiv.org/pdf/2510.16239", "abs": "https://arxiv.org/abs/2510.16239", "authors": ["Stefanos Tsiopelas", "Armen Sedrakian", "Micaela Oertel"], "title": "Rapidly rotating hot nuclear and hypernuclear compact stars: integral parameters and universal relations", "comment": "18 pages, 13 figures", "summary": "In this work, we investigate hot, isentropic compact stars in the limiting\ncases of static and maximally rotating configurations, focusing on how\nvariations in the symmetry energy of the equation of state derived from\ncovariant density functional theory affect stellar properties. We consider both\nnucleonic and hyperonic matter with systematically varied symmetry energy\nslopes, fixed entropies per baryon $s / k_B=1$ and 3, and electron fractions\n$Y_e=0.1$ and $Y_e=0.4$, representative of conditions in binary neutron star\nmergers and proto-neutron stars. We compute and analyze mass--radius and\nmoment--of--inertia--mass relations, as well as the dependence of the Keplerian\n(mass-shedding) frequency on mass, angular momentum, and the ratio of kinetic\nto gravitational energy. Furthermore, we show that several universal relations\nbetween global properties remain valid across both nucleonic and hyperonic\nequations of state with varying symmetry energy, both in the static and\nKeplerian limit, and for various combinations of the fixed entropy and electron\nfraction."}
{"id": "2510.16169", "categories": ["astro-ph.IM", "physics.ed-ph"], "pdf": "https://arxiv.org/pdf/2510.16169", "abs": "https://arxiv.org/abs/2510.16169", "authors": ["Valerie A. Rapson", "Alex Pietrow", "Robert J. Cumming", "Jill Burns", "Ali Cotton", "Yashashree Jadhav", "Maria D. Kazachenko", "Casper A. L. Pietrow", "Livia M. A. Pietrow", "Dennis Schatz", "Elliot Severn", "Sundar Srinivasan", "William Thornburgh", "Andrea Warkentin", "Hayley Yasui"], "title": "Why every solar eclipse viewing event needs a disco ball", "comment": "22 pages, 8 figures, to be published in CAPJournal Volume 19 Issue 2", "summary": "Solar eclipses offer unparalleled opportunities for public engagement in\nastronomy. Large groups of people often gather to view eclipses, and these\nevents require affordable and easy to use tools to safely observe the Sun. One\nunique way to observe a solar eclipse is by using a disco ball. Here, we\npresent an analysis of the experiences of educators who used a disco ball as a\nsolar projector during various public outreach events. Through a survey\nconducted shortly after the April 2024 total solar eclipse and the March 2025\npartial solar eclipse, we collected data on the use, engagement, and perceived\neducational value of a disco ball projector from 31 individual events. The\nresults suggest that disco balls were not only affordable and safe, but also\npopular and educational."}
{"id": "2510.16249", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.16249", "abs": "https://arxiv.org/abs/2510.16249", "authors": ["Mojegan Azadi", "Belinda Wilkes", "Joanna Kuraszkiewicz", "Steven. P. Willner", "Matthew L. N. Ashby"], "title": "Accretion and Jet Coupling in Powerful Radio Quasars at Cosmic Noon", "comment": null, "summary": "We present bolometric corrections, as a function of wavelength, for powerful\nradio-loud quasars from the Revised Third Cambridge Catalogue of Radio Galaxies\n(3CRR) at 1 < z < 2. The bolometric luminosities are derived by integrating the\nintrinsic accretion disk spectral energy distributions (SEDs) over the range\n1{\\mu}m-10keV (excluding reprocessed infrared emission) and integrating over\ninclination angles (to account for accretion disk emission anisotropy). We use\naccretion disk models, fitted to observed data, to self-consistently bridge the\nunobserved wavelength region between the UV and X-rays with no need for far-UV\ngap repair. The resulting bolometric corrections span a wide range (~1-400)\nacross different wavelengths, showing minimal dependence on redshift, X-ray\nluminosity, and black hole mass, which is possibly due to a narrow range of\nthese intrinsic AGN parameters in the sample. However, when the sample is\ndivided by Eddington ratio, the X-ray bolometric corrections exhibit distinctly\ndifferent values, with higher correction factors corresponding to higher\nEddington ratios. We also examine the connection between total radio luminosity\nand accretion disk power. For most 3CRR sources, the radio power constitutes\nroughly 1%-10% of the accretion disk luminosity. However, quasars with compact\njets exhibit higher radio luminosities for a given accretion disk power. This\nsuggests a higher efficiency of conversion of accretion power to radio\nluminosity in the younger jets. Our results provide physically motivated\nbolometric corrections for powerful radio quasars that are applicable to\npowerful radio-loud quasars at any epoch."}
{"id": "2510.16600", "categories": ["astro-ph.IM", "astro-ph.EP", "physics.ins-det"], "pdf": "https://arxiv.org/pdf/2510.16600", "abs": "https://arxiv.org/abs/2510.16600", "authors": ["Oketa Basha", "Tracee Lynn Jamison-Hooks", "Philip Mauskopf", "Lynn Miles", "Sanetra Newman-Bailey", "Abarna Karthikeyan", "Mohammad Samad", "Mariya Taylor", "Sarah E. Kay", "Sean Bryan", "Devika Band", "Thomas Essinger-Hileman", "Sumit Dahal", "Adrian Sinclair", "Caleb Distel"], "title": "Readout of Microwave Kinetic Inductance Detector (MKID) Arrays for Habitable Worlds Observatory Using a Polyphase Filterbank Algorithm", "comment": "6 pages, 11 figures, This work appears in the proceedings of Low\n  Temperature Detectors (LTD) Conference", "summary": "The Habitable Worlds Observatory (HWO), a nextgeneration\nultraviolet/optical/infrared space telescope, will require detector\ntechnologies capable of supporting substantially larger pixel-count arrays than\nthose flown on previous missions. Microwave Kinetic Inductance Detectors\n(MKIDs) provide a scalable solution through microwave multiplexing and have\nalready been demonstrated in balloon-borne instruments using Field-Programmable\nGate Arrays (FPGAs) for real-time signal processing. A central element of MKID\nreadout is the Polyphase Filter Bank (PFB) spectrometer, which converts\ndigitized timedomain signals into finely resolved frequency channels for\nsubsequent analysis. To meet the demands for broader bandwidths and higher\nspectral resolution driven by emerging science goals, efficient FPGA-based\nimplementations of the PFB are essential. This work presents current results\nfrom a fixed-point digital design methodology for deploying the PFB\narchitecture on spacequalified FPGAs. The approach emphasizes efficient\nresource utilization and numerical precision while satisfying stringent\nperformance constraints, enabling scalable, high-resolution spectral processing\nfor future space observatories and remote sensing applications."}
{"id": "2510.16265", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.16265", "abs": "https://arxiv.org/abs/2510.16265", "authors": ["T. Rashidi", "V. Anari", "O. Powles", "G. C. MacLeod", "Y. Tanabe", "Y. Yonekura", "F. Rajabi"], "title": "A Unified Maxwell-Bloch Framework for Multi-periodic 6.7 GHz Methanol Flaring in G9.62+0.20E", "comment": "9 pages, 5 figures", "summary": "We analyze a decade of 6.7 GHz methanol monitoring data in G9.62+0.20E,\nconfirming the known periodicities of p1 = 241.3 +/- 2.3 d and p2 = 52.5 +/-\n0.3 d, and identifying three new cycles at p3 = 127.0 +/- 1.6 d, p4 = 163.9 +/-\n2.9 d, and p5 = 204.1 +/- 1.5 d. The 241.3-d and 204.1-d periods occur in\nmultiple velocity channels, while the others are confined to single components.\nDespite their diverse morphologies and timescales, all flares can be reproduced\nwithin a unified Maxwell-Bloch framework operating in the fast-transient\nsuperradiance regime, driven by narrow periodic pump excitations. Model fits\nyield consistent environmental parameters across periodicities (temperatures,\ncollisional timescales), pointing to broadly uniform physical conditions in the\nmasing region. The discovery of new periodicities and their unified\nMaxwell-Bloch modeling provide a consistent picture of multi-periodic flaring\nin G9.62+0.20E and support superradiance as a general framework for maser\nflaring."}
{"id": "2510.16758", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2510.16758", "abs": "https://arxiv.org/abs/2510.16758", "authors": ["Nicoletta Sanvitale", "Claudio Gheller", "Franco Vazza", "Federica Govoni", "Matteo Murgia", "Valentina Vacca"], "title": "Estimating Flux Densities of Diffuse Cosmological Radio Sources Exploiting Vision Transformers", "comment": "4 pages, 4 figures, accepted for publication in the International\n  Astronomical Union Proceedings Series", "summary": "We present TUNA, a Vision-Transformer based network adapted from segmentation\nto flux regression for faint, diffuse radio emission. Trained on LOFAR-like\nmock observations derived from cosmological simulations, TUNA accurately\nreconstructs low surface-brightness structures, with only mild smoothing and\nsmall brightness-dependent biases. Applied to LOFAR data of the A399 - A401\ngalaxy cluster system, it recovers the ridge not identifiable in the high\nresolution observation and matches the low resolution tapered map. These\nresults indicate how TUNA can deliver automated, quantitative surface\nbrightness estimates for diffuse extragalactic sources, enabling scalable\nanalyses for upcoming surveys."}
{"id": "2510.16307", "categories": ["astro-ph.HE", "astro-ph.GA", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2510.16307", "abs": "https://arxiv.org/abs/2510.16307", "authors": ["Paul Disberg", "Anne Lankreijer", "Martyna Chruślińska", "Andrew J. Levan", "Gijs Nelemans", "Nial R. Tanvir", "Charlotte R. Angus", "Ilya Mandel"], "title": "The metallicity dependence of long-duration gamma-ray bursts", "comment": "Accepted for publication in A&A, 19 pages, 12 figures", "summary": "Both theoretical models and observations of collapsar created gamma-ray\nbursts -- typically long-duration gamma-ray bursts (LGRBs) -- suggest that\nthese transients cannot occur at high metallicity, likely due to angular\nmomentum losses via stellar winds for potential progenitor stars. However, the\nprecise metallicity threshold (if it is a hard threshold) above which the\nformation of LGRBs is suppressed is still a topic of discussion. We\ninvestigated observed LGRBs and the properties of their host galaxies to\nconstrain this metallicity dependence. In order to compute LGRB rates we\nmodelled the cosmic history of star formation, as a function of host galaxy\nmetallicity and stellar mass, and added a LGRB efficiency function that can\ninclude various shapes including abrupt cutoffs and more gradual variations in\nthe GRB yield with metallicity. In contrast to previous work, this model\nincludes scatters in the relations between mass, metallicity, and star\nformation rate, as well as a scatter in the metallicity distribution inside\ngalaxies. We then varied both the threshold value and shape, and compared it to\nobserved LGRBs and the properties of their host galaxies. In our model a sharp\ncutoff at an oxygen abundance $Z_{\\text{O/H}}=12+\\log(\\text{O/H})=8.6\\pm0.1$\n(corresponding to $\\sim0.6Z_{\\odot}$) provides the best explanation for the\nobserved LGRB data. In contrast, a lower threshold proposed in literature (i.e.\nat $Z_{\\text{O/H}}=8.3$ or $\\sim0.3Z_{\\odot}$) fits observations poorly. We\ntherefore conclude that, in contrast to most theoretical LGRB models, a\nrelatively high metallicity threshold at near-solar values provides the best\nmatch between our model and observed LGRBs."}
{"id": "2510.16845", "categories": ["astro-ph.IM", "physics.ao-ph"], "pdf": "https://arxiv.org/pdf/2510.16845", "abs": "https://arxiv.org/abs/2510.16845", "authors": ["Elena Masciadria", "Alessio Turchia", "Camilo Weinbergera", "Marlene De Sepibusa", "Luca Finia"], "title": "Optical turbulence forecast for ground-based astronomy and free-space optical communication", "comment": "Invited Talk - 9 figures, 2 tables, SPIE Optics & Photonics, 3-7\n  August 2025, San Diego, Laser Communication and Propagation through the\n  atmosphere and Oceans XIV joint session with Unconventional imaging, sensing\n  and Adaptive Optics", "summary": "Forecasting optical turbulence in the Earth's atmosphere has been an\nambitious challenge for the astronomical scientific community for several\ndecades. While earlier research primarily focused on whether it was possible to\npredict optical turbulence and its vertical distribution, current efforts are\nmore concentrated on the accuracy achievable at different timescales, the\nefficiency of various forecasting methods and the contributions of new\nstatistical approaches, such as auto-regression and machine learning to this\nfield. In this contribution, I will present the state of the art of the\nresearch conducted by our group, positioned within the international research\nscenery. Most of our past activity has been primarily focused on ground-based\nastronomy but recent advancements in space research opened new opportunities\nfor applications in the free-space optical communication."}
{"id": "2510.16338", "categories": ["astro-ph.HE", "astro-ph.IM", "gr-qc", "hep-ph"], "pdf": "https://arxiv.org/pdf/2510.16338", "abs": "https://arxiv.org/abs/2510.16338", "authors": ["Wan-Peng Sun", "Yong-Kun Zhang", "Ji-Guo Zhang", "Xiaohui Liu", "Yichao Li", "Fu-Wen Zhang", "Wan-Ting Hou", "Jing-Fei Zhang", "Xin Zhang"], "title": "A Practical Framework for Estimating the Repetition Likelihood of Fast Radio Bursts from Spectral Morphology", "comment": "15 pages, 4 figures", "summary": "The repeating behavior of fast radio bursts (FRBs) is regarded as a key clue\nto understanding their physical origin, yet reliably distinguishing repeaters\nfrom apparent non-repeaters with current observations remains challenging. Here\nwe propose a physically interpretable and practically quantifiable\nclassification framework based on spectral morphology. Using dimensionality\nreduction, clustering, and feature-importance analysis, we identify the\nspectral running $r$ and spectral index $\\gamma$ as the most critical\nparameters for distinguishing repeaters from apparent non-repeaters in the\nCHIME/FRB sample. In the $\\gamma$-$r$ space, repeaters preferentially occupy\nregions with steeper, narrower-band spectra, whereas non-repeaters cluster in\nflatter, broader-band regions, resulting in a clear density separation. We\nfurther construct an empirical probability map in the $\\gamma$-$r$ space,\nshowing a clear gradient of repetition likelihood, from $\\sim 65\\%$ in the\nhigh-repetition region to $\\sim 5\\%$ in the low-repetition region. Combining\nthis with Gaussian Mixture Model posterior analysis, we identify several\napparent non-repeaters with high inferred repetition probability, recommending\nthem as priority targets for future monitoring. This framework provides a\nsimple and generalizable tool for assessing repeatability in the CHIME/FRB\nsample and highlights the diagnostic power of spectral morphology in unveiling\nFRB origins."}
{"id": "2510.16955", "categories": ["astro-ph.IM", "astro-ph.CO", "gr-qc", "physics.data-an"], "pdf": "https://arxiv.org/pdf/2510.16955", "abs": "https://arxiv.org/abs/2510.16955", "authors": ["Josiel Mendonça Soares de Souza", "Miguel Quartin"], "title": "On the use of the Derivative Approximation for Likelihoods for Gravitational Wave Inference", "comment": "26 pages, 14 figures", "summary": "Posterior inference on the more than a dozen parameters governing a\ngravitational wave (GW) event is challenging. A typical MCMC analysis can take\naround $100$ CPU hours, and next generation GW observatories will detect many\nthousands of events. Here we present a thorough comparison of the accuracy and\ncomputational cost of the Fisher Matrix, Derivative Approximation for\nLikelihoods (DALI) and traditional MCMC methods. We find that using DALI, which\nextends the traditional Fisher Matrix (FM) method to higher orders, allows for\na good approximation of the posterior with a $55$ times smaller computational\ncost, and that the cost-benefit of the doublet-DALI is better than that of the\ntriplet-DALI. We also show that the singlet-DALI, a hybrid MCMC-Fisher method,\nis much more accurate than the traditional FM and 10 times faster than the\ndoublet-DALI. A large effort has been invested in forecasting the science case\nof different detector configurations, and the ability of making fast yet\naccurate estimations of the posteriors is an important step forward. We also\nintroduce version \\texttt{1.0} of the public \\texttt{GWDALI} code, which\nincorporates automatic differentiation, modern waveforms and an optimized\nparameter decomposition."}
{"id": "2510.16353", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.16353", "abs": "https://arxiv.org/abs/2510.16353", "authors": ["Bibhuti Bhusan Dutta", "Liza Devi", "Biplob Sarkar", "Asish Jyoti Boruah"], "title": "An Overview of Rossby Wave Instability in Accretion Discs surrounding Black Holes", "comment": "9 pages, 1 figure, The manuscript is accepted for publication as a\n  book chapter in the forthcoming research book \"The Nexus Tapestry: Weaving\n  the Threads of Science\"", "summary": "The Rossby Wave Instability (RWI) has become an important concept in\nunderstanding the hydrodynamics (HDs) of accretion discs (ADs), especially in\nsystems around black holes (BHs) where magnetic effects are either weak or\nabsent. This instability is triggered by extrema (or sharp gradients) in the\nvortensity profile of the disc. Once activated, it leads to non-axisymmetric\ndisturbances that can grow into large-scale vortices. These vortices play a\nsignificant role in the outward transport of angular momentum (AM). They may\nalso help explain the presence of quasi-periodic oscillations (QPOs) observed\nin certain astrophysical systems such as X-ray binaries (XRBs). Here we review\nthe main theoretical ideas behind RWI, as well as findings from more advanced\nthree-dimensional (3D) and relativistic simulations. We also mention how the\ntheory has been extended to include magnetic fields and self-gravity(SG) and\nwhat these results might imply for actual observations."}
{"id": "2510.16977", "categories": ["astro-ph.IM", "astro-ph.GA", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.16977", "abs": "https://arxiv.org/abs/2510.16977", "authors": ["Varoujan Gorjian", "Michael W. Werner"], "title": "Studying the Dust Distribution Around Accreting Black Holes with Reverberation Mapping Using PRIMA", "comment": "This paper is part of the JATIS special issue focused on the PRobe\n  Infrared Mission for Astrophysics (PRIMA) probe mission concept. The issue is\n  edited by Matt Griffin and Naseem Rangwala (JATIS VOL. 11, NO. 3, July 2025)", "summary": "Variability studies are a powerful tool for studying the structures of\nunresolved sources. One such type of variability study, called reverberation\nmapping (RM), established that the dominant source of infrared radiation from\nan active galactic nucleus (AGN) was from dust absorption and re-emission,\nwhich demonstrated that the optical brightening and fading of light from the\naccretion disk (AD) around a supermassive black hole was followed by a\ncorresponding (delayed) variation at infrared (IR) wavelengths from the\nsurrounding dust distribution. Since that time a great deal more has been\nlearned about the dust distribution around ADs, both near the AD in the form of\na potential torus, as well as extended emission in the form of polar dust\noutflows. Understanding the dust distribution is vital to understanding how\nAGNs affect their host galaxy as well as the overall energetics of AGNs as ~50%\nof energy from an AGN comes out in the IR. Dust RM has been done exclusively in\nthe near-IR (1-5 microns) which traces the inner edge of the dust near the dust\nsublimation radius. Hence extending RM to the mid-IR, especially to the peak of\nthe dust emission between 25 and 30 microns, allows for an examination of the\ndust distribution around ADs and potentially traces the source of the polar\noutflow. RM with the proposed PRobe far-Infrared Mission for Astrophysics\n(PRIMA) can focus on variability monitoring of a sample of low- to\nhigh-luminosity AGNs to trace the 25-30 microns emission that is reverberated\nfrom the UV/optical AD emission which will be monitored by other space and\nground-based observatories and made available to PRIMA users. Then, by detailed\nmodeling of the response of the dust emission to shorter wavelengths, the\ndistribution of the dust around an AGN will be revealed and can be linked to\nthe accretion disk luminosities."}
{"id": "2510.16365", "categories": ["astro-ph.HE", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2510.16365", "abs": "https://arxiv.org/abs/2510.16365", "authors": ["Luca Boccioli", "Lorenzo Roberti"], "title": "Explodability matters: how realistic neutrino-driven explosions change explosive nucleosynthesis yields", "comment": "23 pages, 18 figures", "summary": "Explosive nucleosynthesis is affected by many uncertainties, particularly\nregarding assumptions and prescriptions adopted during the evolution of the\nstar. Moreover, simple explosion models are often used in the literature, which\ncan introduce large errors in the assumed explosion energy and mass cut. In\nthis paper, our goal is to analyze the explosion properties and nucleosynthesis\nof a large range of progenitors from three different stellar evolution codes:\nFRANEC, KEPLER, and MESA. In particular, we will show the differences between\nthe neutrino-driven explosions simulated in this work with the much simpler\nbomb and piston models that are typically widely used in the literature. We\nwill then focus on the impact of different explodabilities and different\nexplosion dynamics on the nucleosynthetic yields. We adopt the neutrino-driven\ncore-collapse supernova explosion code GR1D+, i.e. a spherically symmetric\nmodel with state-of-the-art microphysics and neutrino transport and a\ntime-dependent mixing-length model for neutrino-driven convection. We carry out\nexplosions up to several seconds after bounce, and then calculate the\nnucleosynthetic yields with the post-processing code SkyNet. We find that our\n1D+ simulations yield explosion energies and remnant masses in agreement with\nobservations of type II-P, IIb, and Ib supernovae, as well as with the most\nrecent 3D simulations of the explosion. We provide a complete set of yields for\nall the stars simulated, including rotating, low-metallicity, and binary\nprogenitors. Finally, we find that piston and bomb models, compared to more\nrealistic neutrino-driven explosions, can artificially increase the production\nof Fe-peak elements, whereas the different explodability tends to cause\ndiscrepancies in the lighter elements."}
{"id": "2510.17053", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2510.17053", "abs": "https://arxiv.org/abs/2510.17053", "authors": ["Dongjin Lee", "Gregory S. H. Paek", "Seo-Won Chang", "Changwan Kim", "Mankeun Jeong", "Hongjae Moon", "Seong-Heon Lee", "Jae-Hun Jung", "Myungshin Im"], "title": "Investigating the Effects of Point Source Injection Strategies on KMTNet Real/Bogus Classification", "comment": null, "summary": "Recently, machine learning-based real/bogus (RB) classifiers have\ndemonstrated effectiveness in filtering out artifacts and identifying genuine\ntransients in real-time astronomical surveys. However, the rarity of transient\nevents and the extensive human labeling required for a large number of samples\npose significant challenges in constructing training datasets for RB\nclassification. Given these challenges, point source injection techniques,\nwhich inject simulated point sources into optical images, provide a promising\nsolution. This paper presents the first detailed comparison of different point\nsource injection strategies and their effects on classification performance\nwithin a simulation-to-reality framework. To this end, we first construct\nvarious training datasets based on Random Injection (RI), Near Galaxy Injection\n(NGI), and a combined approach by using the Korea Microlensing Telescope\nNetwork datasets. Subsequently, we train convolutional neural networks on\nsimulated cutout samples and evaluate them on real, imbalanced datasets from\ngravitational wave follow-up observations for GW190814 and S230518h. Extensive\nexperimental results show that RI excels at asteroid detection and bogus\nfiltering but underperforms on transients occurring near galaxies (e.g.,\nsupernovae). In contrast, NGI is effective for detecting transients near\ngalaxies but tends to misclassify variable stars as transients, resulting in a\nhigh false positive rate. The combined approach effectively handles these\ntrade-offs, thereby balancing between detection rate and false positive rate.\nOur results emphasize the importance of point source injection strategy in\ndeveloping robust RB classifiers for transient (or multi-messenger) follow-up\ncampaigns."}
{"id": "2510.16475", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2510.16475", "abs": "https://arxiv.org/abs/2510.16475", "authors": ["T. K. M. Aldowma", "S. Razzaque", "R. Martinelli", "R. Gupta", "F. Longo", "N. Omodei", "N. Di Lalla", "J. L. Racusin", "A. H. Airasca"], "title": "Implications of Joint Spectral Analysis of Gamma-Ray Bursts detected by Fermi Large Area Telescope and Gamma-ray Burst Monitor on Phenomenological Correlations", "comment": "57 pages, 75 figures and 7 tables", "summary": "Gamma-ray bursts (GRBs) have emerged as powerful cosmological probes for\nexploring the distant Universe, owing to their immense luminosities and\ndetectability at high redshifts. Several empirical correlations have been\nestablished, particularly involving their energy properties. This work aims to\nenhance the precision of these correlations through joint spectral analysis,\nfocusing on reducing uncertainties in both the spectral indices and the peak\nenergy ($E_{\\rm p}$) derived from spectral fitting. We extend previous studies\nusing both traditional and novel spectral models, utilizing a sample of 37 GRBs\nobserved by the Fermi Gamma-ray Burst Monitor (GBM) and Large Area Telescope\n(LAT), incorporating the LAT Low-Energy (LLE) technique, over the period\n2008-2024. Our analysis compares results from joint fits (GBM-LAT-LLE) against\nthose from GBM-only fits. The study focuses on fitting time-integrated ${\\rm\nT}_{90}$ and peak flux in the rest frame. Among the observable phenomenological\ncorrelations, we revisit the Amati and Yonetoku relations: the Amati relation\nlinks the intrinsic peak energy ($E_{i,\\rm p}$) to the total isotropic energy\n($E_{\\rm iso}$) emitted during ${\\rm T}_{90}$, while the Yonetoku relation\nconnects $E_{i,\\rm p}$ to the isotropic luminosity ($L_{\\rm iso}$). Refining\nthese correlations aims to deepen our understanding of GRB energetics and\nimprove the precision of cosmological parameter estimates derived from GRB\nobservations."}
{"id": "2510.17433", "categories": ["astro-ph.IM", "astro-ph.CO", "math.HO"], "pdf": "https://arxiv.org/pdf/2510.17433", "abs": "https://arxiv.org/abs/2510.17433", "authors": ["Rafael S. de Souza", "Emille E. O. Ishida", "Alberto Krone-Martins"], "title": "A Brief History of Inference in Astronomy", "comment": "Invited featured article published in the Notices of the American\n  Mathematical Society. The arXiv version is posted solely to provide access to\n  some additional references", "summary": "In this short review, we trace the evolution of inference in astronomy,\nhighlighting key milestones rather than providing an exhaustive survey. We\nfocus on the shift from classical optimization to Bayesian inference, the rise\nof gradient-based methods fueled by advances in deep learning, and the\nemergence of adaptive models that shape the very design of scientific datasets.\nUnderstanding this shift is essential for appreciating the current landscape of\nastronomical research and the future it is helping to build."}
{"id": "2510.16525", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2510.16525", "abs": "https://arxiv.org/abs/2510.16525", "authors": ["Shi-Jiang Chen", "Jun-Xian Wang", "Jia-Lai Kang", "Wen-Yong Kang", "Hao Sou", "Teng Liu", "Zhen-Yi Cai", "Zhen-Bo Su"], "title": "A UV to X-Ray View of Soft Excess in Type 1 Active Galactic Nuclei. II. Broadband Correlations", "comment": "12+4 pages, 10+2 figures. Accepted by ApJ. Comments are welcome!", "summary": "The physical origin of soft X-ray excess (SE) is a long lasting question,\nwith two prevailing theories -- ``warm corona'' and ``ionized reflection'' --\ndominating the discussion. In the warm corona scenario, SE originates from\nupscattered disk photons and should therefore correlate strongly with UV\nemission. Conversely, in the ionized reflection scenario, SE arises from the\nillumination of the accretion disk by the hot corona and should primarily\ncorrelate with the hard X-ray primary continuum (PC). In this second paper of\nthe series, we investigate the correlations among SE, UV and PC, leveraging a\nsample of 59 unobscured type 1 AGNs compiled in \\citet{Chen+2025a}. Our\nextensive analysis reveals a strong intrinsic correlation between SE and UV\nthat remains robust after controlling for PC ($p_\\mathrm{null}\\lesssim\n10^{-7}$). In contrast, the correlation between SE and PC is weaker but still\nstatistically significant ($p_\\mathrm{null}\\lesssim 5\\times 10^{-2}$). These\nfindings suggest that, in addition to ionized reflection -- a natural outcome\nof the hot corona illuminating the disk -- a warm corona component is\nessential, and may even dominate, in producing the soft excess. Additionally,\nwe report a mild anti-correlation between SE strength ($q$) and PC photon index\n($\\Gamma_\\mathrm{PC}$) ($p_\\mathrm{null}=10^{-2}$), suggesting a potential\ncompetition between the warm and hot coronae. Finally, we find that the\n$\\Gamma_\\mathrm{PC}$ values we derived with SE properly incorporated exhibit a\nmuch weaker correlation with $\\lambda_\\mathrm{Edd}$ ($p_\\mathrm{null}=2\\times\n10^{-2}$) than previously reported in the literature. This highlights the\ncritical role of accurately modeling SE in studies of the\n$\\Gamma_\\mathrm{PC}$--$\\lambda_\\mathrm{Edd}$ relation."}
{"id": "2510.17540", "categories": ["astro-ph.IM", "cs.CV"], "pdf": "https://arxiv.org/pdf/2510.17540", "abs": "https://arxiv.org/abs/2510.17540", "authors": ["Olivier Parisot", "Mahmoud Jaziri"], "title": "Detecting streaks in smart telescopes images with Deep Learning", "comment": "19 pages, preprint submitted to the Springer CCIS Special Issue on\n  DATA 2024 (currently under editorial processing)", "summary": "The growing negative impact of the visibility of satellites in the night sky\nis influencing the practice of astronomy and astrophotograph, both at the\namateur and professional levels. The presence of these satellites has the\neffect of introducing streaks into the images captured during astronomical\nobservation, requiring the application of additional post processing to\nmitigate the undesirable impact, whether for data loss or cosmetic reasons. In\nthis paper, we show how we test and adapt various Deep Learning approaches to\ndetect streaks in raw astronomical data captured between March 2022 and\nFebruary 2023 with smart telescopes."}
{"id": "2510.16584", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.16584", "abs": "https://arxiv.org/abs/2510.16584", "authors": ["Pouya M. Kouch", "Elina Lindfors", "Talvikki Hovatta", "Ioannis Liodakis", "Karri I. I. Koljonen", "Alessandro Paggi", "Kari Nilsson", "Jenni Jormanainen", "Vandad Fallah Ramazani", "Sofia Kankkunen", "Folkert Wierda", "Sarah M. Wagner", "Matthew J. Graham"], "title": "CAZ catalog and optical light curves of 7918 blazar-selected AGN", "comment": "22 pages, 23 figures, submitted to A&A", "summary": "Active Galactic Nuclei (AGN) are some of the brightest and most variable\nobjects in the universe. Those with relativistic jets observed at small viewing\nangles are blazars. Due to Doppler-boosting, blazars exhibit extreme stochastic\nvariability. While the origin of this variability is thought to be changes in\nthe accretion flow and jet dynamics, much about blazar variability remains\nunknown. In this paper we use several blazar-dominated AGN samples to form a\ncatalog of 7918 blazars and candidates -- the largest to date. We also collect\nsource types, redshifts, spectral energy distribution (SED) peak frequencies,\nradio variability Doppler factors, and X-ray flux densities for as many sources\nas possible. We use all-sky surveys (CRTS, ATLAS, and ZTF, abbreviated as\n``CAZ'') to extract their optical multiband flux density on a nightly basis\nbetween 2007 and 2023, and construct as long and as high cadence light curves\nas possible for as many sources as attainable. The catalog and its light curves\nare provided in the accompanying electronic tables, enabling many analyses\ninvolving AGN variability with unprecedented sample-sizes. We quantify the\nvariability of the light curves, and apply the Bayesian blocks algorithm to\ndetermine their flaring periods. We find: (1) optical flares generally have a\nfaster rise than decay; (2) optical brightness and variability are strongly\ndependent on the synchrotron peak frequency; (3) flat spectrum radio quasars\nand BL Lac objects have comparable optical variability and flare\ncharacteristics at the same synchrotron peak frequency; and (4) optical flare\ntimes tend to decrease and amplitudes increase with increasing radio\nvariability Doppler factor."}
{"id": "2510.17721", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2510.17721", "abs": "https://arxiv.org/abs/2510.17721", "authors": ["Jesús D. Petro-Ramos", "David J. Ruiz-Morales", "D. Sierra-Porta"], "title": "Graph-Based Light-Curve Features for Robust Transient Classification", "comment": "8 pages, 3 figures, 2 tables", "summary": "We investigate graph-based representations of astronomical light curves for\ntransient classification on the MANTRA benchmark. Each series is mapped to\nthree visibility-graph views-horizontal (HVG), directed (DHVG), and weighted\n(W-HVG)-from which we extract compact, length-aware network descriptors\n(degree/strength moments, clustering and motifs, assortativity,\npath/efficiency, and spectral summaries). Using stratified five-fold validation\nand tree-based learners, the best configuration (LightGBM with HVG+DHVG+W-HVG\nfeatures) attains a macro-F1 of 0.622 +/- 0.010 and accuracy of 0.661 +/-\n0.010, improving over the MANTRA baseline (F1 macro = 0.528). Ablations show\nthat weighted contrasts and directed asymmetry contribute complementary gains\nto undirected topology. Per-class analysis highlights strong performance for\nCV, HPM, and Non-Tr., with residual confusions concentrated in the\nAGN-Blazar-SN block. These results indicate that visibility graphs offer a\nsimple, survey-agnostic bridge between irregular photometric time series and\nstandard classifiers, yielding competitive multiclass performance without\nbespoke deep architectures. We release code and feature definitions to\nfacilitate reproducibility and future extensions."}
{"id": "2510.16585", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.16585", "abs": "https://arxiv.org/abs/2510.16585", "authors": ["Pouya M. Kouch", "Talvikki Hovatta", "Elina Lindfors", "Ioannis Liodakis", "Karri I. I. Koljonen", "Alessandro Paggi"], "title": "Association of the IceCube neutrinos with CAZ blazar light curves", "comment": "17 pages, 10 figures, submitted to A&A", "summary": "Over the past decade, the IceCube Neutrino Observatory has detected a few\nhundreds of high-energy (HE) neutrinos from cosmic sources. Despite numerous\nstudies searching for their origin, it is still not known which source\npopulations emit them. A few confident individual associations exist with\nactive galactic nuclei (AGN), mostly with blazars which are jetted AGN whose\njet points in our direction. Nonetheless, on a population level,\nblazar-neutrino correlation strengths are rather weak. This could mean that\nblazars as a population do not emit HE neutrinos, or that the detection power\nof the tests is insufficient due to the strong atmospheric neutrino background.\nBy assuming an increase in HE neutrino emission during major blazar flares, in\nour previous studies we leveraged the arrival time of the neutrinos to boost\nthe detection power. In this paper we utilize the same principle while\nsubstantially increasing the number of blazars. We search for the\nspatio-temporal correlation of 356 IceCube HE neutrinos with major optical\nflares of 3225 radio- and 3814 $\\gamma$-ray-selected blazars. We find that,\ndespite the increase in data size, the number of confident spatio-temporal\nassociations remains low and the overall correlation strengths weak. Two\nindividual associations drive our strongest and the only $>$2$\\sigma$\npost-trial spatio-temporal correlation, occurring with the BL Lac objects of\nthe radio-selected blazar sample. We estimate that $\\lesssim$8\\% of the\ndetected cosmic neutrinos were emitted by blazars during major optical flares.\nAs a complementary analysis, we compare the synchrotron peak frequency,\nredshift, Doppler factor, X-ray brightness, and optical variability of\nspatially neutrino-associated blazars to those of the general blazar\npopulation. We find that spatially neutrino-associated blazars of the tested\nsamples have higher than average Doppler factor and X-ray brightness."}
{"id": "2510.16338", "categories": ["astro-ph.HE", "astro-ph.IM", "gr-qc", "hep-ph"], "pdf": "https://arxiv.org/pdf/2510.16338", "abs": "https://arxiv.org/abs/2510.16338", "authors": ["Wan-Peng Sun", "Yong-Kun Zhang", "Ji-Guo Zhang", "Xiaohui Liu", "Yichao Li", "Fu-Wen Zhang", "Wan-Ting Hou", "Jing-Fei Zhang", "Xin Zhang"], "title": "A Practical Framework for Estimating the Repetition Likelihood of Fast Radio Bursts from Spectral Morphology", "comment": "15 pages, 4 figures", "summary": "The repeating behavior of fast radio bursts (FRBs) is regarded as a key clue\nto understanding their physical origin, yet reliably distinguishing repeaters\nfrom apparent non-repeaters with current observations remains challenging. Here\nwe propose a physically interpretable and practically quantifiable\nclassification framework based on spectral morphology. Using dimensionality\nreduction, clustering, and feature-importance analysis, we identify the\nspectral running $r$ and spectral index $\\gamma$ as the most critical\nparameters for distinguishing repeaters from apparent non-repeaters in the\nCHIME/FRB sample. In the $\\gamma$-$r$ space, repeaters preferentially occupy\nregions with steeper, narrower-band spectra, whereas non-repeaters cluster in\nflatter, broader-band regions, resulting in a clear density separation. We\nfurther construct an empirical probability map in the $\\gamma$-$r$ space,\nshowing a clear gradient of repetition likelihood, from $\\sim 65\\%$ in the\nhigh-repetition region to $\\sim 5\\%$ in the low-repetition region. Combining\nthis with Gaussian Mixture Model posterior analysis, we identify several\napparent non-repeaters with high inferred repetition probability, recommending\nthem as priority targets for future monitoring. This framework provides a\nsimple and generalizable tool for assessing repeatability in the CHIME/FRB\nsample and highlights the diagnostic power of spectral morphology in unveiling\nFRB origins."}
{"id": "2510.16618", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.16618", "abs": "https://arxiv.org/abs/2510.16618", "authors": ["J. D. Turner", "B. W. Stappers", "E. Barr", "M. Burgay", "M. Colom i Bernadich", "V. Graber", "M. J. Keith", "M. Kramer", "L. Levin", "Y. P. Men", "C. Pardo-Araujo", "T. Thongmeearkom", "J. Tian", "P. V. Padmanabh", "P. Weltevrede", "J. Behrend", "W. Chen", "E. F. Keane", "A. Ridolfi"], "title": "TRAPUM search for pulsars in supernova remnants and pulsar wind nebulae - II. Survey analysis and population study", "comment": "26 pages, 19 figures. Accepted for publication in MNRAS", "summary": "We present the second and final set of TRAPUM searches for pulsars at 1284\nMHz inside supernova remnants and pulsar wind nebulae with the MeerKAT\ntelescope. No new pulsars were detected for any of the 80 targets, which\ninclude some unidentified TeV sources that could be pulsar wind nebulae. The\nmean upper limit on the flux density of undetected pulsars is 52 $\\mu$Jy, which\nincludes the average sensitivity loss across the coherent beam tiling pattern.\nThis survey is the largest and most sensitive multi-target campaign of its\nkind. We explore the selection effects that precluded discoveries by testing\nthe parameters of the survey iteratively against many simulated populations of\nyoung pulsars in supernova remnants. For the synthetic pulsars that were\nundetected, we find evidence that, after beaming effects are accounted for,\nabout 45 per cent of pulsars are too faint, 30 per cent are too smeared by\nscattering, and a further 25 per cent have a modelled projected location which\nplaces them outside their supernova remnant. The simulations are repeated for\nthe S1 subband of the MeerKAT S-band receivers, resulting in a 50-150 per cent\nincrease in the number of discoveries compared to L-band depending on the flux\ndensity limit achieved. Therefore, higher frequency searches that can also\nachieve improved flux density limits are the best hope for future targeted\nsearches. We also report updated properties for the two previous discoveries,\nincluding a polarimetry study of PSR J1831$-$0941 finding a rotation measure of\n401$\\pm$1 rad m$^2$."}
{"id": "2510.16475", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2510.16475", "abs": "https://arxiv.org/abs/2510.16475", "authors": ["T. K. M. Aldowma", "S. Razzaque", "R. Martinelli", "R. Gupta", "F. Longo", "N. Omodei", "N. Di Lalla", "J. L. Racusin", "A. H. Airasca"], "title": "Implications of Joint Spectral Analysis of Gamma-Ray Bursts detected by Fermi Large Area Telescope and Gamma-ray Burst Monitor on Phenomenological Correlations", "comment": "57 pages, 75 figures and 7 tables", "summary": "Gamma-ray bursts (GRBs) have emerged as powerful cosmological probes for\nexploring the distant Universe, owing to their immense luminosities and\ndetectability at high redshifts. Several empirical correlations have been\nestablished, particularly involving their energy properties. This work aims to\nenhance the precision of these correlations through joint spectral analysis,\nfocusing on reducing uncertainties in both the spectral indices and the peak\nenergy ($E_{\\rm p}$) derived from spectral fitting. We extend previous studies\nusing both traditional and novel spectral models, utilizing a sample of 37 GRBs\nobserved by the Fermi Gamma-ray Burst Monitor (GBM) and Large Area Telescope\n(LAT), incorporating the LAT Low-Energy (LLE) technique, over the period\n2008-2024. Our analysis compares results from joint fits (GBM-LAT-LLE) against\nthose from GBM-only fits. The study focuses on fitting time-integrated ${\\rm\nT}_{90}$ and peak flux in the rest frame. Among the observable phenomenological\ncorrelations, we revisit the Amati and Yonetoku relations: the Amati relation\nlinks the intrinsic peak energy ($E_{i,\\rm p}$) to the total isotropic energy\n($E_{\\rm iso}$) emitted during ${\\rm T}_{90}$, while the Yonetoku relation\nconnects $E_{i,\\rm p}$ to the isotropic luminosity ($L_{\\rm iso}$). Refining\nthese correlations aims to deepen our understanding of GRB energetics and\nimprove the precision of cosmological parameter estimates derived from GRB\nobservations."}
{"id": "2510.16668", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.16668", "abs": "https://arxiv.org/abs/2510.16668", "authors": ["Gabriella Agazie", "David L. Kaplan", "Abhimanyu Susobhanan", "Ingrid H. Stairs", "Deborah C. Good", "Bradley W. Meyers", "Emmanuel Fonseca", "Timothy T. Pennucci", "Akash Anumarlapudi", "Anne M. Archibald", "Zaven Arzoumanian", "Paul T. Baker", "Paul R. Brook", "Alyssa Cassity", "H. Thankful Cromartie", "Kathryn Crowter", "Megan E. DeCesar", "Paul B. Demorest", "Timothy Dolch", "Fengqiu Adam Dong", "Elizabeth C. Ferrara", "William Fiore", "Gabriel E. Freedman", "Nate Garver-Daniels", "Peter A. Gentile", "Joseph Glaser", "Jeffrey S. Hazboun", "Ross J. Jennings", "Megan L. Jones", "Matthew Kerr", "Michael T. Lam", "Duncan R. Lorimer", "Jing Luo", "Ryan S. Lynch", "Alexander McEwen", "James W. McKee", "Maura A. McLaughlin", "Natasha McMann", "Cherry Ng", "David J. Nice", "Benetge B. P. Perera", "Nihan S. Pol", "Henri A. Radovan", "Scott M. Ransom", "Paul S. Ray", "Alexander Saffer", "Ann Schmiedekamp", "Carl Schmiedekamp", "Brent J. Shapiro-Albert", "Kevin Stovall", "Joseph K. Swiggum", "Mercedes S. Thompson", "Haley M. Wahl"], "title": "CHIME-o-Grav: Wideband Timing of Four Millisecond Pulsars from the NANOGrav 15-yr dataset", "comment": "20 pages, 11 figures, Submitted to APJ", "summary": "Wideband timing of the North American Nanohertz Observatory for Gravitational\nWaves (NANOGrav) datasets, where a single time-of-arrival (TOA) and a single\ndispersion measure (DM) are measured using the entire bandwidth of each\nobservation, was first done for the 12.5-year dataset, and proved to be\ninvaluable for characterizing the time-varying dispersion measure, reducing the\ndata volume, and for improving the overall timing precision. The Canadian\nHydrogen Intensity Mapping Experiment (CHIME) Telescope has been observing most\nNANOGrav millisecond pulsars (MSPs) at nearly daily cadence (compared to\nroughly monthly cadence for other NANOGrav observations) since 2019 with the\nobjective of integration into future pulsar timing array (PTA) datasets. In\nthis paper, we show the results of integration of high-cadence,\nlow-observing-frequency CHIME data with data from the NANOGrav experiment for\nan isolated MSP PSR~J0645$+$5158 and three binary MSPs PSR~J1012$+$5307,\nPSR~J2145$-$0750, and PSR~J2302$+$4442. Using a wideband timing pipeline which\nwe also describe, we present updated timing results for all four sources,\nincluding improvements in measurements of relativistic post-Keplerian\nparameters for the three binary pulsars in this analysis. For PSR~J2302$+$4442,\nwe report an updated strong detection of Shapiro delay from which we measured a\ncompanion mass of $0.35^{+0.05}_{-0.04}\\ M_{\\odot}$, a pulsar mass of\n$1.8^{+0.3}_{-0.3}\\ M_{\\odot}$, and an orbital inclination of\n${80^{\\circ}}^{+1}_{-2}$. We also report updated constraints on the reflex\nmotion for PSR~J2145$-$0750 using a combination of Very Long Baseline Array\nastrometry and our updated measurement of the time derivative of the projected\nsemi-major axis of the pulsar orbit as a prior."}
{"id": "2510.16705", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2510.16705", "abs": "https://arxiv.org/abs/2510.16705", "authors": ["Larissa Jerrim", "Stas Shabala", "Ross Turner", "Patrick Yates-Jones", "Martin Krause", "Georgia Stewart", "Chris Power"], "title": "The origin of the spectral versus dynamical age discrepancy in radio galaxies", "comment": "19 pages, 14 figures. To be published in PASA", "summary": "We investigate the effect of turbulent magnetic fields on the observed\nspectral properties of synchrotron radio emission in large-scale radio galaxy\nlobes. We use three-dimensional relativistic magnetohydrodynamic simulations of\nfast, high-powered jets to study the structure of the lobe magnetic fields and\nhow this structure affects the radio spectrum of the lobes. It has previously\nbeen argued that lobe ages inferred from radio spectra underestimate the true\nages of radio galaxies due to re-acceleration of electrons in the lobe, mixing\nof electron populations, or the presence of turbulent magnetic fields in the\nlobes. We find that the spectral ages with and without accounting for the lobe\nmagnetic field structure are consistent with each other, suggesting that mixing\nof radiating populations of different ages is the primary cause of the\nunderestimation of radio lobe ages. By accounting for the structure of lobe\nmagnetic fields, we find greater spectral steepening in the equatorial regions\nof the lobe. We demonstrate that the assumptions of the continuous injection,\nJaffe-Perola, and Tribble models for radio lobe spectra do not hold in our\nsimulations, and we show that young particles with high magnetic field\nstrengths are the dominant contributors to the overall radio lobe spectrum."}
{"id": "2510.16726", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.16726", "abs": "https://arxiv.org/abs/2510.16726", "authors": ["Lei Zhang", "Zhaosheng Li", "Yuanyue Pan", "Wenhui Yu", "Yupeng Chen", "Yue Huang", "Mingyu Ge", "Shu Zhang"], "title": "A transition from mixed-fuel to pure-helium thermonuclear bursts in Terzan 5 X-3/Swift J174805.3-244637", "comment": "9 pages, 7 figures. Accepted for publication in A&A", "summary": "We presented a detailed analysis of seven thermonuclear X-ray bursts from\nTerzan 5 X-3/Swift J174805.3-244637, detected by NICER during the source's 2023\noutburst. Our analysis reveals a clear evolution of burst properties,\nidentifying four non-photospheric radius expansion (non-PRE) bursts, one PRE\ncandidate occurring in a mixed hydrogen/helium environment, and two powerful\nPRE bursts from pure helium ignition. The time-resolved burst spectra were well\ndescribed by a model including a variable persistent emission component,\nquantified by a factor $f_a$, due to the Poynting-Robertson drag. The strength\nof this interaction scales with burst luminosity: the enhancement is absent\n($f_a \\approx 1$) in the faintest bursts, becomes modest ($f_a \\approx 1.5-2$)\nfor the more luminous non-PRE burst and the PRE candidate, and is very strong\n($f_a \\approx 6-8$) during the pure-helium PRE bursts. This observed transition\nfrom mixed-fuel to pure-helium burning as the local mass accretion rate dropped\nbelow $\\sim$10% of the Eddington limit, $\\dot{m}_{\\rm Edd}$, aligns with\ntheoretical predictions. We verified this scenario with two independent\nmethods. First, at the known distance to Terzan 5, the touchdown luminosities\nof both the pure helium PRE bursts and the mixed-fuel PRE candidate are\nconsistent with reaching their respective, composition-dependent Eddington\nlimits on the same plausible, massive neutron star of $\\sim 2 M_\\odot$. Second,\nthe observed recurrence times of the non-PRE bursts were consistent with\npredictions for mixed-fuel burning."}
{"id": "2510.16840", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.16840", "abs": "https://arxiv.org/abs/2510.16840", "authors": ["N. N. Chugai"], "title": "SN Ia-CSM 2020aeuh: Massive binary C/O WD merger?", "comment": null, "summary": "I explore the origin of the circumstellar (CS) shell of the unusual SN Ia\n2020aeuh based on the light curve model abd observational constraints. I\nestimate the $^{56}$Ni mass ($1.1 M\\odot$), CS shell mass ($0.04-0.2 M\\odot$),\nradius ($2\\times10^{16}$ cm), and expansion velocity $\\lesssim 200$ km/s. Large\n$^{56}$Ni mass and properties of the CS shell are consistent with the scenario\nof massive binary white dwarf merger that has been accompanied with the\nejection of $\\sim 0.1 M\\odot$ of matter. It is argued that SN~2020aeuh exploded\nnot earlier than 30 yr after the merger."}
{"id": "2510.17104", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.17104", "abs": "https://arxiv.org/abs/2510.17104", "authors": ["Noah Franz", "Bhagya Subrayan", "Charles D. Kilpatrick", "Griffin Hosseinzadeh", "David J. Sand", "Kate D. Alexander", "Wen-fai Fong", "Collin T. Christy", "Jeniveve Pearson", "Tanmoy Laskar", "Brian Hsu", "Jillian Rastinejad", "Michael J. Lundquist", "Edo Berger", "K. Azalee Bostroem", "Clecio R. Bom", "Phelipe Darc", "Mark Gurwell", "Shelbi Hostler Schimpf", "Garrett K. Keating", "Phillip Noel", "Conor Ransome", "Ramprasad Rao", "Luidhy Santana-Silva", "A. Souza Santos", "Manisha Shrestha", "Ramya Anche", "Jennifer E. Andrews", "Sanchayeeta Borthakur", "Nathaniel R. Butler", "Deanne L. Coppejans", "Philip N Daly", "Kathryne J. Daniel", "Paul C. Duffell", "Tarraneh Eftekhari", "Carl E. Fields", "Alexander T. Gagliano", "Walter W. Golay", "Aldana Grichener", "Erika T. Hamden", "Daichi Hiramatsu", "Harsh Kumar", "Vikram Manikantan", "Raffaella Margutti", "Vasileios Paschalidis", "Kerry Paterson", "Daniel E. Reichart", "Mathieu Renzo", "Kali Salmas", "Genevieve Schroeder", "Nathan Smith", "Kristine Spekkens", "Jay Strader", "David E. Trilling", "Nicholas Vieira", "Benjamin Weiner", "Peter K. G. Williams"], "title": "Optimizing Kilonova Searches: A Case Study of the Type IIb SN 2025ulz in the Localization Volume of the Low-Significance Gravitational Wave Event S250818k", "comment": "37 pages, 12 figures. Submitted to ApJL", "summary": "Kilonovae, the ultraviolet/optical/infrared counterparts to binary neutron\nstar mergers, are an exceptionally rare class of transients. Optical follow-up\ncampaigns are plagued by impostors whose early evolution masquerades as the\nrapid radioactive decay of heavy elements. In this work, we present an analysis\nof the multi-wavelength dataset of supernova (SN) 2025ulz, a proposed kilonova\ncandidate following the low-significance detection of gravitational waves\noriginating from the potential binary neutron star merger S250818k. Despite an\nearly rapid decline in brightness, our multi-wavelength observations of SN\n2025ulz reveal that it is a type IIb supernova. As part of this analysis, we\ndemonstrate the capabilities of a novel quantitative scoring algorithm to\ndetermine the likelihood that a transient candidate is a kilonova, based\nprimarily on its 3D location and light curve evolution. We also apply our\nscoring algorithm to other transient candidates in the localization volume of\nS250818k and find that, at all times after the discovery of SN 2025ulz, there\nare $\\geq 4$ candidates with a score more promising than SN 2025ulz. During\nfuture kilonova searches, this type of scoring algorithm will be useful to rule\nout contaminating transients in real time, optimizing the use of valuable\ntelescope resources."}
{"id": "2510.17219", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.17219", "abs": "https://arxiv.org/abs/2510.17219", "authors": ["M. Molero", "S. Mangano", "C. Delgado"], "title": "Measurement of the Iron Spectrum with the MAGIC Telescopes", "comment": null, "summary": "Iron cosmic rays represent the most abundant heavy nuclei at energies above 1\nTeV, with their production thought to be primarily originated by astrophysical\nsources. Therefore, measuring the iron spectrum provides crucial insights into\nthe origin, acceleration, and propagation mechanisms of cosmic rays. While\nrecent results from space-based detectors have revealed unexpected energy\ndependences in the GeV-TeV range, these measurements are limited by low\nstatistics at higher energies. At energies above a few TeV, ground-based\ndetectors, such as the Major Atmospheric Gamma Imaging Cherenkov (MAGIC)\ntelescopes, become more effective due to their large collec- tion areas,\nenabling them to extend and complement the capabilities of space-borne\ninstruments. In this work, we apply the so-called direct Cherenkov technique,\nwhich accounts for the radiation emitted by charged particles before the\ncascade develops in the atmosphere, with MAGIC to identify iron-induced air\nshowers and distinguish them from those produced by lighter cosmic-ray species."}
{"id": "2510.17225", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.17225", "abs": "https://arxiv.org/abs/2510.17225", "authors": ["Darashan Saikia", "Liza Devi", "Biplob Sarkar", "Asish Jyoti Boruah"], "title": "An Overview of the Effect of Self-Gravity on the Structure of Accretion Discs", "comment": "10 pages, 1 figure, The manuscript is accepted for publication as a\n  book chapter in the forthcoming research book \"The Nexus Tapestry: Weaving\n  the Threads of Science\"", "summary": "In astrophysical systems like X-ray binaries (XRBs), active galactic nuclei\n(AGN), and young stellar objects (YSOs), we often observe a very fundamental\nstructure called accretion discs(ADs). Conventional AD theory usually supposes\nthat the gravitational field is controlled by a central compact object. This\nassumption breaks down when the mass of the disc becomes considerable in\ncontrast to that of the massive central object. In these cases, the AD's\nself-gravity (SG) can drastically change its structure, dynamics, and\nevolution. This review investigates how SG influences the radial and vertical\nstructure of ADs and how it modifies the mechanisms that transport angular\nmomentum (AM). Along with these, this review also tries to explore how\ngravitational instabilities (GIs) evolve and how they affect disc fragmentation\nand astrophysical phenomena like stellar and planetary formation, AGN dynamics,\nand gamma-ray bursts (GRBs)."}
{"id": "2510.17323", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.17323", "abs": "https://arxiv.org/abs/2510.17323", "authors": ["Ziming Wang", "Chenyu Wang", "He Gao", "Hua Feng", "An Li", "Lin Lin", "Songyu Shen"], "title": "A Common Synchrotron Origin for Prompt Gamma-Ray and Soft X-Ray Emission in GRBs: Evidence from Joint Spectral Analysis", "comment": "25 pages, 24 figures", "summary": "The recent launches of the Einstein Probe (EP) and the Space Variable Objects\nMonitor (SVOM) mission have led to the detection of a growing number of long\nGRBs with significant, early soft X-ray flux during their gamma-ray emission,\nprompting the question of whether their multi-band prompt emission shares a\ncommon origin in region and mechanism. To address this, we utilize the 20-year\nSwift archival data, which provides a substantial sample of joint soft X-ray\nand gamma-ray observations, enabling a systematic joint spectral study. We\nresolve 110 temporal pulses from 46 GRBs and find that a single power-law model\nwith a low-energy break or cutoff adequately describes the prompt spectra from\n150 keV down to 0.5 keV. More than half of the sample pulses require a break\naround a few keV, with average spectral indices $\\langle \\alpha_1 \\rangle =\n-0.88$ and $\\langle \\alpha_2 \\rangle = -1.46$ consistent with synchrotron\nradiation in a marginally fast-cooling regime. The observed spectral evolution\nand the distribution of indices support a single-emission-region origin, where\nthe varying spectral shapes are largely governed by the evolution of the\nsynchrotron cooling frequency $\\nu_c$ and the effect of finite emission width.\nThe observed differences in the temporal behavior between X-ray and gamma-ray\nlight curves can be naturally explained by this spectral evolution across the\nbroad band."}
{"id": "2510.17357", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.17357", "abs": "https://arxiv.org/abs/2510.17357", "authors": ["Leo P. Mulholland", "Catherine A. Ramsbottom", "Connor P. Ballance", "Albert Sneppen", "Stuart A. Sim"], "title": "Electron impact excitation of Te IV and V and Level Resolved R-matrix Photoionization of Te I - IV with application to modelling of AT2017gfo", "comment": "Submitted to MNRAS", "summary": "Spectral modelling of kilonovae (KNe) require large amounts of collisional\nexcitation and photoionization atomic data for lowly ionised (neutral, singly\nand doubly ionised) species of heavy elements. Much of the data currently used\nis calculated using approximate hydrogenic results or adopts semi-empirical\nformulae. We present atomic data for ions of tellurium (Te) computed using the\nwell-known $R$-matrix method. Results will also be presented for radiative and\nthermal collisions of Te IV and V, for which the required atomic data are also\ntypically limited in the literature. The Multi-Configuration-Dirac-Hartree-Fock\n(MCDHF) method is used to produce model atomic structures and radiative rates.\nThese model structures are then used to calculate electron-impact-excitation\nand photoionization cross-sections. The resulting excitation and radiative\nrates are further used in a collisional radiative model to produce synthetic\nspectra, which are compared with observations. We also investigate the\npossibility of Te IV contributing to the 1.08 $\\mu$m emission feature in the\nmid-epochs of AT2017gfo alongside the established P-Cygni feature of Sr II."}
{"id": "2510.17473", "categories": ["astro-ph.HE", "hep-ex", "hep-ph"], "pdf": "https://arxiv.org/pdf/2510.17473", "abs": "https://arxiv.org/abs/2510.17473", "authors": ["Milena Crnogorčević"], "title": "The Dark Matters at ICRC 2025", "comment": "DM Rapporteur ICRC 2025 (23 pages incl. references)", "summary": "The dark matter track at ICRC~2025 showed a field in transition. Direct\ndetection has entered the \\emph{neutrino-floor era}, with XENONnT and PandaX-4T\nnow limited by Solar neutrinos. Indirect searches have become truly\n\\emph{multimessenger}, combining $\\gamma$-rays, neutrinos, cosmic rays, and\nradio data under unified likelihoods and shared systematics. Non-WIMP\ncandidates -- axions, sub-GeV particles, primordial black holes, macroscopic\nrelics -- are becoming central. Across all fronts, progress depends as much on\nnew detectors as on the coherence of shared data, methods, and analysis\nframeworks. Here, I distill the main experimental and conceptual shifts behind\nthese trends, noting how assumptions have evolved since ICRC~2023 and where the\nnext decisive advances are likely to come."}
{"id": "2510.17511", "categories": ["astro-ph.HE", "gr-qc"], "pdf": "https://arxiv.org/pdf/2510.17511", "abs": "https://arxiv.org/abs/2510.17511", "authors": ["Inês Rainho", "Jamie Bamber", "Davide Guerra", "Miquel Miravet-Tenés", "Milton Ruiz", "Antonios Tsokaros", "Stuart L. Shapiro"], "title": "Impact of Magnetic Field Topology on Electromagnetic and Gravitational Waves from Binary Neutron Star Merger Remnants", "comment": "29 pages, 18 figures", "summary": "We perform general relativistic magnetohydrodynamic (GRMHD) simulations of\nbinary neutron star (BNS) mergers with four distinct magnetic field topologies:\n(i) a dipole pulsar-like configuration, (ii) a mixed linear superposition of\npoloidal and toroidal components inside the star, and (iii-iv) two topologies\nfeaturing a smooth transition from a confined mixed core to a pulsar-like\nstructure at radii $0.95\\,R_{\\rm NS}$ and $0.5\\,R_{\\rm NS}$, with $R_{\\rm NS}$\nthe radius of the star. The latter topologies are explored in BNS merger\nstudies for the first time. We evolve systems with two equations of state\n(EoS), SLy and WFF1, with ADM masses 2.7 and 2.6, respectively, and include an\nadditional lower-mass SLy binary to probe the behavior of long-lived remnants.\nWe perform an extensive analysis of the emission properties of the systems,\nboth electromagnetic and gravitational waves, and of the properties of the\nremnants, namely their frequency modes, density eigenfunctions, rotation,\ntemperature, and convective stability. We report three key results: (1) for the\nfirst time, we assess the convective stability of magnetized remnants,\nextending previous unmagnetized analyses; (2) we identify a clear secondary\npeak in the gravitational-wave spectrum of pulsar-like configurations,\nconsistent with the nonlinear coupling of the $m=0$ and $m=2$ modes, which is\nabsent in other topologies; and (3) the magnetic field topology strongly\ninfluences the gravitational wave emission properties to the extent that nearby\n($<50\\,{\\rm Mpc}$) events could allow one to observationally distinguish\nbetween different field structures with future gravitational-wave detectors.\nAcross all models, we obtain luminosities compatible with short gamma-ray\nbursts (sGRBs), with purely poloidal configurations being the most efficient in\ndriving possible relativistic jets."}
{"id": "2510.17523", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.17523", "abs": "https://arxiv.org/abs/2510.17523", "authors": ["Alexander Kappes"], "title": "Highlights from the IceCube Neutrino Observatory", "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC2025)", "summary": "The IceCube neutrino observatory has been successfully operating in its full\nconfiguration for almost 15 years and is characterized by a remarkably high\nstability and uptime. During this time, it has made many groundbreaking\nobservations, such as the first detection of a high-energy diffuse cosmic\nneutrino flux or, more recently, the identification of the AGN NGC1068 as a\nsteady source of high-energy neutrino emission and the observation of neutrinos\nfrom the Milky Way. In this talk, new developments in these areas will be\ndiscussed and further highlights presented. The second part then looks at the\nongoing developments at the South Pole with IceCube Upgrade and IceCube-Gen2\nand discusses their potential for advancing neutrino and astroparticle physics."}
{"id": "2510.17636", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.17636", "abs": "https://arxiv.org/abs/2510.17636", "authors": ["Alessandro Veutro", "Irene Di Palma", "Angela Zegarelli"], "title": "Extracting SASI signatures from Gravitational Waves of Core-Collapse Supernovae using the Hilbert-Huang Transform", "comment": "9 pages, 8 figures", "summary": "Core collapse supernovae are among the most energetic astrophysical events in\nthe Universe. Despite huge efforts on understanding the main ingredients\ntriggering such explosions, we still lack of compelling evidences for the\nprecise mechanism driving those phenomena. They are expected to produce\ngravitational waves due to asymmetric mass motions in the collapsing core, and\nemit in the meanwhile neutrinos as a result of the interactions in their\nhigh-density environment. The combination of these two cosmic messengers can\nprovide a unique probe to study the inner engine of these processes and unveil\nthe explosion mechanism. Among the possible detectable signature, standing\naccretion shock instabilities (SASI) are particularly relevant in this context\nas they establish a direct connection between gravitational wave emission and\nthe outcoming neutrino flux. In this work, Hilbert-Huang transform is applied\nto a selected sample of 3D numerical simulations, with the aim of identifying\nSASI contribution and extract its instantaneous frequency. The performance of\nthe method is evaluated in the context of Einstein Telescope."}
{"id": "2510.17696", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.17696", "abs": "https://arxiv.org/abs/2510.17696", "authors": ["Haojie Hu", "Yuta Asahina", "Shogo Yoshioka", "Hiroyuki R. Takahashi", "Ken Ohsuga"], "title": "Clumpy Outflows from Super-Eddington Accreting Black Holes I: Radiation Hydrodynamics Simulations and Observational Implications", "comment": "10 pages, 9 figures, submitted to PASJ", "summary": "Recent advances in X-ray spectroscopic observation have enabled researchers\nto reveal distinct clumpy structures in the super-Eddington outflows from the\nsupermassive black hole in PDS 456 (XRISM Collaboration 2025), initiating\ndetailed investigation of fine-scale structures in accretion-driven outflows.\nIn this study, we conduct high-resolution, two-dimensional\nradiation-hydrodynamics simulations with time-varying and anisotropic initial\nand boundary conditions to reproduce outflows launched from super-Eddington\naccretion flows and analyze their statistical properties. The resulting clumpy\noutflows extend across a wide range of radial distances and polar angles,\nexhibiting typical properties such as a size of ~10 rg (where rg is the\ngravitational radius), a velocity of ~0.05-0.2 c (where c is the speed of\nlight), and about five clumps along the line of sight. Although the velocities\nare slightly smaller, these characteristics reasonably resemble those obtained\nfrom the XRISM observation. The gas density of the clumps is on the order of\n10^{-13}-10^{-12} g cm^{-3}, and their optical depth for electron scattering is\napproximately 1-10. The clumpy winds accelerated by radiation force are\nconsidered to originate from the region within <~300 rg."}
{"id": "2510.17723", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.17723", "abs": "https://arxiv.org/abs/2510.17723", "authors": ["J. Tian", "S. Singh", "B. W. Stappers", "J. D. Turner", "K. M. Rajwade", "M. C. Bezuidenhout", "M. Caleb", "I. Pastor-Marazuela", "F. Jankowski", "V. Gupta", "C. Flynn", "R. Karuppusamy", "E. D. Barr", "M. Kramer", "R. Breton", "C. J. Clark", "D. J. Champion", "T. Thongmeearkom"], "title": "Discovery of 30 Galactic radio transient pulsars with MeerTRAP", "comment": "Accepted for publication in MNRAS", "summary": "We present the discovery of 30 new Galactic sources from the MeerTRAP\nproject, a commensal fast radio transient search programme using the MeerKAT\ntelescope. These sources were all identified via a single pulse search. Most of\nthem are likely to be rotating radio transients (RRATs) given their low pulse\nrates. Using data captured in our transient buffer we have localised nine\nsources in the image domain to arcsecond precision. This facilitates the timing\nof these sources and further follow-up with other telescopes. Using the arrival\ntimes of single pulses, we have constrained the periods of 14 sources, ranging\nfrom 121ms to 7.623s, and derived a phase-coherent timing solution for one of\nthem. Follow-up observations of the MeerTRAP sources (including those published\npreviously) performed with the Effelsberg telescope have detected regular but\nfaint emission from three sources, confirming their long rotation period,\nincluding PSR J2218+2902 with a period of 17.5s, the fourth slowest in the\nradio pulsar population. A few of the sources exhibit interesting emission\nfeatures, such as periodic microstructure in PSR J1243-0435 and possible\nnulling in PSR J1911-2020 and PSR J1243-0435. We find that the duty cycles of\nthe three newly discovered pulsars are very low and follow the general trend\nfor the duty cycle with period of known pulsars."}
{"id": "2510.16977", "categories": ["astro-ph.IM", "astro-ph.GA", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.16977", "abs": "https://arxiv.org/abs/2510.16977", "authors": ["Varoujan Gorjian", "Michael W. Werner"], "title": "Studying the Dust Distribution Around Accreting Black Holes with Reverberation Mapping Using PRIMA", "comment": "This paper is part of the JATIS special issue focused on the PRobe\n  Infrared Mission for Astrophysics (PRIMA) probe mission concept. The issue is\n  edited by Matt Griffin and Naseem Rangwala (JATIS VOL. 11, NO. 3, July 2025)", "summary": "Variability studies are a powerful tool for studying the structures of\nunresolved sources. One such type of variability study, called reverberation\nmapping (RM), established that the dominant source of infrared radiation from\nan active galactic nucleus (AGN) was from dust absorption and re-emission,\nwhich demonstrated that the optical brightening and fading of light from the\naccretion disk (AD) around a supermassive black hole was followed by a\ncorresponding (delayed) variation at infrared (IR) wavelengths from the\nsurrounding dust distribution. Since that time a great deal more has been\nlearned about the dust distribution around ADs, both near the AD in the form of\na potential torus, as well as extended emission in the form of polar dust\noutflows. Understanding the dust distribution is vital to understanding how\nAGNs affect their host galaxy as well as the overall energetics of AGNs as ~50%\nof energy from an AGN comes out in the IR. Dust RM has been done exclusively in\nthe near-IR (1-5 microns) which traces the inner edge of the dust near the dust\nsublimation radius. Hence extending RM to the mid-IR, especially to the peak of\nthe dust emission between 25 and 30 microns, allows for an examination of the\ndust distribution around ADs and potentially traces the source of the polar\noutflow. RM with the proposed PRobe far-Infrared Mission for Astrophysics\n(PRIMA) can focus on variability monitoring of a sample of low- to\nhigh-luminosity AGNs to trace the 25-30 microns emission that is reverberated\nfrom the UV/optical AD emission which will be monitored by other space and\nground-based observatories and made available to PRIMA users. Then, by detailed\nmodeling of the response of the dust emission to shorter wavelengths, the\ndistribution of the dust around an AGN will be revealed and can be linked to\nthe accretion disk luminosities."}
