{"id": "2512.13785", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.13785", "abs": "https://arxiv.org/abs/2512.13785", "authors": ["Raniere de Menezes", "Francesco Massaro", "Elisa Visentin", "Federico Di Pierro", "Haocheng Zhang"], "title": "A minimalist approach to BL Lacertae: explaining gamma-ray spectral and temporal variability with a single physical parameter", "comment": "9 pages, 4 figures, 2 tables", "summary": "The eponymous BL Lac object BL Lacertae is one of the most well-monitored active galactic nuclei, frequently observed from radio to gamma rays. Its relatively soft $γ$-ray spectrum peaks near 500~MeV, and since 2020 it has undergone an exceptional series of flaring episodes. The observed emission is well described by synchrotron self-Compton (SSC) models, with negligible contribution from external seed photons. We investigate the physical origin of BL~Lacertae's $γ$-ray temporal and spectral variability using data from the Large Area Telescope (LAT) on board the \\textit{Fermi} Gamma-ray Space Telescope, and show that this variability can be explained by a single varying parameter, namely the electrons' peak energy, $γ_p$, under a single-zone SSC scenario with a log-parabolic electron distribution. We use a Markov chain Monte Carlo to estimate the spectral parameters of BL Lacertae over time, selected from an adaptive-binned gamma-ray light curve. We then study the correlation between the inverse Compton peak luminosity, $L_{IC}$, and the position of this peak on the SED energy axis, $E_p$, and compare it with what is expected for a single-zone SSC scenario when only one parameter is free to vary. We find a correlation $L_{IC} = 10^{42.33\\pm0.15\\pm0.18_{sys}}E_p^{0.98\\pm0.05\\pm0.06_{sys}}$, consistent, within the errors, with the linear relation $L_{\\mathrm{IC}} \\propto E_p$, expected when $γ_p$ is the only free parameter in the assumed SSC model. This result supports a minimalist SSC scenario in which changes in $γ_p$ dominate the observed temporal and spectral variability of BL~Lacertae."}
{"id": "2512.13791", "categories": ["astro-ph.HE", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2512.13791", "abs": "https://arxiv.org/abs/2512.13791", "authors": ["Luke Harvey", "Kate Maguire", "Alexander Holas", "Joseph P. Anderson", "Ting-Wan Chen", "Lluís Galbany", "Santiago González-Gaitán", "Mariusz Gromadzki", "Tomas E. Müller-Bravo", "Giuliano Pignata", "Ivo R. Seitenzahl"], "title": "Exploring the origins of high-velocity features in SNe Ia with the spectral synthesis code TARDIS", "comment": "21 pages, 16 figures", "summary": "Appearing as secondary higher-velocity absorption components, high-velocity features (HVFs) have been observed in several absorption lines in many Type Ia supernovae (SNe Ia). The frequency and ubiquity of these components in silicon and calcium features specifically indicates that the mechanism through which they form must be common occurrence among the majority of SNe Ia. Here we present modelling of the HVF evolution in a sample of six well observed SNe Ia with the radiative-transfer code tardis. A base model is derived for each of the SNe to reproduce the photospheric velocity components, followed by a grid of simulations with Gaussian enhancements to the density profile at high velocities. We train a set of neural networks to emulate the impact of these density enhancements upon the simulated silicon line profile. These networks are subsequently used within a Markov-Chain Monte Carlo (MCMC) framework to infer the density enhancement parameters that most closely reproduce the HVF evolution. While we obtain good matches for the silicon profile, we find that a single density enhancement alone cannot simultaneously produce the observed silicon and calcium HVF evolution. Our findings indicate that neither the delayed-detonation mechanism, nor the double-detonation mechanism can produce these HVFs, suggesting that something may be missing from the models."}
{"id": "2512.13846", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.13846", "abs": "https://arxiv.org/abs/2512.13846", "authors": ["Roman Krivonos", "Silvia Manconi", "Vadim Arefiev", "Andrei Bykov", "Fiorenza Donato", "Ekaterina Filippova", "Alexander Lutovinov", "Mattia Di Mauro", "Kaya Mori", "Alexey Tkachenko", "Jooyun Woo"], "title": "A wide-field X-ray search for the Geminga pulsar halo with SRG/ART-XC", "comment": "7 pages, 6 figures. Accepted for publication in Astronomy & Astrophysics", "summary": "Searches for the putative large-scale X-ray halo around the Geminga pulsar have been extensively performed using various narrow field-of-view X-ray telescopes. In this paper, we present wide-field scanning observation of Geminga with SRG/ART-XC. Our X-ray analysis provides, for the first time, direct imaging of a $3.5^\\circ \\times 3.5^\\circ$ region in the $4-12$ keV energy band, comparable in extent to the expected Geminga emission. The ART-XC observation provides a highly uniform sky coverage without strong vignetting effects. The synchrotron X-ray halo flux was predicted using a physical model based on particle injection, diffusion, and cooling over the pulsar's lifetime, as well as the spectral and spatial properties of the synchrotron X-ray and inverse-Compton gamma-ray emissions. The model is tuned to reproduce existing multiwavelength data from X-ray upper limits and GeV to TeV gamma-ray observations. After accounting for the high particle background and its uncertainties, no significant emission is found in the assumed source region, and X-ray flux upper limits are derived. These limits are less constraining by up to a factor of three with respect to existing results obtained with narrow field-of-view telescopes and longer exposure times. Nonetheless, we place direct and independent constraints on Geminga's ambient magnetic field strength, which are compatible with other studies. Our methodology, including simulation for longer observation times, is applied for the first time to the wide field-of-view search for pulsar halos. Using extensive simulations, we also show that a 68% probability of detecting the Geminga pulsar halo can be achieved with a 20-day SRG/ART-XC exposure for a 3 $μG$ magnetic field."}
{"id": "2512.14198", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.14198", "abs": "https://arxiv.org/abs/2512.14198", "authors": ["P. Fauverge", "P. Jean", "K. Sokolovsky", "C. C. Cheung", "M. Lemoine-Goumard", "M. -H. Grondin", "L. Chomiuk", "A. Dickenson", "J. D. Linford", "K. Mukai", "J. L. Sokoloski"], "title": "Fermi-LAT detections of novae V1723 Sco and V6598 Sgr", "comment": null, "summary": "Context. Numerous classical novae have been observed to emit γ-rays (E > 100 MeV) detected by the Fermi-LAT. The prevailing hypothesis attributes this emission to the interaction of accelerated particles within shocks in the nova ejecta. However, the lack of non-thermal X-ray detection coincident with the γ-rays remains a challenge to this theory. Methods. We performed similar analyses of the Fermi-LAT data for both novae to determine the duration, localization, and spectral properties of the γ-ray emission. These results were compared with optical data from the AAVSO database and X-ray observations from NuSTAR, available for V1723 Sco 2024 only, to infer the nature of the accelerated particles. Finally, we used a physical emission model to extract key parameters related to particle acceleration. Results. V1723 Sco 2024 was found to be a very bright γ-ray source with an emission duration of 15 days allowing us to constrain the spectral index and the total energy of accelerated protons. Despite early NuSTAR observations, no non-thermal X-ray emission was detected simultaneously with the γ-rays. However, unexpected γ-ray and thermal hard X-ray emission were observed more than 40 days after the nova outburst, suggesting that particle acceleration can occur even several weeks post-eruption. V6598 Sgr 2023, on the other hand, was detected by the Fermi-LAT at a significance level of 4σover just two days, one of the shortest γ-ray emission durations ever recorded, coinciding with a rapid decline in optical brightness. Finally, the high ratio of γ-ray to optical luminosities and γ-ray to X-ray luminosities for both novae, as well as the curvature of the γ-ray spectrum of V1723 Sco below 500 MeV, are all more consistent with the hadronic than the leptonic scenario for γ-ray generation in novae."}
{"id": "2512.13743", "categories": ["astro-ph.IM", "astro-ph.EP", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2512.13743", "abs": "https://arxiv.org/abs/2512.13743", "authors": ["Oem Trivedi", "Abraham Loeb"], "title": "Evolving the Loeb Scale", "comment": "8 pages with no figures, comments are very welcome !", "summary": "We develop a differential formulation of the Loeb Scale that extends the original static framework into a radially evolving, real time classification scheme for interstellar objects. By promoting each anomaly metric to a function of heliocentric distance and introducing a relaxation equation for the effective score, our method incorporates memory, hysteresis and predictive capability. This allows us to have early, stable forecasts of an object's eventual Loeb level based on sparse data obtained at large distances, which is more helpful to quantify its true nature when near Earth."}
{"id": "2512.14356", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.14356", "abs": "https://arxiv.org/abs/2512.14356", "authors": ["Dominik P. Pacholski", "Sandro Mereghetti", "Martin Topinka"], "title": "INTEGRAL IBIS catalog of magnetar bursts", "comment": "17 pages, 6 figures, 7 tables. Accepted for publication in ApJ", "summary": "One of the distinctive properties of magnetars, young neutron stars powered mainly by magnetic energy, is the emission of short ($\\lesssim$1 s) bursts of hard X-rays. Such bursts have been observed in nearly all the known magnetars, although at different and time-variable rates of occurrence. In the last two decades, the INTEGRAL satellite has extensively covered with good imaging capabilities the Galactic plane, where most magnetars reside. We present the results of a comprehensive search for magnetar bursts in more than twenty years of archival data of the INTEGRAL IBIS instrument (15 keV - 1 MeV). This led to the detection of 1349 bursts with 30-150 keV fluence in the $\\sim2\\times10^{-9} - 3\\times10^{-6}$ erg cm$^{-2}$ range from 21 of the 34 examined magnetars and candidate magnetars with well known positions. The durations of the bursts, in terms of $T_{90}$, follow a lognormal distribution centered at $\\sim0.1$ s. Most of the detected bursts originated from three particularly active sources: 1E 1547-5408, SGR 1806-20, and SGR 1935+2154. The integral distributions of their burst fluences follow power laws with slopes $β$= 0.76$\\pm$0.04, 0.95$\\pm$0.06, and 0.92$\\pm$0.10, respectively. The burst spectra are generally well fit with an exponentially cut-off power law with peak energy $E_{peak}$ in the range $\\sim20-60$ keV for SGR 1806-20 and SGR 1935+2154, while the bursts of 1E 1547-5408 are slightly harder ($E_{peak}\\sim35-100$ keV). A significant anti-correlation between $E_{peak}$ and fluence is found for SGR 1806-20, which provided the largest number of bursts among the sources of our sample."}
{"id": "2512.13756", "categories": ["astro-ph.IM", "astro-ph.EP"], "pdf": "https://arxiv.org/pdf/2512.13756", "abs": "https://arxiv.org/abs/2512.13756", "authors": ["Ignas Snellen", "Sebastiaan Haffert", "Matthew Kenworthy", "Tomas Stolker"], "title": "The next frontier in exoplanet science: Imaging our neighbouring planetary systems", "comment": "White Paper - ESO 2040 Expanding Horizons, 3 pages, no figures", "summary": "Transmission and eclipse spectroscopy have been invaluable tools for the characterisation of extrasolar planet atmospheres. While they will continue to provide many new insights and discoveries in the decade(s) to come, these methods are running up against sources of stellar noise from stellar surface inhomogeneities and variability. In this white paper we discuss how the next steps in the characterisation of small, temperate rocky planets requires high-contrast imaging, making the planetary systems around our closest neighbouring stars the new frontier in exoplanet science. The Extremely Large Telescopes (ELTs) will be at the forefront of this quest. The Planetary Camera and Spectrograph (PCS) on ESO's ELT and GmagAO-X on the GMT are planned to become operational in the 2035-2040 time-frame, allowing the characterisation of up to dozen(s) of rocky planets around nearby red dwarf stars. We discuss what role there will be still to play for ground-based exoplanet characterisation in the era of the space-borne Habitable Worlds Observatory and LIFE missions."}
{"id": "2512.14479", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.14479", "abs": "https://arxiv.org/abs/2512.14479", "authors": ["Stella Boula", "Apostolos Mastichiadis", "Demosthenes Kazanas"], "title": "A one-parameter two-zone leptonic model for the blazar sequence", "comment": "5 pages, 5 figures, 2 tables accepted for publication in A&A Letters", "summary": "Blazars, a subclass of radio-loud active galactic nuclei with relativistic jets aligned close to our line of sight, emit highly variable non-thermal radiation across the electromagnetic spectrum. The physical origin of their emission and the blazar sequence remain open questions. We present a self-consistent two-zone leptonic model in which relativistic electrons accelerate in a compact region, losing energy via synchrotron and inverse Compton processes, and escape into a larger zone permeated by an external photon field associated with magnetohydrodynamic winds from the accretion disk. By varying only the mass accretion rate onto the central black hole, the model naturally reproduces the blazar sequence, including Compton Dominance, $γ$-ray spectral indices, and the positions of synchrotron and inverse Compton peaks, while variations in secondary parameters account for the observed spread in the data. Flat Spectrum Radio Quasars exhibit strong external Compton emission from the extended zone, whereas BL Lac objects are dominated by synchrotron and synchrotron self-Compton emission from the compact acceleration region. This framework highlights the key role of accretion rate and spatially structured emission zones in shaping blazar spectra and provides a unified interpretation of their diverse phenomenology."}
{"id": "2512.13766", "categories": ["astro-ph.IM", "astro-ph.EP"], "pdf": "https://arxiv.org/pdf/2512.13766", "abs": "https://arxiv.org/abs/2512.13766", "authors": ["Michiel Min", "Jo Barstow", "Laura C. Mayorga", "Hannah Wakeford", "Jason Wang", "Renyu Hu", "Beth Biller", "José A. Caballero", "Ludmila Carone", "Sarah Casewell", "Katy L. Chubb", "Mario Damiano", "Siddharth Gandhi", "Antonio García Muñoz", "Christiane Helling", "Finnegan Keller", "Nataliea Lowson", "Evert Nasedkin", "Ryan MacDonald", "Jean-Baptiste Ruffio", "Evgenya Shkolnik", "Christopher C. Stark"], "title": "Direct imaging characterization of cool gaseous planets", "comment": "Habitable Worlds Observatory (HWO) Science Case Development Document (SCDD), presented at the \"Towards the Habitable Worlds Observatory: Visionary Science and Transformational Technology\" conference in July 2025, and to be published in the conference proceedings", "summary": "Cool gas giant exoplanets, particularly those with properties similar to those of Jupiter and Saturn, remain poorly characterized due to current observational limitations. This white paper outlines the transformative science case for the Habitable Worlds Observatory (HWO) to directly image and spectroscopically characterize a broad range of gaseous exoplanets with effective temperatures below 400 K. The study focuses on determining key atmospheric properties, including molecular composition, cloud and haze characteristics, and temperature structure, across planets of varying sizes and orbital separations. Leveraging reflected light spectroscopy and polarimetry, HWO will enable comparative planetology of cool gas giants orbiting both solar-type and M-dwarf stars, bridging the observational gap between hot exoplanets and Solar System giants. We present observational requirements and survey strategies necessary to uncover correlations between atmospheric properties and planetary or stellar parameters. This effort will establish critical constraints on planetary formation, cloud microphysics, and the role of photochemistry under diverse irradiation conditions. The unique capabilities of HWO will make it the first facility capable of characterizing true exo-Jupiters in reflected light, thus offering an unprecedented opportunity to place the Solar System in a broader galactic context."}
{"id": "2512.14592", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.14592", "abs": "https://arxiv.org/abs/2512.14592", "authors": ["Eva dos Santos"], "title": "Probing hadronic interactions at the 100 TeV scale with the Pierre Auger Observatory", "comment": null, "summary": "Extensive air showers produced by the interaction of ultra-high-energy cosmic rays ($E > 10^{18}$ eV) in the Earth's atmosphere provide a challenging yet unique channel to probe hadronic interactions at the 100 TeV center-of-mass energy scale. Over more than 20 years of operation, the Pierre Auger Observatory has delivered invaluable insights into the modeling of hadronic interactions at energies beyond human-made particle accelerators. Notably, predictions from current models of hadronic interactions yield a muon deficit that becomes more pronounced with energy when compared to measurements. Presently, the interpretation of the nuclear mass composition estimated from the muon content is in tension with that from direct measurements of the depth of the maximum of electromagnetic profiles. Yet, the measured fluctuations of the muon content of air showers are in agreement with model predictions. These findings hint at small deviations in hadronic models that accumulate throughout the whole shower development rather than at large errors in the calculation of the first hadronic interactions. Also, in an independent, data-driven analysis, we show that the muon deficit can be alleviated if we allow a shift of the predicted depth of the maximum of air-shower profiles by 30 -50 g cm$^{-2}$ towards a heavier mass composition. More recently, we have also provided an updated measurement of the proton-proton cross-section at a center-of-mass energy of 57 TeV and the first estimates of the neutron content of air showers by exploiting late-time signals from the surface scintillator detectors of AugerPrime, the present upgrade of the Observatory. With the advent of AugerPrime, we expect to deliver breakthrough results on the 100 TeV-scale hadronic interactions in the next decade."}
{"id": "2512.13802", "categories": ["astro-ph.IM", "astro-ph.GA", "astro-ph.HE", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2512.13802", "abs": "https://arxiv.org/abs/2512.13802", "authors": ["Simone Scaringi", "Domitilla de Martino", "Anna F. Pala", "Andrea Sanna", "Paul Groot", "Kieran O'Brien", "Alessandro Ederoclite", "Noel Castro Segura", "Deanne L. Coppejans", "Krystian Ilkiewicz", "Piergiorgio Casella", "David Buckley", "Thomas Kupfer", "Nanda Rea", "Meryem Kubra DAG", "Yusuke Tampo", "Siqi Zhang", "Sian Ford", "Martina Veresvarska", "Graham Wynn"], "title": "How Mass Flows Through Accretion Discs: A Spectral-Timing Vision for the 2040s", "comment": "White paper in response to ESO's \"Expanding Horizons\" call", "summary": "Understanding how mass and angular momentum flow through accretion discs remains a fundamental unsolved problem in astrophysics. Accreting white dwarfs offer an ideal laboratory for addressing this question: their variability occurs on accessible timescales of seconds to minutes, and their optical spectra contain continuum and emission-line components that trace distinct disc regions. Broad-band timing studies have revealed time-lags similar to those observed in X-ray binaries and active galactic nuclei, suggesting propagating fluctuations and possible coupling to an inner hot flow. However, the blending of line and continuum light in broad filters prevents a physical interpretation of these signals. The 2040s will bring an unprecedented number of disc-accreting systems discovered by Rubin-LSST, space-based gravitational-wave observatories, and third-generation ground and space-based detectors. To extract disc physics from these sources, high-cadence optical spectral-timing, simultaneously resolving continuum and individual lines, is essential. Such measurements would directly map how variability propagates through discs, determine how the outer disc responds to changes in the inner flow, and test whether accretion physics is scale-invariant from white dwarfs to supermassive black holes. This white paper outlines the scientific motivation and observational capabilities required to realise this vision. It highlights the opportunity for ESO to enable a transformative new window on accretion physics in the coming decade."}
{"id": "2512.13802", "categories": ["astro-ph.IM", "astro-ph.GA", "astro-ph.HE", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2512.13802", "abs": "https://arxiv.org/abs/2512.13802", "authors": ["Simone Scaringi", "Domitilla de Martino", "Anna F. Pala", "Andrea Sanna", "Paul Groot", "Kieran O'Brien", "Alessandro Ederoclite", "Noel Castro Segura", "Deanne L. Coppejans", "Krystian Ilkiewicz", "Piergiorgio Casella", "David Buckley", "Thomas Kupfer", "Nanda Rea", "Meryem Kubra DAG", "Yusuke Tampo", "Siqi Zhang", "Sian Ford", "Martina Veresvarska", "Graham Wynn"], "title": "How Mass Flows Through Accretion Discs: A Spectral-Timing Vision for the 2040s", "comment": "White paper in response to ESO's \"Expanding Horizons\" call", "summary": "Understanding how mass and angular momentum flow through accretion discs remains a fundamental unsolved problem in astrophysics. Accreting white dwarfs offer an ideal laboratory for addressing this question: their variability occurs on accessible timescales of seconds to minutes, and their optical spectra contain continuum and emission-line components that trace distinct disc regions. Broad-band timing studies have revealed time-lags similar to those observed in X-ray binaries and active galactic nuclei, suggesting propagating fluctuations and possible coupling to an inner hot flow. However, the blending of line and continuum light in broad filters prevents a physical interpretation of these signals. The 2040s will bring an unprecedented number of disc-accreting systems discovered by Rubin-LSST, space-based gravitational-wave observatories, and third-generation ground and space-based detectors. To extract disc physics from these sources, high-cadence optical spectral-timing, simultaneously resolving continuum and individual lines, is essential. Such measurements would directly map how variability propagates through discs, determine how the outer disc responds to changes in the inner flow, and test whether accretion physics is scale-invariant from white dwarfs to supermassive black holes. This white paper outlines the scientific motivation and observational capabilities required to realise this vision. It highlights the opportunity for ESO to enable a transformative new window on accretion physics in the coming decade."}
{"id": "2512.13813", "categories": ["astro-ph.IM", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2512.13813", "abs": "https://arxiv.org/abs/2512.13813", "authors": ["Sven Wedemeyer", "Stefaan Poedts", "Stanislav Gunár", "Manuela Temmer", "Astrid Veronig", "Valery Nakariakov", "Mats Kirkaune", "Claudia Cicone", "Stephen White", "Jasmina Magdalenić", "Roman Brajša", "Bart De Pontieu", "Maryam Saberi", "Atul Mohan", "Davor Sudar", "Galina Motorina", "Maria Lukicheva", "Paulo Simões"], "title": "Millimeter-Wavelength Observations of the Active Sun: Unveiling the Origins of Space Weather", "comment": "4 pages, 3 figures; This white paper was submitted to ESO Expanding Horizons in support of AtLAST", "summary": "Societal dependence on space-based services demands major advances in predicting the impacts of eruptive solar events. Millimeter-wavelength observations offer uniquely direct access to the time-dependent physical conditions in the atmospheric layers of the Sun where these events originate. A facility capable of full-disk, high-cadence, multi-frequency imaging would provide a transformative view of the Sun and its influence on the heliosphere. AtLAST is ideally suited to deliver this capability, and to establish a European leadership role in advancing the scientific foundations that will enable reliable, operational space-weather forecasting for the first time."}
{"id": "2512.13960", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.13960", "abs": "https://arxiv.org/abs/2512.13960", "authors": ["A. Miraval Zanon", "G. Illiano", "F. Ambrosino", "D. de Martino", "M. C. Baglio", "C. Ballocco", "D. Buckle", "F. Coti Zelati", "M. Del Santo", "P. J. Groot", "R. La Placa", "C. Malacaria", "A. Marino", "A. Papitto", "N. Rea", "A. Sanna", "S. Scaringi", "J. Turner", "A. Veledina", "L. Zampieri"], "title": "The multiple facets of millisecond pulsar binaries", "comment": "White Paper - ESO Expanding Horizons: Transforming Astronomy in the 2040s", "summary": "Millisecond pulsar (MSP) binaries are unique laboratories for studying matter and radiation under extreme conditions that are unattainable on Earth. Recent detections of optical millisecond pulsations from three systems in distinct evolutionary stages have opened an entirely new observational window to investigate particle acceleration, pulsar-disk interplay, and intrabinary wind interactions. These discoveries reveal unexpectedly diverse emission mechanisms across accretion regimes, with optical efficiencies in some systems far exceeding those predicted by rotation-powered models. Despite decades of research, key questions remain unresolved: are optical pulsations a universal property of MSPs? How does the presence of an accretion disk boost the conversion of spin-down power into coherent optical emission? What physical processes drive the observed fast variability, and how do pulsar and companion winds regulate mass transfer and binary evolution? Addressing these fundamental problems requires high-time-resolution optical observations, rapid-response observing capabilities, and time-resolved spectroscopy at moderate spectral resolution to map disk and intrabinary-shock variability. Future facilities dedicated to time domain astronomy present a unique opportunity to perform a systematic exploration of optical pulsars across all MSP evolutionary stages for the first time and answer the above-mentioned fundamental questions."}
{"id": "2512.13861", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2512.13861", "abs": "https://arxiv.org/abs/2512.13861", "authors": ["J. De Miguel", "E. Hatziminaoglou", "J. Prieto-Polo", "J. D. Marrero-Falcón", "Abaz Kryemadhi"], "title": "The search for dark matter axions from neutron stars in the inner parsecs of the Milky Way with AtLAST", "comment": "This white paper was submitted to ESO Expanding Horizons in support of AtLAST", "summary": "The magnetospheres of neutron stars in the Galactic Center provide an exceptional environment to search for dark matter axions through their resonant conversion into photons. The combination of extreme magnetic fields and high dark matter density in this region creates ideal conditions for axion-photon conversion across the centimetre-to-submillimetre wavelength range. Detecting the cumulative emission from these neutron star populations demands a facility with unprecedented sensitivity, spatial resolution, and broad frequency coverage in the submillimetre domain, capabilities essential to explore a previously inaccessible region of axion parameter space."}
{"id": "2512.14470", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.14470", "abs": "https://arxiv.org/abs/2512.14470", "authors": ["F. Coti Zelati", "P. G. Jonker", "C. P. Gutiérrez", "S. Mattila", "D. Pollacco", "N. Rea", "P. Charalampopoulos", "M. A. P. Torres", "T. Muñoz Darias", "M. C. Baglio", "L. Galbany", "E. Villaver"], "title": "Why the Northern Hemisphere Needs a 30-40 m Telescope and the Science at Stake: Time-domain astronomy", "comment": "White Paper submitted to \"ESO Expanding Horizons: Transforming Astronomy in the 2040s\"", "summary": "We outline the science case for a 30-40 m optical/infrared telescope in the Northern Hemisphere, optimised for transformative time-domain astronomy in the 2040s. Upcoming multi-wavelength and multi-messenger facilities will reveal fast, faint, rapidly evolving Northern transients whose earliest phases carry decisive diagnostics. A Northern ELT with rapid response, broad wavelength coverage, high time resolution, polarimetric capabilities, and diffraction-limited imaging is essential to capture these phases and secure deep spectroscopy and photometry as transients fade. These capabilities will enable recovery of key physical information and detailed characterisation of transient environments, while also enabling unprecedented studies of accretion phenomena at all scales. Among potential sites, La Palma uniquely combines atmospheric stability, complementary longitude to ESO's ELT, protected dark skies, and robust infrastructure to host this facility."}
{"id": "2512.13916", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2512.13916", "abs": "https://arxiv.org/abs/2512.13916", "authors": ["Taylan Demir", "Atakan Koçyiğit"], "title": "Atangana-Baleanu Regularized Wavelet Compression For Astronomical Time-Series", "comment": "14 pages, 3 figures", "summary": "Astronomical light curves are noisy and irregular, so compression must reduce size without erasing weak transients. We propose a fractional wavelet compression method where wavelet coefficients are regularized via an Atangana Baleanu Caputo derivative with a nonsingular Mittag Leffler kernel. The induced long memory smoothing suppresses noise while preserving coherent transits, flares and oscillations. We give the coefficient level formulation, an efficient implementation, and comparisons with classical discrete wavelet thresholding, showing competitive compression with improved retention of low-amplitude events."}
{"id": "2512.14546", "categories": ["astro-ph.IM", "astro-ph.CO", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.14546", "abs": "https://arxiv.org/abs/2512.14546", "authors": ["Samaya Nissanke", "Nikhil Sarin", "Chris Copperwheat", "Sarah Antier", "David Berge", "Pablo Bosch", "Archisman Ghosh", "Paul Groot", "Gregg Hallinan", "Tanja Hinderer", "Kenta Hotokezaka", "Theophanes Karydas", "Mansi Kasliwal", "Yves Kini", "Rubina Kotak", "Kumiko Kotera", "Marek Kowalski", "Luke Krauth", "Kruthi Krishna", "Thomas Kupfer", "Paraskevas Lampropoulos", "Andrew Levan", "Ioannis Liodis", "Lea Marcotulli", "Kunal Mooley", "Silvia Piranomonte", "Nanda Rea", "Martin Roth", "Simone Scaringi", "Steve Schulze", "Lami Suleiman", "Nial Tanvir", "Angela Zegarelli", "Sylvia J. Zhu"], "title": "Multi-messenger and time-domain astronomy in the 2040s", "comment": "4 pages, 2 figures. White paper submitted to ESO Expanding Horizons call", "summary": "Multi-messenger astronomy will be transformed in the 2040s by an unprecedented volume of detections from next-generation gravitational wave, high-energy, and ultra-high energy neutrino, cosmic ray, and time domain observatories. This white paper, prepared for the European Southern Observatory (ESO) Expanding Horizons call, outlines the key science questions enabled by this emerging multi-messenger ecosystem, ranging from nucleosynthesis and dense matter physics to cosmology, fundamental physics, and the growth of black holes across cosmic time. We demonstrate that fully exploiting these discoveries requires a step change in optical to near infrared spectroscopic capability, including low latency response, high throughput, and flexible time domain operations across both hemispheres. We argue that without a dedicated large-aperture time domain facility, the scientific return of multi-messenger astronomy in the 2040s will be considerably limited."}
{"id": "2512.13924", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2512.13924", "abs": "https://arxiv.org/abs/2512.13924", "authors": ["Mike Peel", "Dave Clements", "Tony Mroczkowski", "Allen Foster"], "title": "Detection and characterisation of submm transient sources with a large single-dish telescope", "comment": "This white paper was submitted to ESO Expanding Horizons in support of AtLAST", "summary": "The exploration of the time-variable astronomical sky at submm wavelengths is rapidly becoming more feasible with large sky surveys by Cosmic Microwave Background telescopes with tens of thousands of detectors. Observations with the Atacama Cosmology Telescope and South Pole Telescope have already detected some transients, and Simons Observatory and CCAT are expected to detect many more in the near future. Follow-up observations to characterise these transients, and surveying to uncovering fainter populations, will need high sensitivity and large fields of view at submm wavelengths, which could be provided by large single dish telescopes such as AtLAST."}
{"id": "2512.14644", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.14644", "abs": "https://arxiv.org/abs/2512.14644", "authors": ["Xinyue Sheng", "Tuan Dung Pham", "Zichi Zhang", "Matt Nicholl", "Thai Son Mai"], "title": "Attention-Based Preprocessing Framework for Improving Rare Transient Classification", "comment": "Submitted to ApJ", "summary": "With large numbers of transients discovered by current and future imaging surveys, machine learning is increasingly applied to light curve and host galaxy properties to select events for follow-up. However, finding rare types of transients remains difficult due to extreme class imbalances in training sets, and extracting features from host images is complicated by the presence of bright foreground sources, particularly if the true host is faint or distant. Here we present a data augmentation pipeline for images and light curves that mitigates these issues, and apply this to improve classification of Superluminous Supernovae Type I (SLSNe-I) and Tidal Disruption Events (TDEs) with our existing NEEDLE code. The method uses a Similarity Index to remove image artefacts, and a masking procedure that removes unrelated sources while preserving the transient and its host. This focuses classifier attention on the relevant pixels, and enables arbitrary rotations for class upsampling. We also fit observed multi-band light curves with a two-dimensional Gaussian Process and generate data-driven synthetic samples by resampling and redshifting these models, cross-matching with galaxy images in the same class to produce unique but realistic new examples for training. Models trained with the augmented dataset achieve substantially higher purity: for classifications with a confidence of 0.8 or higher, we achieve 75% (43%) purity and 75% (66%) completeness for SLSNe-I (TDEs)."}
{"id": "2512.13960", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.13960", "abs": "https://arxiv.org/abs/2512.13960", "authors": ["A. Miraval Zanon", "G. Illiano", "F. Ambrosino", "D. de Martino", "M. C. Baglio", "C. Ballocco", "D. Buckle", "F. Coti Zelati", "M. Del Santo", "P. J. Groot", "R. La Placa", "C. Malacaria", "A. Marino", "A. Papitto", "N. Rea", "A. Sanna", "S. Scaringi", "J. Turner", "A. Veledina", "L. Zampieri"], "title": "The multiple facets of millisecond pulsar binaries", "comment": "White Paper - ESO Expanding Horizons: Transforming Astronomy in the 2040s", "summary": "Millisecond pulsar (MSP) binaries are unique laboratories for studying matter and radiation under extreme conditions that are unattainable on Earth. Recent detections of optical millisecond pulsations from three systems in distinct evolutionary stages have opened an entirely new observational window to investigate particle acceleration, pulsar-disk interplay, and intrabinary wind interactions. These discoveries reveal unexpectedly diverse emission mechanisms across accretion regimes, with optical efficiencies in some systems far exceeding those predicted by rotation-powered models. Despite decades of research, key questions remain unresolved: are optical pulsations a universal property of MSPs? How does the presence of an accretion disk boost the conversion of spin-down power into coherent optical emission? What physical processes drive the observed fast variability, and how do pulsar and companion winds regulate mass transfer and binary evolution? Addressing these fundamental problems requires high-time-resolution optical observations, rapid-response observing capabilities, and time-resolved spectroscopy at moderate spectral resolution to map disk and intrabinary-shock variability. Future facilities dedicated to time domain astronomy present a unique opportunity to perform a systematic exploration of optical pulsars across all MSP evolutionary stages for the first time and answer the above-mentioned fundamental questions."}
{"id": "2512.14279", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2512.14279", "abs": "https://arxiv.org/abs/2512.14279", "authors": ["Martin M. Roth", "Paško Roje", "Stella Vješnica", "Stefan Cikota", "Alex J. Brown", "Mike Kretlow", "Marco Azzaro", "Santiago Reinhart", "Jesús Aceituno", "Thomas Kupfer"], "title": "The ORCA-TWIN qCMOS Project I. Commissioning at Calar Alto Observatory", "comment": "10 pages, 12 figures, submitted to A&A", "summary": "Aims. We describe a pilot study to explore a new generation of fast and low noise CMOS image sensors for time domain astronomy, using two remote telescopes with a baseline of 1800 km. Methods. Direct imaging with novel qCMOS image sensor technology that combines fast readout with low readout noise. Synchronized observations from two remote telescope sites will be used to explore new approaches for measuring solar system bodies, precision stellar photometry, and speckle imaging. Results. A fast-track installation of an ORCA-Quest 2 camera at the Calar Alto Observatory (CAHA) 1.23m telescope has demonstrated the potential of the qCMOS technology for time domain astronomy. Conclusions. qCMOS technology generally outperforms classical CCDs for high-cadence imaging on 1-m telescopes, although EMCCDs remain competitive, and in some cases slightly superior, for very short exposures and faint sources."}
{"id": "2512.14343", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2512.14343", "abs": "https://arxiv.org/abs/2512.14343", "authors": ["A. Pérez-Aguilera", "M. Molina-Delicado", "T. Dietrich", "L. A. Tejedor", "J. A. Barrio", "A. Upegui", "Q. Berthet", "J. Buces", "D. Nieto", "D. Martín-Domínguez", "T. Miener"], "title": "Development of a Central Trigger Processor board for the Advanced SiPM based camera of the CTA Large-Sized Telescopes", "comment": "Contribution to the Towpical Workshop for Particle Physics 2025 conference", "summary": "We present ongoing work on the Central Trigger Processor board (CTPb), a trigger subsystem for the future advanced SiPM-based Large-Sized Telescope (LST) camera of the Cherenkov Telescope Array Observatory (CTAO). The camera will implement a fully digital trigger, exploiting the increased resolution to improve discrimination of low-energy $γ$-ray events from Night Sky Background noise. This approach aims to enhance telescope sensitivity while satisfying strict timing and data rate constraints. We describe the CTPb conceptual design and report initial results from hardware prototypes under evaluation within this next-generation trigger architecture."}
{"id": "2512.14407", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2512.14407", "abs": "https://arxiv.org/abs/2512.14407", "authors": ["Alessandro Fasano", "Mateo Fernández-Torreiro", "Guillermo Pascual-Cisneros", "Roger John Hoyland", "Francisco Javier Casas-Reinares", "Ricardo Tanausú Génova-Santos", "Michael William Peel", "Rafael Rebolo-López", "José Alberto Rubiño-Martín"], "title": "QUIJOTE-TFGI polarization calibration -- Ground characterization and on-sky validation with Tau A and the Moon", "comment": "19 pages, 16 figures, submitted to A&A", "summary": "Our objective is to characterize the QUIJOTE Thirty and Forty GHz instrument (TFGI), calibrate it with a reference calibration signal on the ground, compare our results with on-sky calibration based on bright sources, and study the stability of the calibration parameters over time. First, from the ground, we fit the data using a reference calibration signal (a diode) introduced to resolve degeneracies among the various instrument angles. Finally, we utilize on-sky observations of Tau A and the Moon to validate the results. By creating calibration datasets obtained with the reference diode, we evaluate the data quality and quantify phase switch errors to account for the fine polarization response. We also utilize Tau A and Moon observations to calibrate the system's response and stability over time. In addition, we calculate the refraction index of the Moon to be $n_{Moon}$ = 1.209 $\\pm$ 0.007 (stat) $\\pm$ 0.005 (sys) at 31 GHz under smooth-surface assumption. The results from fitting the instrument phase-switch error angle align with 0 deg at 2$σ$ precision, indicating that no further correction is required within a few percent precision. The calibrations with astrophysical sources (Tau A and the Moon) yield consistent results that constrain the polarization angle and responsivity. The polarization efficiency aligns well with ground measurements and the Tau A characterization, whereas the Moon-based calibration is more affected by systematics. We find hints of responsivity variations over time, although the relative responsivity between channels is found to remain stable. In the future, we conclude that installing a live calibrator will enhance performance by continuously monitoring responsivity and, in turn, improving the mitigation of systematic effects."}
{"id": "2512.14470", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.14470", "abs": "https://arxiv.org/abs/2512.14470", "authors": ["F. Coti Zelati", "P. G. Jonker", "C. P. Gutiérrez", "S. Mattila", "D. Pollacco", "N. Rea", "P. Charalampopoulos", "M. A. P. Torres", "T. Muñoz Darias", "M. C. Baglio", "L. Galbany", "E. Villaver"], "title": "Why the Northern Hemisphere Needs a 30-40 m Telescope and the Science at Stake: Time-domain astronomy", "comment": "White Paper submitted to \"ESO Expanding Horizons: Transforming Astronomy in the 2040s\"", "summary": "We outline the science case for a 30-40 m optical/infrared telescope in the Northern Hemisphere, optimised for transformative time-domain astronomy in the 2040s. Upcoming multi-wavelength and multi-messenger facilities will reveal fast, faint, rapidly evolving Northern transients whose earliest phases carry decisive diagnostics. A Northern ELT with rapid response, broad wavelength coverage, high time resolution, polarimetric capabilities, and diffraction-limited imaging is essential to capture these phases and secure deep spectroscopy and photometry as transients fade. These capabilities will enable recovery of key physical information and detailed characterisation of transient environments, while also enabling unprecedented studies of accretion phenomena at all scales. Among potential sites, La Palma uniquely combines atmospheric stability, complementary longitude to ESO's ELT, protected dark skies, and robust infrastructure to host this facility."}
{"id": "2512.14523", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2512.14523", "abs": "https://arxiv.org/abs/2512.14523", "authors": ["Giorgio Pariani", "Guido Agapito", "Demetrio Magrin", "Matteo Munari", "Lorenzo Busoni", "Marco Riva", "Andrea Di Rocco", "Paolo Ciliegi"], "title": "Interfacing adaptive optics simulations with the optical model: a powerful tool for MORFEO", "comment": "Proceeding of the SPIE conference Adaptive Optics Systems IX, SPIE Astronomical Telescopes + Instrumentation 2024", "summary": "In the framework of the MORFEO project, the Multi-Conjugated Adaptive Optics (MCAO) module for the European Extremely Large Telescope (ELT), we developed an integrated modeling tool to interface the optical model with the adaptive optics simulations, called ASSO (Adaptive opticS Simulation interfaced with Optical model). This tool is our asso nella manica (ace in the hole) to predict the performances of the AO relay, i.e., to estimate the wavefront error within the technical and scientific fields of view after AO correction. The tool is based on the IDL based simulator PyrAmid Simulator Software for Adaptive opTics Arcetri (PASSATA), on Zemax OpticStudio for the optical modelling, and on Matlab as interface software."}
{"id": "2512.14546", "categories": ["astro-ph.IM", "astro-ph.CO", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.14546", "abs": "https://arxiv.org/abs/2512.14546", "authors": ["Samaya Nissanke", "Nikhil Sarin", "Chris Copperwheat", "Sarah Antier", "David Berge", "Pablo Bosch", "Archisman Ghosh", "Paul Groot", "Gregg Hallinan", "Tanja Hinderer", "Kenta Hotokezaka", "Theophanes Karydas", "Mansi Kasliwal", "Yves Kini", "Rubina Kotak", "Kumiko Kotera", "Marek Kowalski", "Luke Krauth", "Kruthi Krishna", "Thomas Kupfer", "Paraskevas Lampropoulos", "Andrew Levan", "Ioannis Liodis", "Lea Marcotulli", "Kunal Mooley", "Silvia Piranomonte", "Nanda Rea", "Martin Roth", "Simone Scaringi", "Steve Schulze", "Lami Suleiman", "Nial Tanvir", "Angela Zegarelli", "Sylvia J. Zhu"], "title": "Multi-messenger and time-domain astronomy in the 2040s", "comment": "4 pages, 2 figures. White paper submitted to ESO Expanding Horizons call", "summary": "Multi-messenger astronomy will be transformed in the 2040s by an unprecedented volume of detections from next-generation gravitational wave, high-energy, and ultra-high energy neutrino, cosmic ray, and time domain observatories. This white paper, prepared for the European Southern Observatory (ESO) Expanding Horizons call, outlines the key science questions enabled by this emerging multi-messenger ecosystem, ranging from nucleosynthesis and dense matter physics to cosmology, fundamental physics, and the growth of black holes across cosmic time. We demonstrate that fully exploiting these discoveries requires a step change in optical to near infrared spectroscopic capability, including low latency response, high throughput, and flexible time domain operations across both hemispheres. We argue that without a dedicated large-aperture time domain facility, the scientific return of multi-messenger astronomy in the 2040s will be considerably limited."}
{"id": "2512.14606", "categories": ["astro-ph.IM", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2512.14606", "abs": "https://arxiv.org/abs/2512.14606", "authors": ["Loredana Prisinzano", "Germano G. Sacco", "Francesco Damiani", "Amelia Bayo", "Salvatore Sciortino", "Marco Tarantino", "Rosaria Bonito", "Fatemeh Zahra Majid"], "title": "The Dynamics of the Milky Way: Unveiling the 6D Skeleton of Star Formation in the 2040s", "comment": "Cover page plus 3 pages according to the guidelines issued by the ESO Expanding Horizons initiative 2025 (call for White Papers)", "summary": "The Milky Way (MW) is our unique laboratory to test star formation theories at the level of individual stars, serving as the Rosetta Stone to interpret extragalactic observations. The proposed White Paper focuses on the following key questions regarding the structure and evolution of the MW traced by young stellar populations: Q1. How do large-scale dynamical instabilities, like warps and vertical waves, drive the star formation of the Galactic thin disk? Q2. Do star-forming regions form stochastically, driven by local self-propagating feedback, or are they triggered by a common dynamical process acting on Galactic scales? Do internal feedback loops and external interactions tend to sustain or quench star formation in the MW? Q3. Are the clustered star-forming regions the only environments where stars form, or can stars also form in more diffuse structures such as the stellar strings?"}
{"id": "2512.14644", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.14644", "abs": "https://arxiv.org/abs/2512.14644", "authors": ["Xinyue Sheng", "Tuan Dung Pham", "Zichi Zhang", "Matt Nicholl", "Thai Son Mai"], "title": "Attention-Based Preprocessing Framework for Improving Rare Transient Classification", "comment": "Submitted to ApJ", "summary": "With large numbers of transients discovered by current and future imaging surveys, machine learning is increasingly applied to light curve and host galaxy properties to select events for follow-up. However, finding rare types of transients remains difficult due to extreme class imbalances in training sets, and extracting features from host images is complicated by the presence of bright foreground sources, particularly if the true host is faint or distant. Here we present a data augmentation pipeline for images and light curves that mitigates these issues, and apply this to improve classification of Superluminous Supernovae Type I (SLSNe-I) and Tidal Disruption Events (TDEs) with our existing NEEDLE code. The method uses a Similarity Index to remove image artefacts, and a masking procedure that removes unrelated sources while preserving the transient and its host. This focuses classifier attention on the relevant pixels, and enables arbitrary rotations for class upsampling. We also fit observed multi-band light curves with a two-dimensional Gaussian Process and generate data-driven synthetic samples by resampling and redshifting these models, cross-matching with galaxy images in the same class to produce unique but realistic new examples for training. Models trained with the augmented dataset achieve substantially higher purity: for classifications with a confidence of 0.8 or higher, we achieve 75% (43%) purity and 75% (66%) completeness for SLSNe-I (TDEs)."}
