{"id": "2509.05406", "categories": ["astro-ph.IM", "astro-ph.HE", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2509.05406", "abs": "https://arxiv.org/abs/2509.05406", "authors": ["Zexuan Wu", "Subo Dong", "Andrew P. Gould", "Przemek Mróz", "A. Mérand"], "title": "\"Industrial-Scale\" Black Hole Selection without a Satellite", "comment": null, "summary": "The forthcoming GRAVITY+ instrument promises to usher in an era of\n\"industrial-scale\" mass measurements of isolated black holes (BHs), with the\npotential to assemble a sample of many tens of BHs via interferometric\nmicrolensing over several years. A key challenge will be selecting\ninterferometric follow-up targets from an order-of-magnitude larger pool of\nongoing microlensing events when using traditional selection based on event\ntimescale alone. Gould (2023) proposed a criterion optimized for BH selection\nusing space-based microlens parallax measurements enabled by a satellite. We\nadapt it to work with microlens parallax constraints obtainable from\nground-based data only. Using Galactic simulations, we show that our selection\ncriterion is highly efficient, expecting to detect about a dozen BHs per year\nwith GRAVITY+ from following up ~35 selected events."}
{"id": "2509.05527", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.05527", "abs": "https://arxiv.org/abs/2509.05527", "authors": ["Luca Riitano", "Justin Vandenbroucke", "Zach Curtis-Ginsberg"], "title": "The Schwarzschild-Couder Telescope for the Cherenkov Telescope Array Observatory", "comment": "8 pages, 9 figures, ICRC 2025", "summary": "The Cherenkov Telescope Array Observatory (CTAO) will greatly improve upon\nsensitivities in the field of very-high-energy gamma-ray astrophysics. The CTAO\nnorthern site (CTAO-North, La Palma, Spain) currently hosts LST-1 with the\nremaining three large-sized telescopes (LSTs) expected in mid-2026 and one\nmedium-sized telescope (MST) expected in mid-2027. The CTAO southern site\n(CTAO-South, Paranal, Chile) expects the delivery of five small-sized\ntelescopes (SSTs) and two MSTs in early 2026 with on-site construction\nbeginning in mid-2026. The dual-mirrored Schwarzschild-Couder Telescope (SCT)\nis a candidate MST for CTAO-South and is capable of observations in the energy\nrange of 100 GeV to 10 TeV, the core of CTAO's 20 GeV to 300 TeV energy range.\nInaugurated in January 2019, the prototype SCT (pSCT) located at the Fred\nLawrence Whipple Observatory in southern Arizona observed gamma-ray emission\nfrom the Crab Nebula at a significance of 8.6 sigma in 2020. The pSCT utilizes\na novel dual-mirror optics design and a densely packed focal plane of silicon\nphotomultipliers (SiPMs). An upgrade of the pSCT camera is underway to fully\ninstrument the camera with 11,328 pixels and an 8-degree diameter FoV. In\naddition, upgraded electronics will lower the front-end electronics noise,\nallowing for a lower trigger threshold and improved event reconstruction and\nbackground rejection. This work will present the status of the upgrade of the\npSCT and discuss the future of the SCT."}
{"id": "2509.05645", "categories": ["astro-ph.IM", "astro-ph.EP", "cs.CV", "cs.RO"], "pdf": "https://arxiv.org/pdf/2509.05645", "abs": "https://arxiv.org/abs/2509.05645", "authors": ["Yan-Shan Lu", "Miguel Arana-Catania", "Saurabh Upadhyay", "Leonard Felicetti"], "title": "Stereovision Image Processing for Planetary Navigation Maps with Semi-Global Matching and Superpixel Segmentation", "comment": "8 pages, 6 figures, 2 tables. ESA ASTRA 2025", "summary": "Mars exploration requires precise and reliable terrain models to ensure safe\nrover navigation across its unpredictable and often hazardous landscapes.\nStereoscopic vision serves a critical role in the rover's perception, allowing\nscene reconstruction by generating precise depth maps through stereo matching.\nState-of-the-art Martian planetary exploration uses traditional local\nblock-matching, aggregates cost over square windows, and refines disparities\nvia smoothness constraints. However, this method often struggles with\nlow-texture images, occlusion, and repetitive patterns because it considers\nonly limited neighbouring pixels and lacks a wider understanding of scene\ncontext. This paper uses Semi-Global Matching (SGM) with superpixel-based\nrefinement to mitigate the inherent block artefacts and recover lost details.\nThe approach balances the efficiency and accuracy of SGM and adds context-aware\nsegmentation to support more coherent depth inference. The proposed method has\nbeen evaluated in three datasets with successful results: In a Mars analogue,\nthe terrain maps obtained show improved structural consistency, particularly in\nsloped or occlusion-prone regions. Large gaps behind rocks, which are common in\nraw disparity outputs, are reduced, and surface details like small rocks and\nedges are captured more accurately. Another two datasets, evaluated to test the\nmethod's general robustness and adaptability, show more precise disparity maps\nand more consistent terrain models, better suited for the demands of autonomous\nnavigation on Mars, and competitive accuracy across both non-occluded and\nfull-image error metrics. This paper outlines the entire terrain modelling\nprocess, from finding corresponding features to generating the final 2D\nnavigation maps, offering a complete pipeline suitable for integration in\nfuture planetary exploration missions."}
{"id": "2509.06103", "categories": ["astro-ph.IM", "astro-ph.EP", "cs.RO", "physics.space-ph"], "pdf": "https://arxiv.org/pdf/2509.06103", "abs": "https://arxiv.org/abs/2509.06103", "authors": ["Divij Gupta", "Arkajit Aich"], "title": "Advancing Resource Extraction Systems in Martian Volcanic Terrain: Rover Design, Power Consumption and Hazard Analysis", "comment": "23 pages, 5 figures", "summary": "This study proposes a schematic plan for in-situ resource utilization (ISRU)\nin Martian volcanic terrains. The work investigated the complexity of volcanic\nterrains and Martian environmental hazards and suggested comprehensive\nengineering strategies to overcome the odds and establish a successful mining\nprogram in Martian volcanic regions. Slope stabilization methods - such as\nterracing and anchored drilling rigs - with terrain-adaptive rovers capable of\nautonomous operations on steep unstable slopes has been suggested as feasible\nsolutions to navigate the complex geological terrains of Martian volcanoes. The\nmid range rover design with a mass of approximately 2.1 t, proposed here for\nmining operations, incorporates a six-wheel rocker-bogie suspension,\nanchoring-enabled drilling arm, dust-mitigation solar arrays, and advanced\nsensing systems for hazard detection and navigation. A comparative analysis\nregarding choice of roads and rails for building transport infrastructure has\nalso been performed. We have also looked into the energy requirement of the\nrover to work under extreme environmental conditions of Mars and suggested a\ncombination of solar and nuclear power to account for the huge energy\nrequirements of sustained operations on Mars. The results demonstrate that\nmission success in these environments depends on integrating mechanical\nresilience, environmental adaptability, and operational autonomy, enabling\nsustainable access to resources in one of Mars' most geologically challenging\nsettings."}
{"id": "2509.05405", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.05405", "abs": "https://arxiv.org/abs/2509.05405", "authors": ["Noah Franz", "Kate D Alexander", "Sebastian Gomez", "Collin T Christy", "Tanmoy Laskar", "Sjoert van Velzen", "Nicholas Earl", "Suvi Gezari", "Mitchell Karmen", "Raffaella Margutti", "Jeniveve Pearson", "V. Ashley Villar", "Ann I Zabludoff"], "title": "The Open mulTiwavelength Transient Event Repository (OTTER): Infrastructure Release and Tidal Disruption Event Catalog", "comment": "Submitted to ApJ. The OTTER web interface is available at\n  https://otter.idies.jhu.edu and the API documentation (including example\n  python notebooks demonstrating usage) is available at\n  https://astro-otter.readthedocs.io. Comments are welcome! Please submit any\n  comments and feedback on GitHub at\n  https://github.com/astro-otter/otter/issues/new/choose", "summary": "Multiwavelength analyses of astrophysical transients are essential for\nunderstanding the physics of these events. To make such analyses more efficient\nand effective, we present the Open mulTiwavelength Transient Event Repository\n(OTTER), a publicly available catalog of published transient event metadata and\nphotometry. Unlike previous efforts, our data schema is optimized for the\nstorage of multiwavelength photometric datasets spanning the entire\nelectromagnetic spectrum. Open source software, including an application\nprogramming interface (API) and web application, are available for viewing,\naccessing, and analyzing the dataset. For the initial release of OTTER, we\npresent the largest ever photometric archive of tidal disruption events (TDEs),\nincluding $\\gtrsim 80,000$ observations of 232 TDEs spanning from radio to\nX-ray wavelengths. We demonstrate the power of this infrastructure through four\nexample analyses of the TDE population. We plan to maintain this dataset as\nmore TDEs are discovered in the future and encourage other users to contribute\nby uploading newly published data via our web application. The infrastructure\nwas built with the goal of archiving additional transient data (supernovae,\ngamma-ray bursts, fast blue optical transients, fast radio bursts, etc.) in the\nfuture. The web application is available at https://otter.idies.jhu.edu and the\nAPI documentation is available at https://astro-otter.readthedocs.io."}
{"id": "2509.06141", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.06141", "abs": "https://arxiv.org/abs/2509.06141", "authors": ["Eric Mayotte", "Austin Cummings", "Paul Degarate", "Neville DeWitt Pierrat", "Johannes Eser", "William Finch", "Julia Burton-Heibges", "Tobias Heibges", "Eric Mentzell", "Stephan Meyer", "Conrad Shay", "Benjamin Stillwell", "Yoshiyuki Takizawa", "Luke Wanner", "Lawrence Wiencke"], "title": "The Optical and Mechanical Design of POEMMA Balloon with Radio", "comment": "10 pages, 6 figures, Procceedings for ICRC 25", "summary": "POEMMA Balloon with Radio (PBR) is a NASA super-pressure balloon mission\nbuilding toward the proposed Probe Of Extreme Multi-Messenger Astrophysics\n(POEMMA) dual satellite mission. In its planned 2027 launch, PBR will study\nUltra-High-Energy Cosmic Rays, Neutrinos, and High-Altitude Horizontal\nAirshowers from 33 km above the Earth. By operating at balloon altitudes, PBR\nwill provide a novel vantage point to study air-shower physics while offering\ncompetitive instantaneous exposure to neutrinos from transient astrophysical\nphenomena. The payload's optical instrument is a 0.95 m$^2$ aperture hybrid\nSchmidt telescope with a 3.81 m$^2$ segmented mirror focusing light onto a\nFluorescence Camera and a bi-focalized Cherenkov Camera. The payload will also\nfeature a Radio Instrument consisting of two sinuous antennas based on the\nPayload for Ultrahigh Energy Observations (PUEO) low-frequency instrument. A\ncombined gamma ray/x-ray detector and IR cloud camera round out the\ninstrumentation package, meaning PBR will be the first multi-hybrid\nballoon-borne multi-messenger observatory flown. This extensive instrumentation\nmust be combined into a radio quiet payload that satisfies the scientific needs\nand can operate in near vacuum at extreme temperatures, all while meeting NASA\nsafety requirements and weighing no more than 3000 lbs (1361 kg). Accomplishing\nthese tasks together will mark a significant step toward establishing\ntechnological readiness for the POEMMA satellite mission. We present an\noverview of PBR's mechanical and optical systems, additionally detailing our\nstrategies to mitigate electromagnetic interference for the radio instrument\nand prepare for the harsh near-space environment."}
{"id": "2509.05415", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2509.05415", "abs": "https://arxiv.org/abs/2509.05415", "authors": ["Fulya Kıroğlu", "Kyle Kremer", "Frederic A. Rasio"], "title": "Beyond Hierarchical Mergers: Accretion-Driven Origins of Massive, Highly Spinning Black Holes in Dense Star Clusters", "comment": "Submitted for publication in The Astrophysical Journal Letters. 10\n  pages, 4 figures, 2 tables", "summary": "GW231123, the most massive binary black hole (BBH) merger detected by\nLIGO/Virgo/KAGRA, highlights the need to understand the origins of massive,\nhigh-spin stellar black holes (BHs). Dense star clusters provide natural\nenvironments for forming such systems, beyond the limits of standard massive\nstar evolution to core collapse. While repeated BBH mergers can grow BHs\nthrough dynamical interactions (the so-called \"hierarchical merger\" channel),\nmost star clusters with masses $\\lesssim 10^6\\,M_\\odot$ have escape speeds too\nlow to retain higher-generation BHs, limiting growth into or beyond the mass\ngap. In contrast, BH--star collisions with subsequent accretion of the\ncollision debris can grow and retain BHs irrespective of the cluster escape\nspeed. Using $N$-body (Cluster Monte Carlo) simulations, we study BH growth and\nspin evolution through this process and we find that accretion can drive BH\nmasses up to at least $\\sim200\\,M_\\odot$, with spins set by the details of the\ngrowth history. BHs up to about $150\\,M_\\odot$ can reach dimensionless spins\n$\\chi \\gtrsim 0.7$ via single coherent episodes, while more massive BHs form\nthrough multiple stochastic accretion events and eventually spin down to $\\chi\n\\lesssim 0.4$. These BHs later form binaries through dynamical encounters,\nproducing BBH mergers that contribute up to $\\sim10\\%$ of all detectable\nevents, comparable to predictions for the hierarchical channel. However, the\ntwo pathways predict distinct signatures: hierarchical mergers yield more\nunequal mass ratios, whereas accretion-grown BHs preferentially form\nnear-equal-mass binaries. The accretion-driven channel allows dense clusters\nwith low escape speeds, such as globular clusters, to produce highly spinning\nBBHs with both components in or above the mass gap, providing a natural\nformation pathway to GW231123-like systems."}
{"id": "2509.06310", "categories": ["astro-ph.IM", "astro-ph.EP"], "pdf": "https://arxiv.org/pdf/2509.06310", "abs": "https://arxiv.org/abs/2509.06310", "authors": ["Guang-Yuan Song", "Zhen-Zhao Tao", "Bo-Lun Huang", "Yan Cui", "Bo Yu", "Tong-Jie Zhang"], "title": "A Deep SETI Search for Technosignatures in the TRAPPIST-1 System with FAST", "comment": "10 pages, 5 figures, Submitted to AJ", "summary": "The Five-hundred-meter Aperture Spherical Telescope (FAST) is the world's\nlargest single-dish radio telescope, and the search for extraterrestrial\nintelligence (SETI) is one of its five key science objectives. We conducted a\ntargeted narrowband search toward the TRAPPIST-1 system using FAST. The\nobservations consisted of five independent L-band pointings, each with a\n20-minute integration, for a total on-source time of 1.67h. The frequency\ncoverage spanned 1.05--1.45GHz with a spectral resolution of ~7.5Hz. We\nsearched for narrowband drifting signals with Doppler drift rates within\n+_4Hz/s and a signal-to-noise ratio threshold of S/N>10 in two orthogonal\nlinear polarizations separately.Based on the system parameters adopted in this\nwork, we estimate a minimum detectable equivalent isotropic radiated power of\n2.04x10^10W, placing one of the most stringent constraints to date on\npersistent or high-duty-cycle narrowband transmitters in this system. No\ncredible technosignature candidates were identified within the searched\nparameter space. Nevertheless,TRAPPIST-1 remains a compelling target for future\nSETI efforts. We plan to extend our search to other signal types, such as\nperiodic or transient transmitters, and to carry out broader surveys of nearby\nexoplanetary systems with FAST."}
{"id": "2509.05427", "categories": ["astro-ph.HE", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2509.05427", "abs": "https://arxiv.org/abs/2509.05427", "authors": ["Alexander A. Mushtukov", "Emir Tataroglu", "Alex J. Cooper", "Sergey S. Tsygankov"], "title": "Gamma-ray lines, electron-positron annihilation, and possible radio emission in X-ray pulsars", "comment": "submitted to MNRAS, 11 pages, 8 figures, comments are welcome", "summary": "Accretion onto neutron stars (NSs) in X-ray pulsars (XRPs) results in intense\nX-ray emission, and under specific conditions, high-energy nuclear interactions\nthat produce gamma-ray photons at discrete energies. These interactions are\nenabled by the high free-fall velocities of accreting nuclei near the NS\nsurface and give rise to characteristic gamma-ray lines, notably at 2.2 MeV,\n5.5 MeV, and 67.5 MeV. We investigate the production mechanisms of these lines\nand estimate the resulting gamma-ray luminosities, accounting for the\nsuppression effects of radiative deceleration in bright XRPs and the creation\nof electron-positron pairs in strong magnetic fields. The resulting\nannihilation of these pairs leads to a secondary emission line at $\\sim 511$\nkeV. We also discuss the possibility that non-stationary pair creation in the\npolar cap region could drive coherent radio emission, though its detectability\nin accreting systems remains uncertain. Using a numerical framework\nincorporating general relativistic light bending and magnetic absorption, we\ncompute the escape fraction of photons and distinguish between actual and\napparent gamma-ray luminosities. Our results identify the parameter space -\ndefined by magnetic field strength, accretion luminosity, and NS compactness -\nwhere these gamma-ray signatures may be observable by upcoming MeV gamma-ray\nmissions. In particular, we highlight the diagnostic potential of detecting\ngravitationally redshifted gamma-ray lines and annihilation features for\nprobing the mass-radius relation and magnetospheric structure of NSs."}
{"id": "2509.06315", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.06315", "abs": "https://arxiv.org/abs/2509.06315", "authors": ["Csanád Horváth", "Natasha Hurley-Walker", "Samuel J. McSweeney", "Timothy J. Galvin", "John Morgan"], "title": "A long period transient search method for the Murchison Widefield Array", "comment": "13 pages, 9 figures, 2 tables, accepted for publication in PASA", "summary": "We present an automated search method for radio transients on the minute\ntimescale focused on the emerging long period transients (LPTs) in image-plane\nradio data. The method is tuned for use with the Murchison Widefield Array\n(MWA) and tested on archival observations from the GaLactic and Extragalactic\nAll-Sky MWA Extended Survey (GLEAM-X) in the 70--300 MHz range. The images are\nformed from model-subtracted visibilities, before applying three filters to the\ntime series of each pixel in an image, with each filter designed to be\nsensitive to a different transient behaviour. Due to the nature of radio\ninterferometry and the refraction of the fluctuating ionosphere, the vast\nmajority of candidates at this stage are artefacts which we identify and remove\nusing a set of flagging measures. Of the 336 final candidates, 7 were genuine\ntransients; 1 new LPT, 1 new pulsar, and 5 known pulsars. The performance of\nthe method is analysed by injecting modelled transient pulses into a subset of\nthe observations and applying the method to the result."}
{"id": "2509.05519", "categories": ["astro-ph.HE", "astro-ph.CO", "hep-ph"], "pdf": "https://arxiv.org/pdf/2509.05519", "abs": "https://arxiv.org/abs/2509.05519", "authors": ["Odelia V. Hartl", "Evan Vienneau", "Evan Battaes", "Addy J. Evans", "Nassim Bozorgnia", "Louis E. Strigari"], "title": "Enhancements in velocity-dependent dark matter annihilation in Galactic subhalos", "comment": "15 pages, 4 figures", "summary": "We examine velocity-dependent dark matter annihilation in subhalos using a\nsample of six Milky Way-like galaxies from the Aurgia simulation suite. We\nquantify the enhancement in the annihilation rate in subhalos when including\nthe contribution from particles in the smooth component of the halo that\noverlap with the subhalos. The enhancement in the annihilation rate scales with\nthe smooth component of the host halo dark matter density, and is evident for\nsubhalos over the resolvable mass range. Maximal enhancement factors are ~ 48\nfor p-wave models, and ~ 37,000 for d-wave models. For p and d-wave\nannihilation models, ~ 13 and ~ 6 subhalos, respectively, across all six host\nhalos have emission from dark matter annihilation in their direction that is\nabove the foreground emission from the smooth dark matter component, and would\ntherefore be resolvable as sources. Such subhalos with the most significant\nenhancement factors tend to be on the lower end of the mass range and located\ncloser to the center of the host galaxy. We provide a prescription to calculate\nthe enhancement for subhalos as a function of distance from the Galactic\ncenter, and use this to examine the impact on dark matter limits from a couple\nof example dwarf spheroidals. We show that, including the enhancement factors,\nlimits from individual dwarf spheroidals are at a cross section scale that may\napproach those derived from the Galactic center."}
{"id": "2509.06343", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.06343", "abs": "https://arxiv.org/abs/2509.06343", "authors": ["Fedor Tairli"], "title": "Cloud Detection using Night Sky Background Light at the Pierre Auger Observatory", "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC\n  2025). 12 pages, 11 figures", "summary": "Rejection of cloud-contaminated data is a complex and important process at\nthe Pierre Auger Observatory, one which combines information from several\nsources, including IR cameras, lidars, and satellite imaging. With the\ndeteriorating quality of the IR cameras and challenges in using other sources,\nwe propose a new method. We use continuous detector monitoring measurements to\nbuild a large database of night sky background fluxes for each pixel across 27\ntelescopes. Using this database, we generate the expected background flux and\ndefine cloud rejection thresholds. Through a straightforward analysis we\nconstruct boolean cloud-contamination masks. We demonstrate some results of the\nanalysis, including comparisons with cloud detected using infra-red\nobservations."}
{"id": "2509.05530", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.05530", "abs": "https://arxiv.org/abs/2509.05530", "authors": ["Douglas R. Bergman", "Toshihiro Fujii", "Kozo Fujisue", "Keitaro Fujita", "Jihyun Kim", "Diego Ravignani", "Felix Riehn", "Markus Roth", "Francesco Salamida", "Yoshiki Tsunesada", "Valerio Verzi"], "title": "Updated comparison of the UHECR energy spectra measured by the Pierre Auger Observatory and the Telescope Array", "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC\n  2025). 8 pages, 4 figures", "summary": "The Pierre Auger and Telescope Array joint Working Group on the UHECR energy\nspectrum was established in 2012 to analyze energy scale uncertainties in both\nexperiments and to in vestigate their systematic differences, particularly in\nthe spectral shape of the flux measurements. Previous studies have indeed shown\nthat, within systematic uncertainties, the energy s pectra measured by the two\nobservatories are consistent below~$10\\,\\mathrm{EeV}$. However, at higher\nenergies, a significant difference remains. In this work, we re-examine this\ndiscrepan cy in greater detail and explore its possible origins. We consider\nsystematic and statistical uncertainties, including the conversion from\ndirectly measured observables to energy and the calculation of exposures. We\npresent an updated energy scale comparison between the two experiments and\nupdated flux measurements in the common declination band."}
{"id": "2509.06489", "categories": ["astro-ph.IM", "gr-qc"], "pdf": "https://arxiv.org/pdf/2509.06489", "abs": "https://arxiv.org/abs/2509.06489", "authors": ["Rutger van Haasteren", "Bruce Allen", "Joseph D. Romano"], "title": "Optimal robust detection statistics for pulsar timing arrays", "comment": "11 pages, 3 figures", "summary": "Pulsar timing arrays (PTAs) seek to detect a nano-Hz stochastic\ngravitational-wave background (GWB) by searching for the characteristic\nHellings and Downs angular pattern of timing residual correlations. So far, the\nevidence remains below the conventional $5$-$\\sigma$ threshold, as assessed\nusing the literature-standard ``optimal cross-correlation detection\nstatistic''. While this quadratic combination of cross-correlated data\nmaximizes the {\\em deflection} (signal-to-noise ratio), it does not maximize\nthe detection probability at fixed false-alarm probability (FAP), and therefore\nis not Neyman-Pearson (NP) optimal for the assumed noise and signal models. The\nNP-optimal detection statistic is a different quadratic form, but is not used\nbecause it also incorporates autocorrelations, making it more susceptible to\nuncertainties in the modeling of pulsar timing noise. Here, we derive the best\ncompromise: a quadratic detection statistic which is as close as possible to\nthe NP-optimal detection statistic (minimizing the variance of its difference\nwith the NP statistic) subject to the constraint that it only uses\ncross-correlations, so that it is less affected by pulsar noise modeling\nerrors. We study the performance of this new $\\NPMV$ statistic for a simulated\nPTA whose noise and (putative) signal match those of the NANOGrav 15-year data\nrelease: GWB amplitude $A_{\\rm gw}=2.1\\times 10^{-15}$ and spectral index\n$\\gamma=13/3$. Compared to the literature-standard ``optimal\" cross-correlation\ndetection statistic, the $\\NPMV$ statistic increases the detection probability\nby $47\\%$ when operating at a $5$-$\\sigma$ FAP of $\\alpha = 2.9 \\times\n10^{-7}$."}
{"id": "2509.05580", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.05580", "abs": "https://arxiv.org/abs/2509.05580", "authors": ["Vitaliy Kim", "Yerlan Aimuratov"], "title": "On the origin of super-global spin-up trends of X-ray pulsars in HMXB systems", "comment": "22 pages, 3 figures, 5 tables, accepted by ApJ", "summary": "Most X-ray pulsars in high-mass X-ray binary (HMXB) systems exhibit both\nglobal and local trends of spin acceleration (spin-up) and deceleration\n(spin-down). Moreover, decades-long monitored objects display even more general\nspin-up trends in their spin evolution and simultaneously demonstrate a\ndecrease in the orbital period, so-called orbital decay. Although obvious, this\ngeneral behavior leaves the open question of the energy source and the\nmechanism of angular momentum transfer that ensures the neutron star's spin\nacceleration. We hypothesize that the observed spin acceleration of X-ray\npulsars in HMXB (RLO and sgXRB) systems results from orbital angular momentum\ntransfer via tidal interactions with their massive companions. To study these\nphenomena, we sample five well-studied objects with the longest observational\nhistory of their spin periods from the population of known Galactic persistent\nX-ray pulsars in HMXB systems. We obtain the spin frequency change from the\nobservational data and estimate energy losses for orbital decay and pulsars'\nspin acceleration. We propose a new term of super-global spin-up trends, and\nshow that their observable values do not exceed theoretical upper limits\npredicted within the scenario of orbital decay due to the tidal interaction\nbetween the neutron star and its massive companion."}
{"id": "2509.06496", "categories": ["astro-ph.IM", "astro-ph.EP"], "pdf": "https://arxiv.org/pdf/2509.06496", "abs": "https://arxiv.org/abs/2509.06496", "authors": ["Sirinrat Sithajan", "Lalita Kaewbiang", "Hugh R. A. Jones", "Pakakaew Rittipruk", "Sukanya Meethong"], "title": "Identification of Likely Methane Absorption Features in the Optical Spectra of Titan", "comment": "Accepted for publication in AJ", "summary": "The optical spectra of Titan reveal a rich set of absorption features, most\nof which are likely associated with methane (CH$_4$). Methane is a key molecule\nin planetary and exoplanetary atmospheres, yet a comprehensive high-resolution\nlinelist at optical wavelengths remains incomplete. This study identified and\ncharacterized potential CH$_4$ absorption features in high-resolution optical\nspectra of Titan, providing essential data for linelist development and\nimproving CH$_4$ detection and characterization. We analyzed Titan spectra from\nthe ESPRESSO spectrograph (R $\\approx$ 190,000), identifying intrinsic features\nand measuring their relative strengths. A conservative detection approach was\nemployed, slightly overestimating solar and telluric contributions to\ndistinguish them from Titan's intrinsic features. To assess the impact of\nspectral resolution, we compared the ESPRESSO data with Titan UVES data (R\n$\\approx$ 110,000). We identified 6,195 absorption features in the ESPRESSO\nspectra potentially associated with CH$_4$, of which 5,436 are newly reported.\nESPRESSO detected twice as many features as UVES in overlapping regions,\nhighlighting the advantage of higher-resolution data. Most detected lines\nremained unresolved, so our reported features are primarily blended absorption\nstructures. We estimated the detection limit for feature identification to\ncorrespond to a CH$_4$ absorption coefficient of approximately 0.02\nkm-am$^{-1}$. Comparison of our results with a previous analysis of Titan UVES\nspectra and with experimental CH$_4$ data at a similar temperature showed good\nagreement, while some discrepancies were observed when compared with data\nacquired at a different temperature. We provide a comprehensive list of Titan\nabsorption features with key reliability metrics, along with Titan's intrinsic\nspectra, to support future studies."}
{"id": "2509.05628", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.05628", "abs": "https://arxiv.org/abs/2509.05628", "authors": ["R. Maccary", "C. Guidorzi", "M. Maistrello", "S. Kobayashi", "M. Bulla", "R. Moradi", "S. -X. Yi", "C. W. Wang", "W. L. Zhang", "W. -J. Tan", "S. -L Xiong", "S. -N. Zhang"], "title": "A set of distinctive properties ruling the prompt emission of GRB 230307A and other long γ-ray bursts from compact object mergers", "comment": "18 pages, 12 figures, 5 tables, published in JHEAP", "summary": "Short gamma-ray bursts (SGRBs), occasionally followed by a long and\nspectrally soft extended emission, are associated with compact object mergers\n(COMs). Yet, a few recent long GRBs (LGRBs) show compelling evidence for a COM\norigin, in contrast with the massive-star core-collapse origin of most LGRBs.\nWhile possible COM indicators were found, such as the minimum variability\ntimescale (MVT), a detailed and unique characterisation of their gamma-ray\nprompt emission that may help identify and explain their deceptively long\nprofile is yet to be found. Here we report the discovery of a set of\ndistinctive properties that rule the temporal and spectral evolution of GRB\n230307A, a LGRB with evidence for a COM origin. Specifically, the sequence of\npulses that make up its profile is characterised by an exponential evolution of\n(i) flux intensities, (ii) waiting times between adjacent pulses, (iii) pulse\ndurations, and (iv) spectral peak energy. Analogous patterns are observed in\nthe prompt emission of other long COM candidates. The observed evolution of\ngamma-ray pulses would imply that a relativistic jet is colliding with more\nslowly expanding material. This contrasts with the standard internal shock\nmodel for typical LGRBs, in which dissipation occurs at random locations within\nthe jet itself. We tentatively propose a few simple toy models that may explain\nthese properties and are able to reproduce the overall time profile."}
{"id": "2509.06788", "categories": ["astro-ph.IM", "astro-ph.CO"], "pdf": "https://arxiv.org/pdf/2509.06788", "abs": "https://arxiv.org/abs/2509.06788", "authors": ["Zhenyang Huang", "Haihao Shi", "Zhiyong Liu", "Na Wang"], "title": "An Interpretable AI Framework to Disentangle Self-Interacting and Cold Dark Matter in Galaxy Clusters: The CKAN Approach", "comment": "15 pages, 8 figures; accepted for publication in The Astronomical\n  Journal", "summary": "Convolutional neural networks have shown their ability to differentiate\nbetween self-interacting dark matter (SIDM) and cold dark matter (CDM) on\ngalaxy cluster scales. However, their large parameter counts and ''black-box''\nnature make it difficult to assess whether their decisions adhere to physical\nprinciples. To address this issue, we have built a Convolutional\nKolmogorov-Arnold Network (CKAN) that reduces parameter count and enhances\ninterpretability, and propose a novel analytical framework to understand the\nnetwork's decision-making process. With this framework, we leverage our network\nto qualitatively assess the offset between the dark matter distribution center\nand the galaxy cluster center, as well as the size of heating regions in\ndifferent models. These findings are consistent with current theoretical\npredictions and show the reliability and interpretability of our network. By\ncombining network interpretability with unseen test results, we also estimate\nthat for SIDM in galaxy clusters, the minimum cross-section\n$(\\sigma/m)_{\\mathrm{th}}$ required to reliably identify its collisional nature\nfalls between $0.1\\,\\mathrm{cm}^2/\\mathrm{g}$ and\n$0.3\\,\\mathrm{cm}^2/\\mathrm{g}$. Moreover, CKAN maintains robust performance\nunder simulated JWST and Euclid noise, highlighting its promise for application\nto forthcoming observational surveys."}
{"id": "2509.05885", "categories": ["astro-ph.HE", "astro-ph.SR", "gr-qc"], "pdf": "https://arxiv.org/pdf/2509.05885", "abs": "https://arxiv.org/abs/2509.05885", "authors": ["Ilya Mandel"], "title": "What is the most massive gravitational-wave source?", "comment": null, "summary": "In the presence of significant measurement uncertainties, the events which\nappear to be the most extreme are very likely to be those exhibiting the\ngreatest statistical fluctuations. It is therefore particularly important to\nexercise care when interpreting such events and to use the entire observed\npopulation for context. Here, I attempt to pedagogically illustrate this using\nthe example of the most massive binary black hole so far detected in\ngravitational-wave data, GW231123. I argue that its total mass may be\nsignificantly lower than $238^{+28}_{-49}$ solar masses as reported by Abac et\nal. (2025a). The maximum total binary black hole mass from an analysis of the\nentire detected population may well be less than 140 solar masses, but the\nvalue is very sensitive to assumptions about the population distribution."}
{"id": "2509.06840", "categories": ["astro-ph.IM", "gr-qc"], "pdf": "https://arxiv.org/pdf/2509.06840", "abs": "https://arxiv.org/abs/2509.06840", "authors": ["Liu Tao", "Pooyan Goodarzi", "Jonathan W. Richardson"], "title": "Error Signals for Overcoming the Laser Power Limits of Gravitational-Wave Detection", "comment": "8 pages, 5 figures", "summary": "A major barrier to improving the quantum-limited sensitivity of\ngravitational-wave observatories are the thermal distortions of the test masses\nwhich arise at megawatt laser power. Recent advances in a new form of\nhigher-order wavefront correction, in which corrective heating profiles are\napplied to the test mass surfaces near their edges, have the potential to\nenable a tenfold reduction of the quantum noise floor of future detectors.\nHowever, realizing high levels of quantum noise reduction in practice hinges on\nidentifying measurable error signals to finely control each wavefront actuator,\nin order to suppress wavefront errors to few-nanometer precision across the\nfull mirror apertures. No direct source of such an error signal exists in LIGO\ntoday. We demonstrate that thermally imaging the surface of each test mass can\nprovide these critical error signals. We show that the surface temperature\nprofiles obtained from thermal imaging can be uniquely mapped to a finite\nelement model of the mirror whose complete thermal state is identified,\nenabling full-aperture wavefront reconstruction and direct error signals for\nreal-time precision wavefront control. This new sensing capability can enable\nup to a 34% strain sensitivity improvement in LIGO A+ at 95% confidence,\nincreasing the sky-averaged detection range for binary neutron star mergers by\n11 Mpc, and will be integral to a next-generation 40-km gravitational-wave\nobservatory in the U.S., Cosmic Explorer."}
{"id": "2509.05957", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.05957", "abs": "https://arxiv.org/abs/2509.05957", "authors": ["Wei Li", "Shijun Dang", "Na Wang", "Chengmin Zhang", "Jingbo Wang", "Jianping Yuan", "Feifei Kou", "Yanqing Cai", "Zurong Zhou", "Shuangqiang Wang", "Lunhua Shang", "Juntao Bai", "Yirong Wen", "Jing Zou", "Zhixiang Yu"], "title": "FAST Observations of the Microstructure in Interpulse Pulsars", "comment": "accepted for publication in ApJS", "summary": "In this study, we investigate the microstructure properties of four pulsars\n(PSRs J0953+0755 (B0950+08), J0627+0706, J0826+2637 (B0823+26) and J1946+1805\n(B1944+17)) using the Five-hundred-meter Aperture Spherical radio Telescope\n(FAST), with particular emphasis on identifying microstructure within\ninterpulse (IP). Through the application of autocorrelation function (ACF)\nanalysis and fast Fourier transform (FFT) techniques, we have systematically\nexamined the periodicity of microstructure in these pulsars. Our findings\nrepresent the first successful detection of microstructure within IP.\nFurthermore, we conducted a comprehensive statistical analysis comparing the\ncharacteristic timescales ($\\tau_{\\mu}$) and the characteristic periods\n$P_{\\mu}$ of quasi-periodic microstructure between the main pulse (MP) and IP,\nand our results indicate that the $\\tau_{\\mu}$ and $P_{\\mu}$ of microstructure\nacross components appear consistent within measurement errors for PSR\nJ0627+0706, but microstructure in IP are relatively smaller than those in MP\nfor PSR J0953+0755. Furthermore, the relationship between $P_{\\mu}$ of\nmicrostructure and the rotation period in neutron star populations was\nreconfirmed: $P_{\\mu}(\\text{ms})=(1.337\\pm0.114)\\times\nP(\\text{s})^{(1.063\\pm0.038)}$."}
{"id": "2509.06903", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.06903", "abs": "https://arxiv.org/abs/2509.06903", "authors": ["Michele Cappellari"], "title": "PowerBin: Fast Adaptive Data Binning with Centroidal Power Diagrams", "comment": "13 pages, 8 figures. LaTeX. Submitted to MNRAS. Implementation\n  available in the PowerBin package: https://pypi.org/project/powerbin/", "summary": "Adaptive binning is a crucial step in the analysis of large astronomical\ndatasets, such as those from integral-field spectroscopy, to ensure a\nsufficient signal-to-noise ratio (S/N) for reliable model fitting. However, the\nwidely used Voronoi-binning method and its variants suffer from two key\nlimitations: they scale poorly with data size, often as O(N^2), creating a\ncomputational bottleneck for modern surveys, and they can produce undesirable\nnon-convex or disconnected bins. I introduce PowerBin, a new algorithm that\novercomes these issues. I frame the binning problem within the theory of\noptimal transport, for which the solution is a Centroidal Power Diagram (CPD),\nguaranteeing convex bins. Instead of formal CPD solvers, which are unstable\nwith real data, I develop a fast and robust heuristic based on a physical\nanalogy of packed soap bubbles. This method reliably enforces capacity\nconstraints even for non-additive measures like S/N with correlated noise. I\nalso present a new bin-accretion algorithm with O(N log N) complexity, removing\nthe previous bottleneck. The combined PowerBin algorithm scales as O(N log N),\nmaking it about two orders of magnitude faster than previous methods on\nmillion-pixel datasets. I demonstrate its performance on a range of simulated\nand real data, showing it produces high-quality, convex tessellations with\nexcellent S/N uniformity. The public Python implementation provides a fast,\nrobust, and scalable tool for the analysis of modern astronomical data."}
{"id": "2509.05973", "categories": ["astro-ph.HE", "hep-ph"], "pdf": "https://arxiv.org/pdf/2509.05973", "abs": "https://arxiv.org/abs/2509.05973", "authors": ["Masamitsu Mori", "Kanji Mori"], "title": "Long-term neutrino emission from a core-collapse supernova with axion-photon coupling", "comment": "10pages, 7 figures", "summary": "We perform long-term general-relativistic neutrino-radiation hydrodynamic\nsimulations for core-collapse supernovae (CCSNe) which include the cooling\neffect induced by the coupling between axion-like particles (ALPs) and photons.\nWe take into account the \\kanji{photon} coalescence and the Primakoff effect,\nand investigate ALPs with the mass of 10\\,MeV and the coupling constant\n$g_{a\\gamma}$ of $1.0\\times10^{-9}{\\rm \\,GeV^{-1}}$ to $7.0\\times10^{-9}{\\rm\n\\,GeV^{-1}}$. It is found that the effects of the ALP cooling emerge in the\nlate phase rather than the early phase and the ALP luminosities are always\nlower than the neutrino luminosity in our simulations. We estimate the number\nof neutrino events for Super-Kamiokande assuming a 10\\,kpc CCSN. We conclude\nthat signatures of ALPs could be found in the long-term neutrino signals from a\nnearby CCSN event in the future, even if $g_{a\\gamma}$ is below an upper limit\nbased on the conventional energy-loss argument."}
{"id": "2509.05405", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.05405", "abs": "https://arxiv.org/abs/2509.05405", "authors": ["Noah Franz", "Kate D Alexander", "Sebastian Gomez", "Collin T Christy", "Tanmoy Laskar", "Sjoert van Velzen", "Nicholas Earl", "Suvi Gezari", "Mitchell Karmen", "Raffaella Margutti", "Jeniveve Pearson", "V. Ashley Villar", "Ann I Zabludoff"], "title": "The Open mulTiwavelength Transient Event Repository (OTTER): Infrastructure Release and Tidal Disruption Event Catalog", "comment": "Submitted to ApJ. The OTTER web interface is available at\n  https://otter.idies.jhu.edu and the API documentation (including example\n  python notebooks demonstrating usage) is available at\n  https://astro-otter.readthedocs.io. Comments are welcome! Please submit any\n  comments and feedback on GitHub at\n  https://github.com/astro-otter/otter/issues/new/choose", "summary": "Multiwavelength analyses of astrophysical transients are essential for\nunderstanding the physics of these events. To make such analyses more efficient\nand effective, we present the Open mulTiwavelength Transient Event Repository\n(OTTER), a publicly available catalog of published transient event metadata and\nphotometry. Unlike previous efforts, our data schema is optimized for the\nstorage of multiwavelength photometric datasets spanning the entire\nelectromagnetic spectrum. Open source software, including an application\nprogramming interface (API) and web application, are available for viewing,\naccessing, and analyzing the dataset. For the initial release of OTTER, we\npresent the largest ever photometric archive of tidal disruption events (TDEs),\nincluding $\\gtrsim 80,000$ observations of 232 TDEs spanning from radio to\nX-ray wavelengths. We demonstrate the power of this infrastructure through four\nexample analyses of the TDE population. We plan to maintain this dataset as\nmore TDEs are discovered in the future and encourage other users to contribute\nby uploading newly published data via our web application. The infrastructure\nwas built with the goal of archiving additional transient data (supernovae,\ngamma-ray bursts, fast blue optical transients, fast radio bursts, etc.) in the\nfuture. The web application is available at https://otter.idies.jhu.edu and the\nAPI documentation is available at https://astro-otter.readthedocs.io."}
{"id": "2509.05976", "categories": ["astro-ph.HE", "astro-ph.SR", "gr-qc"], "pdf": "https://arxiv.org/pdf/2509.05976", "abs": "https://arxiv.org/abs/2509.05976", "authors": ["Zi-Yuan Wang", "Ying Qin", "Rui-Chong Hu", "Yuan-Zhu Wang", "Georges Meynet", "Han-Feng Song"], "title": "Reassessing the Spin of Second-born Black Holes in Coalescing Binary Black Holes and Its Connection to the chi_eff-q Correlation", "comment": "12 pages,8 figures,1 appendix,comments are welcome", "summary": "The mass ratio q and effective inspiral spin chi_eff of binary black hole\nmergers in GWTC-4.0 have been reported to display a weakeran ti-correlation\ncompared to GWTC-3, a feature whose origin has been explored by several groups.\nIn this work, within the isolated binary evolution framework, we adopt a\nrecently proposed wind prescription for helium stars to systematically\ninvestigate the spin of the second-born black hole and its role in shaping this\ncorrelation. Using the stellar and binary evolution code MESA, which includes a\nrecently proposed helium-star wind prescription alongside internal differential\nrotation and tidal interactions,we find that the recently proposed wind\nprescription for helium stars is substantially weaker than the standard Dutch\nwind scheme, particularly at subsolar metallicity. Using this scheme, we\nperform detailed binary modeling of a helium star with a black hole companion.\nOur results show that the spin magnitude of the resulting black hole is\ninsensitive to the helium star's evolutionary stage at the onset of tidal\ninteractions or to the companion mass. Instead, wind mass loss plays the\ndominant role: more massive helium-star progenitors produce lower-spinning\nblack holes. The initial stellar rotation has only a minor effect, especially\nunder strong tidal coupling, consistent with the common assumption of orbital\nsynchronization. Using the derived relation between the mass and spin of the\nsecond-born black hole, we find that the properties of most binary black holes\nin GWTC-4.0-specifically the mass ratio q and effective inspiral spin\nchi_eff-can be reproduced. We further show that the q-chi_eff correlation is\nsensitive to the assumed mass function (e.g., Gaussian and uniform\ndistribution), displaying notable deviations from the Power-Law+Peak model."}
{"id": "2509.05530", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.05530", "abs": "https://arxiv.org/abs/2509.05530", "authors": ["Douglas R. Bergman", "Toshihiro Fujii", "Kozo Fujisue", "Keitaro Fujita", "Jihyun Kim", "Diego Ravignani", "Felix Riehn", "Markus Roth", "Francesco Salamida", "Yoshiki Tsunesada", "Valerio Verzi"], "title": "Updated comparison of the UHECR energy spectra measured by the Pierre Auger Observatory and the Telescope Array", "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC\n  2025). 8 pages, 4 figures", "summary": "The Pierre Auger and Telescope Array joint Working Group on the UHECR energy\nspectrum was established in 2012 to analyze energy scale uncertainties in both\nexperiments and to in vestigate their systematic differences, particularly in\nthe spectral shape of the flux measurements. Previous studies have indeed shown\nthat, within systematic uncertainties, the energy s pectra measured by the two\nobservatories are consistent below~$10\\,\\mathrm{EeV}$. However, at higher\nenergies, a significant difference remains. In this work, we re-examine this\ndiscrepan cy in greater detail and explore its possible origins. We consider\nsystematic and statistical uncertainties, including the conversion from\ndirectly measured observables to energy and the calculation of exposures. We\npresent an updated energy scale comparison between the two experiments and\nupdated flux measurements in the common declination band."}
{"id": "2509.06145", "categories": ["astro-ph.HE", "gr-qc", "nucl-th"], "pdf": "https://arxiv.org/pdf/2509.06145", "abs": "https://arxiv.org/abs/2509.06145", "authors": ["Bhaskar Biswas"], "title": "Equation of State Extrapolation Systematics: Parametric vs. Nonparametric Inference of Neutron Star Structure", "comment": "10 pages, 6 figures", "summary": "The equation of state (EOS) of cold dense matter is a central open problem in\nnuclear astrophysics. Its inference is hindered by the lack of \\textit{ab\ninitio} control above about twice nuclear saturation density, requiring\nextrapolation. Parametric schemes such as piecewise polytropes (PP) are\nefficient but restrictive, while nonparametric approaches like Gaussian\nprocesses (GP) allow more flexibility at the cost of larger prior volumes. We\nextend our hybrid EOS framework by replacing the high-density polytropic\nextension with a GP representation of the squared sound speed, anchored at low\ndensities by the SLy crust EOS and a nuclear meta-model constrained by\n$\\chi$EFT and laboratory data. Using hierarchical Bayesian analysis, we jointly\nconstrain the EOS and neutron star mass distribution with multi-messenger\nobservations, including NICER radii, GW170817 and GW190425 tidal\ndeformabilities, pulsar masses, and neutron skin experiments. We examine four\nscenarios defined by high-density extrapolation (PP vs.\\ GP) and hotspot\ngeometry in the NICER modeling of PSR~J0030$+$0451 (ST+PDT vs.\\ PDT-U). GP\nextrapolations generally yield softer EOS posteriors with broader\nuncertainties. Hotspot assumptions also play an important role, shifting\ninferred mass--radius relations. Bayesian evidence strongly favors the ST+PDT\ngeometry over PDT-U under both extrapolations, while GP is mildly preferred\nover PP. These results underscore the impact of observational modeling and EOS\nextrapolation on neutron star inferences, and show that a GP-based extension\noffers a robust way to quantify systematic uncertainties in high-density\nmatter."}
{"id": "2509.06601", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.06601", "abs": "https://arxiv.org/abs/2509.06601", "authors": ["Nicolas De Angelis", "Philipp Azzarello", "Franck Cadoux", "Kurt Dittrich", "Yannick Favre", "Jochen Greiner", "Johannes Hulsman", "Coralie Husi", "Merlin Kole", "Hancheng Li", "Slawomir Mianowski", "Gabriel Pelleriti", "Agnieszka Pollo", "Nicolas Produit", "Dominik Rybka", "Jianchao Sun", "Xin Wu", "Shuang-Nan Zhang"], "title": "Gamma-Ray Burst Polarimetry with the POLAR and POLAR-2 missions", "comment": "12 pages, 11 figures, SPIE Optics+Photonics 2025 proceeding", "summary": "Gamma-Ray Bursts are among the most powerful and violent events in the\nUniverse. Despite over half a century of observations of these transient\nsources, many open questions remain about their nature and the physical\nemission mechanisms at play. Polarization measurements of the GRB prompt\ngamma-ray emission have long been theorized to be able to answer most of these\nquestions. Early polarization measurements did not allow to draw clear\nconclusions because of limited significance.\n  With the aim of better characterizing the polarization of these prompt\nemissions, a compact Gamma-Ray polarimeter called POLAR has been sent to space\nas part of the Tiangong-2 Chinese space lab for 6 months of operations starting\nSeptember 2016. The instrument detected 55 GRBs as well as several pulsars.\nTime-integrated polarization analysis of the 14 brightest detected GRBs has\nshown that the prompt emission is lowly polarized or fully unpolarized.\nHowever, time-resolved analysis depicted strong hints of an evolving\npolarization angle within single pulses, washing out the polarization degree in\ntime-integrated analyses. Energy-resolved polarization analysis has shown no\nconstraining results due to limited statistics. Hence, a more sensitive\n$\\gamma$-ray polarimeter is required to perform detailed energy and\ntime-resolved polarization analysis of the prompt gamma-ray emission of GRBs.\n  Based on the success of the POLAR mission, a larger-scale instrument,\napproved for launch to the China Space Station (CSS) in 2027, is currently\nbeing developed by a Swiss, Chinese, Polish, and German collaboration. Thanks\nto its large sensitivity in the 20-800~keV range, POLAR-2 will produce\npolarization measurements of at least 50 GRBs per year with a precision equal\nto or higher than the best results published by POLAR, allowing for good\nquality time and energy resolved analysis."}
{"id": "2509.06208", "categories": ["astro-ph.HE", "cs.LG"], "pdf": "https://arxiv.org/pdf/2509.06208", "abs": "https://arxiv.org/abs/2509.06208", "authors": ["Bikash Kharel", "Emmanuel Fonseca", "Charanjot Brar", "Afrokk Khan", "Lluis Mas-Ribas", "Swarali Shivraj Patil", "Paul Scholz", "Seth Robert Siegel", "David C. Stenning"], "title": "Repeating vs. Non-Repeating FRBs: A Deep Learning Approach To Morphological Characterization", "comment": "26 pages, 17 figures, submitted to ApJ", "summary": "We present a deep learning approach to classify fast radio bursts (FRBs)\nbased purely on morphology as encoded on recorded dynamic spectrum from\nCHIME/FRB Catalog 2. We implemented transfer learning with a pretrained\nConvNext architecture, exploiting its powerful feature extraction ability.\nConvNext was adapted to classify dedispersed dynamic spectra (which we treat as\nimages) of the FRBs into one of the two sub-classes, i.e., repeater and\nnon-repeater, based on their various temporal and spectral properties and\nrelation between the sub-pulse structures. Additionally, we also used\nmathematical model representation of the total intensity data to interpret the\ndeep learning model. Upon fine-tuning the pretrained ConvNext on the FRB\nspectrograms, we were able to achieve high classification metrics while\nsubstantially reducing training time and computing power as compared to\ntraining a deep learning model from scratch with random weights and biases\nwithout any feature extraction ability. Importantly, our results suggest that\nthe morphological differences between CHIME repeating and non-repeating events\npersist in Catalog 2 and the deep learning model leveraged these differences\nfor classification. The fine-tuned deep learning model can be used for\ninference, which enables us to predict whether an FRB's morphology resembles\nthat of repeaters or non-repeaters. Such inferences may become increasingly\nsignificant when trained on larger data sets that will exist in the near\nfuture."}
{"id": "2509.06699", "categories": ["astro-ph.HE", "astro-ph.IM", "gr-qc", "hep-ph", "hep-th"], "pdf": "https://arxiv.org/pdf/2509.06699", "abs": "https://arxiv.org/abs/2509.06699", "authors": ["José A. Pons", "Clara Dehman", "Daniele Viganò"], "title": "Magnetic, thermal and rotational evolution of isolated neutron stars", "comment": "89 pages, 27 figures. Submitted to Living Reviews in Computational\n  Astrophysics. This review is an updated version of the Living Review by Pons\n  & Vigan\\`o (2019, DOI: https://doi.org/10.1007/s41115-019-0006-7), accounting\n  for developments over the past five years", "summary": "The strong magnetic fields of neutron stars are closely linked to their\nobserved thermal, spectral, and timing properties, such as the distribution of\nspin periods and their derivatives. To understand the evolution of\nastrophysical observables over time, it is essential to develop robust\ntheoretical frameworks and numerical models that solve the coupled thermal and\nmagnetic field evolution equations, incorporating detailed microphysical inputs\nlike thermal and electrical conductivities and neutrino emission rates. These\nefforts are key to uncovering how the strength and geometry of magnetic fields\nchange with age, ultimately shedding light on the diverse phenomenology of\nneutron stars. In this review, we outline the fundamental theory underlying\nmagneto-thermal evolution models, with an emphasis on numerical methods and a\ncomprehensive set of benchmark tests intended to guide current and future code\ndevelopment. We revisit established results from axisymmetric simulations,\nhighlight recent progress in fully three-dimensional models, and offer a\nperspective on the anticipated developments in this rapidly evolving field."}
{"id": "2509.06210", "categories": ["astro-ph.HE", "hep-ex", "hep-ph"], "pdf": "https://arxiv.org/pdf/2509.06210", "abs": "https://arxiv.org/abs/2509.06210", "authors": ["R. Alfaro", "C. Alvarez", "A. Andrés", "E. Anita-Rangel", "M. Araya", "J. C. Arteaga-Velázquez", "D. Avila Rojas", "H. A. Ayala Solares", "R. Babu", "P. Bangale", "A. Bernal", "K. S. Caballero-Mora", "T. Capistrán", "A. Carramiñana", "F. Carreón", "S. Casanova", "A. L. Colmenero-Cesar", "U. Cotti", "J. Cotzomi", "S. Coutiño de León", "E. De la Fuente", "D. Depaoli", "P. Desiati", "N. Di Lalla", "R. Diaz Hernandez", "B. L. Dingus", "M. A. DuVernois", "J. C. Díaz-Vélez", "K. Engel", "T. Ergin", "C. Espinoza", "K. Fang", "N. Fraija", "S. Fraija", "J. A. Garcéa-González", "F. Garfias", "N. Ghosh", "H. Goksu", "A. Gonzalez Muñoz", "M. M. González", "J. A. González", "J. A. Goodman", "S. Groetsch", "J. Gyeong", "J. P. Harding", "S. Hernández-Cadena", "I. Herzog", "J. Hinton", "D. Huang", "F. Hueyotl-Zahuantitla", "P. Hüntemeyer", "A. Iriarte", "S. Kaufmann", "D. Kieda", "A. Lara", "K. Leavitt", "W. H. Lee", "J. Lee", "H. León Vargas", "J. T. Linnemann", "A. L. Longinotti", "G. Luis-Raya", "K. Malone", "O. Martinez", "J. Martínez-Castro", "H. Martínez-Huerta", "J. A. Matthews", "J. McEnery", "P. Miranda-Romagnoli", "P. E. Mirón-Enriquez", "J. A. Montes", "J. A. Morales-Soto", "E. Moreno", "M. Mostafá", "M. Najafi", "A. Nayerhoda", "L. Nellen", "M. U. Nisa", "R. Noriega-Papaqui", "N. Omodei", "M. Osorio-Archila", "E. Ponce", "Y. Pérez Araujo", "E. G. Pérez-Pérez", "C. D. Rho", "A. Rodriguez Parra", "D. Rosa-González", "M. Roth", "H. Salazar", "D. Salazar-Gallegos", "A. Sandoval", "M. Schneider", "J. Serna-Franco", "A. J. Smith", "Y. Son", "R. W. Springer", "O. Tibolla", "K. Tollefson", "I. Torres", "R. Torres-Escobedo", "R. Turner", "F. Ureña-Mena", "E. Varela", "L. Villaseñor", "X. Wang", "Z. Wang", "I. J. Watson", "H. Wu", "S. Yu", "S. Yun-Cárcamo", "H. Zhou", "C. de León"], "title": "Search for Signatures of Dark Matter Annihilation in the Galactic Center with HAWC", "comment": null, "summary": "We conduct an indirect dark matter (DM) search in the Galactic Center,\nfocusing on a square region within $\\pm 9^{\\circ}$ in Galactic longitude and\nlatutide, using 2,865 days of data ($\\sim$8 years) from the High-Altitude Water\nCherenkov (HAWC) Observatory. We explore DM particles within the Weakly\nInteracting Massive Particles framework with masses from 1 TeV to 10 PeV.\nAnalyzing three annihilation channels ($b\\bar{b}$, $\\tau^{+}\\tau^{-}$,\n$W^{+}W^{-}$) and three density profiles (Navarro-Frenk-White, Einasto,\nBurkert), we find no significant excess and set 95\\% confidence-level upper\nlimits on the velocity-weighted annihilation cross section. Our results provide\nthe first constraints on DM particles well above 100 TeV using gamma-ray data\nfrom the Galactic Center, with the strongest limits\n$\\mathcal{O}(10^{-24})$~cm$^{3}$/s, from the $\\tau^{+}\\tau^{-}$ channel and the\nEinasto profile."}
{"id": "2509.06243", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.06243", "abs": "https://arxiv.org/abs/2509.06243", "authors": ["R. Ruffini", "M. T. Mirtorabi", "P. Chardonnet", "C. L. Fryer", "M. Hohmann", "Yu Wang"], "title": "Evidence for Two SNe Type Triggering GRB 220101A: a Pair SN and a Rotating Magnetized Core Collapse SN", "comment": "15 pages, 9 figures, submitted to ApJ", "summary": "The traditional model which assumed GRBs as originating from a single Black\nHole (BH) have been modified by the Binary Driven Hypernova (BdHN) model in\nwhich the trigger of the GRB originate from a binary system composed of a 10\nsolar mass CO core and a 2 solar mass neutron star binary companion. The binary\nperiod being as short as minutes to hours. Recent results evidence that the\nmost energetic GRBs may have as precursors a sequence of two types of SN: a\npair-SN followed soon after by a more traditional core collapse. All this\nappear to open the way to two new types of SNe: the Pair-SNe without a remnant\nand a magnetized-rotating-core collapse leading to the formation of a pulsar.\nWe generalize our previous assumptions, here the possibility of fission of the\nrapidly rotating CO core is examined. The role of the magnetic field of the CO\ncore are equally examined with the magneto-hydrodynamic associated process, all\nthe way to generate overcritical fields and e+ e- pairs. All this appear to\nopen the way to a new types of SN, much in line with pair-SN models and a\nsignificant change from the initial non rotating models. The BdHN are\ncharacterized by seven new physics Episodes here all used to formulate the new\napproach. The substantial modification of each Episode are outlined by a\nleading order treatment."}
{"id": "2509.06437", "categories": ["astro-ph.HE", "physics.plasm-ph"], "pdf": "https://arxiv.org/pdf/2509.06437", "abs": "https://arxiv.org/abs/2509.06437", "authors": ["M. Lemoine", "V. Bresci", "L. Gremillet"], "title": "Particle acceleration up to the synchrotron burn-off limit in relativistic magnetized turbulence", "comment": "to be submitted (comments welcome); 20 pages, 13 figures", "summary": "In high-energy astrophysics, interpreting observed spectra hinges on\nunderstanding the competition between energy gains and radiative losses. To\nprogress along these lines, we report on particle-in-cell simulations of\nparticle acceleration in relativistic, magnetized turbulent pair plasmas\nincluding synchrotron radiative losses. Our key finding is that the particle\nenergy spectrum does not terminate at this maximal energy but extends beyond\nwith a steepened spectrum, up to the synchrotron burn-off limit where particles\ncool within a gyrotime. For our adopted parameters (magnetization $\\sigma\n\\approx 1 $ and amplitude $\\delta B/B_0\\simeq 1$), the particle distribution\nfollows ${\\rm d}n/{\\rm d}\\gamma\\propto \\gamma^{-s}$ with $s\\simeq 3$ below the\npredicted maximal energy, then steepens to $s\\simeq 4$ above. The particle\ndistribution and the radiated synchrotron spectra display strong variability\nnear the cutoff energy down to timescales well below the largest eddy\nturn-around time. We substantiate our results by demonstrating that the\nacceleration rate itself displays a broken powerlaw-like distribution whose\nmaximal value is the gyrofrequency. The highest energy particles are\naccelerated by a generalized Fermi process in ideal electric fields, driven by\na gradient of the $4$--velocity field $u_E$ of the magnetic field lines of\nrelativistic amplitude, $\\delta u_E \\gtrsim c$, ordered on a scale comparable\nto the particle gyroradius. We contend that this is a generic feature of\nrelativistic, large-amplitude turbulence. Lastly, we apply our results to the\nCrab nebula, which exhibits a hierarchy of characteristic Lorentz factors\nsimilar to that studied here. We conclude that stochastic acceleration in this\nenvironment is a promising mechanism for explaining the highest-energy part of\nthe synchrotron spectral energy distribution, and its variability. [Abridged]"}
{"id": "2509.06487", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.06487", "abs": "https://arxiv.org/abs/2509.06487", "authors": ["Francesco Carotenuto", "Liang Zhang", "Diego Altamirano", "Piergiorgio Casella", "Stéphane Corbel", "James C. A. Miller-Jones"], "title": "The full jet production cycle observed during fast state transitions in the black hole X-ray binary MAXI J1348$-$630", "comment": "8 pages, 3 figures, Submitted to A&A", "summary": "Black hole X-ray binaries (BH XRBs) launch powerful relativistic jets during\nbright outburst phases. The properties of these outflows change dramatically\nbetween different spectral/accretion states. Collimated, compact jets are\nobserved during the hard state and are quenched during the soft state, while\ndiscrete ejecta are mainly launched during the hard-to-soft state transition.\nCurrently, we still do not understand what triggers the formation and\ndestruction of compact jets or the launch of discrete ejecta. In this context,\nfinding a unique link between the jet evolution and the properties of the X-ray\nemission, such as its fast variability, would imply a major progress in our\nunderstanding of the fundamental mechanisms that drive relativistic outflows in\nBH XRBs. Here we show that a brief but strong radio re-brightening during a\npredominantly soft state of the BH XRB MAXI J1348$-$630 was contemporaneous\nwith a significant increase in the X-ray rms variability observed with NICER in\n2019. During this phase, the variability displayed significant changes and, at\nthe same time, MAXI J1348$-$630 launched two pairs of relativistic discrete\nejecta that we detected with the MeerKAT and ATCA radio-interferometers. We\npropose that short-lived compact jets were reactivated during this excursion to\nthe hard-intermediate state and were switched off before the ejecta launch, a\nphenomenology that has been very rarely observed in these systems.\nInterestingly, with the caveat of gaps in our radio and X-ray coverage, we\nsuggest a tentative correspondence between the launch of ejecta and the drop in\nX-ray rms variability in this source, while other typical X-ray signatures\nassociated with discrete ejections are not detected. We discuss how these\nresults provide us with insights into the complex and dynamic coupling between\nthe jets and hot corona in BH XRBs."}
{"id": "2509.06594", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.06594", "abs": "https://arxiv.org/abs/2509.06594", "authors": ["Teresa Bister"], "title": "The source of the cosmic-ray excess in the Centaurus region -- constraints on possible candidates, mass composition and cosmic magnetic fields", "comment": null, "summary": "The most significant excess in the arrival directions of ultra-high-energy\ncosmic rays with energies $\\gtrsim40\\,\\mathrm{EeV}$ is found in the direction\nof several interesting source candidates, most prominently the nearby radio\ngalaxy Centaurus A. Naturally, Cen A has been suspected to create the\nanisotropy - but very different scenarios have been proposed. This includes a\nsubdominant source contribution in combination with isotropic background\nsources, as well as a scenario where Cen A supplies the whole cosmic-ray flux\nabove the ankle. Recently, it was suggested that the overdensity could instead\nconsist of strongly deflected events from the Sombrero galaxy. Thanks to the\nrecent development of several models of the Galactic magnetic field, it is now\npossible to test these proposed scenarios explicitly. Leveraging the measured\noverdensity direction, significance, angular scale, and energy evolution, we\nplace limits on the allowed signal fraction, the possible ejected charge number\nand the strength of the extragalactic magnetic field between the respective\nsource and Earth. We find that the scenario of a subdominant source in the\noverdensity region requires the charge number to be $Z\\lesssim6$ and the\nextragalactic magnetic field quantity $B/\\mathrm{nG} \\sqrt{L_c/\\mathrm{nG}}$ to\nbe between $~1$ and $~100$. For the Sombrero galaxy to be the source, the\ndominant charge number has to be around $Z=6$ with $1\\lesssim B/\\mathrm{nG}\n\\sqrt{L_c/\\mathrm{nG}}\\lesssim20$. We find that a scenario where all the flux\nabove $30\\,\\mathrm{EeV}$ is supplied by Cen A or M83 is possible for\n$20\\lesssim B/\\mathrm{nG} \\sqrt{L_c/\\mathrm{nG}}\\lesssim30$ and a mixed\ncomposition - explaining both the Centaurus region excess and the distribution\nof the highest-energy events - however, another contributing source is possibly\nrequired in the energy range $<30\\,\\mathrm{EeV}$."}
{"id": "2509.06601", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.06601", "abs": "https://arxiv.org/abs/2509.06601", "authors": ["Nicolas De Angelis", "Philipp Azzarello", "Franck Cadoux", "Kurt Dittrich", "Yannick Favre", "Jochen Greiner", "Johannes Hulsman", "Coralie Husi", "Merlin Kole", "Hancheng Li", "Slawomir Mianowski", "Gabriel Pelleriti", "Agnieszka Pollo", "Nicolas Produit", "Dominik Rybka", "Jianchao Sun", "Xin Wu", "Shuang-Nan Zhang"], "title": "Gamma-Ray Burst Polarimetry with the POLAR and POLAR-2 missions", "comment": "12 pages, 11 figures, SPIE Optics+Photonics 2025 proceeding", "summary": "Gamma-Ray Bursts are among the most powerful and violent events in the\nUniverse. Despite over half a century of observations of these transient\nsources, many open questions remain about their nature and the physical\nemission mechanisms at play. Polarization measurements of the GRB prompt\ngamma-ray emission have long been theorized to be able to answer most of these\nquestions. Early polarization measurements did not allow to draw clear\nconclusions because of limited significance.\n  With the aim of better characterizing the polarization of these prompt\nemissions, a compact Gamma-Ray polarimeter called POLAR has been sent to space\nas part of the Tiangong-2 Chinese space lab for 6 months of operations starting\nSeptember 2016. The instrument detected 55 GRBs as well as several pulsars.\nTime-integrated polarization analysis of the 14 brightest detected GRBs has\nshown that the prompt emission is lowly polarized or fully unpolarized.\nHowever, time-resolved analysis depicted strong hints of an evolving\npolarization angle within single pulses, washing out the polarization degree in\ntime-integrated analyses. Energy-resolved polarization analysis has shown no\nconstraining results due to limited statistics. Hence, a more sensitive\n$\\gamma$-ray polarimeter is required to perform detailed energy and\ntime-resolved polarization analysis of the prompt gamma-ray emission of GRBs.\n  Based on the success of the POLAR mission, a larger-scale instrument,\napproved for launch to the China Space Station (CSS) in 2027, is currently\nbeing developed by a Swiss, Chinese, Polish, and German collaboration. Thanks\nto its large sensitivity in the 20-800~keV range, POLAR-2 will produce\npolarization measurements of at least 50 GRBs per year with a precision equal\nto or higher than the best results published by POLAR, allowing for good\nquality time and energy resolved analysis."}
{"id": "2509.06668", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.06668", "abs": "https://arxiv.org/abs/2509.06668", "authors": ["Monica Seglar-Arroyo", "Alessio Berti", "Alessandro Carosi", "Gloria Maria Cicciari", "Alice Donini", "Armand Fiasson", "Arnau Aguasca-Cabot", "Mathieu de Bony", "Pol Bordas", "Marc Ribó", "Edna Ruiz-Velasco", "Fabian Schüssler"], "title": "Transient Observations with LST-1: Key Results and Future Prospects", "comment": null, "summary": "The recent detections of the afterglow phase of long gamma-ray bursts (lGRBs)\nat very high energies (VHE, >100 GeV) mark a significant advance in\nastrophysics of transient phenomena, offering deeper insights into the\nacceleration mechanisms, jet structure, and physical processes driving GRB\nemission. In the multi-messenger landscape, both high-energy neutrino and\ngravitational wave detections are providing new insights into the physics of\nextreme cosmic accelerators and highlighting the need for rapid and broadband\nfollow-up observations. The Large-Sized Telescope (LST-1), the first telescope\nof the LST array, part of the Cherenkov Telescope Array Observatory (CTAO)\nNorth site, is particularly well-suited for real-time, rapid follow-up of\ntransients. In this contribution, we present the latest achievements of the\ntransient observational program with LST-1, which is now in advanced\ncommissioning on La Palma, Canary Islands. We outline the observational\nstrategies in place and describe the dynamic handling of events by the\ntransient handler of LST-1 (e.g., its ability to handle poorly localised\nevents, including gravitational waves, GRBs and neutrinos). We present the key\nresults from transient observation campaigns conducted so far, discuss the\nlessons learned, and outline the promising prospects for the future LST-1+MAGIC\ncombined transient program with fast response, via a Transient Handler."}
{"id": "2509.06684", "categories": ["astro-ph.HE", "hep-ph", "hep-th", "nucl-th"], "pdf": "https://arxiv.org/pdf/2509.06684", "abs": "https://arxiv.org/abs/2509.06684", "authors": ["Jeet Amrit Pattnaik", "D. Dey", "M. Bhuyan", "R. N. Panda", "S. K. Patra"], "title": "Core or Halo? Two-Fluid Analysis of Dark Matter-Admixed Quarkyonic Stars in the Multi-Messenger Era", "comment": "6 Pages, 6 Figures, 1 Table", "summary": "For the first time, we explore dark matter (DM) admixed quarkyonic stars\n(DAQSs) within a two-fluid formalism, where the normal/visible sector is\nmodeled by a quarkyonic equation of state (EOS) in the Effective Relativistic\nMean Field (E-RMF) framework and the DM component is treated as a degenerate\nfermionic gas with scalar and vector self-interactions. Our analysis begins\nwith the mass-radius (M-R) relation, showing that the inclusion of DM enables\nstellar configurations to reach the mass range compatible with the GW190814\nevent. We identify both DM core and DM halo morphologies among the viable EOSs,\nwith core dominated and halo dominated cases exhibiting distinct signatures. By\nfixing the stellar mass within the GW190814 range, we constrain the possible\ndark matter fractions and explore the role of different interaction channels.\nUsing the EOSs consistent with these constraints, we further investigate the\ntidal deformability ($\\Lambda$), moment of inertia (MOI), and stellar radius,\nfinding broad agreement with constraints from GW170817, GW190814, and NICER.\nFinally, we compile the characteristic properties of DAQSs, including EOS type,\nDM fractions, morphology (core vs halo), and macroscopic observables in a\ncomparative summary. This study provides a unified two-fluid framework to\nexplore dense QCD matter and dark matter in the multi-messenger era, suggesting\nthat the GW190814 secondary object could plausibly be interpreted as either a\nDM core or a DM halo quarkyonic star."}
{"id": "2509.06699", "categories": ["astro-ph.HE", "astro-ph.IM", "gr-qc", "hep-ph", "hep-th"], "pdf": "https://arxiv.org/pdf/2509.06699", "abs": "https://arxiv.org/abs/2509.06699", "authors": ["José A. Pons", "Clara Dehman", "Daniele Viganò"], "title": "Magnetic, thermal and rotational evolution of isolated neutron stars", "comment": "89 pages, 27 figures. Submitted to Living Reviews in Computational\n  Astrophysics. This review is an updated version of the Living Review by Pons\n  & Vigan\\`o (2019, DOI: https://doi.org/10.1007/s41115-019-0006-7), accounting\n  for developments over the past five years", "summary": "The strong magnetic fields of neutron stars are closely linked to their\nobserved thermal, spectral, and timing properties, such as the distribution of\nspin periods and their derivatives. To understand the evolution of\nastrophysical observables over time, it is essential to develop robust\ntheoretical frameworks and numerical models that solve the coupled thermal and\nmagnetic field evolution equations, incorporating detailed microphysical inputs\nlike thermal and electrical conductivities and neutrino emission rates. These\nefforts are key to uncovering how the strength and geometry of magnetic fields\nchange with age, ultimately shedding light on the diverse phenomenology of\nneutron stars. In this review, we outline the fundamental theory underlying\nmagneto-thermal evolution models, with an emphasis on numerical methods and a\ncomprehensive set of benchmark tests intended to guide current and future code\ndevelopment. We revisit established results from axisymmetric simulations,\nhighlight recent progress in fully three-dimensional models, and offer a\nperspective on the anticipated developments in this rapidly evolving field."}
{"id": "2509.06721", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.06721", "abs": "https://arxiv.org/abs/2509.06721", "authors": ["Swarali Shivraj Patil", "Robert A. Main", "Emmanuel Fonseca", "Kyle McGregor", "B. M. Gaensler", "Charanjot Brar", "Amanda M. Cook", "Alice P. Curtin", "Gwendolyn Eadie", "Ronniy Joseph", "Lordrick Kahinga", "Victoria Kaspi", "Afrokk Khan", "Bikash Kharel", "Adam E. Lanman", "Calvin Leung", "Kiyoshi W. Masui", "Mason Ng", "Kenzie Nimmo", "Ayush Pandhi", "Aaron B. Pearlman", "Ziggy Pleunis", "Mawson W. Sammons", "Ketan R. Sand", "Paul Scholz", "Kaitlyn Shin", "Seth R. Siegel", "Kendrick Smith"], "title": "A Spatial Gap in the Sky Distribution of Fast Radio Burst Detections Coinciding with Galactic Plasma Overdensities", "comment": "26 pages, 8 figures. Submitted to ApJL", "summary": "We analyze the positional and morphological properties of about 3600 unique\nfast radio burst (FRB) sources reported in the second FRB catalog generated by\nthe Canadian Hydrogen Intensity Mapping Experiment (CHIME) telescope. We find a\ntwo-dimensional dependence of FRB detections on sky position, and identify a\nsignificant absence of detections in a roughly circular region centered at\nGalactic coordinates (77.7$^\\circ$, 0.9$^\\circ$), spanning an area of 216.2\ndeg$^2$. This detection gap spatially coincides with the Cygnus X region $--$ a\nplasma-rich star-forming region in the Milky Way. This lack of FRB detections\nis most likely the result of increased sky temperature and strong multi-path\nscattering by turbulent ionized plasma, which broadens the FRB signals beyond\ndetectability in the CHIME band. Our simulations yield a mean of 6 expected FRB\ndetections within the gap when accounting for the elevated sky temperature in\nthe direction of the detection gap. We infer that a lower limit of the maximum\nscattering timescale $\\tau_{\\rm sc,\\, 1\\,GHz} \\geq 4.13$ ms is sufficient to\nsuppress the observed signal-to-noise ratio of all FRBs. In addition to Cygnus\nX, a similar suppression is seen in Catalog 2 along other high-emission measure\n(EM) sightlines ( i.e., EM$\\geq$2900 pc cm$^{-6}$), further supporting a\nbroader trend of suppression due to Galactic scattering. Future very long\nbaseline interferometry (VLBI) measurements of scattering disks with CHIME\nOutriggers could help confirm our interpretation. Our work highlights the\nsubstantial impact of the ionized and turbulent Galactic interstellar medium on\nthe detectability of FRBs."}
{"id": "2509.06857", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2509.06857", "abs": "https://arxiv.org/abs/2509.06857", "authors": ["Anton Stall", "Philipp Mertsch"], "title": "Stochastic modelling of cosmic-ray sources for Galactic diffuse emissions", "comment": "49 pages, 23 figures", "summary": "Galactic diffuse emissions in gamma rays and neutrinos arise from\ninteractions of cosmic rays with the interstellar medium and probe the\ncosmic-ray intensity away from the Solar system. Model predictions for those\nare influenced by the properties of cosmic-ray sources, and understanding the\nimpact of cosmic-ray sources on Galactic diffuse emissions is key for\ninterpreting measurements by LHAASO, Tibet AS-gamma, IceCube, and the upcoming\nSWGO. We consider supernova remnants as prototypical cosmic-ray sources and\nstudy the impact of their discreteness on the Galactic diffuse emissions in\ndifferent source injection and near-source transport models in a stochastic\nMonte Carlo study. Three lessons exemplify the results of our simulations:\nFirst, the distributions of Galactic diffuse emission intensities can be\ndescribed by a mixture model of stable laws and Gaussian distributions. Second,\nthe maximal deviations caused by discrete sources across the sky depend on\nenergy, reaching typically tens of percent in burst-like and energy-dependent\nescape scenarios but order unity or larger in a time-dependent diffusion\nscenario. Third, the additional model uncertainty from source stochasticity is\nsubdominant in burst-like and energy-dependent escape scenarios, but becomes\nsizeable above some tens of TeV in the time-dependent diffusion scenario, where\nit can help reconcile model predictions with LHAASO measurements. With\nincreased spatial resolution, especially at energies beyond tens of TeV,\nmeasurements of Galactic diffuse emissions can be expected to constrain source\nmodels and locate cosmic ray sources."}
{"id": "2509.06933", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2509.06933", "abs": "https://arxiv.org/abs/2509.06933", "authors": ["G. Kyriopoulos", "M. Petropoulou", "G. Vasilopoulos", "D. Hatzidimitriou"], "title": "Black-hole mass estimation through accretion disk spectral fitting for high-redshift blazars", "comment": "15 pages, 9 figures, 4 appendices, submitted to A&A. Supplementary\n  material is available at this link: https://zenodo.org/records/16961282", "summary": "High-redshift ($z>2$) blazars, with relativistic jets aligned toward us,\nprobe the most powerful end of the active galactic nuclei (AGN) population. We\naim at determining the black hole masses and mass accretion rates of high-$z$\nblazars in a common framework that utilizes a Markov Chain Monte Carlo (MCMC)\nfitting method and the Shakura-Sunayev multi-temperature accretion disk model,\naccounting also for attenuation due to neutral hydrogen gas in the\nintergalactic medium (IGM). We compiled a sample of 23 high-redshift blazars\nfrom the literature with publicly available infrared-to-ultraviolet photometric\ndata. We performed a Bayesian fit to the spectral energy distribution (SED) of\nthe accretion disk, accounting for upper limits, and determined the black hole\nmasses and mass accretion rates with their uncertainties. We also examined the\nimpact of optical-ultraviolet attenuation due to gas in the IGM. We find that\nneglecting IGM attenuation in SED fits leads to systematically larger\nblack-hole mass estimates and correspondingly lower Eddington ratios, with the\nbias becoming more severe at higher redshift. Our MCMC fits yield median\nblack-hole masses in the range $\\sim (10^{8}-10^{10})\\,M_{\\odot}$ and a broad\ndistribution of median Eddington ratios ($\\lambda_{\\rm Edd}\\sim 0.04 - 1$).\nComparison with previous literature shows no clear method-dependent systematic\noffsets, although individual mass estimates can differ by up to a factor of a\nfew. We also demonstrate that assumptions about black-hole spin introduce a\nsystematic degeneracy. This work is to our knowledge the first systematic study\nto model the accretion-disk emission of a large sample of high-$z$ blazars\nwithin a single, consistent statistical framework. Our results emphasize the\nimportance of accounting for IGM attenuation and of using uniform fitting\nmethods when comparing disk-based black hole estimates across samples."}
{"id": "2509.05406", "categories": ["astro-ph.IM", "astro-ph.HE", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2509.05406", "abs": "https://arxiv.org/abs/2509.05406", "authors": ["Zexuan Wu", "Subo Dong", "Andrew P. Gould", "Przemek Mróz", "A. Mérand"], "title": "\"Industrial-Scale\" Black Hole Selection without a Satellite", "comment": null, "summary": "The forthcoming GRAVITY+ instrument promises to usher in an era of\n\"industrial-scale\" mass measurements of isolated black holes (BHs), with the\npotential to assemble a sample of many tens of BHs via interferometric\nmicrolensing over several years. A key challenge will be selecting\ninterferometric follow-up targets from an order-of-magnitude larger pool of\nongoing microlensing events when using traditional selection based on event\ntimescale alone. Gould (2023) proposed a criterion optimized for BH selection\nusing space-based microlens parallax measurements enabled by a satellite. We\nadapt it to work with microlens parallax constraints obtainable from\nground-based data only. Using Galactic simulations, we show that our selection\ncriterion is highly efficient, expecting to detect about a dozen BHs per year\nwith GRAVITY+ from following up ~35 selected events."}
{"id": "2509.06141", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.06141", "abs": "https://arxiv.org/abs/2509.06141", "authors": ["Eric Mayotte", "Austin Cummings", "Paul Degarate", "Neville DeWitt Pierrat", "Johannes Eser", "William Finch", "Julia Burton-Heibges", "Tobias Heibges", "Eric Mentzell", "Stephan Meyer", "Conrad Shay", "Benjamin Stillwell", "Yoshiyuki Takizawa", "Luke Wanner", "Lawrence Wiencke"], "title": "The Optical and Mechanical Design of POEMMA Balloon with Radio", "comment": "10 pages, 6 figures, Procceedings for ICRC 25", "summary": "POEMMA Balloon with Radio (PBR) is a NASA super-pressure balloon mission\nbuilding toward the proposed Probe Of Extreme Multi-Messenger Astrophysics\n(POEMMA) dual satellite mission. In its planned 2027 launch, PBR will study\nUltra-High-Energy Cosmic Rays, Neutrinos, and High-Altitude Horizontal\nAirshowers from 33 km above the Earth. By operating at balloon altitudes, PBR\nwill provide a novel vantage point to study air-shower physics while offering\ncompetitive instantaneous exposure to neutrinos from transient astrophysical\nphenomena. The payload's optical instrument is a 0.95 m$^2$ aperture hybrid\nSchmidt telescope with a 3.81 m$^2$ segmented mirror focusing light onto a\nFluorescence Camera and a bi-focalized Cherenkov Camera. The payload will also\nfeature a Radio Instrument consisting of two sinuous antennas based on the\nPayload for Ultrahigh Energy Observations (PUEO) low-frequency instrument. A\ncombined gamma ray/x-ray detector and IR cloud camera round out the\ninstrumentation package, meaning PBR will be the first multi-hybrid\nballoon-borne multi-messenger observatory flown. This extensive instrumentation\nmust be combined into a radio quiet payload that satisfies the scientific needs\nand can operate in near vacuum at extreme temperatures, all while meeting NASA\nsafety requirements and weighing no more than 3000 lbs (1361 kg). Accomplishing\nthese tasks together will mark a significant step toward establishing\ntechnological readiness for the POEMMA satellite mission. We present an\noverview of PBR's mechanical and optical systems, additionally detailing our\nstrategies to mitigate electromagnetic interference for the radio instrument\nand prepare for the harsh near-space environment."}
{"id": "2509.06315", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.06315", "abs": "https://arxiv.org/abs/2509.06315", "authors": ["Csanád Horváth", "Natasha Hurley-Walker", "Samuel J. McSweeney", "Timothy J. Galvin", "John Morgan"], "title": "A long period transient search method for the Murchison Widefield Array", "comment": "13 pages, 9 figures, 2 tables, accepted for publication in PASA", "summary": "We present an automated search method for radio transients on the minute\ntimescale focused on the emerging long period transients (LPTs) in image-plane\nradio data. The method is tuned for use with the Murchison Widefield Array\n(MWA) and tested on archival observations from the GaLactic and Extragalactic\nAll-Sky MWA Extended Survey (GLEAM-X) in the 70--300 MHz range. The images are\nformed from model-subtracted visibilities, before applying three filters to the\ntime series of each pixel in an image, with each filter designed to be\nsensitive to a different transient behaviour. Due to the nature of radio\ninterferometry and the refraction of the fluctuating ionosphere, the vast\nmajority of candidates at this stage are artefacts which we identify and remove\nusing a set of flagging measures. Of the 336 final candidates, 7 were genuine\ntransients; 1 new LPT, 1 new pulsar, and 5 known pulsars. The performance of\nthe method is analysed by injecting modelled transient pulses into a subset of\nthe observations and applying the method to the result."}
