{"id": "2509.14286", "categories": ["astro-ph.IM", "math.DS"], "pdf": "https://arxiv.org/pdf/2509.14286", "abs": "https://arxiv.org/abs/2509.14286", "authors": ["Allan Kardec de Almeida Junior"], "title": "Segmentation of the spacecraft transfer problem through overdetermined and continuity constraints based on the Theory of Functional Connections", "comment": null, "summary": "This paper introduces a segmented approach for solving constrained orbit\ntransfer problems. The segments are connected through continuity constraints\nunder the Theory of Functional Connections (TFC) mathematical framework that\nperforms linear functional interpolation. This approach is further enhanced by\na general vector formulation, from where the constrained functional is derived\nconsidering also a set of linear overdetermined constraints. Since we constrain\nvector instead of coordinates, this methodology allows to apply TFC to multiple\nand complex constraints composed by any types of nonlinear components included.\nWe demonstrate the effectiveness of the method on Earth-to-Moon transfers,\nshowing that this segmented approach achieves solutions with several orders of\nmagnitude greater accuracy and efficiency in comparison with unsegmented orbit\ntransfers."}
{"id": "2509.14333", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.14333", "abs": "https://arxiv.org/abs/2509.14333", "authors": ["Lawrence Wiencke", "James Brague", "Ash Fox-Smith", "Auston Froid", "Levi Bar-On", "Stephen Meyer", "Josh Moses", "Ben Stillwell"], "title": "Telescope Tilt System for the POEMMA Balloon Radio Mission", "comment": "7 page, 4 figures, 2025 International Cosmic Ray Conference", "summary": "The Probe of Extreme Multi-Messenger Astrophysics Balloon with Radio mission\n(PBR) will point above Earth's limb to measure PeV energy cosmic rays, and\nrecord star images to monitor optical focusing in situ. PBR will point below\nEarth's limb to search for earth-skimming neutrinos. PBR will also measure EeV\nenergy cosmic rays by tilting as far down as the nadir direction. All of these\nsearches will require changing and measuring the tilt angle of a single large\nintegrated telescope and radio antenna assembly in the near space environment\nat 33 km above sea level over a mission duration as long as 50 days. In\naddition, the 1.1 m diameter entrance pupil of the telescope will be covered\nduring the day by a shutter system to prevent sunlight from damaging the camera\nsystems and opened at night to collect data. Here we present the design and\nstatus of the tilting system, the tilting monitors, the shutter system, the\ncontroller, and the preflight thermal vacuum testing process. The work draws on\nthe experience of the 2023 Extreme Universe Space Observatory on a Super\nPressure Balloon 2 mission."}
{"id": "2509.14363", "categories": ["astro-ph.IM", "astro-ph.EP"], "pdf": "https://arxiv.org/pdf/2509.14363", "abs": "https://arxiv.org/abs/2509.14363", "authors": ["Sean Bryan", "Hugh Barnaby", "Oketa Basha", "C. Matt Bradford", "Kathryn Chamberlin", "Nicholas Cothard", "Sumit Dahal", "Thomas Essinger-Hileman", "Alessandro Geist", "Jason Glenn", "Tracee Jamison-Hooks", "Abarna Karthikeyan", "Philip Mauskopf", "Lynn Miles", "Sanetra Bailey Newman", "Cody Roberson", "Karwan Rostem", "Adrian Sinclair"], "title": "KID Detector Readout Electronics Development for Habitable Worlds Observatory", "comment": "6 pages, 5 figures, Submitted to IEEE Transactions on Applied\n  Superconductivity", "summary": "We present the status and goals of the readout electronics system we are\ndeveloping to support the detector arrays in the coronagraph instrument on the\nNASA Habitable Worlds Observatory (HWO) mission currently in development. HWO\naims to revolutionize exoplanet exploration by performing direct imaging and\nspectroscopy of 25 or more habitable exoplanets, and to resolve a broad range\nof astrophysics science questions as well. Since exoplanet yield depends\ncritically on the detector dark count rate, as we show in this paper, the\nambitious goals of HWO require arrays of single-photon energy-resolving\ndetectors. We argue that Kinetic Inductance Detectors (KIDs) are best suited to\nmeet these requirements. To support the detectors required for HWO and future\nfar-IR missions, at the required power consumption and detector count, we are\ndeveloping a radiation-tolerant reconfigurable readout system for both imaging\nand energy-resolving single photon KID detector arrays. We leverage an existing\nRFSoC-based system we built for NASA balloons that has a power consumption of\n30 Watts and reads out 2000-4000 detectors (i.e. 7-15 mW/pixel), and move to a\nradiation tolerant Kintex Ultrascale FPGA chip to bring low-power wide\nbandwidth readout to a space-qualified platform for the first time. This\nimproves significantly over previous spaceflight systems, and delivers what is\nrequired for NASA's future needs: ~100,000 pixels with less than 1 kW total\npower consumption. Overall, the system we are developing is a significant step\nforward in capability, and retires many key risks for the Habitable Worlds\nObservatory mission."}
{"id": "2509.14511", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.14511", "abs": "https://arxiv.org/abs/2509.14511", "authors": ["J. Kataoka", "S. Ogasawara", "R. Mori", "K. Yamamoto", "A. R. Joshi", "S. Kojima", "K. Sato", "K. S. Tanaka", "K. Watanabe", "M. Yasuda", "H. Kobayashi", "D. Kobayashi", "A. Ohira", "Y. Amaki", "Y. Arai", "K. Tashirio", "K. Otsubo", "Y. Ozeki", "Y. Kawaguchi", "D. Yoshimura", "H. Yoshida", "K. Takahashi", "S. Masaki", "N. Yamada", "K. Oikawa", "E. Zamami", "K. Miyamoto", "T. Chujo", "H. Nakanishi", "T. Tomura", "S. Hayatsu", "M. Fukuda", "H. Seki", "S. Joshima", "Y. Yatsu"], "title": "Revisiting the ARM cut in Compton gamma-ray imaging and its application to the INSPIRE detector", "comment": "18 pages, 13 figures, accepted for publication in the Journal of\n  Instrumentation", "summary": "The Compton camera is a gamma-ray imaging device developed in the 1970s. In\nthe 1990s, the COMPTEL detector onboard the CGRO was the first to utilize a\nCompton camera for MeV all-sky survey observations. Recently, various Compton\ncameras have been developed using scintillators, semiconductors, and gas\ndetectors, some of which are intended for future small satellite missions as\nwell as medical applications. However, the image obtained by a Compton camera\nhas strong artifacts owing to the overlap of the Compton cones or the arcs,\nwhich degrade the resolution and sensitivity of the image. In this study, we\nrevisit the adaptive ARM cut that significantly reduces artifacts when the\ndirection of gamma ray emitting source is already known. This approach\ncomplements the statistically well-defined method based on the response\nfunction in the three-dimensional data space of scattering direction (\\chi,\n\\psi) and scattering angle \\theta, but it is more direct, intuitive, and\nsimplifies the extraction of spectra in astronomical observations of point-like\nsources. Using a Compton camera, INSPIRE, onboard the ultra-small satellite\nGRAPHIUM as an example, we numerically evaluated the extent of background\nreduction to estimate simulation-based sensitivity. The method was also applied\nto actual measurements using a quarter-scale prototype of INSPIRE to extract\nspectra from multiple sources within the same field of view."}
{"id": "2509.14317", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.14317", "abs": "https://arxiv.org/abs/2509.14317", "authors": ["Collin T. Christy", "Kate D. Alexander", "Tanmoy Laskar", "Noah Franz", "Adelle J. Goodwin", "Jeniveve Pearson", "Edo Berger", "Yvette Cendes", "Ryan Chornock", "Deanne Coppejans", "Tarraneh Eftekhari", "Raffaella Margutti", "James C. A. Miller-Jones", "Melanie Krips", "Enrico Ramirez-Ruiz", "David J. Sand", "Richard Saxton", "Manisha Shrestha", "Sjoert van Velzen"], "title": "Dichotomy in Long-Lived Radio Emission from Tidal Disruption Events AT 2020zso and AT 2021sdu: Multi-Component Outflows vs. Host Contamination", "comment": "26 pages, 9 figures, 5 tables. Submitted to ApJ", "summary": "We present a detailed radio study of the tidal disruption events (TDEs) AT\n2020zso and AT 2021sdu. Both exhibit transient radio emission beginning shortly\nafter optical discovery and persisting for several years. For AT 2020zso, we\nidentify two distinct radio flares. The first arises soon after the optical\npeak, reaching a maximum $\\sim1$ year post-discovery before fading. The second\nflare appears $\\sim800$ days after discovery and results in the brief presence\nof two distinct components in the radio spectra, providing strong evidence for\nphysically separate outflows. Both flares are consistent with non-relativistic\noutflows, with velocities $v\\approx0.1-0.2c$ and energies $E\\sim10^{49}$ erg,\npropagating through a Bondi-like circumnuclear medium. Our analysis supports a\nscenario in which the first outflow is accretion-driven, launched while the TDE\ndisk is accreting at a relatively high Eddington fraction, whereas the second\noutflow is associated with a transition to an advection-dominated accretion\nflow. In contrast, the radio emission from AT 2021sdu is best explained by a\nslower ($v\\approx0.03c$), less energetic outflow ($E\\sim10^{48}$ erg), combined\nwith diffuse, non-variable host emission that becomes dominant $\\sim500$ days\nafter discovery. Assuming free expansion, we infer an outflow launch date\npreceding the optical discovery date. This suggests that the outflow may\noriginate from either the unbound stellar debris ejected during disruption or,\nalternatively, from a decelerating outflow. Our findings demonstrate the\ndiversity of outflow properties in TDEs and highlight the observational\nchallenges of interpreting late-time radio variability in the presence of host\ngalaxy contamination."}
{"id": "2509.14691", "categories": ["astro-ph.IM", "astro-ph.GA", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2509.14691", "abs": "https://arxiv.org/abs/2509.14691", "authors": ["Zhen-Ya Zheng", "Chun Xu", "Xiaohua Liu", "Yong-He Chen", "Fang Xu", "Hu Zhan", "Xinfeng Li", "Lixin Zheng", "Huanyuan Shan", "Jing Zhong", "Zhaojun Yan", "Fang-Ting Yuan", "Chunyan Jiang", "Xiyan Peng", "Wei Chen", "Xue Cheng", "Zhen-Lei Chen", "Shuairu Zhu", "Lin Long", "Xin Zhang", "Yan Gong", "Li Shao", "Wei Wang", "Tianyi Zhang", "Guohao Ju", "Chenghao Li", "Wei Wang", "Zhiyuan Li", "Tao Wang", "Junfeng Wang", "Chengyuan Li", "Bin Ma", "Jianguo Wang", "Lei Wang", "Dezi Liu", "Nie Lin", "Kexin Li", "Xinrong Wen", "Maochun Wu", "Ruqiu Lin", "Xiang Ji"], "title": "MCI: Multi-Channel Imager on the Chinese Space Station Survey Telescope", "comment": "11 pages, 5 figures, submitted to RAA. Comments are welcome!", "summary": "The Multi-Channel Imager (MCI) is a powerful near-ultraviolet (NUV) and\nvisible imager onboard the Chinese Space Station Survey Telescope (CSST). The\nMCI provides three imaging channels, which are the NUV channel, the\nOptical-blue channel and the Optical-red channel, with the wavelength range of\n255-430 nm, 430-700 nm, and 700-1000 nm, respectively. The three channels can\ntarget the same field simultaneously. Each channel employs a CCD focal plane of\n9216 x 9232 pixels and $\\sim$7.5 x 7.5 arcmin$^2$ field of view. The MCI's\nthree channels feature unprecedented sensitivities and field of views, as well\nas rich filter sets, which complements the NUV and visible capabilities of the\nCSST for the high-precision photometry, the weak-signal detection, and the\nrelated sciences. Here we present key design features, results of current\nground tests, and suggested observing strategies of the MCI."}
{"id": "2509.14407", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.14407", "abs": "https://arxiv.org/abs/2509.14407", "authors": ["Shoukat Ali", "Dave Z. Besson for ARA Collaboration"], "title": "Study of an Isolated Double-pulse Cosmic Ray Candidate Recorded with the Askaryan Radio Array", "comment": null, "summary": "The radio-frequency emissions produced by particle showers on Earth,\nresulting from cosmic rays (CRs) and ultra-high energy neutrinos (UHE-$\\nu$)\noriginating from astrophysical sources share significant similarities, enabling\nradio detectors initially designed for UHE-$\\nu$ searches to also study CRs.\nThe Askaryan Radio Array (ARA), an experiment currently operating within the\nice at the South Pole, is primarily designed to detect UHE-$\\nu$s. To date, ARA\nhas deployed five stations, with each station equipped with antennas installed\nat depths up to 200 meters in the ice. Data recorded by ARA Station-2 (A2)\nsuggest a potential CR origin for a subset of events identified in a UHE-$\\nu$\nsearch. This subset includes a double-pulse event potentially from a downward\npropagating CR-induced air shower, with in-air geomagnetic emission followed by\nin-ice Askaryan emission producing the two pulses. A detailed investigation of\nthis CR candidate event using comprehensive simulations has been conducted with\nthe goal of identifying the parameters of a CR-induced air shower that best\nmatch the experimentally observed quantities. We simulate predicted CR signals\nin ARA by combining an impacting CR shower simulation framework (FAERIE) with a\nrealistic detector simulation (AraSim).\n  We determine the event topology based on the vertex reconstruction of both\nthe putative geomagnetic and Askaryan signals. After inferring the event\ngeometry, we show that the simulation matches the observed time structure of\nthe event (channel-by-channel relative signal arrival times) for the recorded\nevent."}
{"id": "2509.14897", "categories": ["astro-ph.IM", "quant-ph"], "pdf": "https://arxiv.org/pdf/2509.14897", "abs": "https://arxiv.org/abs/2509.14897", "authors": ["David Díez-Ibáñez"], "title": "Exploring dark matter with quantum-enhanced haloscopes and time projection chambers", "comment": "This is a PhD thesis", "summary": "This thesis explores experimental and theoretical approaches to dark matter\ndetection, from gas-based detectors to quantum sensors, tackling the challenge\nof identifying dark matter, which makes up 27% of the Universe's energy. It\nreviews astrophysical and cosmological evidence, highlights the Standard\nModel's limitations, and motivates searches for WIMPs, axions, and dark photons\nthrough direct, indirect, and collider-based strategies.\n  The experimental work includes the Micromegas-based TREX-DM experiment for\nlow-mass WIMPs, with studies of argon and neon-based gas mixtures, detector\ndesign, shielding, readout, and background suppression. GEM integration boosted\ngain by up to 45. A UV LED-based internal calibration system was developed for\ncompact, low-background operation, while pressure-dependent gain studies\noptimized future low-background TPCs. The thesis also advances axion and dark\nphoton searches via haloscopes and introduces the DarkQuantum prototype, a\nsuperconducting qubit coupled to microwave cavities for single-photon\ndetection. This system enabled the most stringent exclusion limit on massive\ndark photon interactions at 5.051 GHz, demonstrating the feasibility of\nquantum-enhanced detectors.\n  Overall, the work bridges classical and quantum detection techniques,\nadvancing WIMP searches and pioneering compact quantum sensors for axion and\ndark photon detection, laying the foundation for future high-sensitivity dark\nmatter experiments."}
{"id": "2509.14465", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.14465", "abs": "https://arxiv.org/abs/2509.14465", "authors": ["Shifra Mandel", "Kaya Mori", "Anna Ciurlo", "Paul A. Draghis", "Noa Grollimund", "Gaurava K. Jaisawal", "Chichuan Jin", "Benjamin Levin", "Lorenzo Marra", "Eric Miao", "Maxime Parra", "Mark Reynolds", "Sean A. Granados", "Matteo Bachetti", "Fiamma Capitanio", "Nathalie Degenaar", "Charles J. Hailey", "JaeSub Hong", "Sara Motta", "Gabriele Ponti", "Michael M. Shara", "Megumi Shidatsu", "John A. Tomsick", "Randall Campbell", "Stéphane Corbel", "Rob Fender", "Andrea Ghez", "Jonathan Grindlay", "Matthew W. Hosek Jr.", "Kai Matsunaga", "Romana Mikušincová", "Melania Nynka", "Grace Sanger-Johnson", "Giovanni Stel", "Antonella Tarana", "Rudy Wijnands", "Shuo Zhang"], "title": "A multiwavelength study of the new Galactic center black hole candidate MAXI J1744-294", "comment": null, "summary": "For the first time in nearly a decade, a new, bright transient was detected\nin the central parsec (pc) of the Galaxy. MAXI J1744-294 was never observed in\noutburst prior to January 2025. We present the results of a broadband,\nmulti-wavelength study of this enigmatic source, including data from the\nNuSTAR, Chandra, XMM-Newton, Swift, and NICER X-ray telescopes, as well as\ncomplementary radio and near-infrared observations. We find that MAXI J1744-294\nremained in the bright/soft state throughout the first months of 2025. Spectral\nhardening was observed in April 2025, followed by a decline in flux. Based on\nthe spectral and temporal characteristics of the source, we identify MAXI\nJ1744-294 as a candidate black hole (BH) low-mass X-ray binary (LMXB) $-$ the\nfourth candidate BH transient discovered within a (projected) distance of one\npc from the Galactic supermassive black hole Sgr A*. This discovery provides\nfurther evidence for a cusp of BH-LMXBs in the central pc of our Galaxy, as\nargued for in previous observational work and suggested by analytical and\ntheoretical work. Our multi wavelength study, involving a complementary range\nof observatories and spanning different outburst states, can serve as a model\nfor future time domain astrophysics research."}
{"id": "2509.15108", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.15108", "abs": "https://arxiv.org/abs/2509.15108", "authors": ["Anastasiia Mikhno", "Federica Bradascio", "Jonathan Biteau", "François Brun", "Patrick Brun", "Hossam Boutalha", "Justine Devin", "Armelle Jardin-Blicq", "Pierre Jean", "Michael Josselin", "Jean-Philippe Lenain", "Quentin Luce", "Vincent Marandon", "Kevin Pressard", "Georges Vasileiadis", "CTAO NectarCAM Collaboration"], "title": "Design and characterization of the Flat-Field Calibration of the NectarCAM Camera", "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC\n  2025), 2025", "summary": "The NectarCAM flat-field flasher is a calibration device designed for the\ncamera that will equip the Medium-Sized Telescopes (MSTs) of the northern site\nof the Cherenkov Telescope Array Observatory (CTAO). Positioned in the centre\nof the MST dish, 16 meters in front of the camera, the flasher emits short\n(FWHM $\\approx$ 5 ns), uniform (2$-$4%) light pulses to illuminate the entire\nfocal plane.\n  Accurate calibration is crucial for the optimal operation of the NectarCAM,\nensuring precise gain computation and mitigating differences in\nlight-collection efficiency of the pixels of the camera. Using the flat-field\nflasher, two informations are obtained : the pixel gain and the relative\nefficiency between pixels. In addition, the flasher is used to probe the\ndynamic range over which the camera operates effectively.\n  In this study, we report on the performance characterisation of the\nflat-field flasher using a dedicated test bench. We report on the results of\ntests conducted on several flasher units, evaluating their reliability.\nFurthermore, we describe how the flat-field coefficients are applied within the\ncamera to ensure uniformity of response of few percent level across all 1855\npixels.\n  As the deployment of the first MST at the CTAO northern site is scheduled for\n2027, this work represents a significant contribution to the collaboration`s\nefforts to finalize camera calibration systems."}
{"id": "2509.14494", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.14494", "abs": "https://arxiv.org/abs/2509.14494", "authors": ["Kaito Ninoyu", "Keisuke Uchiyama", "Shinya Yamada", "Ryota Hayakawa", "Shunji Kitamoto", "Nao Kominato", "Takayoshi Kohmura", "Misaki Mizumoto", "Yuusuke Uchida", "Toru Tamagawa", "Ryota Tomaru", "Seoru Ito"], "title": "First Detection of X-ray Polarization and Its Short-term Increase Pre- and Post-Eclipse in HMXB 4U 1700-377", "comment": null, "summary": "We report the first statistically significant detection of X-ray polarization\nfrom the high-mass X-ray binary (HMXB) 4U 1700-377, observed using the Imaging\nX-ray Polarimetry Explorer (IXPE). A polarization degree exceeding 10% was\ndetected above 5 keV, placing it among the highest polarization observed in\nHMXBs to date. The observation was conducted over a full orbital period of the\nbinary system, during which several sporadic and instantaneous flares were\ndetected. We identify a clear correlation between the polarization degree and\norbital phase, with the highest polarization occurring just before and after\nthe eclipse, reaching over 20% for a few tens of ks. These results suggest that\nthe scattering medium responsible for the observed polarization is spatially\nlocalized between the compact object and the O-type companion star, likely\ncreated by large-scale inhomogeneities in the stellar wind and its interaction\nwith the compact star's emission. We also explore the roles of disk winds and\norbital reflection in the observed polarization variability. While both\nmechanisms contribute to the polarization, the substantial increase in\npolarization before and after the eclipse cannot be fully explained by these\nmodels alone, suggesting that the involvement of additional factors. The\nproperties of the X-ray polarization observed by IXPE provide new insights into\nthe accretion processes, X-ray emission, and wind structure in 4U 1700-377,\nadvancing our understanding of their complex environments and the nature of the\ncompact objects within."}
{"id": "2509.15176", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.15176", "abs": "https://arxiv.org/abs/2509.15176", "authors": ["Hendrik Müller"], "title": "To CLEAN or not to CLEAN: Data Processing in the ngVLA era", "comment": "IAU conference proceedings", "summary": "Radio interferometric imaging has long relied on the CLEAN algorithm, valued\nfor its speed, robustness, and integration with calibration pipelines. However,\nnext-generation facilities such as the ngVLA, SKA, and ALMAs Wideband\nSensitivity Upgrade will produce data volumes and dynamic ranges that exceed\nthe scalability of traditional methods. CLEAN remains dominant due to its\nsimplicity and accumulated expertise, yet its assumption of modeling the sky as\npoint sources limits its ability to recover extended emission and hampers\nautomation. We review CLEANs limitations and survey alternatives, including\nmultiscale extensions, compressive sensing, Regularized Maximum Likelihood,\nBayesian inference, and AI-driven approaches. Forward-modeling methods enable\nhigher fidelity, flexible priors, and uncertainty quantification, albeit at\ngreater computational cost. Hybrid approaches such as Autocorr-CLEAN, CG-CLEAN,\nand PolyCLEAN retain CLEANs workflow while incorporating modern optimization.\nWe argue hybrids are best suited for the near term, while Bayesian and AI-based\nframeworks represent the long-term future of interferometric imaging."}
{"id": "2509.14555", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.14555", "abs": "https://arxiv.org/abs/2509.14555", "authors": ["XRISM collaboration", "Marc Audard", "Hisamitsu Awaki", "Ralf Ballhausen", "Aya Bamba", "Ehud Behar", "Rozenn Boissay-Malaquin", "Laura Brenneman", "Gregory V. Brown", "Lia Corrales", "Elisa Costantini", "Renata Cumbee", "Maria Diaz Trigo", "Chris Done", "Tadayasu Dotani", "Ken Ebisawa", "Megan Eckart", "Dominique Eckert", "Teruaki Enoto", "Satoshi Eguchi", "Yuichiro Ezoe", "Adam Foster", "Ryuichi Fujimoto", "Yutaka Fujita", "Yasushi Fukazawa", "Kotaro Fukushima", "Akihiro Furuzawa", "Luigi Gallo", "Javier A. Garcia", "Liyi Gu", "Matteo Guainazzi", "Kouichi Hagino", "Kenji Hamaguchi", "Isamu Hatsukade", "Katsuhiro Hayashi", "Takayuki Hayashi", "Natalie Hell", "Edmund Hodges-Kluck", "Ann Hornschemeier", "Yuto Ichinohe", "Manabu Ishida", "Kumi Ishikawa", "Yoshitaka Ishisaki", "Jelle Kaastra", "Timothy Kallman", "Erin Kara", "Satoru Katsuda", "Yoshiaki Kanemaru", "Richard Kelley", "Caroline Kilbourne", "Shunji Kitamoto", "Shogo Kobayashi", "Takayoshi Kohmura", "Aya Kubota", "Maurice Leutenegger", "Michael Loewenstein", "Yoshitomo Maeda", "Maxim Markevitch", "Hironori Matsumoto", "Kyoko Matsushita", "Dan McCammon", "Brian McNamara", "Francois Mernier", "Eric D. Miller", "Jon M. Miller", "Ikuyuki Mitsuishi", "Misaki Mizumoto", "Tsunefumi Mizuno", "Koji Mori", "Koji Mukai", "Hiroshi Murakami", "Richard Mushotzky", "Hiroshi Nakajima", "Kazuhiro Nakazawa", "Jan-Uwe Ness", "Kumiko Nobukawa", "Masayoshi Nobukawa", "Hirofumi Noda", "Hirokazu Odaka", "Shoji Ogawa", "Anna Ogorzalek", "Takashi Okajima", "Naomi Ota", "Stephane Paltani", "Robert Petre", "Paul Plucinsky", "Frederick Scott Porter", "Katja Pottschmidt", "Kosuke Sato", "Toshiki Sato", "Makoto Sawada", "Hiromi Seta", "Megumi Shidatsu", "Aurora Simionescu", "Randall Smith", "Hiromasa Suzuki", "Andrew Szymkowiak", "Hiromitsu Takahashi", "Mai Takeo", "Toru Tamagawa", "Keisuke Tamura", "Takaaki Tanaka", "Atsushi Tanimoto", "Makoto Tashiro", "Yukikatsu Terada", "Yuichi Terashima", "Yohko Tsuboi", "Masahiro Tsujimoto", "Hiroshi Tsunemi", "Takeshi G. Tsuru", "Aysegul Tumer", "Hiroyuki Uchida", "Nagomi Uchida", "Yuusuke Uchida", "Hideki Uchiyama", "Yoshihiro Ueda", "Shinichiro Uno", "Jacco Vink", "Shin Watanabe", "Brian J. Williams", "Satoshi Yamada", "Shinya Yamada", "Hiroya Yamaguchi", "Kazutaka Yamaoka", "Noriko Yamasaki", "Makoto Yamauchi", "Shigeo Yamauchi", "Tahir Yaqoob", "Tomokage Yoneyama", "Tessei Yoshida", "Mihoko Yukita", "Irina Zhuravleva", "Joey Neilsen", "Ryota Tomaru", "Missagh Mehdipour"], "title": "Stratified wind from a super-Eddington X-ray binary is slower than expected", "comment": "author version of the accepted manuscript. see final published\n  version at https://doi.org/10.1038/s41586-025-09495-w (Nature September 17\n  2025)", "summary": "Accretion discs in strong gravity ubiquitously produce winds, seen as\nblueshifted absorption lines in the X-ray band of both stellar mass X-ray\nbinaries (black holes and neutron stars), and supermassive black holes. Some of\nthe most powerful winds (termed Eddington winds) are expected to arise from\nsystems where radiation pressure is sufficient to unbind material from the\ninner disc ($L\\gtrsim L_{\\rm Edd}$). These winds should be extremely fast and\ncarry a large amount of kinetic power, which, when associated with supermassive\nblack holes, would make them a prime contender for the feedback mechanism\nlinking the growth of those black holes with their host galaxies. Here we show\nthe XRISM Resolve spectrum of the Galactic neutron star X-ray binary, GX 13+1,\nwhich reveals one of the densest winds ever seen in absorption lines. This\nCompton-thick wind significantly attenuates the flux, making it appear faint,\nalthough it is intrinsically more luminous than usual ($L\\gtrsim L_{\\rm Edd}$).\nHowever, the wind is extremely slow, more consistent with the predictions of\nthermal-radiative winds launched by X-ray irradiation of the outer disc, than\nwith the expected Eddington wind driven by radiation pressure from the inner\ndisc. This puts new constraints on the origin of winds from bright accretion\nflows in binaries, but also highlights the very different origin required for\nthe ultrafast ($v\\sim 0.3c$) winds seen in recent Resolve observations of a\nsupermassive black hole at similarly high Eddington ratio."}
{"id": "2509.14407", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.14407", "abs": "https://arxiv.org/abs/2509.14407", "authors": ["Shoukat Ali", "Dave Z. Besson for ARA Collaboration"], "title": "Study of an Isolated Double-pulse Cosmic Ray Candidate Recorded with the Askaryan Radio Array", "comment": null, "summary": "The radio-frequency emissions produced by particle showers on Earth,\nresulting from cosmic rays (CRs) and ultra-high energy neutrinos (UHE-$\\nu$)\noriginating from astrophysical sources share significant similarities, enabling\nradio detectors initially designed for UHE-$\\nu$ searches to also study CRs.\nThe Askaryan Radio Array (ARA), an experiment currently operating within the\nice at the South Pole, is primarily designed to detect UHE-$\\nu$s. To date, ARA\nhas deployed five stations, with each station equipped with antennas installed\nat depths up to 200 meters in the ice. Data recorded by ARA Station-2 (A2)\nsuggest a potential CR origin for a subset of events identified in a UHE-$\\nu$\nsearch. This subset includes a double-pulse event potentially from a downward\npropagating CR-induced air shower, with in-air geomagnetic emission followed by\nin-ice Askaryan emission producing the two pulses. A detailed investigation of\nthis CR candidate event using comprehensive simulations has been conducted with\nthe goal of identifying the parameters of a CR-induced air shower that best\nmatch the experimentally observed quantities. We simulate predicted CR signals\nin ARA by combining an impacting CR shower simulation framework (FAERIE) with a\nrealistic detector simulation (AraSim).\n  We determine the event topology based on the vertex reconstruction of both\nthe putative geomagnetic and Askaryan signals. After inferring the event\ngeometry, we show that the simulation matches the observed time structure of\nthe event (channel-by-channel relative signal arrival times) for the recorded\nevent."}
{"id": "2509.14587", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.14587", "abs": "https://arxiv.org/abs/2509.14587", "authors": ["Zhen-Jie Wang", "Ruo-Yu Liu", "Xiang-Yu Wang"], "title": "The Stochastic Dissipation Model for the Steady State Neutrino and Multi-Wavelength Emission of TXS 0506+056", "comment": "10 pages, 3 figures, accepted for publication in PRD", "summary": "The blazar TXS 0506+056 has been suggested to be a potential high-energy\nneutrino source thanks to the observations of IceCube, which found\noutburst-like neutrino emissions during 2014-2015 and 2017 in the transient\nemission search, and a $3.5\\sigma$ local significance in a 10-year\ntime-integrated search. The conventional one-zone jet model cannot explain the\nobserved neutrino flux during outbursts due to the constraint from the X-ray\nflux, leading to proposals of multi-zone models (e.g. two-zone model) with\nmultiple radiation zones. In literature, it has been shown that multi-zone\nmodels may consistently explain the high-state neutrino emission and the\nmulti-wavelength emission of TXS 0506+056, while the quasi-steady-state\nlong-term emission has not been well studied. In this work, we investigate a\nphysically based model for the quasi-steady-state neutrino and electromagnetic\nradiation under the same framework, and successfully reproduce the\nmulti-messenger emission of TXS 0506+056."}
{"id": "2509.14955", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.14955", "abs": "https://arxiv.org/abs/2509.14955", "authors": ["Martina Boháčová"], "title": "AugerPrime Surface Detector Electronics: requirements, verification and performance", "comment": null, "summary": "The Pierre Auger Observatory has recently undergone a major upgrade, called\nAugerPrime, tailored to answer the current most pressing questions in the\nultra-high-energy cosmic ray (UHECR) detection. The AugerPrime upgrade consists\nof the addition, on top of each station, of a scintillator detector, to\nseparate the muonic and electromagnetic component of the shower for better\nprimary identification, and of a radio detector to measure the emission of air\nshowers in 30-80 MHz range. An additional small diameter photomultiplier is\ninstalled in each station to increase the dynamic range for signal detection.\nNew electronic modules, installed on all stations, provide a sufficient number\nof channels for the readout of the additional detectors, as well as faster\nsampling, increased dynamic range and processing capability. In this\ncontribution we summarize the performance of the new electronic modules with\nrespect to the requirements, describe the verification procedure and give the\nresults in the laboratory tests compared to the performance in the field."}
{"id": "2509.14715", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.14715", "abs": "https://arxiv.org/abs/2509.14715", "authors": ["Jieying Liu", "Jirong Mao", "Shao-Lin Xiong", "Yan-Qiu Zhang"], "title": "The Production Mechanism of the High-energy Emission Line in the Brightest Cosmic Burst", "comment": "Accepted for publication in ApJ", "summary": "As a characteristic feature of the spectrum, the emission line carries\ncritical information on the underlying physics of the radiation. After\nextensive efforts in decades, the first high-significant detection of a series\nof emission lines evolving from 37 MeV to 6 MeV has been detected in the\never-bright gamma-ray burst GRB 221009A. However, the physical mechanism of the\nentire evolutionary trend of the lines remains elusive. To provide a\nself-consistent interpretation, we propose a novel scenario in which the\nphotons of the line undergo a radiation transfer process called\ndown-Comptonization after generation by the electron--positron pair\nannihilation. By incorporating the gamma-ray burst dynamical evolution, we\nsystematically reproduce the observed evolution of the central energy, width,\nand flux of the emission line and further impose stringent constraints on the\nproduction of high-energy emission lines in general. Our study provides a new\ndirection to the research of extreme cosmic bursts."}
{"id": "2509.14973", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.14973", "abs": "https://arxiv.org/abs/2509.14973", "authors": ["T. Miener", "I. Viale", "B. Lacave", "A. Cerviño"], "title": "Deep Learning-Based Stereoscopic Event Reconstruction for CTAO using CTLearn", "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC\n  2025), 2025", "summary": "The Cherenkov Telescope Array Observatory (CTAO), a next-generation\nground-based gamma-ray observatory, will be composed of two arrays of multiple\nimaging atmospheric Cherenkov telescopes (IACTs) located in both the Northern\nand Southern Hemispheres. Its goal is to enhance the sensitivity of current\ninstruments by a factor of five to ten over an energy range from 20 GeV to over\n300 TeV. IACT arrays are used to probe the very-high-energy (VHE) gamma-ray\nsky, operating by simultaneously observing air showers triggered by the\ninteraction of VHE gamma rays and cosmic rays with the atmosphere. Cherenkov\nphotons produced by these showers create a stereoscopic record of the event. By\nreconstructing the event using machine learning techniques, the properties of\nthe originating VHE particle-including its type, energy, and incoming\ndirection-can be determined. In this contribution, we present a fully\ndeep-learning-driven approach to reconstruct simulated, stereoscopic IACT\nevents using CTLearn. CTLearn is a package designed for loading and\nmanipulating IACT data and for running deep learning models with pixel-wise\ncamera data as input."}
{"id": "2509.14753", "categories": ["astro-ph.HE", "hep-ph"], "pdf": "https://arxiv.org/pdf/2509.14753", "abs": "https://arxiv.org/abs/2509.14753", "authors": ["Denise Boncioli", "Valdir Barbosa Bezerra", "Matteo Giammarco", "Iarley Pereira Lobo", "Pedro Morais", "Francesco Salamida"], "title": "Lorentz invariance violation in the extragalactic propagation of ultra-high energy photons and in the development of showers in the Earth crust and atmosphere", "comment": "8 pages, ICRC25 proceedings", "summary": "We investigate the effects of Lorentz invariance violation (LIV) on photon\ninteractions, considering both intergalactic propagation (Breit-Wheeler\nprocess) and atmospheric interactions (Bethe-Heitler process). By incorporating\nLIV into the theoretical framework, we analyze how it modifies key quantities\nsuch as the cross section, threshold energy, and mean free path of photons\ntraveling through intergalactic space. In addition, we study its impact on\nextensive air showers initiated by high-energy photons, demonstrating that LIV\ncan alter the cross section of the primary interaction in the atmosphere.\nAdditionally, we also test the photon interactions in the Earth crust, to\nevaluate if they can induce upward-going showers. Our results highlight the\nnecessity of accounting for both propagation effects in intergalactic space and\ninteractions in the atmosphere when evaluating LIV signatures. Even small\ndeviations from Lorentz invariance can lead to measurable changes in\nastroparticle propagation and photon dynamics, offering new opportunities to\ntest quantum gravity theories through high-energy astrophysical observations."}
{"id": "2509.15010", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.15010", "abs": "https://arxiv.org/abs/2509.15010", "authors": ["T. Miener", "L. Burmistrov", "B. Lacave", "A. Cerviño"], "title": "First IACT Waveform Analysis Based on Deep Convolutional Neural Networks Using CTLearn", "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC\n  2025), 2025", "summary": "Imaging atmospheric Cherenkov telescopes (IACTs) detect extended air showers\n(EASs) generated when very-high-energy (VHE) gamma rays or cosmic rays interact\nwith the Earth's atmosphere. Cherenkov photons produced during an EAS are\ncaptured by fast-imaging cameras, which record both the spatial and temporal\ndevelopment of the shower, along with calorimetric data. By analyzing these\nrecordings, the properties of the original VHE particle-such as its type,\nenergy, and direction of arrival-can be reconstructed through machine learning\ntechniques. This contribution focuses on the Large-Sized Telescopes (LSTs) of\nthe Cherenkov Telescope Array Observatory, a next-generation ground-based\ngamma-ray observatory. LSTs are responsible for reconstructing lower-energy\ngamma rays in the tens of GeV range. We explore a novel event reconstruction\ntechnique based on deep convolutional neural networks (CNNs) applied on\ncalibrated and cleaned waveforms of the IACT camera pixels using CTLearn. Our\napproach explicitly incorporates the time development of the shower, enabling a\nmore accurate reconstruction of the event. This method eliminates the need for\ncharge integration or handcrafted feature extraction, allowing the model to\ndirectly learn from waveform data."}
{"id": "2509.14776", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2509.14776", "abs": "https://arxiv.org/abs/2509.14776", "authors": ["Anton Stall", "Philipp Mertsch"], "title": "Diffuse emission from stochastic sources", "comment": "8 pages, 3 figures, Proceedings of the 39th International Cosmic Ray\n  Conference (ICRC2025)", "summary": "Diffuse emission in gamma-rays and neutrinos are produced by the interaction\nof cosmic rays with the interstellar medium. Below some hundreds of TeV, the\nsources of these cosmic rays are most likely Galactic. Hence, observations of\nhigh-energy gamma-rays and neutrinos can be used to probe the flux of cosmic\nrays in other parts of the Galaxy. Supernova remnants are usually considered as\nthe prime candidate for the acceleration of Galactic cosmic rays. They inject\ncosmic rays in a point-like and specific time-dependent manner. As the precise\npositions and ages of the sources are not known, predictions must be obtained\nin a stochastic model. At GeV energies, the distribution of sources can be\napproximated with a smoothly varying spatial and temporal source density. At\nhundreds of TeV, however, the point-like nature matters as less sources\ncontribute effectively due to shorter escape times. We have modelled diffuse\nemissions at hundreds of TeV, relevant for measurements by LHAASO, Tibet\nAS-gamma, IceCube, and the upcoming SWGO, as well as at tens of GeV, as\nmeasured by Fermi-LAT. This reveals the distinctive nature of diffuse emissions\nat the respective energies which can likely be used to constrain source models\nand locate cosmic ray sources."}
{"id": "2509.14818", "categories": ["astro-ph.HE", "hep-ex", "hep-ph"], "pdf": "https://arxiv.org/pdf/2509.14818", "abs": "https://arxiv.org/abs/2509.14818", "authors": ["Tomislav Terzić", "Karlo Mrakovčić"], "title": "Searching for Lorentz invariance violation with artificial neural networks", "comment": "8 pages; 2 figures; proceeding from ICRC 2025", "summary": "Lorentz invariance violation (LIV) can have multiple consequences on\nvery-high energy gamma rays' emission, propagation, and detection, such as\nenergy-dependent photon group velocity, photon instability, vacuum\nbirefringence, and modified electromagnetic interaction. Depending on the\nunderlying theoretical model, several of these effects can coexist.\nNevertheless, in experimental tests of LIV, each effect is tested separately\nand independently. Here, we are performing a search for traces of several\ncoexisting effects in a single analysis. We present our analysis method based\non artificial neural networks and put our very first results in the context of\nexperimental searches for LIV."}
{"id": "2509.14867", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.14867", "abs": "https://arxiv.org/abs/2509.14867", "authors": ["Alan Sunny", "Martina Cardillo", "Antonio Tutone"], "title": "Studying SNR-MC interactions as galactic PeVatrons in the era of CTAO and ASTRI Mini-Array", "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC\n  2025), 2025", "summary": "Supernova remnants (SNRs) are widely recognized as key accelerators of\nGalactic cosmic rays (CRs), supported by the detection of the characteristic\npion bump in the gamma-ray spectra of several SNRs. However, the recent\nobservation of ultra-high-energy (UHE, greater than 100 TeV) gamma-rays by\nLHAASO from sources such as W51 region challenges standard models, which\npredict CR acceleration up to PeV energies only during the early (~ 100 year)\nphase of SNR evolution. Given the older age of known SNRs, alternative\nmechanisms - such as the interaction of runaway CRs with nearby molecular\nclouds (MCs) - have been proposed to explain the persistent UHE emission. In\nthis study, we focus on the W51 complex, particularly the W51C-B region, as a\npromising site for investigating SNR-MC interactions. Simulated observations\nwith the CTAO and the ASTRI Mini-Array are presented to demonstrate their\ncrucial role in bridging the energy gap between Fermi-LAT and LHAASO,\nespecially in the 0.3-100 TeV range. Their improved angular resolution will\nalso help disentangle emission components from the interaction zone and nearby\nsources. Our theoretical modelling suggests that accelerated particles at the\nshock can account for the radio and GeV data, while UHE emission could be best\nexplained by the combined contribution from both acceleration and adiabatic\ncompression of cloud material at the SNR-MC interface."}
{"id": "2509.14895", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.14895", "abs": "https://arxiv.org/abs/2509.14895", "authors": ["KM3NeT Collaboration", "O. Adriani", "A. Albert", "A. R. Alhebsi", "S. Alshalloudi", "M. Alshamsi", "S. Alves Garre", "A. Ambrosone", "F. Ameli", "M. Andre", "L. Aphecetche", "M. Ardid", "S. Ardid", "J. Aublin", "F. Badaracco", "L. Bailly-Salins", "B. Baret", "A. Bariego-Quintana", "Y. Becherini", "M. Bendahman", "F. Benfenati Gualandi", "M. Benhassi", "D. M. Benoit", "Beňušová", "E. Berbee", "E. Berti", "V. Bertin", "P. Betti", "S. Biagi", "M. Boettcher", "D. Bonanno", "S. Bottai", "A. B. Bouasla", "J. Boumaaza", "M. Bouta", "M. Bouwhuis", "C. Bozza", "R. M. Bozza", "H. Brânzaš", "F. Bretaudeau", "M. Breuhaus", "R. Bruijn", "J. Brunner", "R. Bruno", "E. Buis", "R. Buompane", "J. Busto", "B. Caiffi", "D. Calvo", "A. Capone", "F. Carenini", "V. Carretero", "T. Cartraud", "P. Castaldi", "V. Cecchini", "S. Celli", "L. Cerisy", "M. Chabab", "A. Chen", "S. Cherubini", "T. Chiarusi", "M. Circella", "R. Clark", "R. Cocimano", "J. A. B. Coelho", "A. Coleiro", "A. Condorelli", "R. Coniglione", "P. Coyle", "A. Creusot", "G. Cuttone", "R. Dallier", "A. De Benedittis", "G. De Wasseige", "V. Decoene", "P. Deguire", "I. Del Rosso", "L. S. Di Mauro", "I. Di Palma", "A. F. Díaz", "D. Diego-Tortosa", "C. Distefano", "A. Domi", "C. Donzaud", "D. Dornic", "E. Drakopoulou", "D. Drouhin", "J. -G. Ducoin", "P. Duverne", "R. Dvornický", "T. Eberl", "E. Eckerová", "A. Eddymaoui", "T. van Eeden", "M. Eff", "D. van Eijk", "I. El Bojaddaini", "S. El Hedri", "S. El Mentawi", "A. Enzenhöfer", "G. Ferrara", "M. D. Filipović", "F. Filippini", "D. Franciotti", "L. A. Fusco", "S. Gagliardini", "T. Gal", "J. García Méndez", "A. Garcia Soto", "C. Gatius Oliver", "N. Geißelbrecht", "E. Genton", "H. Ghaddari", "L. Gialanella", "B. K. Gibson", "E. Giorgio", "I. Goos", "P. Goswami", "S. R. Gozzini", "R. Gracia", "B. Guillon", "C. Haack", "H. van Haren", "A. Heijboer", "L. Hennig", "J. J. Hernández-Rey", "A. Idrissi", "W. Idrissi Ibnsalih", "G. Illuminati", "R. Jaimes", "O. Janik", "D. Joly", "M. de Jong", "P. de Jong", "B. J. Jung", "P. Kalaczyński", "J. Keegans", "V. Kikvadze", "G. Kistauri", "C. Kopper", "A. Kouchner", "Y. Y. Kovalev", "L. Krupa", "V. Kueviakoe", "V. Kulikovskiy", "R. Kvatadze", "M. Labalme", "R. Lahmann", "M. Lamoureux", "G. Larosa", "C. Lastoria", "J. Lazar", "A. Lazo", "G. Lehaut", "V. Lemaître", "E. Leonora", "N. Lessing", "G. Levi", "M. Lindsey Clark", "F. Longhitano", "S. Madarapu", "F. Magnani", "L. Malerba", "F. Mamedov", "A. Manfreda", "A. Manousakis", "M. Marconi", "A. Margiotta", "A. Marinelli", "C. Markou", "L. Martin", "M. Mastrodicasa", "S. Mastroianni", "J. Mauro", "K. C. K. Mehta", "G. Miele", "P. Migliozzi", "E. Migneco", "M. L. Mitsou", "C. M. Mollo", "L. Morales-Gallegos", "N. Mori", "A. Moussa", "I. Mozun Mateo", "R. Muller", "M. R. Musone", "M. Musumeci", "S. Navas", "A. Nayerhoda", "C. A. Nicolau", "B. Nkosi", "B. Ó Fearraigh", "V. Oliviero", "A. Orlando", "E. Oukacha", "L. Pacini", "D. Paesani", "J. Palacios González", "G. Papalashvili", "P. Papini", "V. Parisi", "A. Parmar", "C. Pastore", "A. M. Păun", "G. E. Păvălaš", "S. Peña Martínez", "M. Perrin-Terrin", "V. Pestel", "M. Petropavlova", "P. Piattelli", "A. Plavin", "C. Poirè", "V. Popa", "T. Pradier", "J. Prado", "S. Pulvirenti", "C. A. Quiroz-Rangel", "N. Randazzo", "A. Ratnani", "S. Razzaque", "I. C. Rea", "D. Real", "G. Riccobene", "J. Robinson", "A. Romanov", "E. Ros", "A. Šaina", "F. Salesa Greus", "D. F. E. Samtleben", "A. Sánchez Losa", "S. Sanfilippo", "M. Sanguineti", "D. Santonocito", "P. Sapienza", "M. Scaringella", "M. Scarnera", "J. Schnabel", "J. Schumann", "J. Seneca", "P. A. Sevle Myhr", "I. Sgura", "R. Shanidze", "Chengyu Shao", "A. Sharma", "Y. Shitov", "F. Šimkovic", "A. Simonelli", "A. Sinopoulou", "B. Spisso", "M. Spurio", "O. Starodubtsev", "D. Stavropoulos", "I. Štekl", "D. Stocco", "M. Taiuti", "G. Takadze", "Y. Tayalati", "H. Thiersen", "S. Thoudam", "I. Tosta e Melo", "B. Trocmé", "V. Tsourapis", "E. Tzamariudaki", "A. Ukleja", "A. Vacheret", "V. Valsecchi", "V. Van Elewyck", "G. Vannoye", "E. Vannuccini", "G. Vasileiadis", "F. Vazquez de Sola", "A. Veutro", "S. Viola", "D. Vivolo", "A. van Vliet", "E. de Wolf", "I. Lhenry-Yvon", "S. Zavatarelli", "D. Zito", "J. D. Zornoza", "J. Zúñiga"], "title": "Constraining gamma-ray burst parameters with the first ultra-high energy neutrino event KM3-230213A", "comment": null, "summary": "Context: The detection of the highest energy neutrino observed to date by\nKM3NeT, with an estimated energy of 220 PeV, opens up new possibilities for the\nstudy and identification of the astrophysical sources responsible for a diffuse\nflux of such ultra-high-energy neutrinos, among which gamma-ray bursts are\nlongstanding candidates.\n  Aims: Based on the event KM3-230213A, we derive constraints on the baryon\nloading and density of the surrounding environment in models of blastwaves in\nlong-duration gamma-ray bursts.\n  Methods: We compute the diffuse flux from gamma-ray burst blastwaves, either\nexpanding in a constant density interstellar medium or developing in a radially\ndecreasing density of a wind-like environment surrounding the gamma-ray burst\nprogenitor star, by taking into account the expected neutrino spectra and\nluminosity function. We use a Poisson likelihood method to constrain the\nblastwave model parameters by calculating the expected number of neutrino\nevents within the 90% confidence level energy range of KM3-230213A and by using\nthe joint exposure of KM3NeT/ARCA, IceCube and Pierre Auger.\n  Results: We constrain the baryon loading to be $\\leq \\{392, 131, 39, 13\\}$ at\n90% confidence level, which is inversely proportional to a varying interstellar\nmedium particle density of $\\{1, 3, 10, 30\\}$ cm$^{-3}$. In the wind-like\nenvironment case, the baryon loading is $\\leq \\{20, 50, 100\\}$ at 90%\nconfidence level, which is proportional to the sixth power of a varying density\nparameter of $\\{0.05, 0.06, 0.07\\}$."}
{"id": "2509.14955", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.14955", "abs": "https://arxiv.org/abs/2509.14955", "authors": ["Martina Boháčová"], "title": "AugerPrime Surface Detector Electronics: requirements, verification and performance", "comment": null, "summary": "The Pierre Auger Observatory has recently undergone a major upgrade, called\nAugerPrime, tailored to answer the current most pressing questions in the\nultra-high-energy cosmic ray (UHECR) detection. The AugerPrime upgrade consists\nof the addition, on top of each station, of a scintillator detector, to\nseparate the muonic and electromagnetic component of the shower for better\nprimary identification, and of a radio detector to measure the emission of air\nshowers in 30-80 MHz range. An additional small diameter photomultiplier is\ninstalled in each station to increase the dynamic range for signal detection.\nNew electronic modules, installed on all stations, provide a sufficient number\nof channels for the readout of the additional detectors, as well as faster\nsampling, increased dynamic range and processing capability. In this\ncontribution we summarize the performance of the new electronic modules with\nrespect to the requirements, describe the verification procedure and give the\nresults in the laboratory tests compared to the performance in the field."}
{"id": "2509.14973", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.14973", "abs": "https://arxiv.org/abs/2509.14973", "authors": ["T. Miener", "I. Viale", "B. Lacave", "A. Cerviño"], "title": "Deep Learning-Based Stereoscopic Event Reconstruction for CTAO using CTLearn", "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC\n  2025), 2025", "summary": "The Cherenkov Telescope Array Observatory (CTAO), a next-generation\nground-based gamma-ray observatory, will be composed of two arrays of multiple\nimaging atmospheric Cherenkov telescopes (IACTs) located in both the Northern\nand Southern Hemispheres. Its goal is to enhance the sensitivity of current\ninstruments by a factor of five to ten over an energy range from 20 GeV to over\n300 TeV. IACT arrays are used to probe the very-high-energy (VHE) gamma-ray\nsky, operating by simultaneously observing air showers triggered by the\ninteraction of VHE gamma rays and cosmic rays with the atmosphere. Cherenkov\nphotons produced by these showers create a stereoscopic record of the event. By\nreconstructing the event using machine learning techniques, the properties of\nthe originating VHE particle-including its type, energy, and incoming\ndirection-can be determined. In this contribution, we present a fully\ndeep-learning-driven approach to reconstruct simulated, stereoscopic IACT\nevents using CTLearn. CTLearn is a package designed for loading and\nmanipulating IACT data and for running deep learning models with pixel-wise\ncamera data as input."}
{"id": "2509.15010", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.15010", "abs": "https://arxiv.org/abs/2509.15010", "authors": ["T. Miener", "L. Burmistrov", "B. Lacave", "A. Cerviño"], "title": "First IACT Waveform Analysis Based on Deep Convolutional Neural Networks Using CTLearn", "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC\n  2025), 2025", "summary": "Imaging atmospheric Cherenkov telescopes (IACTs) detect extended air showers\n(EASs) generated when very-high-energy (VHE) gamma rays or cosmic rays interact\nwith the Earth's atmosphere. Cherenkov photons produced during an EAS are\ncaptured by fast-imaging cameras, which record both the spatial and temporal\ndevelopment of the shower, along with calorimetric data. By analyzing these\nrecordings, the properties of the original VHE particle-such as its type,\nenergy, and direction of arrival-can be reconstructed through machine learning\ntechniques. This contribution focuses on the Large-Sized Telescopes (LSTs) of\nthe Cherenkov Telescope Array Observatory, a next-generation ground-based\ngamma-ray observatory. LSTs are responsible for reconstructing lower-energy\ngamma rays in the tens of GeV range. We explore a novel event reconstruction\ntechnique based on deep convolutional neural networks (CNNs) applied on\ncalibrated and cleaned waveforms of the IACT camera pixels using CTLearn. Our\napproach explicitly incorporates the time development of the shower, enabling a\nmore accurate reconstruction of the event. This method eliminates the need for\ncharge integration or handcrafted feature extraction, allowing the model to\ndirectly learn from waveform data."}
{"id": "2509.15168", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.15168", "abs": "https://arxiv.org/abs/2509.15168", "authors": ["Michela Rigoselli", "Sarah Recchia", "Alberto Bonollo", "Silvia Crestan", "Giada Peron", "Andrea Giuliani", "Sandro Mereghetti"], "title": "Unveiling TeV halos among unidentified extended TeV sources", "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC\n  2025), 2025", "summary": "In recent years, the number of known sources emitting very- and\nultra-high-energy gamma-rays has increased significantly thanks to facilities\nsuch as LHAASO and HAWC. Many of the observed sources are still unidentified or\npoorly constrained due to the limited angular resolution of these instruments;\nhowever, it is now ascertained that approximately half of them have a pulsar in\ncoincidence. Some of these unidentified extended sources may be the result of\nthe diffusion of leptons accelerated by the pulsar itself or in its nebula to\nenergies exceeding 50 TeV. This new class of sources, called TeV halos, is\ncharacterized by a peculiar radial profile that, if properly resolved, is key\nto distinguishing them from other TeV sources that are associated with a\npulsar, such as supernova remnants and pulsar wind nebulae. In this\ncontribution, we consider all the pulsars which are spatially coincident with\nan unidentified extended TeV source, in order to quantify whether its spin-down\npower, age and distance allow the pulsar to produce a TeV halo with the\nobserved flux and extension. We also investigate how the next generation of\nImaging Atmospheric Cherenkov Telescopes (IACTs), namely the Cherenkov\nTelescope Array Observatory (CTAO) and the ASTRI Mini-Array, will observe and\ncharacterize these TeV halos. We present a set of simulated sources with the\nexpected morphology and spectrum, and we show for which of them we can\ndistinguish between TeV halos and other classes of extended sources."}
{"id": "2509.15108", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.15108", "abs": "https://arxiv.org/abs/2509.15108", "authors": ["Anastasiia Mikhno", "Federica Bradascio", "Jonathan Biteau", "François Brun", "Patrick Brun", "Hossam Boutalha", "Justine Devin", "Armelle Jardin-Blicq", "Pierre Jean", "Michael Josselin", "Jean-Philippe Lenain", "Quentin Luce", "Vincent Marandon", "Kevin Pressard", "Georges Vasileiadis", "CTAO NectarCAM Collaboration"], "title": "Design and characterization of the Flat-Field Calibration of the NectarCAM Camera", "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC\n  2025), 2025", "summary": "The NectarCAM flat-field flasher is a calibration device designed for the\ncamera that will equip the Medium-Sized Telescopes (MSTs) of the northern site\nof the Cherenkov Telescope Array Observatory (CTAO). Positioned in the centre\nof the MST dish, 16 meters in front of the camera, the flasher emits short\n(FWHM $\\approx$ 5 ns), uniform (2$-$4%) light pulses to illuminate the entire\nfocal plane.\n  Accurate calibration is crucial for the optimal operation of the NectarCAM,\nensuring precise gain computation and mitigating differences in\nlight-collection efficiency of the pixels of the camera. Using the flat-field\nflasher, two informations are obtained : the pixel gain and the relative\nefficiency between pixels. In addition, the flasher is used to probe the\ndynamic range over which the camera operates effectively.\n  In this study, we report on the performance characterisation of the\nflat-field flasher using a dedicated test bench. We report on the results of\ntests conducted on several flasher units, evaluating their reliability.\nFurthermore, we describe how the flat-field coefficients are applied within the\ncamera to ensure uniformity of response of few percent level across all 1855\npixels.\n  As the deployment of the first MST at the CTAO northern site is scheduled for\n2027, this work represents a significant contribution to the collaboration`s\nefforts to finalize camera calibration systems."}
