{"id": "2510.15116", "categories": ["astro-ph.IM", "cs.LG"], "pdf": "https://arxiv.org/pdf/2510.15116", "abs": "https://arxiv.org/abs/2510.15116", "authors": ["Sarod Yatawatta"], "title": "Polarization based direction of arrival estimation using a radio interferometric array", "comment": null, "summary": "Direction of arrival (DOA) estimation is mostly performed using specialized\narrays that have carefully designed receiver spacing and layouts to match the\noperating frequency range. In contrast, radio interferometric arrays are\ndesigned to optimally sample the Fourier space data for making high quality\nimages of the sky.\n  Therefore, using existing radio interferometric arrays (with arbitrary\ngeometry and wide frequency variation) for DOA estimation is practically\ninfeasible except by using images made by such interferometers. In this paper,\nwe focus on low cost DOA estimation without imaging, using a subset of a radio\ninterferometric array, using a fraction of the data collected by the full\narray, and, enabling early determination of DOAs. The proposed method is\nsuitable for transient and low duty cycle source detection. Moreover, the\nproposed method is an ideal follow-up step to online radio frequency\ninterference (RFI) mitigation, enabling the early estimation of the DOA of the\ndetected RFI."}
{"id": "2510.15198", "categories": ["astro-ph.IM", "cs.LG", "eess.IV"], "pdf": "https://arxiv.org/pdf/2510.15198", "abs": "https://arxiv.org/abs/2510.15198", "authors": ["Chao Tang", "Arwa Dabbech", "Adrian Jackson", "Yves Wiaux"], "title": "HyperAIRI: a plug-and-play algorithm for precise hyperspectral image reconstruction in radio interferometry", "comment": "18 pages, 10 figures, submitted to MNRAS", "summary": "The next-generation radio-interferometric (RI) telescopes require imaging\nalgorithms capable of forming high-resolution high-dynamic-range images from\nlarge data volumes spanning wide frequency bands. Recently, AIRI, a\nplug-and-play (PnP) approach taking the forward-backward algorithmic structure\n(FB), has demonstrated state-of-the-art performance in monochromatic RI imaging\nby alternating a data-fidelity step with a regularisation step via learned\ndenoisers. In this work, we introduce HyperAIRI, its hyperspectral extension,\nunderpinned by learned hyperspectral denoisers enforcing a power-law spectral\nmodel. For each spectral channel, the HyperAIRI denoiser takes as input its\ncurrent image estimate, alongside estimates of its two immediate neighbouring\nchannels and the spectral index map, and provides as output its associated\ndenoised image. To ensure convergence of HyperAIRI, the denoisers are trained\nwith a Jacobian regularisation enforcing non-expansiveness. To accommodate\nvarying dynamic ranges, we assemble a shelf of pre-trained denoisers, each\ntailored to a specific dynamic range. At each HyperAIRI iteration, the spectral\nchannels of the target image cube are updated in parallel using\ndynamic-range-matched denoisers from the pre-trained shelf. The denoisers are\nalso endowed with a spatial image faceting functionality, enabling scalability\nto varied image sizes. Additionally, we formally introduce Hyper-uSARA, a\nvariant of the optimisation-based algorithm HyperSARA, promoting joint sparsity\nacross spectral channels via the l2,1-norm, also adopting FB. We evaluate\nHyperAIRI's performance on simulated and real observations. We showcase its\nsuperior performance compared to its optimisation-based counterpart\nHyper-uSARA, CLEAN's hyperspectral variant in WSClean, and the monochromatic\nimaging algorithms AIRI and uSARA."}
{"id": "2510.15315", "categories": ["astro-ph.IM", "cs.CV", "stat.AP", "85A35 (Primary), 62F15 (Secondary)"], "pdf": "https://arxiv.org/pdf/2510.15315", "abs": "https://arxiv.org/abs/2510.15315", "authors": ["Yicun Duan", "Xinyue Li", "Camille Avestruz", "Jeffrey Regier"], "title": "Neural Posterior Estimation for Cataloging Astronomical Images from the Legacy Survey of Space and Time", "comment": null, "summary": "The Vera C. Rubin Observatory Legacy Survey of Space and Time (LSST) will\ncommence full-scale operations in 2026, yielding an unprecedented volume of\nastronomical images. Constructing an astronomical catalog, a table of imaged\nstars, galaxies, and their properties, is a fundamental step in most scientific\nworkflows based on astronomical image data. Traditional deterministic\ncataloging methods lack statistical coherence as cataloging is an ill-posed\nproblem, while existing probabilistic approaches suffer from computational\ninefficiency, inaccuracy, or the inability to perform inference with multiband\ncoadded images, the primary output format for LSST images. In this article, we\nexplore a recently developed Bayesian inference method called neural posterior\nestimation (NPE) as an approach to cataloging. NPE leverages deep learning to\nachieve both computational efficiency and high accuracy. When evaluated on the\nDC2 Simulated Sky Survey -- a highly realistic synthetic dataset designed to\nmimic LSST data -- NPE systematically outperforms the standard LSST pipeline in\nlight source detection, flux measurement, star/galaxy classification, and\ngalaxy shape measurement. Additionally, NPE provides well-calibrated posterior\napproximations. These promising results, obtained using simulated data,\nillustrate the potential of NPE in the absence of model misspecification.\nAlthough some degree of model misspecification is inevitable in the application\nof NPE to real LSST images, there are a variety of strategies to mitigate its\neffects."}
{"id": "2510.15816", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.15816", "abs": "https://arxiv.org/abs/2510.15816", "authors": ["Chen-Wei Wang", "Peng Zhang", "Shao-Lin Xiong", "Yue Huang", "Wen-Jun Tan", "Zheng-Hang Yu", "Yue Wang", "Wang-Chen Xue", "Chao Zheng", "Hao-Xuan Guo", "Ce Cai", "Yong-Wei Dong", "Jiang He", "Cheng-Kui Li", "Xiao-Bo Li", "Jia-Cong Liu", "Xing-Hao Luo", "Xiang Ma", "Yang-Zhao Ren", "Li-Ming Song", "Ping Wang", "Jin Wang", "Bo-Bing Wu", "Shuo Xiao", "Sheng-Lun Xie", "Shu-Xu Yi", "Xue-Yuan Zao", "Xiao-Yun Zhao", "Li Zhang", "Shuang-Nan Zhang", "Yan-Qiu Zhang", "Shi-Jie Zheng"], "title": "BREAKFAST: A Framework for general joint BA duty and follow-up guidance of multiple $γ$-ray monitors", "comment": null, "summary": "With the growing number of gamma-ray monitors in operation, several research\nteams have adopted a strategy of joint operation and scientific duty to improve\nefficiency. A successful example is the GECAM-HXMT-SVOM (GHS) constellation\ncollaboration, which sets a precedent for other gamma-ray monitor\nconstellations. However, joint duty also presents challenges to Burst Advocates\n(BAs), including the increased number of triggers and, more importantly, the\nfrequent switching between various systems due to incompatibilities among\ndifferent missions, which complicates the situation. To address the current\nrequirements of multi-wavelength and multi-messenger astronomy, we developed a\ncustomized framework for unified trigger processing within the GHS joint duty,\nnamed \"BA's Rapid Evaluation and Analysis Kit for Formulating Alerts and\nSummary Tools\" (BREAKFAST). This framework incorporates a series of automated,\nsemi-automated, and manual pipelines designed to rapidly process triggers of\nprompt emissions in the gamma-ray band from different instruments, while\nmaintaining flexible compatibility for future missions. The pursuit of\nBREAKFAST goes beyond merely providing trigger processing for BAs. BREAKFAST\nalso aims to filtering high-value targets and guiding follow-up telescopes\nthrough rapid analysis and reporting, thus serving as an important bridge\nbetween prompt emission observations and afterglow observations. To this end, a\nsuite of comprehensive analysis modules is included in BREAKFAST, particularly\nthe specially designed module that predicts X-ray afterglow brightness based on\nprompt emission properties. The framework's effectiveness has already been\ndemonstrated in recent observational campaigns, and it is expected to play a\nsignificant role in the discovery and observation of peculiar transients in the\nfuture."}
{"id": "2510.15028", "categories": ["astro-ph.HE", "gr-qc"], "pdf": "https://arxiv.org/pdf/2510.15028", "abs": "https://arxiv.org/abs/2510.15028", "authors": ["Yi Qiu", "David Radice", "Sherwood Richers", "Federico Maria Guercilena", "Albino Perego", "Maitraya Bhattacharyya"], "title": "Impact of Neutrino Flavor Conversions on Neutron Star Merger Dynamics, Ejecta, Nucleosynthesis, and Multi-Messenger Signals", "comment": "19 pages, 13 figures, will be submitted to Phys.Rev.D", "summary": "We present numerical relativity simulations of binary neutron star mergers\nincorporating neutrino flavor transformations triggered by fast flavor\ninstability, quantum many-body effects, or potential beyond standard model\nphysics. In both long-lived and short-lived remnant scenarios, neutrino flavor\nconversions modify species-dependent neutrino luminosities and mean energies,\nand drive the matter towards more neutron rich conditions. They produce up to\n$300\\%$ more neutron rich ejecta and significantly boost the r-process yields,\nespecially in low-density, near-equatorial outflows. We identify regions\nunstable to fast flavor instabilities and find that these instabilities persist\ndespite flavor conversions. We further test the sensitivity to the\nequilibration timescale of the flavor conversions, finding that slower flavor\nconversions can interact with thermodynamic equilibration, and increase the\nneutron richness of the ejecta. Flavor conversions may also contribute to\nstronger gravitational wave and neutrino emissions, pointing to a correlation\nbetween neutrino transport and merger dynamics. These results highlight the\npotential impact of flavor conversions while motivating future work to improve\non theoretical understanding of flavor instabilities in global simulations."}
{"id": "2510.15454", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2510.15454", "abs": "https://arxiv.org/abs/2510.15454", "authors": ["Rodrigo Guedes Lang", "Tim Unbehaun", "Lars Mohrmann", "Simon Steinmassl", "Jim Hinton", "Stefan Funk"], "title": "Event types in H.E.S.S.: a combined analysis for different telescope types and energy ranges", "comment": null, "summary": "Imaging atmospheric Cherenkov telescopes (IACTs) are the main technique for\ndetecting gamma rays with energies between tens of GeV and hundreds of TeV.\nAmongst them, the High Energy Stereoscopic System (H.E.S.S.) has pioneered the\nuse of different telescope types to achieve an energy range as broad as\npossible. A large, 28 m diameter telescope is used in monoscopic mode to access\nthe lowest energies ($E \\gtrsim 30$ GeV), while the four smaller, 12 m diameter\ntelescopes are used in stereoscopic mode to study energies between 150 GeV and\n100 TeV. Nevertheless, a combination of both telescope types and trigger\nstrategies has proven to be challenging. In this work, we propose for the first\ntime an analysis based on event types capable of exploiting both telescope\ntypes, trigger strategies, and the whole energy range of the experiment. Due to\nthe large differences between monoscopic and stereoscopic reconstructions, the\ntypes are defined based on Hillas parameters of individual events, resulting in\nthree types (Type M, Type B, and Type A), each dominating over a different\nenergy range. The performances of the new analysis configurations are compared\nto the standard configurations in the H.E.S.S. Analysis Package (HAP), Mono and\nStereo. The proposed analysis provides optimal sensitivity over the whole\nenergy range, in contrast to Mono and Stereo, which focus on smaller energy\nranges. On top of that, improvements in sensitivity of 25-45% are found for\nmost of the energy range. The analysis is validated using real data from the\nCrab Nebula, showing the application to data of an IACT analysis capable of\ncombining significantly different telescope types with significantly different\nenergy ranges. Larger energy coverage, lower energy threshold, smaller\nstatistical uncertainty, and more robustness are observed. The need for a\nrun-by-run correction for the observation conditions is also highlighted."}
{"id": "2510.15049", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.15049", "abs": "https://arxiv.org/abs/2510.15049", "authors": ["Fergus J. E. Baker", "Andrew J. Young"], "title": "Gradus.jl: spacetime-agnostic general relativistic ray-tracing for X-ray spectral modelling", "comment": "17 pages, 19 figures; accepted MNRAS", "summary": "We introduce Gradus.jl, an open-source and publicly available general\nrelativistic ray-tracing toolkit for spectral modelling in arbitrary\nspacetimes. Our software is written in the Julia programming language, making\nuse of forward-mode automatic differentiation for computing the Christoffel\nsymbols during geodesic integration, and for propagating derivatives through\nthe entire ray-tracer. Relevant numerical methods are detailed, and our models\nare validated using a number of tests and comparisons to other codes. The\ndifferentiability is used to optimally calculate Cunningham transfer functions\n-- used to efficiently pre-compute relativistic effects in spectral models. A\nmethod is described for calculating such transfer functions for disc with\nnon-zero vertical height, including the treatment of self-obscuration. An\nextension of the transfer function formalism that includes timing information\nis described, and used to calculate high-resolution reverberation lag spectra\nfor a lamppost corona. The lag-frequency and lag-energy spectra for a\nShakura-Sunyaev accretion disc with various lamppost heights and Eddington\nratios are calculated, and the general impact of disc thickness in reflection\nmodels is discussed."}
{"id": "2510.15534", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2510.15534", "abs": "https://arxiv.org/abs/2510.15534", "authors": ["Ichiro Takahashi", "Tomoki Morokuma", "Masaomi Tanaka", "Mahito Sasada", "Hiroshi Akitaya", "Ichi Tanaka", "Nozomu Tominaga", "Michitoshi Yoshida", "Yousuke Utsumi", "Ryosuke Itoh", "Kyohei Kawaguchi", "the J-GEM collaboration"], "title": "J-GEM near-infrared follow-up observations of the gravitational wave event S240422ed", "comment": "18 pages, 8 figures, 4 tables. Accepted for publication in PASJ", "summary": "We report our near-infrared (NIR) follow-up observations of the gravitational\nwave (GW) event S240422ed using the Subaru Telescope/MOIRCS. S240422ed was\ninitially classified as a black hole-neutron star merger with $>$ 99%\nprobability of electromagnetic wave emission. We started follow-up observations\n7.8 hours after the event. Over two nights, we observed 206 nearby galaxies in\n$Y$ and $K_{\\rm s}$ bands down to about 21.4 and 21.1 AB mag (3$\\sigma$),\nrespectively. The total completeness of our survey based on galaxy $B$-band\nluminosity is 22%. As a result of our observations, five candidate counterparts\nwere identified. We show that properties of these five objects are not\nconsistent with kilonova such as AT2017gfo. Four objects are consistent with\nknown classes of transients such as supernovae or dwarf nova outbursts. On the\nother hand, the nature of the remaining one object, which shows a red color and\nrapid decline, remains unclear. Although later analyses of GW signal\nreclassified S240422ed as likely terrestrial noise, our NIR observations\nprovide valuable lessons for future NIR surveys for GW sources. We demonstrate\nthat deep NIR follow-up observations as presented in this work would\neffectively constrain the presence of red kilonova even at 200 Mpc distance. We\nalso discuss the importance of deep and wide NIR reference images and of\nunderstanding the properties and frequency of Galactic transients."}
{"id": "2510.15064", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.15064", "abs": "https://arxiv.org/abs/2510.15064", "authors": ["Samuel G. D. Turner", "Roman R. Rafikov", "Alexander A. Philippov"], "title": "Wave-Mediated Boundary Layers of Accretion Discs: Role of Internal Structure of the Accretor", "comment": "22 pages, 19 figures, accepted to MNRAS", "summary": "Disc accretion onto astrophysical objects with a material surface proceeds\nthrough the boundary layer (BL) -- a radially narrow region in the inner disc\nwhere the incoming gas must slow down its rotation before settling onto the\nsurface of the accretor. Here we numerically study a BL in which the angular\nmomentum transport in the layer is accomplished via the excitation of global\nacoustic waves. While the earlier studies of such wave-mediated BLs typically\nmodeled the internal structure of the central object as a globally isothermal\nsphere with sharply rising density profile, here we explore the effect of other\ninternal density and temperature profiles on the mode operation. We model the\ninner structure of an accretor as a polytropic sphere, allowing a shallower\nincrease of density and a non-trivial temperature profile inside the object.\nWhile the mix of acoustic modes observed in our long-duration (1000 inner\norbits long) 2D hydrodynamic simulations is a weak function of the polytropic\nindex $n$ of the accretor's structure, the mass accretion rate and the angular\nmomentum flux across the BL show a clear dependence on $n$, both decreasing in\namplitude as $n$ is lowered. Interestingly, in 2D these transport metrics are\nbetter correlated not with $n$ but with a total mass inside the central object\ncontained within the simulation domain. These results improve our understanding\nof the wave-mediated BL accretion by quantifying the effect of the inner\nstructure of the accretor on the excitation and propagation of acoustic modes\nmediating the BL transport."}
{"id": "2510.15102", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.15102", "abs": "https://arxiv.org/abs/2510.15102", "authors": ["Y. Sultan Abylkairov", "Matthew C. Edwards", "Artyom Ostrikov", "Yersultan Tleukhanov", "Alejandro Torres-Forné", "Pablo Cerdá-Durán", "José Antonio Font", "Marek J. Szczepańczyk", "Ernazar Abdikamalov"], "title": "Assessing the Distance for Probing the Nuclear Equation of State with Supernova Gravitational Waves", "comment": "Submitted to PRD. Comments and suggestions are welcome", "summary": "Gravitational waves from core-collapse supernovae provide a unique probe of\nthe equation of state (EOS) of high density matter. In this work, we focus on\nthe bounce signal from numerical simulations of rotating supernovae and explore\nits potential for EOS inference. We employ a support vector machine, previously\nshown to perform best among tested methods, to classify GW signals simulated\nfor 18 EOS models. For optimally oriented sources, we estimate that the\nAdvanced LIGO A+ detector can probe the EOS for Galactic events, while\nthird-generation observatories such as the Einstein Telescope and Cosmic\nExplorer can reach substantially farther. For randomly oriented sources, only\nthese next-generation detectors are expected to have sufficient sensitivity.\nThese results represent the potential observational range for probing the\nnuclear EOS, although, due to the simplifying assumptions adopted, they should\nbe regarded as approximate upper limits."}
{"id": "2510.15149", "categories": ["astro-ph.HE", "nucl-th"], "pdf": "https://arxiv.org/pdf/2510.15149", "abs": "https://arxiv.org/abs/2510.15149", "authors": ["Chun-Ming Yip", "Shu Yan Lau", "Kent Yagi"], "title": "Universal Relations for Elastic Hybrid Stars and Quark Stars", "comment": "15 pages, 10 figures", "summary": "Some compact stars may contain deconfined quark matter, forming hybrid stars\nor quark stars. If the quark matter forms an inhomogeneous condensate in the\ncrystalline color superconducting phase, its rigidity may be high enough to\nnoticeably alter the stellar properties. In this paper, we investigate whether\nthese elastic stars follow the universal relations, i.e., relations insensitive\nto equations of state, that have been well established for fluid stars. We\nimprove upon previous studies by allowing quark matter in the background,\nstatic, and spherically symmetric configuration to be sheared. Such background\nshear can be treated in the form of an effective pressure anisotropy. We then\ncalculate the moment of inertia $I$, tidal deformability ${\\lambda}_2$, and\nspin-induced quadrupole moment $Q$ of these models with pressure anisotropy.\nThe $I$-${\\lambda}_2$-$Q$ universal relations for the elastic hybrid (quark)\nstar models are valid up to a variation of $\\approx2\\,(3)\\%$, larger than that\nfor typical fluid star models, when the maximal magnitude of quark matter shear\nmodulus is considered in the crystalline color superconducting phase from\nrealistic calculations. The uncertainty in universal relations related to the\nstellar compactness for these elastic star models, on the other hand, remain\ncomparable to those for typical fluid star models. Our results demonstrate the\nvalidity of universal relations for hybrid stars and quark stars with a\nrealistic degree of pressure anisotropy due to the crystalline color\nsuperconducting quark matter."}
{"id": "2510.15156", "categories": ["astro-ph.HE", "astro-ph.SR", "physics.plasm-ph"], "pdf": "https://arxiv.org/pdf/2510.15156", "abs": "https://arxiv.org/abs/2510.15156", "authors": ["Zitao Hu", "Xue-Ning Bai", "Xiaochen Sun"], "title": "Magnetohydrodynamic-guiding-center-particle-in-cell Method for Multiscale Plasma Kinetic Simulations", "comment": "28 pages, 10 figures, submitted to ApJS, comments welcomed", "summary": "We present the formulation, algorithm and numerical tests of the\nmagnetohydrodynamic-particle-in-cell (MHD-PIC) method with particles treated\nunder the guiding center approximation, which we term the MHD-gPIC method, and\nit is implemented in the Athena++ MHD code. The new MHD-gPIC model consists of\nthermal (cold) fluid and high-energy particles whose dynamics are integrated\nthrough guiding center equations including drift motion, with carefully\nevaluated source terms as particle backreaction. The code is validated with a\nseries of tests, and it is expected to be primarily applicable to study\nparticle acceleration and transport in systems where gyro-resonance is\nconsidered insignificant. We also present preliminary studies of particle\nacceleration during non-relativistic magnetic reconnection."}
{"id": "2510.15441", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.15441", "abs": "https://arxiv.org/abs/2510.15441", "authors": ["I. Sultana", "A. Estrade", "B. S. Meyer", "H. Schatz"], "title": "Sensitivity of Nuclear Reaction Rates in X-ray Burst Models", "comment": "37 pages, 10 figures, 3 tables, submitted", "summary": "Type I X-ray bursts (XRBs) are thermonuclear runaways on the surface of\naccreting neutron stars, powered by rapid proton-capture and alpha-capture\nprocesses on neutron-deficient nuclei. Uncertainties in the corresponding\nreaction rates remain a major limitation in modeling burst light curves and\nashes. We present a systematic study of the sensitivity of XRB models to\nuncertainties in charged-particle-induced reaction rates across a broad\nparameter space of accretion rates and fuel compositions in low-mass X-ray\nbinaries. The study proceeds in two stages: ignition conditions are first\ndetermined with a semi-analytic framework coupled to a full reaction network,\nfollowed by a sensitivity analysis using the ONEZONE model with individual rate\nvariations. We identify 41 reactions that alter the burst light curve and 187\nthat significantly impact final abundances. Reactions on bottleneck isotopes in\nthe alpha-p- and rp-process paths strongly affect both observables, while most\n(p, gamma) reactions on medium-mass (A > 32) and heavy-mass (A > 55) nuclei\ninfluence only the final composition. Medium-mass cases dominate in He-rich\nbursts, where the reaction flow terminates earlier, while heavy-mass cases\nappear in mixed H and He bursts with extended rp-process paths reaching A ~\n110. We identify a subset of reactions whose rate uncertainties exert influence\non the final 12C yield in helium-rich bursts, which could have important\nconsequences for the mechanism of ignition of carbon superbursts. Our results\nidentify key targets for nuclear reaction experiments to reduce nuclear physics\nuncertainties in XRB models."}
{"id": "2510.15454", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2510.15454", "abs": "https://arxiv.org/abs/2510.15454", "authors": ["Rodrigo Guedes Lang", "Tim Unbehaun", "Lars Mohrmann", "Simon Steinmassl", "Jim Hinton", "Stefan Funk"], "title": "Event types in H.E.S.S.: a combined analysis for different telescope types and energy ranges", "comment": null, "summary": "Imaging atmospheric Cherenkov telescopes (IACTs) are the main technique for\ndetecting gamma rays with energies between tens of GeV and hundreds of TeV.\nAmongst them, the High Energy Stereoscopic System (H.E.S.S.) has pioneered the\nuse of different telescope types to achieve an energy range as broad as\npossible. A large, 28 m diameter telescope is used in monoscopic mode to access\nthe lowest energies ($E \\gtrsim 30$ GeV), while the four smaller, 12 m diameter\ntelescopes are used in stereoscopic mode to study energies between 150 GeV and\n100 TeV. Nevertheless, a combination of both telescope types and trigger\nstrategies has proven to be challenging. In this work, we propose for the first\ntime an analysis based on event types capable of exploiting both telescope\ntypes, trigger strategies, and the whole energy range of the experiment. Due to\nthe large differences between monoscopic and stereoscopic reconstructions, the\ntypes are defined based on Hillas parameters of individual events, resulting in\nthree types (Type M, Type B, and Type A), each dominating over a different\nenergy range. The performances of the new analysis configurations are compared\nto the standard configurations in the H.E.S.S. Analysis Package (HAP), Mono and\nStereo. The proposed analysis provides optimal sensitivity over the whole\nenergy range, in contrast to Mono and Stereo, which focus on smaller energy\nranges. On top of that, improvements in sensitivity of 25-45% are found for\nmost of the energy range. The analysis is validated using real data from the\nCrab Nebula, showing the application to data of an IACT analysis capable of\ncombining significantly different telescope types with significantly different\nenergy ranges. Larger energy coverage, lower energy threshold, smaller\nstatistical uncertainty, and more robustness are observed. The need for a\nrun-by-run correction for the observation conditions is also highlighted."}
{"id": "2510.15463", "categories": ["astro-ph.HE", "astro-ph.CO", "gr-qc"], "pdf": "https://arxiv.org/pdf/2510.15463", "abs": "https://arxiv.org/abs/2510.15463", "authors": ["Otto A. Hannuksela", "K. Haris", "Justin Janquart", "Harsh Narola", "Hemantakumar Phurailatpam", "Jolien D. E. Creighton", "Chris Van Den Broeck"], "title": "Strong gravitational-wave lensing posterior odds", "comment": "19 pages, 6 figures", "summary": "Like light, gravitational waves are gravitationally lensed by intervening\nmassive astrophysical objects, such as galaxies, clusters, black holes, and\nstars, resulting in a variety of potentially observable gravitational-wave\nlensing signatures. Searches for gravitational-wave lensing by the\nLIGO-Virgo-KAGRA (LVK) collaboration have begun. One common method focuses on\nstrong gravitational-wave lensing, which produces multiple \"images\": repeated\ncopies of the same gravitational wave that differ only in amplitude, arrival\ntime, and overall \"Morse phase.\" The literature identifies two separate\napproaches to identifying such repeated gravitational-wave events based on\nfrequentist and Bayesian approaches. Several works have discussed selection\neffects and identified challenges similar to the well-known \"birthday problem\",\nnamely, the rapidly increasing likelihood of false alarms in an ever-growing\ncatalogue of event pairs. Here, we discuss these problems, unify the different\napproaches in Bayesian language, and derive the posterior odds for strong\nlensing. In particular, the Bayes factor and prior odds are sensitive to the\nnumber of gravitational-wave events in the data, but the posterior odds are\ninsensitive to it once strong lensing time delays are accounted for. We confirm\nLo et al.'s (2020) finding that selection effects enter the Bayes factor as an\noverall normalisation constant. However, this factor cancels out in the\nposterior odds and does not affect frequentist approaches to strong lensing\ndetection."}
{"id": "2510.15465", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.15465", "abs": "https://arxiv.org/abs/2510.15465", "authors": ["Alicja Wierzcholska", "Hubert Siejkowski"], "title": "Disentangling two spectral components in the X-ray emission of the blazar 1ES 0229+200", "comment": "7 pages, 3 figures, accepted for publication in Astronomy &\n  Astrophysics", "summary": "X-ray observations are essential to achieve a deeper understanding of the\nbroadband emission mechanism in blazars. Here, we present a long-term spectral\nand temporal analysis of X-ray and optical observations of 1E 0229+200\ncollected with the Neil Gehrels Swift Observatory from 2008 to 2024,\ncomplemented by hard X-ray observations from the Nuclear Spectroscopic\nTelescope Array NuSTAR. The blazar 1ES 0229+200 is a high-frequency, peaked BL\nLac object, known for its exceptionally hard very high-energy (VHE)\n$\\gamma$-ray spectrum extending up to 10 TeV. In August 2021, NuSTAR observed\nthe source in a low X-ray state, revealing a concave spectral shape with a\ndistinct upturn around 25 keV. This feature contrasts with previous\nobservations performed with NuSTAR and Swift-BAT, which showed no such spectral\nupturn. Previous observations of 1ES 0229+200 and broadband SED (spectral\nenergy distribution) modelling suggest that its X-ray emission extends beyond\n100 keV without a significant cutoff. The newly detected spectral upturn may\nindicate a transition between the synchrotron and inverse Compton components or\ncould be linked to photohadronic processes involving high-energy neutrinos. We\ndiscuss the implications of this finding in the context of blazar spectral\nenergy distributions, particularly the potential existence of a third SED bump\nin the kiloelectronvolt to megaelectronvolt range. The observed spectral\nfeatures support the hypothesis that 1ES 0229+200 could be a source of\nhigh-energy neutrino emission."}
{"id": "2510.15534", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2510.15534", "abs": "https://arxiv.org/abs/2510.15534", "authors": ["Ichiro Takahashi", "Tomoki Morokuma", "Masaomi Tanaka", "Mahito Sasada", "Hiroshi Akitaya", "Ichi Tanaka", "Nozomu Tominaga", "Michitoshi Yoshida", "Yousuke Utsumi", "Ryosuke Itoh", "Kyohei Kawaguchi", "the J-GEM collaboration"], "title": "J-GEM near-infrared follow-up observations of the gravitational wave event S240422ed", "comment": "18 pages, 8 figures, 4 tables. Accepted for publication in PASJ", "summary": "We report our near-infrared (NIR) follow-up observations of the gravitational\nwave (GW) event S240422ed using the Subaru Telescope/MOIRCS. S240422ed was\ninitially classified as a black hole-neutron star merger with $>$ 99%\nprobability of electromagnetic wave emission. We started follow-up observations\n7.8 hours after the event. Over two nights, we observed 206 nearby galaxies in\n$Y$ and $K_{\\rm s}$ bands down to about 21.4 and 21.1 AB mag (3$\\sigma$),\nrespectively. The total completeness of our survey based on galaxy $B$-band\nluminosity is 22%. As a result of our observations, five candidate counterparts\nwere identified. We show that properties of these five objects are not\nconsistent with kilonova such as AT2017gfo. Four objects are consistent with\nknown classes of transients such as supernovae or dwarf nova outbursts. On the\nother hand, the nature of the remaining one object, which shows a red color and\nrapid decline, remains unclear. Although later analyses of GW signal\nreclassified S240422ed as likely terrestrial noise, our NIR observations\nprovide valuable lessons for future NIR surveys for GW sources. We demonstrate\nthat deep NIR follow-up observations as presented in this work would\neffectively constrain the presence of red kilonova even at 200 Mpc distance. We\nalso discuss the importance of deep and wide NIR reference images and of\nunderstanding the properties and frequency of Galactic transients."}
{"id": "2510.15634", "categories": ["astro-ph.HE", "astro-ph.CO"], "pdf": "https://arxiv.org/pdf/2510.15634", "abs": "https://arxiv.org/abs/2510.15634", "authors": ["Ludwig M. Böss", "Ildar Khabibullin", "Daniel Karner", "Klaus Dolag", "Ulrich P. Steinwandel", "Elena Hernandez-Martinez", "Jenny G. Sorce"], "title": "Simulating the LOcal Web (SLOW) - VI: $γ$-ray Emission in the Local Universe", "comment": "12 pages, 8 figures, submitted to A&A. Comments welcome", "summary": "Context: Diffuse $\\gamma$-ray emission from cosmic ray (CR) protons\nscattering off the gas in the intracluster and intergalactic medium (ICM and\nIGM) remains out of reach for current observations. Detecting this emission\nwould provide constraints on intergalactic magnetic fields as well as dark\nmatter interaction models. Aims: We aim to provide estimates for diffuse\n$\\gamma$-ray emission in the Fermi-LAT band from galaxy clusters and the cosmic\nweb in the local Universe. Methods: In this work we show results from the first\ncosmological MHD simulation with an on-the-fly spectral CR model. We model CR\ninjection at shocks, account for adiabatic energy changes and advection of CR\nprotons, and obtain their $\\gamma$-ray emissivity directly from the simulated\nCR energy density and spectra. For this we use constrained initial conditions,\nwhich evolve in a field closely resembling that of the local Universe, allowing\ndirect comparison to Fermi-LAT data on massive clusters. Results: We find CR\nproton acceleration at all structure formation and accretion shocks in galaxy\nclusters and cosmic web filaments. These protons provide the basis for diffuse\n$\\gamma$-ray emission in these regimes. The absolute value of the diffuse\n$\\gamma$-ray emission in our simulation lies a few orders of magnitude below\nthe current upper limits found by Fermi-LAT. Under the assumption of our model,\na sensitivity of $F_\\gamma < 10^{-11} \\: \\gamma~ \\text{s}^{-1}~\\text{cm}^{-2}$\nis required for a detection of diffuse emission in Coma."}
{"id": "2510.15661", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.15661", "abs": "https://arxiv.org/abs/2510.15661", "authors": ["Mattéo Sautron", "Jérôme Pétri", "Dipanjan Mitra", "Adélie Dupuy--Junet", "Marie-Eloïse Pietrin"], "title": "Born to be recycled: a comprehensive population synthesis of the Galactic millisecond pulsars", "comment": "Submitted to A&A. Comments are welcome", "summary": "Millisecond pulsars (MSPs) are the oldest but fastest pulsars known to date.\nTo explain how these pulsars could be formed, a new hypothesis was formulated:\nthe recycling of pulsars, i.e the fact that a pulsar could accrete matter from\na companion and been spun up. In this paper, we developed a population\nsynthesis algorithm for pulsars which belong to a binary, in order to check\nwhether most of the observed recycled pulsars were formed via an accretion\nmechanism and derive statistics about their properties, that are difficult to\nobtain through observations. We also make predictions for future surveys.\nToward the presented objectives, we use the code Stellar EVolution for N-body\n(SEVN) to take into account all the binary processes and our own code to evolve\neach pulsar self-consistently by taking into account the secular evolution of a\nforce-free magnetosphere, the magnetic field decay, gravitational braking and\nspatial evolution. Each pulsar is born in binary with a main sequence\ncompanion, and evolve to present time. The radio and $\\gamma$-ray emission\nlocations were modeled by the polar cap geometry and striped wind model,\nrespectively. Our simulations seem to reproduce well the population of radio\nand $\\gamma$-ray pulsars observed in the selected surveys. We also found that\nthere should be less than $330$ unidentified pulsars in the Fourth Fermi-LAT\ncatalogue of $\\gamma$-ray sources (4FGL). High values of the viewing angle\n$\\zeta$ seem to be needed to be able to observe the recycled pulsars, and it\nalso seems difficult to observe recycled pulsars with an aligned rotation axis\nand magnetic axis (i.e., $\\chi \\leq 10${\\deg}). We find that only a small\nfraction, approximately $\\sim 7.5\\times10^{-3}$ %, of oxygen-neon white dwarfs\n(ONeWDs) in binary systems appear to contribute to the population of mildly\nrecycled pulsars through accretion-induced collapse."}
{"id": "2510.15836", "categories": ["astro-ph.HE", "gr-qc"], "pdf": "https://arxiv.org/pdf/2510.15836", "abs": "https://arxiv.org/abs/2510.15836", "authors": ["Kendall Ackley"], "title": "From Localization to Discovery: Bayesian Ranking of Electromagnetic Counterparts to Gravitational-Wave Events", "comment": "Invited article for special CQG issue on Gravitational Wave Physics\n  and Astrophysics Ten Years After GW150914", "summary": "The robust association of electromagnetic candidates discovered during\nfollow-up of gravitational-wave alerts is challenging, not only due to the\nlarge sky areas and broad distance uncertainties, but also due to the tens to\nhundreds of unrelated optical transients that are observed per event. We\npresent a Bayesian ranking method to identify electromagnetic counterparts to\nGW events using only location information. The framework combines\nthree-dimensional gravitational wave skymaps with host-galaxy information, a\nmorphology-aware host association, empirical offset priors, and peculiar\nvelocity corrections. We apply the method to GW170817 where it ranks AT2017gfo\nas the top candidate and correctly selects NGC\\,4993 as the host. The approach\nis directly applicable to transient candidates with only location information\nand enables more efficient follow-up with prioritized candidates and leads to\nmore reliable counterpart identification in current and future observing runs."}
{"id": "2510.15867", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.15867", "abs": "https://arxiv.org/abs/2510.15867", "authors": ["S. Dichiara", "E. Troja", "B. O'Connor", "Y. -H. Yang", "P. Beniamini", "A. Galvan-Gamez", "T. Sakamoto", "Y. Kawakubo", "J. C. Charlton"], "title": "A merger within a merger: Chandra pinpoints the short GRB 230906A in a peculiar environment", "comment": "19 pages, 11 figures, 3 tables. Submitted to ApJ Letters", "summary": "We report the precise X-ray localization of GRB~230906A, a short duration\n($T_{90}\\sim$0.9 s) burst with no optical or radio counterpart. Deep imaging\nwith the Hubble Space Telescope detects a faint galaxy (G$^\\ast$;\n$F160W\\simeq26$ AB mag) coincident with the sub-arcsecond X-ray position.\nCompared with standard GRB galaxies, its faintness, compact size and color\nwould suggest a high redshift ($z\\gtrsim$3) host. However, our observations\nalso reveal the presence of a galaxy group at $z\\!\\sim$0.453, confirmed\nspectroscopically with VLT/MUSE, with clear signs of interactions and mergers\namong group members. The GRB and its putative host project onto an extended\n($\\approx$180 kpc) tidal tail emerging from the group's central galaxy. The\nprobability of a chance alignment is small ($P_{cc}\\!\\lesssim\\!4$\\%), we thus\nargue that the GRB and its galaxy G$^*$ reside within the group. Their peculiar\nlocation along the tidal debris suggests that an enhanced burst of star\nformation, induced by the galaxy merger, might have formed the progenitor\ncompact binary $\\lesssim$700 Myr ago. The compact binary later evolved in a\nneutron star merger which produced GRB 230906A and injected $r$-process\nmaterial into the surrounding circumgalactic medium."}
{"id": "2510.15816", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.15816", "abs": "https://arxiv.org/abs/2510.15816", "authors": ["Chen-Wei Wang", "Peng Zhang", "Shao-Lin Xiong", "Yue Huang", "Wen-Jun Tan", "Zheng-Hang Yu", "Yue Wang", "Wang-Chen Xue", "Chao Zheng", "Hao-Xuan Guo", "Ce Cai", "Yong-Wei Dong", "Jiang He", "Cheng-Kui Li", "Xiao-Bo Li", "Jia-Cong Liu", "Xing-Hao Luo", "Xiang Ma", "Yang-Zhao Ren", "Li-Ming Song", "Ping Wang", "Jin Wang", "Bo-Bing Wu", "Shuo Xiao", "Sheng-Lun Xie", "Shu-Xu Yi", "Xue-Yuan Zao", "Xiao-Yun Zhao", "Li Zhang", "Shuang-Nan Zhang", "Yan-Qiu Zhang", "Shi-Jie Zheng"], "title": "BREAKFAST: A Framework for general joint BA duty and follow-up guidance of multiple $γ$-ray monitors", "comment": null, "summary": "With the growing number of gamma-ray monitors in operation, several research\nteams have adopted a strategy of joint operation and scientific duty to improve\nefficiency. A successful example is the GECAM-HXMT-SVOM (GHS) constellation\ncollaboration, which sets a precedent for other gamma-ray monitor\nconstellations. However, joint duty also presents challenges to Burst Advocates\n(BAs), including the increased number of triggers and, more importantly, the\nfrequent switching between various systems due to incompatibilities among\ndifferent missions, which complicates the situation. To address the current\nrequirements of multi-wavelength and multi-messenger astronomy, we developed a\ncustomized framework for unified trigger processing within the GHS joint duty,\nnamed \"BA's Rapid Evaluation and Analysis Kit for Formulating Alerts and\nSummary Tools\" (BREAKFAST). This framework incorporates a series of automated,\nsemi-automated, and manual pipelines designed to rapidly process triggers of\nprompt emissions in the gamma-ray band from different instruments, while\nmaintaining flexible compatibility for future missions. The pursuit of\nBREAKFAST goes beyond merely providing trigger processing for BAs. BREAKFAST\nalso aims to filtering high-value targets and guiding follow-up telescopes\nthrough rapid analysis and reporting, thus serving as an important bridge\nbetween prompt emission observations and afterglow observations. To this end, a\nsuite of comprehensive analysis modules is included in BREAKFAST, particularly\nthe specially designed module that predicts X-ray afterglow brightness based on\nprompt emission properties. The framework's effectiveness has already been\ndemonstrated in recent observational campaigns, and it is expected to play a\nsignificant role in the discovery and observation of peculiar transients in the\nfuture."}
