{"id": "2509.09778", "categories": ["astro-ph.IM", "hep-ex"], "pdf": "https://arxiv.org/pdf/2509.09778", "abs": "https://arxiv.org/abs/2509.09778", "authors": ["Arun Vaidyanathan", "Lars Heuermann"], "title": "Commissioning and Testing of IceAct Telescopes at the IceCube Neutrino Observatory", "comment": null, "summary": "IceAct is an array of imaging air Cherenkov telescopes located at the ice\nsurface above the IceCube Neutrino Observatory. Each telescope features a\nsilicon photomultiplier based 61 pixel camera and a Fresnel-lens as imaging\noptic, resulting in a 12-degree field of view. The design is optimized to be\noperated in harsh environments, particularly at the South Pole. The setup will\nconsist of seven telescopes in a so-called fly's eye configuration, increasing\nthe field of view to 36^\\circ, and an additional telescope 200m apart for\nstereoscopic observations. Rigorous testing procedures have been performed\nbefore deployment to ensure that operation under these conditions is possible,\ne.g. night sky observations and cold temperature tests. Furthermore, on-site\ncalibrations are used to verify the accuracy and reliability of the\ninstallation. We derive the geometric alignment of each IceAct telescope by\ncomparing the directional reconstruction of muons measured with IceCube to the\ncorresponding primary particle direction reconstruction from IceAct. This\ncontribution presents these testing procedures. Additionally, we present the\non-site alignment calibration, including a Graph Neural Network reconstruction\nfor the primary particle direction in IceAct, verification on Monte Carlo\nsimulation, and the application to a commissioning dataset."}
{"id": "2509.09780", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.09780", "abs": "https://arxiv.org/abs/2509.09780", "authors": ["Kyle Van Gorkom", "Ramya M. Anche", "Christopher B. Mendillo", "Jessica Gersh-Range", "G. C. Hathaway", "Saraswathi Kalyani Subramanian", "Justin Hom", "Tyler D. Robinson", "Mamadou N'Diaye", "Nikole K. Lewis", "Bruce Macintosh", "Ewan S. Douglas"], "title": "Progress toward a demonstration of high contrast imaging at ultraviolet wavelengths", "comment": "5 pages, 3 figures, SPIE Optics and Photonics 2025", "summary": "NASA's Habitable Worlds Observatory (HWO) aims to achieve starlight\nsuppression to the $10^{-10}$ level for the detection and spectral\ncharacterization of Earth-like exoplanets. Broadband ozone absorption features\nare key biosignatures that appear in the 200-400nm near-ultraviolet (UV)\nregime. Extending coronagraphy from visible wavelengths to the UV, however,\nbrings with it a number of challenges, including tighter requirements on\nwavefront sensing and control, optical surface quality, scattered light, and\npolarization aberrations, among other things. We aim to partially quantify and\naddress these challenges with a combination of modeling, high-resolution\nmetrology to the scales required for UV coronagraphy, and ultimately a\ndemonstration of UV coronagraphy on the Space Coronagraph Optical Bench (SCoOB)\nvacuum testbed. In these proceedings, we provide a status update on our\nmodeling and contrast budgeting efforts, characterization efforts to understand\nperformance limitations set by key optical components, and our plans to move\ntoward a demonstration of UV coronagraphy."}
{"id": "2509.09878", "categories": ["astro-ph.IM", "astro-ph.EP"], "pdf": "https://arxiv.org/pdf/2509.09878", "abs": "https://arxiv.org/abs/2509.09878", "authors": ["R. Julo", "M. Bonnefoy", "F. Chatelain", "O. Flasseur", "O. J. J. Michel", "S. Jorquera", "P. Delorme", "G. Chauvin"], "title": "Stellar halo subtraction alternative for accreting companions' characterization with integral field spectroscopy: Analytical and on-sky demonstration on the PDS70, HTLup, and YSES1 systems", "comment": "14 pages, 15 figures, to be published in A&A", "summary": "Context. Medium-resolution IFS, such as MUSE at the VLT, are equipped to\ndetect the emission lines of faint accreting companions when associated with\ndedicated stellar halo subtraction methods. We recently proposed a new approach\nbased on polynomial modulations of a stellar spectrum estimate across the field\nof view, with orthogonal polynomials and lines masking. Aims. We seek to\nhighlight and quantify analytically and on real data the benefits of this new\napproach over the one classically used, particularly with regard to distortions\nof the extracted spectra. Methods. We carried out analytical calculations based\non simple toy models. Simulations of the most extreme situations identified\nwere used to highlight these problems and corrections. Archival VLT/MUSE data\nof the young PDS70 and HTLup systems were used to vet the detection and\ncharacterization capabilities using on-sky observations. New images of the\nYSES1 planetary system were used to further illustrate the gains. Results. We\nshow that the state-of-the-art method, based on low-pass filtering, can lead to\nthe self-subtraction of the emission lines and modify the neighboring continua.\nWe show that the proposed technique corrects these characterization problems,\nwhile maintaining the same detection capabilities. The two protoplanets PDS70 b\nand c were detected with 5sigma significance. The Halpha line estimate of the\nHTLup B stellar companion was improved by ~30% for the integrated flux and by\n~8% for the 10%-width. As for YSES1 b, we found it uniquely displays a\ncombination of Halpha, Hbeta, CaII H&K triplet, and HeI lines in emission.\nConclusions. The proposed method better preserves the spectral information,\nnotably the emission line fluxes and profiles, while achieving similar\ndetection performance. Based on a linear and parametric approach, it can be\nextended and/or combined with additional faint signal search algorithms."}
{"id": "2509.10274", "categories": ["astro-ph.IM", "astro-ph.HE", "hep-ex"], "pdf": "https://arxiv.org/pdf/2509.10274", "abs": "https://arxiv.org/abs/2509.10274", "authors": ["Philipp Pilar", "Martin Ravn", "Christian Glaser", "Niklas Wahlström"], "title": "A Differentiable Surrogate Model for the Generation of Radio Pulses from In-Ice Neutrino Interactions", "comment": null, "summary": "The planned IceCube-Gen2 radio neutrino detector at the South Pole will\nenhance the detection of cosmic ultra-high-energy neutrinos. It is crucial to\nutilize the available time until construction to optimize the detector design.\nA fully differentiable pipeline, from signal generation to detector response,\nwould allow for the application of gradient descent techniques to explore the\nparameter space of the detector. In our work, we focus on the aspect of signal\ngeneration, and propose a modularized deep learning architecture to generate\nradio signals from in-ice neutrino interactions conditioned on the shower\nenergy and viewing angle. The model is capable of generating differentiable\nsignals with amplitudes spanning multiple orders of magnitude, as well as\nconsistently producing signals corresponding to the same underlying event for\ndifferent viewing angles. The modularized approach ensures physical consistency\nof the samples and leads to advantageous computational properties when using\nthe model as part of a bigger optimization pipeline."}
{"id": "2509.09741", "categories": ["astro-ph.HE", "gr-qc"], "pdf": "https://arxiv.org/pdf/2509.09741", "abs": "https://arxiv.org/abs/2509.09741", "authors": ["Wanting Niu", "Chad Hanna", "Carl-Johan Haster", "Shomik Adhicary", "Pratyusava Baral", "Amanda Baylor", "Bryce Cousins", "Jolien D. E. Creighton", "Heather Fong", "Yun-Jing Huang", "Rachael Huxford", "Prathamesh Joshi", "James Kennington", "Alvin K. Y. Li", "Ryan Magee", "Duncan Meacher", "Cody Messick", "Soichiro Morisaki", "Cort Posnansky", "Surabhi Sachdev", "Shio Sakon", "Urja Shah", "Divya Singh", "Ron Tapia", "Leo Tsukada", "Aaron Viets", "Zach Yarbrough", "Noah Zhang"], "title": "GW231109_235456: A Sub-threshold Binary Neutron Star Merger in the LIGO-Virgo-KAGRA O4a Observing Run?", "comment": "13 pages, 4 figures, 2 table", "summary": "We present a sub-threshold search for gravitational-wave inspirals from\nbinary neutron stars using data from the first part of the fourth observing run\nof the LIGO-Virgo-KAGRA Collaboration. To enhance sensitivity to this targeted\npopulation, we incorporate a redshift-corrected population model based on radio\nobservations of Galactic double neutron star systems. The search identifies a\nsignificant trigger with a false-alarm rate of about one per 50 years and a\nnetwork signal-to-noise ratio of 9.7, which was first reported by the LVK in\nlow-latency processing as S231109ci and subsequently in the GWTC-4.0 catalog as\nGW231109_235456, a sub-threshold candidate. Accounting for a trials factor of\nfive from the four LVK searches in GWTC-4.0 and this new search, the\nfalse-alarm rate of the reported candidate is approximately one per 10 years.\nIf this event is of astrophysical origin, the inferred source properties\nindicate component masses of 1.40 to 2.24 solar masses for the primary and 0.97\nto 1.49 solar masses for the secondary, yielding a total mass of 2.95 (+0.38,\n-0.07) solar masses. The event was localized to a region of 450 square degrees\n(90 percent probability) at a luminosity distance of 165 (+70, -69)\nmegaparsecs."}
{"id": "2509.10451", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.10451", "abs": "https://arxiv.org/abs/2509.10451", "authors": ["Linling Shuai", "John D. Monnier", "Benjamin R. Setterholm", "Stefan Kraus", "Narsireddy Anugu", "Tyler Gardner", "Jean-Baptiste Le Bouquin", "Gail H. Schaefer"], "title": "The CHARA Array Polarization Model and Prospects for Spectropolarimetry", "comment": "37 pages, 24 figures, accepted for publication by AJ. Our code,\n  mircxpol, is published in https://github.com/slinling/mircxpol", "summary": "Polarimetric data provide key insights into infrared emission mechanisms in\nthe inner disks of YSOs and the details of dust formation around AGB stars.\nWhile polarization measurements are well-established in radio interferometry,\nthey remain challenging at visible and near-infrared due to the significant\ntime-variable birefringence introduced by the complex optical beamtrain. In\nthis study, we characterize instrumental polarization effects within the\noptical path of the CHARA Array, focusing on the H-band MIRC-X and K-band\nMYSTIC beam combiners. Using Jones matrix formalism, we developed a\ncomprehensive model describing diattenuation and retardance across the array.\nBy applying this model to an unpolarized calibrator, we derived the\ninstrumental parameters for both MIRC-X and MYSTIC. Our results show\ndifferential diattenuation consistent with >= 97% reflectivity per\naluminum-coated surface at 45 deg incidence. The differential retardance\nexhibits small wavelength-dependent variations, in some cases larger than we\nexpected. Notably, telescope W2 exhibits a significantly larger phase shift in\nthe Coude path, attributable to a fixed aluminum mirror (M4) used in place of\ndeformable mirrors present on the other telescopes during the observing run. We\nalso identify misalignments in the LiNbO_3 birefringent compensator plates on\nS1 (MIRC-X) and W2 (MYSTIC). After correcting for night-to-night offsets, we\nachieve calibration accuracies of $\\pm$ 3.4% in visibility ratio and $\\pm$ 1.4\ndeg in differential phase for MIRC-X, and $\\pm$ 5.9% and $\\pm$ 2.4 deg,\nrespectively, for MYSTIC. Given that the differential intrinsic polarization of\nspatially resolved sources, such as AGB stars and YSOs, typically greater than\nthese instrumental uncertainties, our results demonstrate that CHARA is now\ncapable of achieving high-accuracy measurements of intrinsic polarization in\nastrophysical targets."}
{"id": "2509.09827", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.09827", "abs": "https://arxiv.org/abs/2509.09827", "authors": ["Amit Kumar", "B. P. Gompertz", "B. Schneider", "S. Belkin", "M. E. Wortley", "A. Saccardi", "D. O'Neill", "K. Ackley", "B. Rayson", "A. de Ugarte Postigo", "A. Gulati", "D. Steeghs", "D. B. Malesani", "J. R. Maund", "M. J. Dyer", "S. Giarratana", "M. Serino", "Y. Julakanti", "B. Kumar", "D. Xu", "R. A. J. Eyles-Ferris", "Z. -P. Zhu", "B. Warwick", "Y. -D. Hu", "I. Allen", "G. Ramsay", "R. L. C. Starling", "J. Lyman", "K. Ulaczyk", "B. Godson", "D. K. Galloway", "V. S. Dhillon", "P. O'Brien", "K. Noysena", "R. Kotak", "R. P. Breton", "L. K. Nuttall", "D. Pollacco", "J. Casares", "T. L. Killestein", "M. R. Kennedy", "N. Habeeb", "S. Moran", "K. Wiersema", "I. Worssam", "D. L. Coppejans", "C. A. Phillips", "A. Martin-Carrillo", "N. S. Pankov", "J. F. Agüí Fernández", "M. A. Aloy", "J. An", "G. E. Anderson", "A. Bochenek", "A. J. Castro-Tirado", "X. Chen", "L. Cotter", "R. Dastidar", "M. De Pasquale", "V. D'Elia", "Y. Fang", "S. Y. Fu", "J. P. U. Fynbo", "D. H. Hartmann", "L. B. He", "L. Izzo", "S. Q. Jiang", "Y. Kawakubo", "E. V. Klunko", "A. J. Levan", "X. -W. Liu", "X. Liu", "G. Lombardi", "E. Maiorano", "J. T. Palmerio", "D. A. Perley", "D. L. A. Pieterse", "A. S. Pozanenko", "G. Pugliese", "A. Rossi", "B. Sbarufatti", "S. Bijavara Seshashayana", "N. R. Tanvir", "C. C. Thöne", "A. J. van der Horst", "S. D. Vergani", "A. A. Volnova", "R. A. M. J. Wijers", "J. L. Wise"], "title": "Discovery and Analysis of Afterglows from Poorly Localised GRBs with the Gravitational-wave Optical Transient Observer (GOTO) All-sky Survey", "comment": "50 pages, including 27 figures and 15 tables (with Appendix).\n  Submitted to MNRAS", "summary": "Gamma-ray bursts (GRBs), particularly those detected by wide-field\ninstruments such as the Fermi/GBM, pose a challenge for optical follow-up due\nto their large initial localisation regions, leaving many GRBs without\nidentified afterglows. The Gravitational-wave Optical Transient Observer\n(GOTO), with its wide field of view, dual-site coverage, and robotic\nrapid-response capability, bridges this gap by rapidly identifying and\nlocalising afterglows from alerts issued by space-based facilities including\nFermi, SVOM, Swift, and the EP, providing early optical positions for\ncoordinated multi-wavelength follow-up. In this paper, we present optical\nafterglow localisation and multi-band follow-up of seven Fermi/GBM and MAXI/GSC\ntriggered long GRBs (240122A, 240225B, 240619A, 240910A, 240916A, 241002B, and\n241228B) discovered by GOTO in 2024. Spectroscopy for six GRBs (no\nspectroscopic data for GRB 241002B) with VLT/X-shooter and GTC/OSIRIS yields\nprecise redshifts spanning $z\\approx0.40-$3.16 and absorption-line diagnostics\nof host and intervening systems. Radio detections for four events confirm the\npresence of long-lived synchrotron emission. Prompt-emission analysis with\nFermi and MAXI data reveals a spectrally hard population, with two bursts lying\n$>3\\sigma$ above the Amati relation. Although their optical afterglows resemble\nthose of typical long GRBs, the prompt spectra are consistently harder than the\nlong-GRB average. Consistent modelling of six GOTO-discovered GRB afterglows\nyields jet half-opening angles of a few degrees and beaming-corrected kinetic\nenergies ($E_{jet}\\sim10^{51-52}$) erg, consistent with the canonical long-GRB\npopulation. These findings suggest that optical discovery of poorly localised\nGRBs may be subject to observational biases favouring luminous events with high\nspectral peak energy, while also providing insight into jet microphysics and\ncentral engine diversity."}
{"id": "2509.09860", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.09860", "abs": "https://arxiv.org/abs/2509.09860", "authors": ["Hua Xiao", "Sergey S. Tsygankov", "Valery F. Suleimanov", "Alexander A. Mushtukov", "Long Ji", "Juri Poutanen"], "title": "Propeller effect in action: unveiling quenched accretion in the transient X-ray pulsar 4U 0115+63", "comment": "8 pages, 6 figures, 2 tables, accepted for publication in Astronomy &\n  Astrophysics", "summary": "The Be/X-ray pulsar 4U 0115+63 underwent a type II outburst in 2023. After\nthe outburst, similar to the outbursts in 2015 and 2017, the source decayed\ninto a quiescent state. Two out of three XMM-Newton observations conducted\nafter the 2023 outburst confirmed the source to be in a low-luminosity state at\na level of $L_{\\rm X} \\sim 10^{33}\\,\\rm erg\\,s^{-1}$. X-ray pulsations were\ndetected at $\\approx$0.277 Hz in both observations with a pulsed fraction\nexceeding 50%. The power density spectra show no significant low-frequency red\nnoise in both observations, suggesting that the radiation is not driven by\naccretion. The energy spectra in this state can be described by a single\nblackbody component, with an emitting area smaller than the typical size of the\npolar caps during the accretion phase. Based on the timing and spectral\nproperties, we suggest that the propeller effect is active during the quiescent\nstate, resulting in a total quenching of accretion. We discuss possible\nmechanisms for the generation of pulsations in this regime and consider the\nscenario of neutron star crust cooling."}
{"id": "2509.09876", "categories": ["astro-ph.HE", "gr-qc"], "pdf": "https://arxiv.org/pdf/2509.09876", "abs": "https://arxiv.org/abs/2509.09876", "authors": ["Nir Guttman", "Ethan Payne", "Paul D. Lasky", "Eric Thrane"], "title": "Trends in the Population of Binary Black Holes Following the Fourth Gravitational-Wave Transient Catalog: a Data-Driven Analysis", "comment": "20 pages, 19 figures", "summary": "Current population models of binary black hole distributions are difficult to\ninterpret because standard population inferences hinge on modeling choices,\nwhich can mask or mimic real structure. The maximum population likelihood\n``$\\pistroke$ formalism'' provides a means to investigate and interpret\nfeatures in the distribution of binary black holes using only data -- without\nspecifying a population model. It tells us if features inferred from current\npopulation models are truly present in the data or if they arise from model\nmisspecification. It also provides guidance for developing new models by\nhighlighting previously unnoticed features. In this study, we utilize the\n$\\pistroke$ formalism to examine the binary black hole population in the\nLIGO--Virgo--KAGRA (LVK) fourth Gravitational-Wave Transient Catalog (GWTC-4).\nOur analysis supports the existence of a gap around $45\\,M_\\odot$ in the\nsecondary black hole mass distribution and identifies a widening in the\ndistribution of the effective inspiral spin parameter $\\chi_\\text{eff}$ near\nthis mass as recently reported by Tong et al. (2025). Similar to earlier\nstudies, we find support for an anti-correlation between $\\chi_\\text{eff}$ and\nmass ratio. However, we argue that this may be a spurious correlation arising\nfrom misspecification of the joint distribution of black hole masses.\nFurthermore, we identify support for dimensionless black hole spin magnitudes\nat approximately $\\chi \\approx 0.2$ and $\\chi\\approx0.7$. The data support the\nexistence of a correlation between the spin magnitudes $\\chi_1$ and $\\chi_2$,\nthough subsequent study is required to determine if this feature is\nstatistically significant. The accompanying data release includes $\\pistroke$\nsamples, which can be used to compare theoretical predictions to LVK data and\nto assess assumptions in parameterised models."}
{"id": "2509.09929", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.09929", "abs": "https://arxiv.org/abs/2509.09929", "authors": ["Wu Fan", "Yamada Shoichi"], "title": "Laplace-Fourier linear stability analysis of non-relativistic magnetized rotational jets: mode identification by Hamiltonian analysis and the occurrence of mode transitions", "comment": "25 pages, 10 figures", "summary": "In this paper, we conduct a linear stability analysis of magnetized and/or\nrotating jets propagating in ambient matter that is also magnetized and/or\nrotating, having in mind the application to the jet penetrating the\ncore/envelope of a massive star. We solve the linearized magneto-hydrodynamic\n(MHD) equations in the non-relativistic regime by Laplace transform in time and\nFourier transform in space. In this formulation all unstable modes with the\nsame translational and azimuthal wave numbers can be obtained simultaneously by\nsearching for pole singularities in the complex plane. In order to determine\nunambiguously their driving mechanisms, we evaluate the second-order\nperturbation of the MHD Hamiltonian for individual eigenfunctions derived at\nthese singular points. We identify in our non-rotating models the\nKelvin-Helmholtz instability (KHI) as one of the shear-driven modes and the\ncurrent-driven instability such as the kink instability (KKI). In rotational\nmodels we also find the magnetorotational instability (MRI) as another\nshear-driven mode. In some cases, we find that a mode changes its character\ncontinuously from KKI to KHI (and vice versa) or from MRI to KHI as the jet\nvelocity is increased."}
{"id": "2509.10017", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.10017", "abs": "https://arxiv.org/abs/2509.10017", "authors": ["H. Tong", "L. Chen"], "title": "Rotating twisted magnetosphere of magnetars: approximate analytical solutions", "comment": "7 pages, submitted", "summary": "An approximate analytical solution for the rotating twisted magnetosphere of\nmagnetars is presented. The poloidal flux is approximated by the self-similar\ntwisted dipole field. The toroidal field is obtained by the minimum torque\nmodel. Under this approximation, it is found that: (1) The Y-point radius\ndecreases with the increase of twist of the magnetic field. (2) The polar cap\nis larger for larger twist. (3) The particle outflow luminosity is larger for\nlarger twist. (4) The maximum acceleration potential, pulse width of magnetar\nradio emission etc all increase with the twist. (5) For an untwisting\nmagnetosphere, the physical properties general evolves towards that of the\nnormal pulsars. The above findings are consistent with previous analytical and\nnumerical results. The larger polar cap may corresponds to the hot spot during\nmagnetar outburst. In general, a rotating twisted magnetosphere has larger open\nfield line regions. The radio emission of magnetars and fast radio burst may\nboth originates in the larger and evolving open field line regions of\nmagnetars."}
{"id": "2509.10037", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.10037", "abs": "https://arxiv.org/abs/2509.10037", "authors": ["D. Malyshev", "M. Chernyakova", "A. Finn Gallagher", "A. Kuzin", "N. Matchett", "A. Santangelo", "Iu. Shebalkova", "B. van Soelen"], "title": "Multi-GeV Fermi-LAT Detection of PSR B1259-63", "comment": null, "summary": "PSR B1259-63 is a classical gamma-ray binary detected from radio to TeV\nenergies near periastron. In the GeV band, it had previously been detected only\nup to a few GeV, with the extrapolation of the TeV spectrum overestimating the\nmeasured GeV flux. Using over 17 years of Fermi-LAT observations, we report the\nfirst detection of PSR B1259-63 in the 10 GeV to $\\gtrsim 100$ GeV range, from\n-400 to +100 days relative to periastron. The Fermi-LAT spectrum is well\ndescribed by a hard power law with index $\\Gamma = 1.9 \\pm 0.1$, and has a flux\nlevel consistent with that measured at TeV energies by H.E.S.S. The apparent\ntransition from the hard Fermi-LAT spectrum to the softer TeV spectrum suggests\nthat the detected GeV emission traces the rising tail of the inverse-Compton\ncomponent extending into the TeV regime. We note that the detection of PSR\nB1259-63 as early as -400 days before periastron is difficult to reconcile with\nexisting theoretical models."}
{"id": "2509.10115", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.10115", "abs": "https://arxiv.org/abs/2509.10115", "authors": ["A. Miraval Zanon", "F. Ambrosino", "G. Illiano", "A. Papitto", "G. L. Israel", "F. Coti Zelati", "L. Stella", "T. Di Salvo", "S. Campana", "G. Benevento", "N. O. Pinciroli Vago", "M. C. Baglio", "P. Casella", "P. D'Avanzo", "D. de Martino", "M. Imbrogno", "R. La Placa", "S. E. Motta"], "title": "An ultraviolet burst oscillation candidate from the low-mass X-ray binary EXO 0748-676", "comment": "accepted for publication by A&A", "summary": "X-ray burst oscillations are quasi-coherent periodic signals at frequencies\nclose to the neutron star spin frequency. They are observed during\nthermonuclear Type I X-ray bursts from a number of low-mass X-ray binaries\n(LMXBs) hosting a fast-spinning, weakly magnetic neutron star. Besides\nmeasuring the spin frequencies, burst oscillations hold the potential to\naccurately measure neutron star mass and radius, thus providing constraints on\nthe equation of state of matter at nuclear densities. Based on far-ultraviolet\n(FUV) observations of the X-ray binary EXO 0748-676 taken with the Hubble Space\nTelescope in 2003, we report a possible indication of ultraviolet burst\noscillations at the neutron star spin frequency ($\\sim$552 Hz), potentially the\nfirst such case for an LMXB. The candidate signal is observed during an $\\sim$8\ns interval in the rising phase of an FUV burst, which occurred $\\sim$4 s after\na Type I X-ray burst. Through simulations, we estimated that the probability of\ndetecting the observed signal power from pure random noise is 3.7$\\%$,\ndecreasing to 0.3$\\%$ if only the burst rise interval is considered, during\nwhich X-ray burst oscillations had already been observed in this source. The\nbackground-subtracted folded pulse profile of the candidate FUV oscillations in\nthe (120-160 nm) band is nearly sinusoidal with a $\\sim$16$\\%$ pulsed fraction,\ncorresponding to a pulsed luminosity of $\\sim$8$\\times$10$^{33}$ erg/s.\nInterpreting the properties of this candidate FUV burst oscillations in the\nlight of current models for optical-ultraviolet emission from neutron star\nLMXBs faces severe problems. If signals of this kind are confirmed in future\nobservations, they might point to an unknown coherent emission process as the\norigin of the FUV burst oscillations observed in EXO 0748-676."}
{"id": "2509.10150", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.10150", "abs": "https://arxiv.org/abs/2509.10150", "authors": ["Anson Ka Long Yip", "Tjonnie Guang Feng Li"], "title": "Magnetic effects on fundamental modes in rotating neutron stars with a purely toroidal magnetic field", "comment": "14 pages, 4 figures", "summary": "Electromagnetic and gravitational-wave signals from neutron stars are shaped\nby rapid rotation and strong magnetic fields. Determining these properties is\nessential to interpret such signals, but current measurements are limited:\nrotation estimates rely on electromagnetic detections and assume uniform\nrotation, while inferring interior magnetic fields remains ambiguous due to a\nlack of direct observations. Measuring the excited fundamental modes of neutron\nstars in gravitational-wave signals offers a promising solution, as these modes\nencode information about stellar composition, structure, and dynamics. Previous\nstudies have examined the individual effects of rotation and magnetic fields on\nthese modes, identifying magnetic suppression and establishing linear relations\nfor the frequencies of the fundamental $l=0$ quasi-radial mode $f_F$ and $l=2$\nquadrupolar mode $f_{^2f}$. However, few have investigated the combined\ninfluence of rotation and magnetic fields. Here, for the first time, we\nconsider both rotation and a toroidal magnetic field to construct linear\nrelations for quantifying $f_F$ and $f_{^2f}$, showing that their combined\neffects can be constrained by detecting these modes. Using 2D axisymmetric\nsimulations, we demonstrate that quasi-linear relations between $f_F$,\n$f_{^2f}$, stellar compactness $M/R$, and kinetic-to-binding energy ratio\n$T/|W|$ persist even with a toroidal magnetic field. The slope of these\nrelations depends on the toroidal magnetization constant $K_\\mathrm{m}$.\nAdditionally, measuring the frequency ratio $f_{^2f}/f_F$ enables inference of\n$T/|W|$ and the maximum magnetic field strength $\\mathcal{B}_\\mathrm{max}$.\nLastly, we show that differential rotation causes only minor deviations from\npredictions for uniform rotation. Thus, this work demonstrates that rotational\nand magnetic properties of neutron stars can be inferred from their fundamental\nmodes."}
{"id": "2509.10177", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.10177", "abs": "https://arxiv.org/abs/2509.10177", "authors": ["Sudeb Ranjan Datta", "Michal Bursa", "Michal Dovciak", "Wenda Zhang"], "title": "Interaction between disk and extended corona in general relativistic framework. I. Static slab corona in global energy balance with the underlying disk", "comment": "Under review in A&A", "summary": "The energy equilibrium between the corona and the underlying disk in a\ntwo-phase accretion flow sets a lower limit on the achievable photon index. A\nslab corona may not explain the hard state observations of X-ray binaries\n(XRBs). We incorporate energy feedback to the accretion disk resulting from\nillumination by an extended corona, and vice versa. The interaction between\nthese two components allows for the possibility of finding an energetically\nself-consistent equilibrium solution for a given disk-corona system. We have\nupgraded the existing Monte Carlo radiative transfer code, MONK, to incorporate\nthe interaction between the disk and the extended corona within the general\nrelativistic framework. We introduce an albedo parameter to specify the\nfraction of the incident flux that is reflected by the disk, while the\nremainder is absorbed and added to the intrinsic dissipation. Reflection is\nmodeled assuming a semi-infinite electron atmosphere. We find global\nequilibrium solutions by iterating interaction between disk and extended slab\ncorona. A higher black hole spin, higher coronal temperature, and higher albedo\nall lead to harder spectra. For typical coronal temperatures and disk albedo,\nthe lowest achievable photon index with a static slab corona fully covering the\ndisk is approximately 1.7-1.8. With the upgraded version of MONK, we are now\nable to achieve global energy equilibrium for a given disk-corona system. This\napproach holds significant potential for constraining the coronal geometry\nusing not only the observed flux but also polarization. A static slab does not\nappear to be a favorable coronal geometry for the hard state of XRBs, even when\nglobal energy balance is taken into account. In future work, we will explore\ntruncated disk geometries and outflowing coronae as potential alternatives.\n(shortened)"}
{"id": "2509.10221", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.10221", "abs": "https://arxiv.org/abs/2509.10221", "authors": ["Pornisara Nuchvanichakul", "Poshak Gandhi", "Christian Knigge", "Yue Zhao", "Puji Irawati", "Suwicha Wanawichian", "Cordelia Dashwood Brown"], "title": "Further evidence for natal kick segregation by spectral type in high-mass X-ray binaries", "comment": "21 pages with 14 figures", "summary": "High-mass X-ray binaries (HMXBs) are systems in which a neutron star or black\nhole accretes material from a massive companion. HMXBs are expected to have\nexperienced a supernova in their evolution. The impulsive kick associated with\nthis event should affect the space velocity of the system in a way that depends\non the nature and state of the progenitor binary. Here, we test whether the\ndifferent evolutionary histories of HMXBs have left a detectable imprint on\ntheir peculiar velocities ($V_{\\rm pec}$). Using data from Gaia Data Release 3\n(Gaia DR3), we first calculate the $V_{\\rm pec}$ values for 63 well-known HMXBs\nhosting a black hole or neutron star and estimate the associated uncertainties\nvia Monte Carlo re-sampling. We then analyse their distribution and check for\ndifferences between classes. Overall, $V_{\\rm pec}$ estimates extend up to 100\nkm s$^{-1}$, but with Be/X-ray binaries (BeXRBs) favouring $V_{\\rm pec}$\n$\\lesssim 40$ km s$^{-1}$ and supergiant X-ray binaries (SgXRBs) favouring\n$V_{\\rm pec}$ $\\gtrsim 40$ km s$^{-1}$. Based on a Kolmogorov-Smirnov (K-S)\ntest, the null hypothesis that the peculiar velocities of both classes are\ndrawn from the same parent distribution can be robustly rejected, irrespective\nof the background stellar velocity dispersion. Tests with binary population\nsynthesis demonstrate that SgXRBs typically have shorter orbital periods and\nhigher fractional mass loss than BeXRBs at supernova. We argue that the\nmagnitude of $V_{\\rm pec}$ could be used as a complementary feature to\ndistinguish between Be and supergiant systems. These findings extend previous\ninferences based on two-dimensional kinematics from Hipparcos, and may be\nexplained by the differing nature of the respective progenitors systems between\nthe source classes at the instant of supernova."}
{"id": "2509.10275", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.10275", "abs": "https://arxiv.org/abs/2509.10275", "authors": ["I. Mariani", "S. E. Motta", "P. Atri", "J. H. Matthews", "R. P. Fender", "J. Martí", "P. L. Luque-Escamilla", "I. Heywood"], "title": "A MeerKAT view of the parsec-scale jets in the black-hole X-ray binary GRS 1758-258", "comment": "14 pages, 6 figures", "summary": "Jets from accreting black hole (BH) X-ray binaries (XRBs) are powerful\noutflows that release a large fraction of the accretion energy to the\nsurrounding environment, providing a feedback mechanism that may alter the\ninterstellar medium (ISM) properties. Studying accretion and feedback together\nenables estimates of matter and energy input/output around accreting BHs. We\nfocus on the extended jet structures of the BH-XRB GRS1758-258. First seen in\nVLA data, these parsec-scale jets arise from jet-ISM interaction and show a\nZ-shaped morphology. Using the MeerKAT telescope we observed GRS1758-258 in\nL-band for a total exposure of 7 hr. Applying a calorimetry-based method\ndeveloped for AGN and later used for XRBs, we estimated the properties of the\njets and of the surrounding ISM. We detect a jet and counter-jet terminating in\nbow-shocks. Within the northern jet lobe we identify synchrotron and\nbremsstrahlung emission, while the southern lobe is dominated by thermal\nemission. We measure ISM densities between 10-40 cm-3 across both jets,\nslightly lower in the northern region. The estimated ages of the two lobes\nrange from 6-51 kyr. The time-averaged jet power lies between 4.4x10^33 and\n3.3x10^36 erg/s, with differences between north and south likely due to\ndifferent local ISM conditions. Comparing new MeerKAT with archival VLA data,\nwe measured a proper motion of 130 mas/yr in a portion of the northern jet.\nJet-ISM interaction structures on both sides of GRS1758-258 reveal different\nISM properties. The comparison between these structures and those from other\nXRBs suggests that the lobes in GRS1758-258 are younger and may result from\ndifferent jet activity phases. The time-averaged energy transferred to the\nenvironment is slightly lower than in other XRBs, consistent with the younger\nage of the lobes in GRS1758-258 relative to those of other systems."}
{"id": "2509.10319", "categories": ["astro-ph.HE", "gr-qc", "physics.comp-ph", "physics.plasm-ph"], "pdf": "https://arxiv.org/pdf/2509.10319", "abs": "https://arxiv.org/abs/2509.10319", "authors": ["Lorenzo Ennoggi", "Manuela Campanelli", "Julian Krolik", "Scott C. Noble", "Yosef Zlochower", "Maria Chiara de Simone"], "title": "The merger of spinning, accreting supermassive black hole binaries", "comment": "6 pages, 3 figures. See Supplemental Material in the ancillary files\n  section", "summary": "Because they are likely to accrete substantial amounts of interstellar gas,\nmerging supermassive binary black holes are expected to be strong\nmultimessenger sources, radiating gravitational waves, photons from thermal\ngas, and photons from relativistic electrons energized by relativistic jets.\nHere we report on a numerical simulation that covers the late inspiral, merger,\nand initial postmerger phase of such a system where both black holes have the\nsame mass and spin, and both spin axes are parallel to the orbital angular\nmomentum. The simulation incorporates both 3D general relativistic\nmagnetohydrodynamics and numerical relativity. The thermal photon power during\nthe late inspiral, merger, and immediate postmerger phases is drawn from strong\nshocks rather than dissipation of turbulence inside a smoothly structured\naccretion disk as typically found around accreting single black holes. We find\nthat the thermal photon and jet Poynting flux outputs are closely related in\ntime, and we posit a mechanism that enforces this relation. The power radiated\nin both photons and jets diminishes gradually as merger is approached, but\njumps sharply at merger to a noisy plateau. Such a distinct lightcurve should\naid efforts to identify supermassive black hole mergers, with or without\naccompanying gravitational wave detections."}
{"id": "2509.10346", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.10346", "abs": "https://arxiv.org/abs/2509.10346", "authors": ["Masahiro Ichihashi", "Aya Bamba", "Dai Tateishi", "Kouichi Hagino", "Satoru Katsuda", "Hiroyuki Uchida", "Hiromasa Suzuki", "Ryo Yamazaki", "Yutaka Ohira"], "title": "The electron temperature distribution and the high ionization just behind the shock in the Cygnus Loop", "comment": "14 pages, 6 figures, ApJ, Accepted", "summary": "The physical processes behind astrophysical collisionless shocks, such as\nthermal relaxation and ionization after shock passage, remain poorly\nunderstood. To investigate these processes, we analyze the northeastern region\nof the Cygnus Loop with XMM-Newton. The electron temperature is found to\nincrease towards the interior of the remnant ranging from 0.15-0.19 keV energy\nrange within a spatial scale of 6 arcmin (or 1.27 pc at a distance of 725 pc)\nfrom the shock front. This can be explained well by a modified Sedov solution\nwith radiative cooling. We also show that the ionization timescales determined\nfrom our spectroscopy are significantly larger than those estimated based on\nthe electron density of the surrounding materials and the shock velocity. This\nexcess can be qualitatively explained by a mixing of inner multiple plasma\ncomponents with different ionization states due to turbulence."}
{"id": "2509.10352", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.10352", "abs": "https://arxiv.org/abs/2509.10352", "authors": ["Polina Kivokurtseva", "Sergey Troitsky"], "title": "Can a gamma-ray dim radio blazar produce a 200-PeV neutrino? The case of PMN J0606$-$0724 and KM3-230213A", "comment": "17 pages, 3 figures", "summary": "An extremely energetic muon has been recently detected by the Cubic Kilometre\nNeutrino Telescope (KM3NeT), indicating the observation of a neutrino with the\nestimated energy of $\\left( 2.2^{+5.7}_{-1.0} \\right)\\times 10^{17}$~eV. Radio\nblazar PMN~J0606$-$0724, not detected in gamma rays, is located within the\nreported error region of the neutrino arrival direction, and was flaring at the\ntime of the event. Here we demonstrate that the neutrino could be produced in a\nphotohadronic interaction in its radio core. The necessary proton power is of\norder of the source's photon luminosity, and protons can be accelerated to the\nrequired energies in the core, while high-energy gamma rays cannot leave the\nsource because of intense production of electron-positron pairs. Expected\ncontribution of the population of similar flaring sources matches\nnon-observation of energetic events by other neutrino telescopes."}
{"id": "2509.10420", "categories": ["astro-ph.HE", "gr-qc"], "pdf": "https://arxiv.org/pdf/2509.10420", "abs": "https://arxiv.org/abs/2509.10420", "authors": ["N. V. Krishnendu", "Frank Ohme", "K. G. Arun"], "title": "Testing the nature of compact objects in the lower mass gap using gravitational wave observations", "comment": "14 pages, 8 Figures and 2 Tables", "summary": "As the compact binary catalog continues to grow rapidly, developing and\nrefining tests to probe the nature of compact objects is essential for a\ncomprehensive understanding of both the observed data and the underlying\nastrophysics of the binary population. We investigate the effectiveness of\nspin-induced multipole moments (SIQM) and tidal deformability measurements in\ndistinguishing lower mass-gap black hole (BH) binaries from non-BH binaries\nwith different mass and spin configurations. We perform model-agnostic tests on\nbinary BH (BBH) simulations using full Bayesian inference, evaluating the\nindependent and joint measurability of SIQM and tidal parameters across the\nparameter space. We extend the analysis to simulations of self-interacting\nspinning boson stars, using synthetic signals that exhibit (a) both SIQM and\ntidal effects and (b) each effect individually. For case (a), recovery is\nperformed using (i) a BBH model, (ii) a model incorporating both SIQM and tidal\neffects, and (iii) models including either SIQM or tidal effects. For case (b),\nwe employ (i) a BBH model and (ii) models incorporating either SIQM or tidal\neffects, consistent with the injection. Simulations employ TaylorF2 waveform\nmodel and consider binaries in the low mass gap with varying spin magnitudes.\nWe find that employing an incorrect model to analyze the signal can lead to\nbiases in parameter inference. Notably, when analyzing a simulated binary boson\nstar-like signal with component masses $\\rm{(4, 4) \\, M_{\\odot}}$ using a BBH\nmodel, the system is incorrectly identified as having masses $\\rm{(8, 2) \\,\nM_{\\odot}}$. In contrast, using the correct recovery model that includes both\nSIQM and tidal deformability effects successfully recovers the true masses,\nhighlighting the significance of waveform model accuracy in performing reliable\ndistinguishability tests for compact objects in the low-mass gap."}
{"id": "2509.10274", "categories": ["astro-ph.IM", "astro-ph.HE", "hep-ex"], "pdf": "https://arxiv.org/pdf/2509.10274", "abs": "https://arxiv.org/abs/2509.10274", "authors": ["Philipp Pilar", "Martin Ravn", "Christian Glaser", "Niklas Wahlström"], "title": "A Differentiable Surrogate Model for the Generation of Radio Pulses from In-Ice Neutrino Interactions", "comment": null, "summary": "The planned IceCube-Gen2 radio neutrino detector at the South Pole will\nenhance the detection of cosmic ultra-high-energy neutrinos. It is crucial to\nutilize the available time until construction to optimize the detector design.\nA fully differentiable pipeline, from signal generation to detector response,\nwould allow for the application of gradient descent techniques to explore the\nparameter space of the detector. In our work, we focus on the aspect of signal\ngeneration, and propose a modularized deep learning architecture to generate\nradio signals from in-ice neutrino interactions conditioned on the shower\nenergy and viewing angle. The model is capable of generating differentiable\nsignals with amplitudes spanning multiple orders of magnitude, as well as\nconsistently producing signals corresponding to the same underlying event for\ndifferent viewing angles. The modularized approach ensures physical consistency\nof the samples and leads to advantageous computational properties when using\nthe model as part of a bigger optimization pipeline."}
