{"id": "2511.02871", "categories": ["astro-ph.IM", "astro-ph.EP", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2511.02871", "abs": "https://arxiv.org/abs/2511.02871", "authors": ["R. O. Parke Loyd", "Evgenya L. Shkolnik", "Joseph Lazio", "Gregg W. Hallinan", "Julián Alvarado-Gómez", "Laura Amaral", "Ivey Davis", "Alison Farrish", "James Green", "Dave Brain", "Bin Chen", "Christina Cohen", "Shannon Curry", "Karin Dissauer", "Arika Egan", "Nat Gopalswamy", "Guillaume Gronoff", "Shadia Habbal", "Renyu Hu", "Meng Jin", "James Paul Mason", "Ruth Murray-Clay", "Kosuke Namekata", "Rachel Osten", "Antígona Segura", "Astrid Veronig", "Aline Vidotto", "Maurice Wilson", "Yu Xu"], "title": "The Exospace Weather Frontier", "comment": "170 pages, 55 figures (with table of contents, references,\n  appendices, glossary, and index)", "summary": "Space weather is among the most powerful and least understood forces shaping\nplanetary atmospheres. In our Solar System, we observe its effects directly:\natmospheric escape, chemical disruption, and spectacular auroral displays. Yet\nfor exoplanets, we lack the tools and data to comprehensively assess the\nimpacts of space weather, especially invisible elements like stellar winds,\ncoronal mass ejections, energetic particles, and variable interplanetary\nmagnetic fields. This problem lies at the intersection of four key fields:\nheliophysics, planetary science, astrobiology, and astrophysics. In 2023--2025,\nexperts from these four fields convened at the W. M. Keck Institute for Space\nStudies to explore pathways for advancing the study of exospace weather.\nOrganizing the subject into five core themes -- planets and their stellar\nparticle environments, stellar magnetism and space weather modeling,\nquasi-steady stellar winds, transient events, and programmatic pathways -- our\nteam synthesized concepts from across relevant fields and identified a wide\narray of opportunities for progress. This report is the product of that effort.\nIt assembles cross-disciplinary knowledge; highlights outstanding theoretical\nchallenges; explores promising innovations in observation, modeling,\nmethodology, and instrumentation; and makes recommendations for accelerating\ncommunity-wide progress. Together, these lay out a path to transforming the\nchallenging, yet tractable problem of exospace weather into a foundational\nelement of our understanding exoplanetary systems, and our own Solar System, in\ntheir entirety."}
{"id": "2511.02917", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.02917", "abs": "https://arxiv.org/abs/2511.02917", "authors": ["Norbert Schartel", "Maria Santos-Lleo"], "title": "Unveiling the Cosmos: XMM-Newton's Scientific Strategy", "comment": "29 pages, 15 Figures, accepted for publication in Astronomical Notes", "summary": "In December 2024, the European Space Agency's (ESA) XMM-Newton X-ray\nObservatory celebrated the 25th anniversary of its launch. The annual number of\npeer-reviewed articles utilising XMM-Newton data has exhibited a consistent\nupward trajectory over the past two and a half decades, attaining more than 400\nin 2022. The annual call for observing time proposals continues to experience a\nhigh level of oversubscription, typically ranging from a factor of 6 to 7. In\norder to enhance the scientific discovery space, XMM-Newton, primarily through\nthe Project Scientist and Science Operations Centre, has pursued a strategy of\nexpansion, which can be grouped into three phases: Large Projects with long\nobserving time (2006-2009), Joint Observations (2011-2016), and Targets of\nOpportunity (2016-2024), respectively. A salient feature of XMM-Newton's time\nallocation is the systematic removal of biases from the second call onwards, a\nstrategy that has enabled the attainment of comparable gender success rates and\nhigh acceptance rates for young scientists over 25 years, a feat only recently\naccomplished by similar missions through the introduction of double-anonymous\nreview. XMM-Newton research is conducted by an active community of 4,300\nscientists, of which approximately 570 are leading (1st author). The foundation\nof this community and its research is predicated on XMM-Newton data, with the\nproject's policy of user support and calibration being fundamental\nconstituents, as well as the project's active engagement and communication with\nits members."}
{"id": "2511.02945", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2511.02945", "abs": "https://arxiv.org/abs/2511.02945", "authors": ["Marek Górski", "Grzegorz Pietrzyński", "Paulina Karczmarek", "Gergely Hajdu", "Mirosław Kicia", "Mikołaj Kałuszyński", "Joseph R. Eimer", "Stephen A. Smee", "Bartłomiej Zgirski", "Piotr Wielgórski", "Weronika Narloch"], "title": "Secondary standards in the UKIRT faint standard fields", "comment": "Accepted for publication in the Astrophysical Journal Supplement\n  Series (ApJS)", "summary": "We present precise J- and K-band photometric measurements for 128\nnear-infrared secondary standard stars, located in the 19 UKIRT/MKO primary\nfaint standard fields. The data were collected over more than 50 nights,\ncovering a decade of observations between 2008 and 2018 at the ESO La Silla\nObservatory, using the New Technology Telescope (NTT) equipped with the SOFI\nNIR camera. Presented magnitudes are calibrated onto the MKO photometric\nsystem. The J- and K-band magnitudes range from 10 to 15.8 mag, with median\nvalues of $\\tilde{J}$ = 13.5 and $\\tilde{K}$ = 13 mag. The selection process\nensured high photometric quality, with a precision better than 0.01 mag for all\nstars. The catalog excludes stars with close neighbors, high proper motion, or\nvariable stars. Using these fields for standardization can improve the\nprecision and accuracy of photometric calibrations without increasing the\nobservational time cost."}
{"id": "2511.02961", "categories": ["astro-ph.IM", "quant-ph"], "pdf": "https://arxiv.org/pdf/2511.02961", "abs": "https://arxiv.org/abs/2511.02961", "authors": ["Ephraim Gau", "Zhongyuan Liu", "Henric Krawczynski", "Chong Zu"], "title": "Improving the Energy and Angular Resolutions of X-ray Telescopes with Nitrogen-Vacancy Centers in Diamond", "comment": "15 pages, 5 figures, 1 table", "summary": "We introduce a focal-plane detector for advancing the energy and angular\nresolutions of current X-ray telescopes. The architecture integrates a metallic\nmagnetic microcalorimeter (MMC) array of paramagnetic absorber pads with a thin\nlayer of nitrogen-vacancy (NV) centers in diamond for simultaneous optical\nreadout. An impinging X-ray photon induces a temperature transient in an\nabsorber pad, kept at ~35 mK. This time- and temperature-dependent magnetic\nfield transient is then optically imaged by diamond NV centers, kept at 4 K and\npositioned directly below the pad. For a 10 $\\mu$m absorber length used with a\n12 m focal length telescope, our design yields an optimal angular resolution of\n~0.17 arcseconds and energy resolution of ~0.70 eV. Our NV-MMC design improves\nupon current transition-edge sensors (TES) or MMCs read-out by superconducting\nquantum interference devices (SQUID) by enabling simultaneous optical readout\nof the entire MMC array. Because no additional cryogenic multiplexing\nelectronics are required, our approach scales naturally to larger and finer\narrays, supporting finer angular resolutions and wider fields of view."}
{"id": "2511.03140", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2511.03140", "abs": "https://arxiv.org/abs/2511.03140", "authors": ["Xu-Fan Hu", "Hong-Xuan Jiang", "Yosuke Mizuno", "Christian M. Fromm", "Bhargav Vaidya"], "title": "Quasi-Periodic Polarized Emissions from Kink Structure in Magnetized Relativistic Jets", "comment": "14 pages, 11 figures; accepted for publication in ApJ", "summary": "Recent polarimetric observations of blazars indicate the development of\ncurrent-driven (CD) kink instability after passing the recollimation shocks in\nthe relativistic jets and association with quasi-periodic oscillations (QPOs).\nTo investigate multi-wavelength polarized features of CD kink instability in\njets, we develop {\\tt RaptorP}, a new special relativistic module of the\npolarized General Relativistic Radiative Transfer (GRRT) code {\\tt RAPTOR}.\nBased on 3D SRMHD simulations of over-pressured magnetized jets, we find that\njet images vary at different frequencies. At low frequencies, the emission\ncomes from the turbulent ambient medium surrounding the jet that obscures the\ninner jet structure. Electronic Vector Position Angle (EVPA) patterns are\nperpendicular to the jet propagation direction, indicating a dominance of the\npoloidal magnetic field. At high frequencies, bright knots and twisted kink\nstructures appear, and EVPA patterns are consistent with a toroidal magnetic\nfield. We also find that QPOs in light curves of intensity and linear\npolarization (degree and angle). The peak frequency in Power Spectral Densities\n(PSDs) is well-matched with the rotation period of the kink structure in\nrelativistic jets. It shows an anti-correlation between total intensity and the\ndegree of polarization at a lower inclination angle. Our findings, based on\nrealistic polarized radiation calculations, will explain the observational\nsignatures seen in blazars."}
{"id": "2511.02985", "categories": ["astro-ph.IM", "astro-ph.CO", "astro-ph.GA", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2511.02985", "abs": "https://arxiv.org/abs/2511.02985", "authors": ["James J. Bock", "Asad M. Aboobaker", "Joseph Adamo", "Rachel Akeson", "John M. Alred", "Farah Alibay", "Matthew L. N. Ashby", "Yoonsoo P. Bach", "Lindsey E. Bleem", "Douglas Bolton", "David F. Braun", "Sean Bruton", "Sean A. Bryan", "Tzu-Ching Chang", "Shuang-Shuang Chen", "Yun-Ting Cheng", "James R. Cheshire IV", "Yi-Kuan Chiang", "Jean Choppin de Janvry", "Samuel Condon", "Walter R. Cook", "Brendan P. Crill", "Ari J. Cukierman", "Olivier Dore", "C. Darren Dowell", "Gregory P. Dubois-Felsmann", "Spencer Everett", "Beth E. Fabinsky", "Andreas L. Faisst", "James L. Fanson", "Allen H. Farrington", "Tamim Fatahi", "Candice M. Fazar", "Richard M. Feder", "Eric H. Frater", "Henry S. Grasshorn Gebhardt", "Utkarsh Giri", "Tatiana Goldina", "Varoujan Gorjian", "William G. Hart", "Joseph L. Hora", "Zhaoyu Huai", "Howard Hui", "Young-Soo Jo", "Woong-Seob Jeong", "Jae Hwan Kang", "Miju Kang", "Branislav Kecman", "Chul-Hwan Kim", "Jaeyeong Kim", "Minjin Kim", "Young-Jun Kim", "Yongjung Kim", "J. Davy Kirkpatrick", "Phil M. Korngut", "Elisabeth Krause", "Bomee Lee", "Ho-Gyu Lee", "Jae-Joon Lee", "Jeong-Eun Lee", "Carey M. Lisse", "Giacomo Mariani", "Daniel C. Masters", "Philip D. Mauskopf", "Gary J. Melnick", "Mary H. Minasyan", "Jordan Mirocha", "Hiromasa Miyasaka", "Anne Moore", "Bradley D. Moore", "Giulia Murgia", "Bret J. Naylor", "Christina Nelson", "Chi H. Nguyen", "Jinyoung K. Noh", "Stephen Padin", "Roberta Paladini", "Konstantin I. Penanen", "Dustin S. Putnam", "Jeonghyun Pyo", "Nesar Ramachandra", "Keshav Ramanathan", "Daniel J. Reiley", "Eric B. Rice", "Jennifer M. Rocca", "Ji Yeon Seok", "Jeremy Stober", "Sara Susca", "Harry I. Teplitz", "Michael P. Thelen", "Volker Tolls", "Gabriela Torrini", "Amy R. Trangsrud", "Stephen Unwin", "Phani Velicheti", "Pao-Yu Wang", "Robin Y. Wen", "Michael-W. -Werner", "Ross Williamson", "James Wincentsen", "Soung-Chul Yang", "Yujin Yang", "Michael Zemcov"], "title": "The SPHEREx Satellite Mission", "comment": "30 pages, 21 figures. Submitted to Astrophysical Journal on 1\n  November 2025", "summary": "SPHEREx, a NASA explorer satellite launched on 11 March 2025, is carrying out\nthe first all-sky near-infrared spectral survey. The satellite observes in 102\nspectral bands from 0.75 to 5.0 um with a resolving power ranging from 35 to\n130 in 6.2 arcsecond pixels. The observatory obtains a 5-sigma depth of 19.5 -\n19.9 AB mag for 0.75 to 3.8 um and 17.8 - 18.8 AB mag for 3.8 to 5.0 um after\nmapping the full sky four times over two years. Scientifically, SPHEREx will\nproduce a large galaxy redshift survey over the full sky, intended to constrain\nthe amplitude of inflationary non-Gaussianity. The observations will produce\ntwo deep spectral maps near the ecliptic poles that will use intensity mapping\nto probe the evolution of galaxies over cosmic history. By mapping the depth of\ninfrared absorption features over the Galactic plane, SPHEREx will\ncomprehensively survey the abundance and composition of water and other\nbiogenic ice species in the interstellar medium. The initial data are rapidly\nreleased in the form of spectral images to the public. The project will release\nspecialized data products over the life of the mission as the surveys proceed.\nThe science team will also produce specialized spectral catalogs on\nplanet-bearing and low-mass stars, solar system objects, and galaxy clusters 3\nyears after launch. We describe the design of the instrument and spacecraft,\nwhich flow from the core science requirements. Finally, we present an initial\nevaluation of the in-flight performance and key characteristics."}
{"id": "2511.03150", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.03150", "abs": "https://arxiv.org/abs/2511.03150", "authors": ["Jingbo Wang", "Jintao Xie", "Jing Zou", "Jianfei Tang"], "title": "Study of Four nulling pulsars with FAST", "comment": null, "summary": "We present an analysis of 4 nulling pulsars with the Five-hundred-meter\nAperture Spherical radio Telescope (FAST). For PSR J1649+2533, our results\nsuggest mode changing rather than subpulse drifting as previously reported at\nlower frequencies. For PSR J1752+2359, we confirm its quasi-periodic switching\nbetween distinct emission states, but further show that the so-called\n\"quasi-null\" or \"RRAT-like\" state actually consists of persistent low-level\nemission superposed with occasional bright pulses. For PSR J1819+1305, our data\nconfirm the modulation reported earlier, while additional weaker features are\nalso seen. For PSR J1916+1023, we detect both nulling and subpulse drifting,\nbut find no clear evidence of direct interaction between them. These results\nprovide new insights into the diverse manifestations of pulsar nulling,\nhighlight the capability of FAST to detect subtle emission states, and add to\nthe growing body of work on pulsar emission variability."}
{"id": "2511.03225", "categories": ["astro-ph.IM", "astro-ph.EP"], "pdf": "https://arxiv.org/pdf/2511.03225", "abs": "https://arxiv.org/abs/2511.03225", "authors": ["Manjunath Bestha", "Thirupathi Sivarani", "Bachar Wehbe", "Amirul Hasan", "Bharat Chandra P", "Devika K Divakar", "Athira Unni", "Parvathy Menon", "Arun Surya", "Pallavi Saraf"], "title": "A new broadband atmospheric dispersion corrector for HROS-TMT", "comment": "Accepted for publication in Royal Astronomical Society Techniques and\n  Instruments (RASTI)", "summary": "Atmospheric dispersion causes light from celestial objects with different\nwavelengths to refract at varying angles as it passes through Earth's\natmosphere. This effect results in an elongated image at the focal plane of a\ntelescope and diminishes fiber coupling efficiency into spectrographs. We\npropose an optical design that incorporates a Rotational Atmospheric Dispersion\nCorrector (RADC) to address the broadband dispersion encountered in the\nmulti-object mode of the High-Resolution Optical Spectrograph (HROS) on the\nThirty Meter Telescope (TMT). The RADC corrects the dispersion across the\nentire wavelength range (0.31-1 micron), using Amici prisms optimized for over\n90% transmission efficiency and minimal angular deviation of the beam from the\noptical axis after dispersion correction. For enhanced accuracy, particularly\nin the blue region, we have, for the first time, implemented the Filippenko\n(1982) model in Zemax via a custom Dynamic-Link Library (DLL) file."}
{"id": "2511.03172", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.03172", "abs": "https://arxiv.org/abs/2511.03172", "authors": ["Mahasweta Bhattacharya", "Aditya S. Mondal", "Biplab Raychaudhuri", "Gulab C. Dewangan"], "title": "Exploring the spectral characteristics of the periodic burster 4U 1323-62: Type-I X-ray burst and persistent emission", "comment": "23 pages, 8 figures and 7 tables, submitted to Journal of High Energy\n  Astrophysics", "summary": "We report on the results obtained by the analysis of persistent and type-I\nthermonuclear X-ray burst emission observed from the periodic burster 4U\n1323-62. These analyses are based on the NuSTAR observation performed on 2024\nAugust 7 for a total exposure of around 90 ks. The persistent emission is well\ndescribed by an absorbed thermal Comptonization model. An absorption edge is\nalso detected at an energy of approximately 7.87 keV, which indicates the\npresence of absorbing material in the vicinity of this system. Six bursts have\nbeen observed during this observation, wherein we find the burst recurrence\ntime to be approximately 4.52 hr. All the bursts exhibit the characteristics of\na sharp rise and exponential decay. We perform the time-resolved spectroscopy\nof the burst spectra described by a model consisting of thermal emission from\nthe neutron star surface and a varying persistent emission component to study\nthe evolution of burst parameters. The enhancement of the persistent emission\nduring burst exposure is characterized by the scaling parameter f a, which\nreflects the increasing strength of the burst-disc interaction with burst\nintensity, likely driven by Poynting-Robertson drag. The spectral analysis of\nbursts estimate the average apparent blackbody emitting radius of the neutron\nstar to lie within 1.5-3.5 km. The ignition depths computed from the burst\nparameters indicate short Type-I thermonuclear bursts from a mixed\nhydrogen-helium fuel layer."}
{"id": "2511.03438", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2511.03438", "abs": "https://arxiv.org/abs/2511.03438", "authors": ["V. A. Allakhverdyan", "A. D. Avrorin", "A. V. Avrorin", "V. M. Aynutdinov", "I. A. Belolaptikov", "Z. Berusova", "E. A. Bondarev", "I. V. Borina", "N. M. Budnev", "V. A. Chadymov", "A. S. Chepurnov", "V. Y. Dik", "A. N. Dmitriyeva", "G. V. Domogatsky", "A. A. Doroshenko", "R. Dvornicky", "A. N. Dyachok", "Zh. -A. M. Dzhilkibaev", "E. Eckerova", "T. V. Elzhov", "V. N. Fomin", "A. R. Gafarov", "K. V. Golubkov", "T. I. Gress", "K. G. Kebkal", "V. K. Kebkal", "I. Kharuk", "S. S. Khokhlov", "E. V. Khramov", "M. M. Kolbin", "S. O. Koligaev", "K. V. Konischev", "A. V. Korobchenko", "A. P. Koshechkin", "V. A. Kozhin", "M. V. Kruglov", "V. F. Kulepov", "A. A. Kulikov", "Y. E. Lemeshev", "M. V. Lisitsin", "S. V. Lovtsov", "R. R. Mirgazov", "D. V. Naumov", "A. S. Nikolaev", "I. A. Perevalova", "A. A. Petrukhin", "D. P. Petukhov", "E. N. Pliskovsky", "M. I. Rozanov", "E. V. Ryabov", "G. B. Safronov", "B. A. Shaybonov", "V. Y. Shishkin", "E. V. Shirokov", "F. Simkovic", "A. E. Sirenko", "A. V. Skurikhin", "A. G. Solovjev", "M. N. Sorokovikov", "I. Stekl", "A. P. Stromakov", "O. V. Suvorova", "V. A. Tabolenko", "V. I. Tretyak", "B. B. Uizutuev", "Y. V. Yablokova", "D. N. Zaborov", "S. I. Zavyalov", "D. Y. Zvezdov"], "title": "Design and Implementation of the Fast Data Processing System for the Baikal-GVD Neutrino Telescope", "comment": "11 pages, 2 figures", "summary": "We present a fast data processing system for the Baikal-GVD neutrino\ntelescope, designed for rapid identification of astrophysical neutrino events.\nLeveraging Baikal-GVD's modular cluster architecture, the system implements\nparallelized file processing where raw data files undergo concurrent analysis\nacross dedicated virtual machines. The system implements two pipelines: a fast\nper-file processing and a fully fledged (per-run) processing, which integrates\ndynamic detector geometry determined from acoustic and inertial positioning\nsystems and data quality monitoring with a latency of about 27 hr. The fast\nprocessing pipeline delivers a total latency of about 1.5-18 minutes from event\ndetection to reconstructed data availability, depending on water luminescence\nlevels. This enables fast follow-up observations of transient astrophysical\nsources, fulfilling Baikal-GVD's role in multi-messenger networks. The article\nalso highlights key features of the data acquisition system, the integration of\nadvanced synchronization systems and a robust infrastructure for data handling\nand storage, ensuring efficient and reliable operation of the Baikal-GVD\ntelescope."}
{"id": "2511.03185", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.03185", "abs": "https://arxiv.org/abs/2511.03185", "authors": ["A. D. Kulkarni", "R. M. Shannon", "D. J. Reardon", "M. T. Miles"], "title": "Measuring scattering variations in pulsar timing observations: A test of the fidelity of current methods", "comment": "16 pages, 9 figures, 2 Tables,", "summary": "The turbulent nature of the ionised interstellar medium (IISM) causes\ndispersion measure (DM) and scattering variations in pulsar timing\nmeasurements. To improve precision of gravitational wave measurements, pulsar\ntiming array (PTA) collaborations have begun the use of sophisticated and\nintricate noise modelling techniques such as modelling stochastic variations\ninduced by the turbulent IISM and quasi-deterministic processes attributed to\ndiscrete structures. However, the reliability of these techniques has not been\nstudied in detail, and it is unclear whether the recovered processes are\nphysical or if they are impacted by misspecification. In this work, we present\nan analysis to test the efficacy of IISM noise models based on the data from\nthe MeerKAT Pulsar Timing Array (MPTA) 4.5-year data release. We first\nperformed multi-frequency, long-length (500 refractive length scale)\nsimulations of multipath propagation in the IISM to study the properties of\nscattering variations under a variety of scattering conditions. The results of\nour simulations show the possibility of significant radio-frequency\ndecorrelation in the scattering variations, particularly for the anisotropic\nscattering medium. Our analysis of the observed DM and scattering variations\nusing the MPTA 4.5-year data set shows that there can be apparent\nanticorrelations between DM and scattering variations, which we attribute to\nthe model fitting methods. We also report a possibility that plasma\nunderdensities might exist along the sight lines of PSR J1431$-$5740 and PSR\nJ1802$-$2124. Finally, using simulations, we show that the IISM noise models\ncan result in the apparent measurement of strong frequency dependence of\nscattering variations observed in the MPTA data set. Our analysis shows that\nimprovements in the IISM noise modelling techniques are necessary to accurately\nmeasure the IISM properties."}
{"id": "2511.03518", "categories": ["astro-ph.IM", "astro-ph.EP"], "pdf": "https://arxiv.org/pdf/2511.03518", "abs": "https://arxiv.org/abs/2511.03518", "authors": ["Axel Potier", "Raphaël Galicher", "Pierre Baudoz", "Johan Mazoyer", "Zahed Wahhaj", "Ruben Tandon", "Jonas G. Kühn", "Laura Perez", "Gael Chauvin"], "title": "Coherent Differential Imaging of high-contrast extended sources with VLT/SPHERE", "comment": "Accepted in A&A", "summary": "High-contrast imaging relies on advanced coronagraphs and adaptive optics\n(AO) to attenuate the starlight. However, residual aberrations, especially\nnon-common path aberrations between the AO channel and the coronagraph channel,\nlimit the instrument performance. While post-processing techniques such as\nspectral or angular differential imaging (ADI) can partially address those\nissues, they suffer from self-subtraction and inefficiencies at small angular\nseparations or when observations are conducted far from transit. We previously\ndemonstrated the on-sky performance of coherent differential imaging (CDI),\nwhich offers a promising alternative. It allows for isolating coherent\nstarlight residuals through speckle modulation, which can then be subtracted\nfrom the raw images during post-processing. This work aims to validate a CDI\nmethod on real science targets, demonstrating its effectiveness in imaging\nalmost face-on circumstellar disks, which are typically challenging to retrieve\nwith ADI. We temporally modulated the speckle field in VLT/SPHERE images,\napplying small phase offsets on the AO deformable mirror while observing stars\nsurrounded by circumstellar material: HR 4796A, CPD-36 6759, HD 169142, and HD\n163296. We hence separated the astrophysical scene from the stellar speckle\nfield, whose lights are mutually incoherent. Combining a dozen of data frames\nand reference coronagraph point spread functions through a Karhunen-Lo\\`eve\nimage projection framework, we recover the circumstellar disks without the\nartifacts that are usually introduced by common post-processing algorithms\n(e.g., self-subtraction). The CDI method therefore represents a promising\nstrategy for calibrating the effect of static and quasi-static aberrations in\nfuture direct imaging surveys. Indeed, it is efficient, does not require\nfrequent telescope slewing, and does not introduce image artifacts to first\norder."}
{"id": "2511.03262", "categories": ["astro-ph.HE", "astro-ph.CO", "gr-qc"], "pdf": "https://arxiv.org/pdf/2511.03262", "abs": "https://arxiv.org/abs/2511.03262", "authors": ["Mohit Raj Sah", "Suvodip Mukherjee"], "title": "The First Upper Bound on the Non-Stationary Gravitational Wave Background and its Implication on the High Redshift Binary Black Hole Merger Rate", "comment": "13 pages, 9 figures", "summary": "The high redshift merger rate and mass distribution of black hole binaries\n(BHBs) is a direct probe to distinguish astrophysical black holes (ABHs) and\nprimordial black holes (PBHs), which can be studied using the Stochastic\nGravitational-Wave Background (SGWB). The conventional analyses solely based on\nthe power spectrum are limited in constraining the properties of the underlying\nsource population under the assumption of a non-sporadic Gaussian distribution.\nHowever, recent studies have shown that SGWB will be sporadic and non-Gaussian\nin nature, which will cause non-zero 'spectral correlation' depending on the\nhigh redshift merger rate and mass distribution of the compact objects. In this\nwork, we present the first spectral covariance analysis of the SGWB using data\nfrom the LIGO-Virgo-KAGRA collaboration during the third and the first part of\nthe fourth observing runs. Our analysis indicates that the current spectral\ncorrelation is consistent with non-stationary noise, yielding no detection from\nthe current data and providing only upper bounds between frequencies in the\nrange 25 Hz to 100 Hz. This upper bound on the spectral correlation translates\nto the upper bounds on the mass-dependent merger rate of PBHs between\n$2.4\\times10^{4}$ and $2.3\\times10^{2} \\rm ~Gpc^{-3}yr^{-1}$ (at ${\\rm z} = 1 $\n) with a log-normal mass distribution with median masses between $20\n~M_{\\odot}$ and $120 ~M_{\\odot}$. This provides a stringent upper bound on the\nPBH merger rate at high redshift and hence puts constraints on the PBH\nformation scenario even in the presence of large spatial clustering. In the\nfuture, detection of this signal will lead to direct evidence of the\nhigh-redshift black hole population using gravitational waves."}
{"id": "2511.03604", "categories": ["astro-ph.IM", "astro-ph.HE", "gr-qc"], "pdf": "https://arxiv.org/pdf/2511.03604", "abs": "https://arxiv.org/abs/2511.03604", "authors": ["Riccardo Buscicchio", "Federico Pozzoli", "Daniele Chirico", "Alberto Sesana"], "title": "The first year of LISA Galactic foreground", "comment": "16 pages, 13 figures", "summary": "Galactic white-dwarf binaries play a central role in the inference model for\nthe Laser Interferometer Space Antenna. In this manuscript, we employ the\n$\\texttt{bahamas}$ codebase to characterize, in a global-fit fashion, the\nreconstruction of the Galactic foreground during the first year of observation.\nTo account for its statistical properties, we represent the data in\ntime--frequency domain, and characterize the effectiveness of multiple\napproaches, e.g. statistically viable likelihoods, sampling schemes,\nsegmentation widths, and gaps density. Our analysis yields consistent results\nacross, with overwhelming evidence in favor of a non-stationary model in less\nthan a month of data. Moreover, we show robustness against the presence of\nadditional extragalactic foregrounds, and test the suitability of our\napproximations on the more complex simulated data in the $\\textit{Yorsh}$ data\nchallenge."}
{"id": "2511.03316", "categories": ["astro-ph.HE", "hep-ex"], "pdf": "https://arxiv.org/pdf/2511.03316", "abs": "https://arxiv.org/abs/2511.03316", "authors": ["Yen-Jhen Liu", "Yi Yang"], "title": "Search for Axion-Like Particles in High-Magnetic-Field Pulsars with NICER", "comment": null, "summary": "Axion-like particles (ALPs) can couple to photons in strong magnetic fields,\nproducing characteristic fluctuations in X-ray spectra. Using data from NASA's\nNeutron Star Interior Composition EXplorer (NICER), we analyzed three pulsars,\nPSR J2229+6114, PSR J1849-0001, and PSR B0531+21, to search for such features.\nEach spectrum was modeled with a sliding-window power-law fitting method to\nidentify local deviations from the smooth continuum. From these analyses, we\nderived constraints on the axion-photon coupling constant $g_{a\\gamma\\gamma}$\nwithin a refined parameter space compared to previous studies, obtaining upper\nlimits in the range $10^{-12}-10^{-14}GeV^{-1}$."}
{"id": "2511.03667", "categories": ["astro-ph.IM", "astro-ph.CO", "astro-ph.HE", "stat.ML"], "pdf": "https://arxiv.org/pdf/2511.03667", "abs": "https://arxiv.org/abs/2511.03667", "authors": ["Luigi D'amico", "Eleonora Villa", "Fatima Modica Bittordo", "Aldo Barca", "Francesco Alì", "Massimo Meneghetti", "Luca Naso"], "title": "Addressing prior dependence in hierarchical Bayesian modeling for PTA data analysis I: Methodology and implementation", "comment": "15 pages, 7 figures. Under review for Proceedings of International\n  Summer Conference 2025: Intelligent Systems & Decision Making: Human Insights\n  in the Era of A.I - Lecture Notes in Computer Science, Springer Nature", "summary": "Complex inference tasks, such as those encountered in Pulsar Timing Array\n(PTA) data analysis, rely on Bayesian frameworks. The high-dimensional\nparameter space and the strong interdependencies among astrophysical, pulsar\nnoise, and nuisance parameters introduce significant challenges for efficient\nlearning and robust inference. These challenges are emblematic of broader\nissues in decision science, where model over-parameterization and prior\nsensitivity can compromise both computational tractability and the reliability\nof the results. We address these issues in the framework of hierarchical\nBayesian modeling by introducing a reparameterization strategy. Our approach\nemploys Normalizing Flows (NFs) to decorrelate the parameters governing\nhierarchical priors from those of astrophysical interest. The use of NF-based\nmappings provides both the flexibility to realize the reparametrization and the\ntractability to preserve proper probability densities. We further adopt\ni-nessai, a flow-guided nested sampler, to accelerate exploration of complex\nposteriors. This unified use of NFs improves statistical robustness and\ncomputational efficiency, providing a principled methodology for addressing\nhierarchical Bayesian inference in PTA analysis."}
{"id": "2511.03338", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.03338", "abs": "https://arxiv.org/abs/2511.03338", "authors": ["Raphaël Mignon-Risse", "Peggy Varniere", "Fabien Casse"], "title": "Electromagnetic variability from circumbinary discs around binary black holes during their post-decoupling epoch", "comment": "9 pages, 7 figures. Accepted for publication in MNRAS", "summary": "We present general-relativistic hydrodynamical simulations of inviscid\ncircumbinary discs (CBDs) around near equal-mass binary black holes (BBH) in\nthe binary-disc post-decoupling epoch. We use an approximate BBH spacetime with\na post-Newtonian inspiral motion trajectory from ${\\sim}80 (M/10^7\n\\mathrm{M_\\odot}) \\, \\mbox{days}$ (separation of ${\\sim}\\,30$ gravitational\nradii) to ${\\sim}100 (M/10^7 \\mathrm{M_\\odot}) \\, \\mbox{minutes}$ before\nmerger. Initial data for the inspiral runs are produced from circular-orbits\nruns covering the formation timescale of the overdense {\\lq}lump{\\rq}, orbiting\nthe CBD inner edge. The CBD non-axisymmetries (spiral waves and lump) lead to\nnon-negligible angular momentum transport with effective viscosity\n${\\alpha_\\mathrm{eff} \\, {\\sim} \\, 10^{{-3}}{- 2\\times 10}^{-2}}$. We\npost-process these simulations with a general-relativistic ray-tracing code to\nobtain synthetic observations in thermal emission. We find the lump and its\nassociated electromagnetic (EM) modulation, already reported in the\npre-decoupling epoch, to survive post-decoupling up until the end of the\nsimulation. For LISA sources, our findings point to an active EM signature in\nUV during optimal gravitational wave source localization. For PTA sources and\ncurrent BBH candidates detected through their optical periodicity: the lump{ in\na low-viscosity CBD is a possible, though not unique, origin} for the observed\nperiodicity."}
{"id": "2511.03386", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.03386", "abs": "https://arxiv.org/abs/2511.03386", "authors": ["Andrzej A. Zdziarski", "Swadesh Chand", "Gulab Dewangan", "Ranjeev Misra", "Michal Szanecki", "Bei You", "Maxime Parra", "Gregoire Marcel"], "title": "The strong Fe K line and spin of the black-hole X-ray binary MAXI J1631-479", "comment": "Submitted to ApJ, comments are welcome", "summary": "We study the transient black hole binary MAXI J1631--479 in its soft spectral\nstate observed simultaneously by the NICER and NuSTAR instruments. Its puzzling\nfeature is the presence of a strong and broad Fe K line, while the continuum\nconsists of a strong disk blackbody and a very weak power-law tail. The\nirradiation of the disk by a power-law spectrum fitting the tail is much too\nweak to account for the strong line. Two solutions were proposed in the past.\nOne invoked an intrinsic Fe K disk emission, and the other invoked disk\nirradiation by the returning blackbody emission. We instead find that the\nstrong line is naturally explained by the irradiation of the disk by the\nspectrum from Comptonization of the disk blackbody by coronal relativistic\nelectrons. The shape of the irradiating spectrum at $\\lesssim$10 keV reflects\nthat of the disk blackbody; it is strongly curved and has a higher flux than\nthat of a fit with a power-law irradiation. That flux accounts for the line.\nWhile this result is independent of the physical model used for the disk\nintrinsic emission, the value of the fitted spin strongly depends on it. When\nusing a Kerr disk model for a thin disk with a color correction, the fitted\nspin corresponds to a retrograde disk, unlikely for a Roche-lobe overflow\nbinary. Then, a model accounting for both the disk finite thickness and\nradiative transfer yields a spin of $a_*\\approx0.8$--0.9, which underlines the\nstrong model-dependence of X-ray spin measurements."}
{"id": "2511.03419", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.03419", "abs": "https://arxiv.org/abs/2511.03419", "authors": ["G. S. Bisnovatyi-Kogan", "E. A. Patraman"], "title": "Stellar critical parameters in the uniform density approximation", "comment": "12 pages, 3 figures", "summary": "Stellar models are calculated in the approximation of a uniform density\ndistribution. Variational method was used for determination of the boundary of\na stability loss, for stellar masses in the range from 2 up to $10^5$\n$M_{\\odot}$. The effects of the general relativity had been taken into account.\nThe equation of state in the temperature and density ranges $10^9 < T < 10^{10}\nK$, $10^5 < \\rho < 10^{10}\\,\\frac{g}{cm^3}$ had been taken from the work of\nImshennik and Nadyozhin (1965). The critical parameters for the values of\nentropy and stellar masses differ from more accurate values, obtained using a\nmore complicated variant of accepted density distribution, not more than\n12$\\%$."}
{"id": "2511.03457", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.03457", "abs": "https://arxiv.org/abs/2511.03457", "authors": ["Vishal Jadoliya", "Mayukh Pahari", "Sudip Bhattacharyya", "Shaswat Suresh Nair"], "title": "Measuring accretion disc properties in the transitional millisecond pulsar PSR J1023+0038 using XMM-Newton, NuSTAR, NICER and Chandra", "comment": "18 pages, 3 tables, 12 figures, Accepted for publication in the\n  Journal of High Energy Astrophysics", "summary": "Whether the accretion disc in the X-ray high-mode of transitional millisecond\npulsars (tMSP) reaches near the neutron star surface by penetrating the\nmagnetosphere is a crucial question with many implications, including for\ncontinuous gravitational wave emission from the pulsar. We attempt to answer\nthis question for the tMSP PSR J1023+0038 by segregating high-mode data and\nperforming detailed spectral analysis using the XMM-Newton EPIC-PN+MOS1+MOS2\njoint observations, XMM-Newton+NuSTAR joint observations, NICER and Chandra\nindividual observations during different epochs. With the sum of longest\nexposures ($\\sim$202 ksec of high mode data from $\\sim$364 ksec of total\nexposure), we performed a self-consistent spectral analysis and constrain the\ninner disc radius 16.8 $\\pm$ 3.8 km with at least 3$\\sigma$ significance. Such\na measurement is found consistent with best-fit spectral values of inner disc\nradius from other observatory like NICER and a joint observations with\nXMM-Newton and NuSTAR within 3$\\sigma$ limits. We also detect a Fe emission\nline at 6.45 keV, for the first time from a tMSP, in the Chandra spectrum with\n99% significance with an upper limit of the inner disc radius of 21 R$_g$,\nsupporting independently the fact that inner disc extends into neutron stars's\nmagnetosphere during high mode. All results from our analysis imply that the\naccretion disc is significantly present and extended within the corotation\nradius of the neutron star in PSR J1023+0038 during the X-ray high-mode of the\ntMSP PSR J1023+0038. The measured range of inner disc radius is fully\nconsistent with an independent analysis by Bhattacharyya (2020), which suggests\ncontinuous gravitational wave emission from this neutron star, and the standard\nmodel of X-ray pulsations in accreting MSPs."}
{"id": "2511.03470", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.03470", "abs": "https://arxiv.org/abs/2511.03470", "authors": ["F. Nakanishi", "K. Abe", "S. Abe", "C. Bronner", "M. Harada", "Y. Hayato", "K. Hiraide", "K. Hosokawa", "T. H. Hung", "K. Ieki", "M. Ikeda", "J. Kameda", "Y. Kanemura", "Y. Kataoka", "S. Miki", "S. Mine", "M. Miura", "S. Moriyama", "M. Nakahata", "S. Nakayama", "Y. Noguchi", "G. Pronost", "K. Sato", "H. Sekiya", "K. Shimizu", "M. Shiozawa", "Y. Suzuki", "A. Takeda", "Y. Takemoto", "H. Tanaka", "T. Yano", "Y. Itow", "T. Kajita", "K. Okumura", "T. Tashiro", "T. Tomiya", "X. Wang", "P. Fernandez", "L. Labarga", "B. Zaldivar", "B. W. Pointon", "C. Yanagisawa", "E. Kearns", "L. Wan", "T. Wester", "J. Bian", "B. Cortez", "N. J. Griskevich", "Y. Jiang", "M. B. Smy", "H. W. Sobel", "V. Takhistov", "A. Yankelevich", "J. Hill", "M. C. Jang", "S. H. Lee", "D. H. Moon", "R. G. Park", "B. S. Yang", "B. Bodur", "K. Scholberg", "C. W. Walter", "A. Beauchêne", "Le Blévec", "O. Drapier", "A. Ershova", "M. Ferey", "Th. A. Mueller", "A. D. Santos", "P. Paganini", "C. Quach", "R. Rogly", "T. Nakamura", "J. S. Jang", "R. P. Litchfield", "L. N. Machado", "F. J. . P Soler", "J. G. Learned", "K. Choi", "S. Cao", "L. H. V. Anthony", "N. W. Prouse", "M. Scott", "Y. Uchida", "V. Berardi", "N. F. Calabria", "M. G. Catanesi", "N. Ospina", "E. Radicioni", "A. Langella", "G. De Rosa", "G. Collazuol", "M. Feltre", "M. Mattiazzi", "L. Ludovici", "M. Gonin", "L. L. Périssé", "B. Quilain", "S. Horiuchi", "A. Kawabata", "M. Kobayashi", "Y. M. Liu", "Y. Maekawa", "Y. Nishimura", "R. Akutsu", "M. Friend", "T. Hasegawa", "Y. Hino", "T. Ishida", "T. Kobayashi", "M. Jakkapu", "T. Matsubara", "T. Nakadaira", "Y. Oyama", "A. Portocarrero Yrey", "K. Sakashita", "T. Sekiguchi", "T. Tsukamoto", "N. Bhuiyan", "G. T. Burton", "F. Di Lodovico", "J. Gao", "T. Katori", "R. Kralik", "N. Latham", "R. M. Ramsden", "H. Ito", "T. Sone", "A. T. Suzuki", "Y. Takeuchi", "S. Wada", "H. Zhong", "J. Feng", "L. Feng", "S. Han", "J. Hikida", "J. R. Hu", "Z. Hu", "M. Kawaue", "T. Kikawa", "T. V. Ngoc", "T. Nakaya", "R. A. Wendell", "S. J. Jenkins", "N. McCauley", "A. Tarrant", "M. Fan`ı", "M. J. Wilking", "Z. Xie", "Y. Fukuda", "H. Menjo", "Y. Yoshioka", "J. Lagoda", "M. Mandal", "Y. S. Prabhu", "J. Zalipska", "M. Mori", "J. Jiang", "K. Hamaguchi", "H. Ishino", "Y. Koshio", "T. Tada", "T. Ishizuka", "G. Barr", "D. Barrow", "L. Cook", "S. Samani", "D. Wark", "A. Holin", "F. Nova", "S. Jung", "J. Yoo", "J. E. P. Fannon", "L. Kneale", "M. Malek", "J. M. McElwee", "T. Peacock", "P. Stowell", "M. D. Thiesse", "L. F. Thompson", "H. Okazawa", "S. M. Lakshmi", "E. Kwon", "M. W. Lee", "J. W. Seo", "I. Yu", "Y. Ashida", "A. K. Ichikawa", "K. D. Nakamura", "S. Goto", "H. Hayasaki", "S. Kodama", "Y. Kong", "Y. Masaki", "Y. Mizuno", "T. Muro", "K. Nakagiri", "Y. Nakajima", "N. Taniuchi", "M. Yokoyama", "P. de Perio", "S. Fujita", "C. Jesús-Valls", "K. Martens", "Ll. Marti", "K. M. Tsui", "M. R. Vagins", "J. Xia", "M. Kuze", "S. Izumiyama", "R. Matsumoto", "R. Asaka", "M. Ishitsuka", "M. Sugo", "M. Wako", "K. Yamauchi", "Y. Nakano", "F. Cormier", "R. Gaur", "M. Hartz", "A. Konaka", "X. Li", "B. R. Smithers", "S. Chen", "Y. Wu", "B. D. Xu", "A. Q. Zhang", "B. Zhang", "H. Adhikary", "M. Girgus", "P. Govindaraj", "M. Posiadala-Zezula", "Y. S. Prabhu", "S. B. Boyd", "R. Edwards", "D. Hadley", "M. Nicholson", "M. O'Flaherty", "B. Richards", "A. Ali", "B. Jamieson", "C. Bronner", "D. Horiguchi", "A. Minamino", "Y. Sasaki", "R. Shibayama", "R. Shimamura"], "title": "First Associated Neutrino Search for a Failed Supernova Candidate with Super-Kamiokande", "comment": "11 pages, 4 figures, and 1 table", "summary": "In 2024, a failed supernova candidate, M31-2014-DS1, was reported in the\nAndromeda galaxy (M31), located at a distance of approximately 770 kpc. In this\npaper, we search for neutrinos from this failed supernova using data from\nSuper-Kamiokande (SK). Based on the estimated time of black hole formation\ninferred from optical and infrared observations, we define a search window for\nneutrino events in the SK data. Using this window, we develop a dedicated\nanalysis method for failed supernovae and apply it to M31-2014-DS1, by\nconducting a cluster search using the timing and energy information of\ncandidate events. No significant neutrino excess is observed within the search\nregion. Consequently, we place an upper limit on the electron antineutrino\nluminosity from M31-2014-DS1 and discuss its implications for various failed SN\nmodels and their neutrino emission characteristics. Despite the 18 MeV\nthreshold adopted to suppress backgrounds, the search remains sufficiently\nsensitive to constrain the Shen-TM1 EOS, yielding a 90% confidence level upper\nlimit of 1.76 \\times 10^{53} erg on the electron antineutrino luminosity,\nslightly above the expected value of 1.35 \\times 10^{53} erg."}
{"id": "2511.03539", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.03539", "abs": "https://arxiv.org/abs/2511.03539", "authors": ["Julia Ahlvind", "Josefin Larsson", "Dennis Alp"], "title": "X-Ray Observations of Old Nearby Supernovae: Constraints on Compact Object Populations and Late Interaction", "comment": "34 pages, 13 Figures, 7 Tables. Accepted for publication in ApJ", "summary": "The properties of the population of compact objects created in core-collapse\nsupernovae (SNe) are uncertain. X-ray observations years to decades after the\nexplosions offer a way to gain insight into this, as hard X-ray emission from\nthe central regions will emerge as the ejecta absorption decreases. Here we\nanalyze and place upper limits on late-time X-ray emission in 242 nearby SNe,\nusing 607 observations from Chandra, XMM-Newton, Swift, and NuSTAR. We use\nabsorption models based on 3D simulations of neutrino-driven explosions to\naccount for absorption of emission from the compact objects by the asymmetric\nejecta. We detect X-ray emission from 12 SNe, including four for the first time\n(SN 1982R, SN 1984J, SN 1992bu, and SN 2003gk), and several of the others at\nlater epochs than before. The X-ray spectra of these SNe are consistent with\ninteraction with the circumstellar medium (CSM), with the possible exception of\nSN 1979C, which shows an additional hard component, as also noted in previous\nstudies at earlier epochs. This emission may be due to a pulsar wind nebula.\nUsing the upper limits in the full sample, we also perform a population\nsynthesis to constrain the fraction of SNe that produce pulsars and the\nproperties of the pulsars themselves. We find that pulsar populations with mean\ninitial spin periods $\\gtrsim100\\rm~ ms$ are favored. Finally, we note that the\nhigh luminosities of several of the SNe with CSM interaction imply interactions\nwith dense shells."}
{"id": "2511.03575", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.03575", "abs": "https://arxiv.org/abs/2511.03575", "authors": ["P. P. Biswas", "A. Różańska", "F. H. Vincent", "D. Lančová", "P. T. Zycki"], "title": "Broad Iron Line as a Relativistic Reflection from Warm Corona in AGN", "comment": "18 pages, 19 figures, 3 tables. After first round of revision in A&A", "summary": "We present that the broad feature usually observed in X-ray spectra can be\nexplained by a ray-traced emission from a two-slab system containing a\ndissipative, warm corona on top of an accretion disk in an AGN. Such an\naccretion flow is externally illuminated by X-ray radiation from a lamp located\nabove a central SMBH. Thermal lines from highly ionized iron ions (FeXXV and\nFeXXVI), caused by both internal heating and reflection from the warm corona,\ncan be integrated into an observed broad line profile due to the close vicinity\nof the SMBH. We investigate the dependence of the broad line profile by varying\nthe SMBH spin parameter, viewing angle, lamp height, and dissipation factor.\nOur results introduce a new method to probe properties of the warm corona using\nhigh-resolution spectroscopic measurements. We use the photoionization code\nTITAN to compute local ion populations and emission line profiles, and the\nray-tracing code GYOTO to include relativistic effects on the outgoing X-ray\nspectrum. In our models, the temperature of the inner atmosphere covering the\ndisk can reach values of 10^7 - 10^8 K due to internal warm corona dissipation\nand external illumination, which is adequate for generating the highly ionized\niron lines. These lines can undergo significant gravitational redshift near the\nblack hole, leading to a prominent spectral feature centered around 6.4 keV.\nFor all computed models, the relativistic corrections shift highly ionized iron\nlines to the X-ray region, usually attributed to fluorescent emission from the\nilluminated skin of an accretion disk. Hence, in the case of a warm corona\ncovering the inner disk regions, the resulting theoretical line profile under\nstrong gravity is a sum of different iron line transitions, and those\noriginating from highly ionized iron contribute the most to the observed total\nline profile in AGN."}
{"id": "2511.03714", "categories": ["astro-ph.HE", "hep-ph", "hep-th", "nucl-ex", "nucl-th"], "pdf": "https://arxiv.org/pdf/2511.03714", "abs": "https://arxiv.org/abs/2511.03714", "authors": ["Bao-Jun Cai", "Bao-An Li", "Yu-Gang Ma"], "title": "The Trace Anomaly at Neutron Star Centers: Minimum or Not?", "comment": "13 pages with 8 figures", "summary": "While the equation of state (EOS) $P(\\varepsilon)$ of neutron star (NS)\nmatter has been extensively studied, the EOS-parameter $\\phi = P/\\varepsilon$\nor equivalently the dimensionless trace anomaly $\\Delta = 1/3 - \\phi$, which\nquantifies the balance between pressure $P$ and energy density $\\varepsilon$,\nremains far less explored, especially in NS cores. Its bounds and density\nprofile carry crucial information about the nature of superdense matter.\nPhysically, the EOS-parameter $\\phi$ represents the mean stiffness of matter\naccumulated from the stellar surface up to a given density. Based on the\nintrinsic structure of the Tolman--Oppenheimer--Volkoff equations, we show that\n$\\phi$ decreases monotonically outward from the NS center, independent of any\nspecific input NS EOS model. Furthermore, observational evidence of a peak in\nthe speed-of-sound squared (SSS) density-profile near the center effectively\nrules out a valley and a subsequent peak in the radial profile of $\\phi$ at\nsimilar densities, reinforcing its monotonic decrease. These model-independent\nrelations impose strong constraints on the near-center behavior of the\nEOS-parameter $\\phi$, particularly demonstrating that the mean stiffness (or\nequivalently $\\Delta$) reaches a local maximum (minimum) at the center."}
{"id": "2510.07215", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2510.07215", "abs": "https://arxiv.org/abs/2510.07215", "authors": ["Maojie Xu", "Argyro Sasli", "Alexandra Junell", "Felipe Fontinele Nunes", "Yu-Jing Qin", "Christoffer Fremling", "Sam Rose", "Theophile Jegou Du Laz", "Benny Border", "Antoine Le Calloch", "Sushant Sharma Chaudhary", "Hailey Markoff", "Avyukt Raghuvanshi", "Nabeel Rehemtulla", "Jesper Sollerman", "Yashvi Sharma", "Niharika Sravan", "Judy Adler", "Tracy X. Chen", "Richard Dekany", "Reed Riddle", "Mansi M. Kasliwal", "Matthew J. Graham", "Michael W. Coughlin"], "title": "AppleCiDEr II: SpectraNet -- A Deep Learning Network for Spectroscopic Data", "comment": "14 pages,9 figures", "summary": "Time-domain surveys such as the Zwicky Transient Facility (ZTF) have opened a\nnew frontier in the discovery and characterization of transients. While\nphotometric light curves provide broad temporal coverage, spectroscopic\nobservations remain crucial for physical interpretation and source\nclassification. However, existing spectral analysis methods -- often reliant on\ntemplate fitting or parametric models -- are limited in their ability to\ncapture the complex and evolving spectra characteristic of such sources, which\nare sometimes only available at low resolution. In this work, we introduce\nSpectraNet, a deep convolutional neural network designed to learn robust\nrepresentations of optical spectra from transients. Our model combines\nmulti-scale convolution kernels and multi-scale pooling to extract features\nfrom preprocessed spectra in a hierarchical and interpretable manner. We train\nand validate SpectraNet on low-resolution time-series spectra obtained from the\nSpectral Energy Distribution Machine (SEDM) and other instruments,\ndemonstrating state-of-the-art performance in classification. Furthermore, in\nredshift prediction tasks, SpectraNet achieves a root mean squared relative\nredshift error of 0.02, highlighting its effectiveness in precise regression\ntasks as well."}
{"id": "2511.02917", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.02917", "abs": "https://arxiv.org/abs/2511.02917", "authors": ["Norbert Schartel", "Maria Santos-Lleo"], "title": "Unveiling the Cosmos: XMM-Newton's Scientific Strategy", "comment": "29 pages, 15 Figures, accepted for publication in Astronomical Notes", "summary": "In December 2024, the European Space Agency's (ESA) XMM-Newton X-ray\nObservatory celebrated the 25th anniversary of its launch. The annual number of\npeer-reviewed articles utilising XMM-Newton data has exhibited a consistent\nupward trajectory over the past two and a half decades, attaining more than 400\nin 2022. The annual call for observing time proposals continues to experience a\nhigh level of oversubscription, typically ranging from a factor of 6 to 7. In\norder to enhance the scientific discovery space, XMM-Newton, primarily through\nthe Project Scientist and Science Operations Centre, has pursued a strategy of\nexpansion, which can be grouped into three phases: Large Projects with long\nobserving time (2006-2009), Joint Observations (2011-2016), and Targets of\nOpportunity (2016-2024), respectively. A salient feature of XMM-Newton's time\nallocation is the systematic removal of biases from the second call onwards, a\nstrategy that has enabled the attainment of comparable gender success rates and\nhigh acceptance rates for young scientists over 25 years, a feat only recently\naccomplished by similar missions through the introduction of double-anonymous\nreview. XMM-Newton research is conducted by an active community of 4,300\nscientists, of which approximately 570 are leading (1st author). The foundation\nof this community and its research is predicated on XMM-Newton data, with the\nproject's policy of user support and calibration being fundamental\nconstituents, as well as the project's active engagement and communication with\nits members."}
{"id": "2511.03604", "categories": ["astro-ph.IM", "astro-ph.HE", "gr-qc"], "pdf": "https://arxiv.org/pdf/2511.03604", "abs": "https://arxiv.org/abs/2511.03604", "authors": ["Riccardo Buscicchio", "Federico Pozzoli", "Daniele Chirico", "Alberto Sesana"], "title": "The first year of LISA Galactic foreground", "comment": "16 pages, 13 figures", "summary": "Galactic white-dwarf binaries play a central role in the inference model for\nthe Laser Interferometer Space Antenna. In this manuscript, we employ the\n$\\texttt{bahamas}$ codebase to characterize, in a global-fit fashion, the\nreconstruction of the Galactic foreground during the first year of observation.\nTo account for its statistical properties, we represent the data in\ntime--frequency domain, and characterize the effectiveness of multiple\napproaches, e.g. statistically viable likelihoods, sampling schemes,\nsegmentation widths, and gaps density. Our analysis yields consistent results\nacross, with overwhelming evidence in favor of a non-stationary model in less\nthan a month of data. Moreover, we show robustness against the presence of\nadditional extragalactic foregrounds, and test the suitability of our\napproximations on the more complex simulated data in the $\\textit{Yorsh}$ data\nchallenge."}
{"id": "2511.03667", "categories": ["astro-ph.IM", "astro-ph.CO", "astro-ph.HE", "stat.ML"], "pdf": "https://arxiv.org/pdf/2511.03667", "abs": "https://arxiv.org/abs/2511.03667", "authors": ["Luigi D'amico", "Eleonora Villa", "Fatima Modica Bittordo", "Aldo Barca", "Francesco Alì", "Massimo Meneghetti", "Luca Naso"], "title": "Addressing prior dependence in hierarchical Bayesian modeling for PTA data analysis I: Methodology and implementation", "comment": "15 pages, 7 figures. Under review for Proceedings of International\n  Summer Conference 2025: Intelligent Systems & Decision Making: Human Insights\n  in the Era of A.I - Lecture Notes in Computer Science, Springer Nature", "summary": "Complex inference tasks, such as those encountered in Pulsar Timing Array\n(PTA) data analysis, rely on Bayesian frameworks. The high-dimensional\nparameter space and the strong interdependencies among astrophysical, pulsar\nnoise, and nuisance parameters introduce significant challenges for efficient\nlearning and robust inference. These challenges are emblematic of broader\nissues in decision science, where model over-parameterization and prior\nsensitivity can compromise both computational tractability and the reliability\nof the results. We address these issues in the framework of hierarchical\nBayesian modeling by introducing a reparameterization strategy. Our approach\nemploys Normalizing Flows (NFs) to decorrelate the parameters governing\nhierarchical priors from those of astrophysical interest. The use of NF-based\nmappings provides both the flexibility to realize the reparametrization and the\ntractability to preserve proper probability densities. We further adopt\ni-nessai, a flow-guided nested sampler, to accelerate exploration of complex\nposteriors. This unified use of NFs improves statistical robustness and\ncomputational efficiency, providing a principled methodology for addressing\nhierarchical Bayesian inference in PTA analysis."}
