{"id": "2511.20682", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.20682", "abs": "https://arxiv.org/abs/2511.20682", "authors": ["Ioannis Contopoulos", "Jerome Petri", "Ioannis Dimitropoulos"], "title": "High-energy radiation from the pulsar Equatorial Current Sheet", "comment": "8 pages, 4 figures, submitted to Astronomy and Astrophysics", "summary": "Pulsars emit beams of radiation that reveal the extreme physics of neutron star magnetospheres. Yet, their understanding remains incomplete. Recent global Particle-in-Cell (PIC) simulations have raised several questions that led us to question their validity and their extrapolation to realistic particle Lorentz factors, electric and magnetic fields. We want to generate realistic sky maps of high-energy radiation from first principles. We propose a novel method to study the Equatorial Current Sheet (ECS) where most of the particle acceleration and the high-energy radiation is expected to originate. We first determine its shape and external magnetic field with a steady-state ideal force-free solution. Then, we consider the extra electric and magnetic field components that develop when dissipation is considered. Finally, we study the particle acceleration and radiation that is due to these extra field components for realistic field and particle parameters. We generate realistic sky maps of high-energy radiation and compare them with those obtained via PIC simulations. These sky maps may also be closely reproduced using the ECS of the split-monopole solution beyond the light cylinder. The ECS is probably stabilized by the normal magnetic field component that is due to the global magnetospheric reconnection. Our method helps us better understand the origin of the pulsed high-energy radiation in the pulsar magnetosphere."}
{"id": "2511.20755", "categories": ["astro-ph.HE", "astro-ph.CO", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2511.20755", "abs": "https://arxiv.org/abs/2511.20755", "authors": ["E. Gatuzz", "J. ZuHone", "J. S. Sanders", "A. Fabian", "A. Liu", "C. Pinto", "S. Walker"], "title": "From Observations to Simulations: A Neural-Network Approach to Intracluster Medium Kinematics", "comment": "9 pages, 5 figures, submitted to A&A", "summary": "We present a systematic comparison between {\\it XMM-Newton} velocity maps of the Virgo, Centaurus, Ophiuchus and A3266 clusters and synthetic velocity maps generated from the Illustris TNG-300 simulations. Our goal is to constrain the physical conditions and dynamical states of the intracluster medium (ICM) through a data-driven approach. We employ a Siamese Convolutional Neural Network (CNN) designed to identify the most analogous simulated cluster to each observed system based on the morphology of their line-of-sight velocity maps. The model learns a high-dimensional similarity metric between observations and simulations, allowing us to capture subtle kinematic and structural patterns beyond traditional statistical tests. We find that the best-matching simulated halos reproduce the observed large-scale velocity gradients and local kinematic substructures, suggesting that the ICM motions in these clusters arise from a combination of gas sloshing, AGN feedback, and minor merger activity. Our results demonstrate that deep learning provides a powerful and objective framework for connecting X-ray observations to cosmological simulations, offering new insights into the dynamical evolution of galaxy clusters and the mechanisms driving turbulence and bulk flows in the hot ICM."}
{"id": "2511.20756", "categories": ["astro-ph.HE", "gr-qc"], "pdf": "https://arxiv.org/pdf/2511.20756", "abs": "https://arxiv.org/abs/2511.20756", "authors": ["Hina Suzuki", "Yosuke Mizuno", "Akhil Uniyal", "Indu Kalpa Dihingia", "Tintin Nguyen", "Chi-kwan Chan"], "title": "High-Order Photon Rings around Kerr Naked Singularities", "comment": "9 pages, 3 figures, comments welcomed", "summary": "We present a detailed study of higher-order photon rings of an accreting Kerr naked singularity (KNS) with dimensionless spin parameter $a=1.01$; i.e., a horizonless, overly spinning compact object. Motivated by horizon-scale very-long-baseline interferometry (VLBI) including Event Horizon Telescope (EHT) and future missions such as the Black Hole Explorer (BHEX), we analyze image morphology and interferometric visibilities to identify observational signatures that differentiate KNS from Kerr black holes. We find that higher-order photon rings are tightly concentrated within the nominal ``shadow'' region and that the shadow develops a pronounced gap at sufficiently large observer inclination. These morphological differences produce measurable deviations in the complex visibilities relative to Kerr black hole predictions. Our results indicate that photon-ring structure and visibility-domain diagnostics at horizon-resolving baselines can provide a direct observational test of the presence (or absence) of an event horizon and thus offer a concrete avenue to test general relativity with future horizon-scale observations."}
{"id": "2511.20767", "categories": ["astro-ph.HE", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2511.20767", "abs": "https://arxiv.org/abs/2511.20767", "authors": ["Tianshu Wang", "Adam Burrows"], "title": "The Effect of the Fast-Flavor Instability on Core-Collapse Supernova Models: II. Quasi-Equipartition and the Impact of Various Angular Reconstruction Methods", "comment": "19 pages, 13 figures. Submitted to ApJ", "summary": "In this work, we explore in a consistent fashion the effects of fast flavor conversion (FFC) in 1D and 2D core-collapse supernova (CCSN) simulations. In addition, we investigate the impact of various angular reconstruction methods and compare the ``3-species'' and ``4-species'' neutrino transport schemes. We find that the FFC effects are insensitive to the different methods tested and that the FFC alters supernova hydrodynamics is only minor ways. We also present a ``quasi-equipartition'' approximation which can be used to estimate the FFC-altered neutrino properties by post-processing the neutrino signals extracted from no-oscillation CCSN simulations. The relative errors in neutrino number and energy luminosities of this phenomenological method are less than 2\\% for 1D models, and less than 10\\% for 2D models. This method provides a simple way to include the effects of FFC on neutrino signals without implementing a complex and expensive FFC scheme or redoing simulations."}
{"id": "2511.20735", "categories": ["astro-ph.IM", "astro-ph.GA", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2511.20735", "abs": "https://arxiv.org/abs/2511.20735", "authors": ["Amedeo Romagnolo"], "title": "StarEstate: A Python Package for Galactic Population Synthesis", "comment": "Code available at github.com/AmedeoRom/StarEstate Submitted to Journal of Open Source Software", "summary": "I present StarEstate, an open-source Python package for producing rapid, statistically robust galactic population synthesis models. By utilizing optimized pre-calculated inverse-cumulative distribution function samplers, the tool generates synthetic populations from pre-generated grids of stellar tracks orders of magnitude faster than traditional numerical integration methods. A key morphological feature is the probabilistic assignment of stars to spiral arms based on age-dependent dynamical temperature, reproducing the observation that young tracers tightly confine to arms while older populations disperse. The software combines statistical generation with stellar physics by mapping synthetic populations to MESA or rapid SSE/BSE evolutionary tracks. Users can inspect specific evolutionary stages through automatic hierarchical classification, distinguishing evolutionary phases and spectral classes like Wolf-Rayet, O-type, or red supergiant stars across different metallicity environments. StarEstate's features allow the user to predict spatial distributions of diverse stellar objects, providing a flexible resource for interpreting galactic surveys."}
{"id": "2511.20847", "categories": ["astro-ph.HE", "hep-ph"], "pdf": "https://arxiv.org/pdf/2511.20847", "abs": "https://arxiv.org/abs/2511.20847", "authors": ["Joseph O'Leary", "Andrew Melatos", "Tom Kimpson", "Dimitris M. Christodoulou", "Nicholas J. O'Neill", "Patrick M. Meyers", "Sayantan Bhattacharya", "Silas G. T. Laycock"], "title": "Is there a retrograde accretion disk around 4U 1626$-$67? Tracking torque reversals with a state-space model", "comment": "31 pages, 7 figures. Accepted for publication in The Astrophysical Journal", "summary": "X-ray timing studies of the persistent, Galactic, accretion-powered pulsar 4U 1626$-$67 reveal torque reversals, during which the pulse frequency $ν(t)$ alternates between multiyear episodes of secular acceleration and deceleration, separated by transitions lasting $\\lesssim 150 \\, \\rm{days}$. Here an unscented Kalman filter is applied to track the $ν(t)$ fluctuations observed in 22.7 years (3340 samples) of publicly available Compton Gamma-Ray Observatory and Fermi Gamma-Ray Space Telescope data to test the canonical picture of magnetocentrifugal accretion for consistency with prograde-prograde and retrograde-prograde accretion disk configurations on either side of the 2008 torque reversal. It is found that the retrograde-prograde model is preferred, with a log Bayes factor equal to 0.44 and maximum a posteriori log likelihood ratio equal to 2.5. The mass accretion rate $Q(t)$ and magnetocentrifugal fastness $ω(t)$ transition smoothly between episodes of deceleration and acceleration; $Q(t)$ shifts by $\\leq 0.34 \\, {\\rm dex}$ across the reversal, and one measures $ω(t) \\approx 0.25$ and $ω(t) \\approx 0.30$ during deceleration and acceleration, respectively. The angular acceleration $\\dotΩ(t)$ satisfies $-9 \\lesssim \\dotΩ(t)/(10^{-12} \\, \\rm{rad \\, s^{-2}}) \\lesssim -5$ and $2 \\lesssim \\dotΩ(t)/(10^{-12} \\, \\rm{rad \\, s^{-2}}) \\lesssim 9$ before and after the 2008 reversal, respectively, compared to $\\dotΩ \\approx -3.0 \\times 10^{-12} \\, \\rm{rad \\, s^{-2}}$ before reversal and $\\dotΩ \\approx 2.5 \\times 10^{-12} \\, \\rm{rad \\, s^{-2}}$ after reversal, as inferred from previous long-term X-ray timing and spectral analysis of 4U 1626$-$67."}
{"id": "2511.20763", "categories": ["astro-ph.IM", "eess.SP"], "pdf": "https://arxiv.org/pdf/2511.20763", "abs": "https://arxiv.org/abs/2511.20763", "authors": ["Chi-kwan Chan", "Hina Suzuki", "David Forbes", "Andrew Thomas West", "Arash Roshanineshat", "Daniel P. Marrone", "Amy Lowitz"], "title": "A Direct Calibration Algorithm for ADC Interleaving", "comment": "9 pages, 3 figures, comments welcomed", "summary": "We introduce a novel direct calibration algorithm to address phase delay, gain, and offset mismatches in Analog-to-Digital Converter (ADC) time interleaving systems. These mismatches, common in high-speed data acquisition, degrade system performance and signal integrity, particularly in applications such as radio astronomy and very long baseline interferometry (VLBI). Our proposed algorithm uses a sinusoidal reference signal and Fourier analysis to isolate and correct each type of mismatch, providing a computationally efficient solution. Extensive numerical simulations validate the algorithm's effectiveness and demonstrate its ability to significantly enhance signal reconstruction accuracy compared to existing methods. This work provides a robust and scalable solution for maintaining signal fidelity in interleaved ADC systems and has broad applications in fields that require high-speed data acquisition."}
{"id": "2511.20945", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2511.20945", "abs": "https://arxiv.org/abs/2511.20945", "authors": ["Steven Chen", "Jeremy Hare", "Oleg Kargaltsev", "Hui Yang", "Denis Cioffi", "Maximilian Häberle", "Anil Seth"], "title": "The Intermediate Mass Black Hole in Omega Centauri: Constraints on Accretion from JWST", "comment": "Submitted to ApJ", "summary": "We analyze JWST observations of the central region of the globular cluster $ω$ Centauri (NGC 5139, $ω$ Cen hereafter), around the position of the candidate IMBH inferred by Haberle et al. (2024a) from the motion of fast-moving stars in multi-epoch HST observations. We performed PSF-fitting photometry for sources in NIRCam (F200W and F444W) and MIRI (F770W and F1500W) and constructed UV to IR SEDs for sources within the central region of the cluster by using HST photometry from oMEGACat (Haberle et al. 2024b). None of the SEDs of reliably measured sources within this region resembles the SEDs computed from models of Pesce et al. 2021 for IMBHs accreting from intracluster medium at low rates. Our JWST limits place constraints on combinations of IMBH mass and accretion efficiency, either due to the amount of material available to be accreted, or due to the fraction of accreting matter that actually falls into the IMBH. Our non-detection then does not contradict the mass range of the IMBH inferred from the fast moving stars. We discuss these constraints in the context of the model of Pesce et al. 2021. We find that JWST limits are more restrictive than the existing radio limits for IMBH masses $\\lesssim 20,000 M_{\\odot}$. It is also possible that the faint IMBH emission is dominated by the light of a nearby star. Tighter limits on accretion onto the candidate IMBH can be placed with deeper observations, a more precise localization of the IMBH, and better measurements of the local intracluster medium density and temperature at the center of the cluster."}
{"id": "2511.20764", "categories": ["astro-ph.IM", "astro-ph.EP"], "pdf": "https://arxiv.org/pdf/2511.20764", "abs": "https://arxiv.org/abs/2511.20764", "authors": ["Nicolas Leo Kaufmann", "Thomas Pfeil", "Sebastian Stammler", "Anna Penzlin", "Sandro Christian Paetzold", "Til Birnstiel"], "title": "TriPoDPy: 1D Tri-Population size distributions forDust evolution in protoplanetary disks", "comment": "Submitted to the Journal of Open Source Software (JOSS). Documentation: https://tripodpy.readthedocs.io/en/latest/ Repository: https://github.com/tripod-code/tripodpy", "summary": "TriPoDPy is a code simulating the dust evolution, including dust growth and dynamics in protoplanetary disks using the parametric dust model presented in (Pfeil et al., 2024). The simulation evolves a dust distribution in a one-dimensional grid in the radial direction. It's written in Python and the core routines are implemented in Fortran90. The code not only solves for the evolution of the dust but also the gas disk with the canonical alpha-description (Shakura & Sunyaev, 1973). In addition to the original model, we added descriptions of tracers for the dust and gas, which could be used for compositional tracking of additional components."}
{"id": "2511.20970", "categories": ["astro-ph.HE", "astro-ph.SR", "gr-qc"], "pdf": "https://arxiv.org/pdf/2511.20970", "abs": "https://arxiv.org/abs/2511.20970", "authors": ["Shenghua Yu", "Youjun Lu", "C. Simon Jeffery", "Zhanwen Han", "DongDong Liu", "Jie Yang", "Xilong Fan", "Bo Peng", "Jianbin Li"], "title": "The diverse morphology of gravitational wave signals from merging neutron-star white-dwarf binaries", "comment": "13 pages, 7 figures, accepted for publication in MNRAS", "summary": "In sufficiently compact neutron star-white dwarf (NSWD) binary systems, orbital decay means the white dwarf eventually fills its shrinking Roche lobe, initiating a phase of mass transfer. The exchange of angular momentum-both internal and external-plays a critical role in determining the binary's evolutionary outcome. For neutron stars with relatively low magnetic fields and spin frequencies, whether the orbital separation continues to shrink depends on the interplay between gravitational wave (GW) radiation and mass transfer dynamics. We compute the orbital evolution of NSWD binaries across a broad parameter space, incorporating four key variables. Our results reveal distinct boundaries in the NS-WD mass-mass diagram: binaries with white dwarf masses above these thresholds undergo rapid orbital decay and direct coalescence. The dependence of these boundaries on system parameters indicates that Roche-lobe-filling NSWD binaries can follow multiple evolutionary pathways -- a phenomenon we refer to as branched or polymorphic evolution. NSWD binary systems emit strong and diverse GW signals, many of which would be detectable by space-based GW observatories. The morphology of the evolving GW waveform provides a direct diagnostic for the NSWD binary configuration, including any contribution from an accretion disk. Our models can provide critical waveform templates for identifying merging binary signals in real-time GW data."}
{"id": "2511.21184", "categories": ["astro-ph.IM", "astro-ph.EP", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2511.21184", "abs": "https://arxiv.org/abs/2511.21184", "authors": ["Thomas Hajnik", "Nicholas A. Walton", "Giuseppe D'Ago", "Piercarlo Bonifacio", "Gavin Dalton", "Lilian Dominguez-Palmero", "Emanuel Gafton", "Mike J. Irwin", "Sergio Pico", "David Terrett", "Anke Ardern-Arentsen", "Ruben Sanchez-Janssen", "David S. Aguado", "J. Alfonso L. Aguerri", "Carlos Allende Prieto", "Marc Balcells", "Chris Benn", "Angela Bragaglia", "Elisabetta Caffau", "Esperanza Carrasco", "Ricardo Carrera", "Silvano Desidera", "Boris T. Gansicke", "Sarah Hughes", "Shoko Jin", "Ian Lewis", "Alireza Molaeinezhad", "David N. A. Murphy", "Ellen Schallig", "Scott Trager", "Antonella Vallenari"], "title": "The WEAVE-TwiLight-Survey: Expanding WEAVE's Reach to Bright and Low-Surface-Density Targets with a Novel Observing Mode", "comment": null, "summary": "Current-day multi-object spectroscopic surveys are often limited in their ability to observe bright stars due to their low surface densities, resulting in increased observational overheads and reduced efficiency. Addressing this, we have developed a novel observing mode for WEAVE (William Herschel Telescope Enhanced Area Velocity Explorer) that enables efficient observations of low-surface-density target fields without incurring additional overheads from calibration exposures. As a pilot for the new mode, we introduce the WEAVE-TwiLight-Survey (WTLS), focusing on bright exoplanet-host stars and their immediate surroundings on the sky. High observational efficiency is achieved by superimposing multiple low-target-density fields and allocating the optical fibres in this configuration. We use a heuristic method to define fields relative to a central guide star, which serves as a reference for their superposition. Suitable guide fibres for each merged configuration are selected using a custom algorithm. Test observations have been carried out, demonstrating the feasibility of the new observing mode. We show that merged field configurations can be observed with WEAVE using the proposed method. The approach minimizes calibration times and opens twilight hours to WEAVE's operational schedule. WTLS is built upon the new observing mode and sourced from the ESA PLATO long-duration-phase fields. This survey will result in a homogeneous catalogue of approximately 6300 bright stars, including 62 known planet hosts, laying the groundwork for future elemental abundance studies tracing chemical patterns of planetary formation. This new observing mode (WEAVE-Tumble-Less) expands WEAVE's capabilities to rarely used on-sky time and low-density field configurations without sacrificing efficiency."}
{"id": "2511.21154", "categories": ["astro-ph.HE", "physics.plasm-ph"], "pdf": "https://arxiv.org/pdf/2511.21154", "abs": "https://arxiv.org/abs/2511.21154", "authors": ["Saikat Das", "Siddhartha Gupta", "Prateek Sharma"], "title": "Impact of Cosmic Ray Distribution on the Growth and Saturation of Bell Instability", "comment": "15 pages, 11 figures, 3 tables; To be submitted; Comments are welcome!", "summary": "Cosmic rays (CRs) streaming in weakly magnetized plasmas can drive large-amplitude magnetic fluctuations via nonresonant streaming instability (NRSI), or Bell instability. Using one-dimensional kinetic simulations, we investigate how mono-energetic and power-law CR momentum distributions influence the growth and saturation of NRSI. The linear growth is governed solely by the CR current and is largely insensitive to the CR distribution. However, the saturation depends strongly on the CR distribution and is achieved through CR isotropization, which quenches the driving current. Mono-energetic CRs effectively amplify the magnetic field and isotropize. For power-law distributions, the lowest-energy CRs dominate current relaxation and magnetic growth, while the highest-energy CRs remain weakly scattered, limiting their contribution to saturation. In the absence of low-energy CRs, high-energy particles amplify magnetic fields effectively and isotropize. We provide a modified saturation prescription accounting for these effects and propose a layered CR-confinement scenario upstream of astrophysical shocks, relevant to particle acceleration to high energies."}
{"id": "2511.21207", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2511.21207", "abs": "https://arxiv.org/abs/2511.21207", "authors": ["Sergey Mirzoyan"], "title": "Enhancing Galaxy Classification with U-Net Variational Autoencoders. II. JWST High Redshift Galaxy Sample", "comment": "9 pages, 2 figures, Research in Astronomy and Astrophysics in press", "summary": "Building on our previous work, we apply a U-Net Variational Autoencoder (VAE) framework to denoise galaxy images from the James Webb Space Telescope (JWST) and enhance morphological classification. This study focuses on galaxies observed up to redshift approximately at 8, capturing them at early evolutionary stages where their faintness and structural complexity pose challenges for the traditional classification methods. By mitigating observational noise, our approach enables the identification of morphological features, particularly in distinguishing between disk and non-disk galaxy types. We evaluate the denoising performance using standard image quality metrics and demonstrate that the enhanced images lead to improved classification accuracy across multiple deep learning models. Our analysis of a sample of 292 galaxies up to z=7.69 shows 83 galaxies classified as disk-like by the GCNN model with high confidence, of those approximately 70-80 % are of redshifts greater than 3. These findings suggest that disk-like structures can be prevalent in the early universe. The results highlight the potential of VAE-based denoising as a robust pre-processing step for analyzing high-redshift galaxy populations in ongoing astronomical surveys."}
{"id": "2511.21182", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.21182", "abs": "https://arxiv.org/abs/2511.21182", "authors": ["Avik Kumar Das", "Pankaj Kushwaha", "Veeresh Singh", "Goldy Ahuja", "Deekshya R. Sarkar"], "title": "Broad-band temporal and spectral study of TeV blazar TXS 0518+211", "comment": "20 pages, 8 figures, 4 tables. Submitted to ApJ", "summary": "We present a long-term broad-band temporal and spectral study of a TeV BL Lac source TXS 0518+211 by analyzing nearly 16 years (MJD 54682 -- 60670) of simultaneous optical, UV and X-ray light curves from Swift-XRT/UVOT and gamma-ray light curves from Fermi-LAT. Based on the availability of simultaneous multi-wavelength data and considering flux level as the depiction of AGN-jet activity we identified 11 epochs (named as Epoch-A to Epoch-K) and investigated temporal as well as spectral variability during these epochs to understand the emission properties in this source. The fractional variability analysis reveals that, in all epochs, X-ray light curve exhibits relatively high degree of variability in compared to the optical, UV and gamma-ray light curves. The flux-flux plots among different bands, in general, show weak to moderate correlation with Spearman correlation coefficient ranging from 0.29 to 0.58. Notably, during Epoch-I, we detect a possible orphan flare exhibiting increase in the X-ray flux level ($\\sim$ 2.4 times of the total average flux) but with no corresponding counterpart seen in the optical, UV bands. In contrast, during Epoch-K, we detect a significant decrease in the X-ray flux but no corresponding decrease in optical, UV and gamma-ray bands. Overall, our study reveals several changes in the flux states and complex nature of jet dominated emission processes. In all the epochs, two-zone leptonic model provides a better description of the broad-band emission in this TeV BL Lac source."}
{"id": "2511.21243", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2511.21243", "abs": "https://arxiv.org/abs/2511.21243", "authors": ["Mengqiu Huang", "Yongquan Xue", "Shuo Li", "Fukun Liu", "Shifu Zhu", "Jin-Hong Chen", "Rong-Feng Shen", "Yibo Wang", "Yi Yang", "Ning Jiang", "Franz Erik Bauer", "Cristian Vignali", "Fan Zou", "Jialai Wang", "Alexei V. Filippenko", "Bin Luo", "Chen Qin", "Jonathan Quirola-Vásquez", "Jun-Xian Wang", "Lulu Fan", "Mouyuan Sun", "Qingwen Wu", "Qingling Ni", "Thomas G. Brink", "Tinggui Wang", "Weikang Zheng", "Xinwen Shu", "Xuechen Zheng", "Xiaozhi Lin", "Xu Kong", "Yijun Wang", "Yibin Luo", "Zheyu Lin"], "title": "The Faintest, Extremely Variable X-ray Tidal Disruption Event from a Supermassive Black Hole Binary?", "comment": "31 pages, 6 figures, 1 table, accepted by The Innovation", "summary": "Tidal disruption events (TDEs), which occur when stars enter the tidal radii of supermassive black holes (SMBHs) and are subsequently torn apart by their tidal forces, represent intriguing phenomena that stimulate growing research interest and pose an increasing number of puzzles in the era of time-domain astronomy. Here we report an unusual X-ray transient, XID 935, discovered in the 7 Ms Chandra Deep Field-South, the deepest X-ray survey ever. XID 935 experienced an overall X-ray dimming by a factor of more than 40 between 1999 and 2016. Not monotonically decreasing during this period, its X-ray luminosity increased by a factor $> 27$ within 2 months, from $L_{\\rm 0.5-7\\ keV}<10^{40.87}$ erg s$^{-1}$ (10 October 2014 -- 4 January 2015) to $L_{\\rm 0.5-7\\ keV}=10^{42.31\\pm 0.20}$ erg s$^{-1}$ (16 March 2015). The X-ray position of XID 935 is located at the center of its host galaxy with a spectroscopic redshift of 0.251, whose optical spectra do not display emission characteristics associated with an active galactic nucleus. The peak 0.5--2.0 keV flux is the faintest among all the X-ray-selected TDE candidates to date. Thanks to a total exposure of $\\sim 9.5$ Ms in the X-ray bands, we manage to secure relatively well-sampled, 20-year-long X-ray light curves of this deepest X-ray-selected TDE candidate. We find that a partial TDE model could not explain the main declining trend. An SMBH binary TDE model is in acceptable accordance with the light curves of XID 935; however, it fails to match short-timescale fluctuations exactly. Therefore, the exceptional observational features of XID 935 provide a key benchmark for refining quantitative TDE models and simulations."}
{"id": "2511.21419", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.21419", "abs": "https://arxiv.org/abs/2511.21419", "authors": ["Wen-Yuan Yu", "Hou-Jun Lü", "Xiao Tian", "Liang-Jun Chen", "En-Wei Liang"], "title": "Probing the Nature of High-Redshift Long GRB 250114A and Its Magnetar Central Engine", "comment": "16 pages, 7 figures, and 3 tables. Accepted for publication in ApJ", "summary": "GRB 250114A is a long-duration gamma-ray burst (GRB) which triggered the Swift/BAT with a spectroscopic high-redshift at $z = 4.732$. The light curve of the prompt emission is composed of three distinct emission episodes, which are separated by quiescent gaps ranging from tens to hundreds of seconds. While the X-ray light curve exhibits the canonical X-ray emission which is composed of several power-law segments superposition of a giant X-ray flare. More interestingly, there is still significant X-ray emission during the quiescent time in the prompt emission, suggesting a continuously active central engine whose power fluctuates across the $γ$-ray detectability threshold. In this paper, we propose a magnetar as the central engine of GRB 250114A by fitting the X-ray light curve, and infer a magnetic field strength $B_{\\rm p}=13.24^{+1.73}_{-5.84} \\, \\times10^{15}\\ \\mathrm{G}$ and an initial spin period $P_{0}=14.31^{+0.93}_{-3.16} \\, \\mathrm{ms}$ of magnetar, with a jet correction, fall within a reasonable range. Furthermore, we also compare the prompt emission, X-ray afterglow, $E_{\\mathrm p}$-$E_{γ,\\mathrm{iso}}$, and $\\varepsilon-$distribution of GBR 250114A with those of other high-$z$ sample-GRBs, and find no significant statistical differences between them."}
{"id": "2511.21463", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.21463", "abs": "https://arxiv.org/abs/2511.21463", "authors": ["Mfuphi Ntshatsha", "Markus Böttcher", "Soebur Razzaque"], "title": "Compton-induced $γ$-ray Cascade Emissions in Radio Galaxy NGC 1275", "comment": "7 pages, 5 figures, 1 table, conference", "summary": "Among active galactic nuclei (AGNi), blazars are the brightest emitters of high-energy (HE, $E \\geq 100$ MeV) to very-high-energy (VHE, $E \\geq 100$ GeV) $γ$-rays from their jets. Radio galaxies, being the misaligned parent population of the blazar class, were historically not detected at these frequencies. However, advances in experiments and observatories have led to their detection in the HE--VHE $γ$-ray band. In this work, we leverage and refine a Monte-Carlo photon and electron-positron (e$^\\pm$) pair tracking code in the AGN environment of the radio galaxy NGC 1275. In the code, we consider the isotropic broad-line region (BLR) and anisotropic Shakura-Sunyaev (SS) accretion disk radiation fields, with mild magnetic fields in the AGN environment. We find that cascade $γ$-rays from inverse-Compton scattering by relativistic e$^\\pm$ pairs of these external radiation fields can explain the Fermi Large Area Telescope's (LAT) and Major Atmospheric Cherenkov Experiment's observations from the radio galaxy NGC 1275. We present a set of plausible parameters obtained from the code by fitting the source's spectral energy distribution (SED) during flaring events reported during the period December 2022 to January 2023."}
{"id": "2511.21501", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.21501", "abs": "https://arxiv.org/abs/2511.21501", "authors": ["D. L. Moutard", "L. R. Corrales", "R. Tomaru", "C. Done", "J. Neilsen", "E. Behar", "E. Costantini", "M. Díaz-Trigo", "S. Yamada"], "title": "The Feasibility of Using Fe XXIII Metastable Transitions as a Density Diagnostic for LMXB Disk Winds", "comment": "Accepted for Publication in ApJ", "summary": "Low mass X-ray binaries (LMXBs) occasionally show signs of outflowing material from the accretion disk. Studying these outflows can inform the understanding of the geometry of the systems, as well as the dynamics and energetics of accretion. One key variable for determining the location of these disk winds is the density of the outflowing material. In this paper we explore a density diagnostic based upon the absorption of ionizing photons by density-sensitive metastable states of Fe XXIII. This can yield a blue shifted complex of absorption features in the region of $6.61-6.64$ keV. We use the photoionization code {\\sc pion} to test how varying the ionizing spectrum affects the detectability and interpretation of these features. We base these ionizing spectral energy distributions on GX~13$+$1 to represent a bright thermally dominated spectrum; 4U 1735$-$44 representing a harder, fainter LMXB spectrum; and MAXI J1820$+$070 representing a black hole LMXB spectrum completely dominated by Comptonized emission. For each of these, we find that the regime where Fe XXIII can be used as a density diagnostic is with an ionization parameter $\\log{(ξ/{\\rm erg~cm~s^{-1}})}\\sim2-3$ and an outflow density $\\log{(n_H/{\\rm cm^{-3})}}\\gtrsim14$. The typical range of ionization parameters for LMXBs indicates that this technique is more feasibly achieved with BH LMXBs than their NS counterparts."}
{"id": "2511.21532", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2511.21532", "abs": "https://arxiv.org/abs/2511.21532", "authors": ["Francesco Carenini", "Matteo Cerruti"], "title": "Simulations of high-energy neutrino emissions from blazars with the LeHa-Paris code", "comment": "Presented at the 39th International Cosmic Ray Conference (ICRC2025)", "summary": "The identification of astrophysical sources responsible for high-energy cosmic neutrinos has long been a challenge. A significant milestone was achieved with the blazar TXS 0506+056, which was found to be in a flaring state of high gamma-ray emission and associated at the 3$σ$ level with a 290 TeV neutrino detected by IceCube in September 2017. This discovery motivated deeper exploration of the theoretical link between photon and neutrino emissions. In this context, simulations of proton-photon interactions in blazars and radiative processes are conducted using advanced numerical codes to predict neutrino spectra. The LeHa-Paris code, previously applied to TXS 0506+056, enables the computation of both leptonic and hadronic components of blazar spectral energy distributions, facilitating exploration of a broad parameter space. In this work, starting from the case of PKS 2155-304, one of the brightest and most studied High-frequency-peaked BL Lacs (HBLs), known for its extreme variability and subject of multi-wavelength observational campaigns, a methodology has been developed to extend neutrino flux templates, optimized via LeHa-Paris, to the full class of HBLs. Afterwards, neutrino emission models for a subset of HBLs from the 3HSP catalogue are derived."}
{"id": "2511.21567", "categories": ["astro-ph.HE", "nucl-th"], "pdf": "https://arxiv.org/pdf/2511.21567", "abs": "https://arxiv.org/abs/2511.21567", "authors": ["T. Dasher", "A. Ravlić", "S. Lalit", "E. O'Connor", "K. Godbey"], "title": "Enhanced antineutrino emission from $β$ decay in core-collapse supernovae with self-consistent weak decay rates", "comment": "7 pages, 3 figures, includes Supplemental Material. Comments are welcome", "summary": "Nuclear weak-interaction rates are known to exert a prominent effect in the late-stages of stellar collapse. Despite their importance, most studies to date on core-collapse supernovae (CCSNe) have focused primarily on the effects of electron captures, generally neglecting $β$ decay contributions. In this Letter, we present the first CCSNe simulation incorporating global $β$ decay rates from a microscopic theory. These are enabled by a large-scale evaluation of both electron capture and $β$ decay rates, obtained self-consistently utilizing the relativistic energy density functional theory and finite-temperature quasiparticle random-phase approximation. We find a significant enhancement of antineutrino emissivity by more than 4 orders of magnitude due to the inclusion of $β$ decay rates, as well as 3 orders of magnitude for antineutrino luminosity. It is expected that these new rates could help us constrain the model uncertainties related to weak-interaction processes, improving the prediction of antineutrino signal during the final stages of stellar death and potentially influencing the late-stage evolution of massive stars."}
