{"id": "2509.03593", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.03593", "abs": "https://arxiv.org/abs/2509.03593", "authors": ["Paarmita Pandey", "Jason Hinkle", "Christopher Kochanek", "Michael Tucker", "Mark Reynolds", "Jack Neustadt", "Todd Thompson", "Katie Auchettl", "Benjamin Shappee", "Aaron Do", "Dhvanil Desai", "W. Hoogendam", "C. Ashall", "Thomas Lowe", "Melissa Shahbandeh", "Anna Payne"], "title": "Unraveling the Nature of the Nuclear Transient AT2020adpi", "comment": "To be submitted to The Open Journal of Astrophysics, comments are\n  welcome. 11 pages, 8 figures", "summary": "Transient events associated with supermassive black holes provide rare\nopportunities to study accretion and the environments of supermassive black\nholes. We present a multiwavelength study of AT2020adpi (ZTF20acvfraq), a\nluminous optical/UV transient in the nucleus of the galaxy WISEA\nJ231853.77$-$103505.6 ($z=0.26$) that exhibits the properties of an ambiguous\nnuclear transient. Near peak, its spectral energy distribution is well\ndescribed by a power law ($\\lambda L_\\lambda \\propto \\lambda^{-\\alpha}$,\n$\\alpha = 0.44 \\pm 0.04$), with a maximum $g$-band luminosity of $(3.6 \\pm\n0.6)\\times10^{44}$ erg s$^{-1}$, which is consistent with luminous AGN flares.\nWe detect a strong mid-infrared flare ($L_\\mathrm{peak}^{\\mathrm{MIR}} = (2.3\n\\pm 0.05)\\times10^{44}$ erg s$^{-1}$) delayed by $\\sim$240 rest-frame days,\nindicating a hot dust echo from material at $\\sim$0.2 pc. The optical and\nnear-infrared spectra show broad H, He I, [OIII] lines, as well as narrow Fe\nII, and prominent Mg II, which is a combination not typical of TDEs. Taken\ntogether, these features suggest AT2020adpi is an ambiguous nuclear transient,\nwhere an accretion episode was triggered by stellar disruption of an accretion\ndisk or instabilities within an active nucleus. This source demonstrates the\nneed for careful multiwavelength analysis to distinguish between extreme AGN\nvariability and TDEs."}
{"id": "2509.03732", "categories": ["astro-ph.HE", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2509.03732", "abs": "https://arxiv.org/abs/2509.03732", "authors": ["Aidan Martas", "Stefano Valenti", "Aravind P. Ravi", "Yize Dong", "K. Azalee Bostroem", "Jeniveve Pearson", "Manisha Shrestha", "Jennifer E. Andrews", "David J. Sand", "Griffin Hosseinzadeh", "Michael Lundquist", "Emily Hoang", "Darshana Mehta", "Nicolas Meza Retamal", "Saurabh W. Jha", "Daryl Janzen", "D. Andrew Howell", "Curtis McCully", "Daichi Hiramatsu", "Craig Pellegrino"], "title": "SN 2019hnl: A Type IIP Supernova with a Partially Stripped, Low Mass Progenitor", "comment": null, "summary": "We present optical photometry and spectroscopy of SN 2019hnl. Discovered\nwithin ~26 hr of explosion by the ATLAS survey, SN 2019hnl is a typical Type\nIIP supernova with a peak absolute V band magnitude of -16.7+-0.1 mag, a\nplateau length of ~107 days, and an early decline rate of 0.0086+-0.0006 mag\n(50 days)^-1. We use nebular spectroscopy and hydrodynamic modeling with the\nSNEC, MESA, and STELLA codes to infer that the progenitor of SN 2019hnl was a\nM_ZAMS ~ 11M_solar red supergiant which produced 0.047+-0.007M_solar of 56Ni in\nthe explosion. As a part of our hydrodynamic modeling, we reduced hydrogen\nenvelope mass by scaling the mass loss within the \"Dutch\" wind scheme to fit\nour light curve, showing that the progenitor of a relatively typical Type IIP\nSN may experience partial stripping during their evolution and establish\nmassive (~0.2M_solar) CSM environments prior to core collapse."}
{"id": "2509.03735", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.03735", "abs": "https://arxiv.org/abs/2509.03735", "authors": ["Gustavo Esteban Romero", "Lucas Manuel Pasquevich", "Leandro Abaroa"], "title": "Effects of Bethe-Heitler pair production in ultraluminous X-ray sources", "comment": "16 pages, 25 figures, accepted for publication in Astroparticle\n  Physics", "summary": "Some black holes in X-ray binaries accrete at rates far above the Eddington\nlimit. In this supercritical regime, photons are trapped in a\nradiation-dominated, geometrically thick disk. The innermost regions form a\ncomplex environment of intense radiation, strong magnetic fields, and powerful\noutflows, where radiation-driven winds expel large amounts of mass. These\nconditions suppress primary relativistic electrons within the transparent\nfunnel along the black hole's spin axis. We show that high-energy electrons can\ninstead arise as secondary pairs from Bethe-Heitler interactions between\nrelativistic protons and ambient photons. Using self-similar models of\naccretion disks with strong winds of ultraluminous X-ray sources (ULXs), we\ncompute particle acceleration via magnetic reconnection and diffusive shocks,\nevaluate energy losses, and assess the efficiency and spectral imprint of\nBethe-Heitler pair production. Our results suggest that secondary pairs can\nyield nonthermal radiation in the 0.1-100 MeV range with luminosities from\n$10^{34}$ up to $10^{38}$ erg s$^{-1}$. This emission could be detectable by\nfuture MeV instruments from Galactic ULXs, offering evidence of relativistic\nprotons in their inner funnels and revealing misaligned, otherwise hidden,\nsuper-Eddington sources in the Milky Way."}
{"id": "2509.03763", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.03763", "abs": "https://arxiv.org/abs/2509.03763", "authors": ["Michela Negro", "Zorawar Wadiasingh", "George Younes", "Eric Burns", "Anirudh Patel", "Brian D. Metzger", "Todd A. Thompson", "Daryl Haggard", "S. Bradley Cenko"], "title": "Fast X-ray Transient detection with AXIS: application to Magnetar Giant Flares", "comment": "Submitted to Open Journal of Astrophysics", "summary": "Magnetar giant flares (MGFs) are among the most luminous high-energy\ntransients in the local universe, consisting of a short, intense MeV gamma-ray\nspike followed by a softer, pulsating X-ray tail and possibly delayed\nradioactive emission. While only three Galactic events have been firmly\ndetected, several extragalactic candidates have recently been reported,\nmotivating the need for sensitive, rapid-response gamma- and X-ray facilities\nto constrain their rates and energetics. We present a feasibility study of\ndetecting MGFs with the Advanced X-ray Imaging Satellite (AXIS), focusing on\ntwo complementary pathways: (i) serendipitous discovery of the prompt gamma-ray\nspike within the field of view, and (ii) rapid follow-up of MGF tails in nearby\ngalaxies. Using sensitivity rescaling and volumetric rate estimates, we find\nthat serendipitous detection of prompt spikes during the mission lifetime is\npossible but unlikely, given their hardness and short duration. In contrast,\nAXIS's superior sensitivity, if accompanied by fast repointing capabilities,\noffer an extraordinary opportunity to detect pulsating X-ray tails out to about\n20 Mpc, enabling the first extragalactic measurements of periodic modulations\nand potentially constraining emission geometry and fireball physics. Finally,\nwe evaluate the detectability of soft X-ray line emission from r-process\nnucleosynthesis in MGFs, finding that such signals are extremely faint and\nconfining the detection to Galactic distances. Our study offer a general\nframework for assessing the detectability of short transients with future\nmissions."}
{"id": "2509.03558", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.03558", "abs": "https://arxiv.org/abs/2509.03558", "authors": ["Wenbo Gu", "Ali Esamdin", "Cunhai Bai", "Jicheng Zhang", "Xuan Zhang", "Guojie Feng", "Letian Wang", "Guangxin Pu", "Xinliang Wang", "Daiping Zhang"], "title": "Seeing and Meteorological Analysis at the North-1 and North-2 Points of Muztagh-Ata Site on the Pamir Plateau", "comment": "14 pages,26 figures. published in MNRAS", "summary": "To support the selection of large optical/infrared telescope sites in western\nChina, long-term monitoring of atmospheric conditions and astronomical seeing\nhas been conducted at the Muztagh-Ata site on the Pamir Plateau since 2017.\nWith the monitoring focus gradually shifting northward, three stations were\nestablished: the South Point, North-1 point, and North-2 point. The North-1\npoint,selected as the site for the 1.93m Muztagh Optical Survey Telescope\n(MOST), has recorded seeing and meteorological parameters since late 2018. In\n2023,the North-2 point was established approximately 1.5 km northeast of\nNorth-1 point as a candidate location for a future large-aperture telescope. A\n10m DIMM tower and a PC-4A environmental monitoring system were installed to\nevaluate site quality. This study presents a comparative analysis of data from\nthe North-1 and North-2 points during 2018-2024.The median seeing is 0.89\narcsecs at North-1 and 0.78 arcsecs at North-2. Both points show clear seasonal\nand diurnal variations,with winter nights offering optimal observing\nconditions.On average, about 64% of the nighttime duration per year is suitable\nfor astronomical observations. Nighttime temperature variation is low :2.03 at\nNorth-1 and 2.10 at North-2 .Median wind speeds are 5-6 m/s, with dominant\ndirections between 210 and 300, contributing to stable airflow. Moderate wind\nsuppresses turbulence, while strong shear and rapid fluctuations degrade image\nquality. These findings confirm that both the North-1 and North-2 points offer\nhigh-quality atmospheric conditions and serve as promising sites for future\nground-based optical/infrared telescopes in western China."}
{"id": "2509.03862", "categories": ["astro-ph.HE", "hep-th", "nucl-th"], "pdf": "https://arxiv.org/pdf/2509.03862", "abs": "https://arxiv.org/abs/2509.03862", "authors": ["Ankit Kumar", "Hajime Sotani"], "title": "Stability analysis of two-fluid neutron stars featuring twin star and ultradense configurations", "comment": null, "summary": "We perform a detailed analysis of radial oscillations to discuss dynamical\nstability in two-fluid neutron stars composed of ordinary nuclear matter and a\ngravitationally coupled dark matter component. Using a fully relativistic\ntwo-fluid formalism, we solve the eigenvalue problem for a coupled system of\nequations with small-amplitude radial perturbations and derive the critical\nline corresponding to stability boundaries. We also compare these stability\nboundary lines obtained from the radial perturbations with those obtained from\na generalized turning-point criterion based on extremization of mass and\nparticle numbers, and find that the two methods agree to within better than\n$1\\%$ across the parameter space explored. We consider both mirror dark matter\nand self-interacting fermionic dark matter models, and examine how\nmicrophysical properties$-$such as nuclear equations of state, dark matter\nmass, and vector coupling strength$-$reshape the topology of the stability\nboundary and gravitational mass contours. Our results reveal the emergence of\nultra-dense and compact stars, with nuclear central densities exceeding\nsingle-fluid instability thresholds by factors of two or more, and the\nappearance of twin-star configurations with identical masses but distinct radii\nand internal fluid compositions. These findings have direct implications for\nthe interpretation of neutron star observables and motivate future studies\ninvolving phase transitions, density discontinuities, or additional\ninteractions in multi-component stellar systems. In particular, the emergence\nof exotic stable configurations beyond conventional stability limits\nunderscores the need to reassess standard criteria in light of multi-fluid\ndynamics, with significant consequences for multimessenger probes of dense\nmatter$-$including gravitational wave signals, mass-radius constraints, and\npost-merger remnants."}
{"id": "2509.03564", "categories": ["astro-ph.IM", "astro-ph.CO"], "pdf": "https://arxiv.org/pdf/2509.03564", "abs": "https://arxiv.org/abs/2509.03564", "authors": ["S. Stellati", "F. Piacentini", "S. Micheli", "A. Novelli", "F. Columbro", "A. Coppolecchia", "P. de Bernardis", "S. Masi", "M. Najafi", "A. Occhiuzzi", "L. Pagano", "A. Paiella", "LiteBIRD Collaboration"], "title": "Systematic effect induced by misalignment in a Reflective Polarization Modulator for CMB, and application to the LiteBIRD case", "comment": null, "summary": "[Abridged] The LiteBIRD mission aims to measure the Cosmic Microwave\nBackground (CMB) polarization with unprecedented precision, targeting the\ndetection of primordial B modes and a precise determination of the\ntensor-to-scalar ratio r. A central component of LiteBIRD are the polarization\nmodulators based on Half-Wave Plates (HWP). In this work, we investigate\nsystematic effects caused by a small, constant misalignment between the\nreflective HWP's rotation axis and optical axis, which mimics a wedge-like\neffect. This effect can introduce HWP-synchronous pointing errors, biasing\npolarization measurements and generating spurious B modes. Using the LiteBIRD\nsimulation framework, we implement this wedge-like misalignment in time-ordered\ndata and evaluate its impact on reconstructed maps and angular power spectra.\nOur results show that the contamination predominantly mimics lensing B modes\nrather than primordial tensor modes, and its impact is reduced when increasing\nthe number of detectors. By estimating the resulting error on the\ntensor-to-scalar ratio, we set constraints on the maximum allowable wedge angle\nto ensure systematic effects remain below mission requirements. This study\nemphasizes the critical importance of precise optical alignment in CMB\npolarization experiments. Future work will address the additional effects of\ntime-dependent HWP wobbling and more realistic scenarios with non-ideal\ndetector pairs."}
{"id": "2509.03904", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.03904", "abs": "https://arxiv.org/abs/2509.03904", "authors": ["Zhi-peng Ma", "Kai Wang"], "title": "Can Quasi-periodic Eruptions Produce Detectable High Energy Neutrinos?", "comment": "Accepted for publication in Physical Review D", "summary": "Quasi-periodic eruptions (QPEs) are a class of X-ray flaring phenomena that\noccur at the centers of galactic nuclei and are likely to arise from repeated\ninteractions between a star and an accretion disk. This work investigates\nwhether such disk-crossing events can accelerate protons and generate\ndetectable high-energy neutrinos. Based on observed QPE luminosities,\nrecurrence periods, and flare durations, the stellar motion parameters and the\ndisk properties are evaluated. We consider proton acceleration during the\nbreakout phase and evaluate neutrino production, accounting for both $pp$ and\n$p\\gamma$ interactions. Applying the method to ten observed QPE sources, we\nestimate the neutrino fluence accumulated over a 10-year observation period and\ncompute the corresponding detection numbers for IceCube and IceCube-Gen2. Our\nanalysis indicates that protons can be accelerated up to several tens of TeV,\nand neutrino production is mostly confined below $\\sim 10~\\mathrm{TeV}$. The\nresulting optimized neutrino fluence spans from $ 7.0 \\times 10^{-7} $ to $1.5\n\\times 10^{-4}~\\mathrm{GeV~cm^{-2}}$ for these ten QPE sources. We find that\nthe expected neutrino detection number for a single QPE source is low, and the\nexpected neutrino detection number would approach unity only for the most\npromising QPE source occurring at a distance closer than a few Mpc.\nNext-generation neutrino telescopes with better detection sensitivities at\n$\\lesssim \\rm TeV$ can significantly improve the capture capacity of the\ncumulative neutrino signal from the QPE population."}
{"id": "2509.03770", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.03770", "abs": "https://arxiv.org/abs/2509.03770", "authors": ["Rebecca Jensen-Clem", "Vincent Chambouleyron", "Prince Javier", "Daren Dillon", "Emiel H. Por", "Benjamin Calvin", "Sylvain Cetre", "Rodrigo Amezcua Correa", "Tara Crowe", "Jordan Diaz", "Caleb Dobias", "David Doelman", "Stephen Eikenberry", "J. Fowler", "Benjamin L. Gerard", "Phil Hinz", "Renate Kupke", "Ashai Moreno", "Tiffany Nguyen", "Maissa Salama", "Aditya R. Sengupta", "Nour Skaf", "Frans Snik"], "title": "The Santa Cruz Extreme AO Lab (SEAL) 2.0: A reflective, multi-wavelength rebuild", "comment": "submitted to SPIE Astronomical Applications 2025, paper number\n  13627-97", "summary": "The Santa cruz Extreme Adaptive optics Lab (SEAL) is a visible/near-infrared\nwavelength testbed designed to support technology development for high contrast\nimaging on large, segmented, ground-based telescopes. SEAL saw first light in\n2021 as a transmissive, visible-wavelength AO testbed. In this paper, we\npresent four major upgrades to SEAL: (1) the testbed has been rebuilt with\ncustom off-axis parabolic mirrors, enabling operation in both near-infrared and\nvisible wavelengths; (2) the suite of wavefront sensors now includes a\nShack-Hartmann, transmissive four-sided pyramid, vector-Zernike, and, in the\nmuirSEAL testbed, a photonic lantern; (3) the testbed includes a vector-vortex\ncoronagraph and will soon include a hybrid astrophotonic coronagraph; (4) in\naddition to its original Keck-heritage RTC, SEAL now includes two additional\ncontrol software packages: Catkit, originally developed for the HiCAT testbed\nat the Space Telescope Science Institute, and the RTC Compute And Control for\nAdaptive Optics (CACAO), originally designed for Subaru/SCExAO. We discuss the\nperformance of the testbed after the reflective rebuild and on-going technology\ndevelopment work at SEAL."}
{"id": "2509.04040", "categories": ["astro-ph.HE", "hep-ex"], "pdf": "https://arxiv.org/pdf/2509.04040", "abs": "https://arxiv.org/abs/2509.04040", "authors": ["Clara E. Leitgeb", "Robert D. Parsons", "Andrew M. Taylor", "Kenneth J. Ragan", "David Berge", "Cigdem Issever"], "title": "Probing the Cosmic Ray Background of Gamma-Ray Astronomy with Hadron Colliders", "comment": "22 pages, 7 figures", "summary": "Hadronic cosmic particles (cosmic rays) and gamma rays are constantly\nabsorbed in the Earth's atmosphere and result in air showers of secondary\nparticles. Cherenkov radiation from these atmospheric events is used to measure\ncosmic gamma rays with ground-based telescopes. We focus here on the dominant\nhadronic cosmic-ray-initiated background events in the atmosphere, which give\nrise to gamma-ray like air showers for gamma-ray telescopes. It is shown that\nonly a small subset of hadronic cosmic-ray interactions, those which produce a\nlarge energy neutral pion, are responsible for this background. We subsequently\naddress how the predictions of this background vary depending on the hadronic\ninteraction model adopted. The pseudorapidity range of the energetic pions,\nwith respect to the shower axis produced in these background events, is shown\nto be large. We show that collider experiments, specifically LHCf and RHICf,\nprobe cosmic ray interactions precisely within this pseudorapidity range.\nPresent and future measurements with these instruments are shown to be able to\ntest the ability for current hadronic interaction models to accurately describe\nthese background events."}
{"id": "2509.03843", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.03843", "abs": "https://arxiv.org/abs/2509.03843", "authors": ["Kane M. Sjoberg", "Johnny Esteves", "Christopher W. Stubbs"], "title": "PANDORA: New avenues in sub-percent photometric precision for ground based astronomy", "comment": "10 pages, 6 figures, presented at SPIE Optics + Photonics 2025", "summary": "Precision photometric calibration is key to a number of astrophysical\nresearch areas such as supernova cosmology and dark energy studies. In the age\nof large surveys, pushing the limits of photometry is a worthy challenge, with\ntraditional celestial calibrators limited to approximately percent precision.\nHere we present PANDORA, a novel calibration source that achieves sub-percent\nphotometric precision across the optical spectrum with a selectable dynamic\nrange and high optical efficiency. Building on proven collimated beam projector\ndesigns for relative throughput calibration of survey telescopes, PANDORA is\ncapable of delivering photons anywhere in the 350-1100 nm spectral range. It\nuses selectable neutral density filters and sequential NIST-calibrated\nphotodiode feedback to internally self-calibrate prior to operation, and is\nilluminated by an Energetiq EQ-99X-FC broadband laser-driven light source. We\npresent here an overview of the system design, operation, and laboratory\ncharacterization results. PANDORA will begin science operations this year to\nsupport the upcoming LS4 survey on the ESO 1m Schmidt telescope."}
{"id": "2509.04151", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.04151", "abs": "https://arxiv.org/abs/2509.04151", "authors": ["Hui Tong", "Maya Fishbach", "Eric Thrane", "Matthew Mould", "Thomas A. Callister", "Amanda Farah", "Nir Guttman", "Sharan Banagiri", "Daniel Beltran-Martinez", "Ben Farr", "Shanika Galaudage", "Jaxen Godfrey", "Jack Heinzel", "Marios Kalomenopoulos", "Simona J. Miller", "Aditya Vijaykumar"], "title": "Evidence of the pair instability gap in the distribution of black hole masses", "comment": null, "summary": "Stellar theory predicts a forbidden range of black-hole masses between\n${\\sim}50$--$130\\,M_\\odot$ due to pair-instability supernovae, but evidence for\nsuch a gap in the mass distribution from gravitational-wave astronomy has\nproved elusive. Early hints of a cutoff in black-hole masses at ${\\sim}\n45\\,M_\\odot$ disappeared with the subsequent discovery of more massive binary\nblack holes. Here, we report evidence of the pair-instability gap in\nLIGO--Virgo--KAGRA's fourth gravitational wave transient catalog (GWTC-4), with\na lower boundary of $45_{-4}^{+5} M_\\odot$ (90\\% credibility). While the gap is\nnot present in the distribution of \\textit{primary} masses $m_1$ (the bigger of\nthe two black holes in a binary system), it appears unambiguously in the\ndistribution of \\textit{secondary} masses $m_2$, where $m_2 \\leq m_1$. The\nlocation of the gap lines up well with a previously identified transition in\nthe binary black-hole spin distribution; binaries with primary components in\nthe gap tend to spin more rapidly than those below the gap. We interpret these\nfindings as evidence for a subpopulation of hierarchical mergers: binaries\nwhere the primary component is the product of a previous black-hole merger and\nthus populates the gap. Our measurement of the location of the pair-instability\ngap constrains the $S$-factor for $^{12}\\rm{C}(\\alpha,\\gamma)^{16}\\rm{O}$ at\n300keV to $256_{-104}^{+197}$ keV barns."}
{"id": "2509.03870", "categories": ["astro-ph.IM", "astro-ph.EP"], "pdf": "https://arxiv.org/pdf/2509.03870", "abs": "https://arxiv.org/abs/2509.03870", "authors": ["Joshua Liberman", "Sebastiaan Y. Haffert", "Jared R. Males", "Kevin Derby", "Ewan S. Douglas"], "title": "Single-shot focal plane wavefront sensing with the spatially-clipped self-coherent camera", "comment": "11 pages, 7 figures, Techniques and Instrumentation for Detection of\n  Exoplanets XII, SPIE Optics and Photonics, San Diego, 2025", "summary": "The Habitable Worlds Observatory requires active speckle suppression to\ndirectly image Earth-like exoplanets. Focal plane wavefront sensing and control\nallows us to detect, and subsequently remove, time-varying speckles through\nmeasurements of the electric field. Two measurement-based wavefront sensing\napproaches are pairwise probing (PWP) and the self-coherent camera (SCC).\nHowever, the PWP technique is time-consuming, requiring at least 4 images and\nreducing the speed at which aberrations can be eliminated. In the SCC, a\ncoronagraph mask diffracts light outside of the Lyot stop, where it is filtered\nwith a pinhole. The filtered light creates a reference beam, interfering with\nspeckles that leak through the coronagraph. The classic implementation of the\nSCC only works over small spectral bandwidths and needs significantly oversized\noptics which limits its implementation. We propose a new variant, the\nSpatially-Clipped Self-Coherent Camera (SCSCC). The SCSCC utilizes a pinhole\nplaced closer to the Lyot Stop, reducing the overall beam footprint and\nboosting the sensor resolution. A knife-edge beam splitter downstream of the\nLyot Stop splits the light into two channels: fringed and unfringed. This\nallows us to sense the wavefront with a single exposure. Time-varying\naberrations are effectively frozen in place, making them easy to remove. We\npresent monochromatic simulation results of the SCSCC in a sensing and control\nloop, demonstrating a normalized intensity of ~ 4 * 10^-10 in a 5-20 lambda/D\ndark hole. We find that wavefront control paired with the SCSCC achieves ~ 50x\ndeeper contrast than that achieved with PWP in a temporally evolving speckle\nfield. Our results make the SCSCC a valuable wavefront sensor concept for the\nupcoming Habitable World Observatory mission."}
{"id": "2509.04165", "categories": ["astro-ph.HE", "astro-ph.EP", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2509.04165", "abs": "https://arxiv.org/abs/2509.04165", "authors": ["Péter Ozsvárt", "Emma Kun", "Imre Bartos", "Zsolt Gy. Márka", "Szabolcs Márka"], "title": "Galactic forcing increases origination of marine microplankton", "comment": "26 pages, 6 figures. Accepted for publication in Paleoceanography and\n  Paleoclimatology", "summary": "The continuous flux of Galactic cosmic rays that bombard Earth's atmosphere\ncreates ionizing radiation that can damage the DNA of living organisms. While\nthis radiation on Earth is relatively constant in the short term, large and\nlong-scale fluctuations are expected with a period of $\\sim 63.5$ million\nyears. As the Solar System moves above or below the Galactic plane during its\noscillatory motion about the Galactic center, the Galactic magnetic shielding\nweakens, allowing more cosmic rays to reach Earth and trigger mutations in\norganisms. We identify a significant correlation (weighted global p-value:\n$1.25\\times 10^{-4}$, or $3.72\\sigma$) between the Solar System's Galactic\noscillations and the origination of marine zoo- and phyto-microplankton genera\nover the Phanerozoic. When we restrict the analysis to time intervals during\nwhich all four groups coexisted, a post-trial significance of $4.52\\sigma$\nemerges. Our findings suggest that changes in biodiversity have been\nsignificantly influenced by long-term Galactic forcing."}
{"id": "2509.03914", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.03914", "abs": "https://arxiv.org/abs/2509.03914", "authors": ["Kouichi Hagino", "Tatsuaki Kato", "Toshiya Iwata", "Masahiro Ichihashi", "Hiroumi Matsuhashi", "Gen Fujimoto", "Riki Sato", "Hirokazu Odaka", "Noriyuki Narukage", "Shota Arai", "Takahiro Minami", "Satoshi Takashima", "Aya Bamba"], "title": "Development of Solar Flare X-ray Polarimeter with Micro-Pixel CMOS Sensors", "comment": "9 pages, 5 figures, Proceedings of SPIE 2025 Optics + Photonics,\n  Astronomical Applications, Paper number 13625-43", "summary": "We are developing an X-ray polarimeter using micro-pixel CMOS sensors for\nsolar flare X-ray polarimetry. The system consists of a 2.5-$\\mu$m pixel CMOS\nimage sensor with a 12.8$\\times$12.8 mm$^2$ imaging area and a readout system\nbased on a Zynq System-on-Chip. While previous studies have validated this\nconcept, no realistic feasibility studies have been conducted for the solar\nflare X-ray polarization observation. In this work, we performed polarization\nsensitivity measurements at synchrotron facilities. The results show that our\npolarimeter is sensitive to the X-ray polarization, exhibiting a modulation\nfactor of 5-15% at an energy range of 6-22 keV. The measurements also\ndetermined the thickness of the sensitive layer to be approximately 5 $\\mu$m,\nand the thicknesses of the insensitive layers to be 0.8 $\\mu$m (Si), 2.1 $\\mu$m\n(SiO2), and 0.24 $\\mu$m (Cu). These measured thicknesses lead to a quantum\nefficiency of 3-4% at 10 keV. Based on these experimental evaluations, we\nestimated the sensitivity of the micro-pixel CMOS polarimeter system. We found\nthat, when combined with a telescope with an effective area of $\\sim$10 cm$^2$,\nthis system can detect X-ray polarization with a polarization degree of a few\npercent for M-class flares."}
{"id": "2509.04229", "categories": ["astro-ph.HE", "hep-ph"], "pdf": "https://arxiv.org/pdf/2509.04229", "abs": "https://arxiv.org/abs/2509.04229", "authors": ["Alexander Sandrock"], "title": "Cosmic-Ray Boosted Diffuse Supernova Neutrinos", "comment": "Accepted for publication in Astronomy", "summary": "The subject of boosted fluxes of dark matter or cosmic relic neutrinos via\nscattering on cosmic rays has received considerable attention recently. This\narticle investigates the boosted neutrino flux from scattering of cosmic rays\nand the so-far undetected diffuse supernova neutrino background, taking into\naccount both galactic and extragalactic cosmic rays. The calculated flux is\nmany orders of magnitude smaller than either the galactic diffuse neutrino\nemission, the extragalactic astrophysical flux measured by IceCube, or the\ncosmogenic neutrino flux expected at the highest energies."}
{"id": "2509.03987", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.03987", "abs": "https://arxiv.org/abs/2509.03987", "authors": ["Armando di Matteo"], "title": "Simulating the propagation of cosmic rays heavier than iron in SimProp", "comment": "Prepared for the proceedings of the 39th International Cosmic Ray\n  Conference (ICRC2025), 15-24 July 2025, Geneva, Switzerland", "summary": "Ultra-high-energy cosmic rays (UHECRs) have long been assumed to entirely\nconsist of iron and/or lighter atomic nuclei, and this assumption has been\nhard-coded in a great deal of software for UHECR simulations and data analysis.\nHowever, in the last few years several authors have started questioning this\nassumption and entertaining the possibility that UHECRs might at least partly\nconsist of nuclei of elements heavier than iron, especially at the highest\nenergies. Thoroughly testing this hypothesis will require upgrading software so\nthat it can handle such nuclei. In this contribution I will describe the\nminimal modifications required for the last publicly released version of\nSimProp, a code for Monte Carlo simulations of the intergalactic propagation of\nUHECRs, to be able to treat heavier nuclei, and discuss the applicability of\napproximations first introduced for lighter nuclei."}
{"id": "2509.04262", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.04262", "abs": "https://arxiv.org/abs/2509.04262", "authors": ["Rahul Basu", "Dipanjan Mitra", "George I. Melikidze"], "title": "Characterizing the Nature of Periodic Amplitude Modulation in Pulsars", "comment": "20 pages, 10 figures, accepted for publication in ApJ", "summary": "In recent years periodic amplitude modulation has emerged as a unique\nemission feature in the single pulse sequence of pulsars alongside periodic\nnulling and subpulse drifting. Despite ample evidence for the uniqueness of\nthis phenomenon, the periodic modulation in several pulsars are often confused\nwith subpulse drifting, primarily due to lack of clear characterisation of the\nemission features from a representative sample of pulsars. In this work we\npresent a detailed analysis of the single pulse behaviour from seventeen\npulsars exhibiting periodic amplitude modulation, six of them being new\ndetections. The pulsar switches between different intensity states as a result\nof periodic amplitude modulation and we propose a novel statistical scheme to\nidentify these emission states. The periodic modulation can be divided into\nthree broad categories, phase stationary modulation, modulations with phase\nshift and intermittent periodic modulations. The phase stationary behaviour is\nseen when the emission intensity across a major part of the pulse window\nchanges periodically. The phase shifts are associated with intensity changes at\nspecific locations within the emission window in a periodic manner; while in\nsome pulsars the periodic modulations become more prominent only at specific\nintervals resulting in intermittent behaviour."}
{"id": "2509.04081", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.04081", "abs": "https://arxiv.org/abs/2509.04081", "authors": ["Hua-Jian Yu", "Jia-Lei Zheng", "Yuan Fang"], "title": "Using Deep Learning to Identify Artificial Satellite Trails in Multi-band Photometric Astronomical Images", "comment": "27 pages, 14 figures,", "summary": "This research addresses the growing challenge of artificial satellite trail\ninterference in ground-based astronomical observations by developing an\nefficient deep learning identification method. With the proliferation of\nsatellite constellations in low Earth orbit, accurate detection of satellite\ntrails has become crucial for preserving astronomical data quality. Using\nmulti-band photometric survey observational data from the $Multi-channel$\n$Photometric$ $Survey$ $Telescope$ (Mephisto) of Yunnan University , we\nconstructed a specialized dataset of astronomical images containing satellite\ntrails. We propose a novel ASA-U-Net model that integrates atrous spatial\npyramid pooling with channel attention mechanisms into the U-Net architecture\nto effectively capture sparse satellite trail features that traditional\nsemantic segmentation models often miss during downsampling. The model was\nimplemented and validated on actual telescope data, demonstrating superior\nperformance in end-to-end detection and marking of satellite trails compared to\ntraditional methods. This approach significantly improves data processing\nprecision without requiring manual parameter adjustments, making it suitable\nfor processing massive nightly survey data and enhancing the quality of\nastronomical data products."}
{"id": "2509.04387", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2509.04387", "abs": "https://arxiv.org/abs/2509.04387", "authors": ["Xihui Zhao", "Xue-Ning Bai", "Eve C. Ostriker"], "title": "Cosmic Ray Magnetohydrodynamics: A New Two-Moment Framework with Numerical Implementation", "comment": "32 pages, 12 figures, submitted to ApJS, comments welcomed", "summary": "Cosmic rays (CRs) play a pivotal role in various astrophysical systems,\ndelivering feedback over a broad range of scales. However, modeling CR\ntransport remains challenging due to its inherently multi-scale nature and\ncomplex microphysics. Recent advances in two-moment CR hydrodynamics have\nalleviated some of these challenges, improving understanding of CR feedback.\nYet, current two-moment methods may not be able to directly incorporate all\nrelevant CR transport processes, while the outcome of CR feedback sensitively\ndepends on these underlying microphysics. Furthermore, numerical challenges\npersist, including instabilities from streaming terms and ambiguities in solver\ndesign for coupled CR-MHD systems. In this work, we develop a two-moment\ndescription for CR hydrodynamics from first principles. Beyond canonical CR\nstreaming, our formulation accounts for CR pressure anisotropy and Alfv\\'en\nwaves propagating in both directions along the magnetic field, providing a\ngeneral framework to incorporate more CR transport physics. We implement this\nframework as a new CR fluid module in the \\textit{Athena}++ code, and validate\nit through a suite of benchmark tests. In particular, we derive the full\ndispersion relation of the two-moment CR-MHD system, identifying the\nCR-acoustic instability as well as other wave branches. These CR-MHD waves\nserve as rigorous benchmarks and also enable the use of realistic signal speeds\nin our Riemann solver. We propose a time step guideline to mitigate numerical\ninstabilities arising from streaming source terms."}
{"id": "2509.04302", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2509.04302", "abs": "https://arxiv.org/abs/2509.04302", "authors": ["J. Eser", "A. V. Olinto", "G. Osteria"], "title": "POEMMA-Balloon with Radio: An Overview", "comment": "To be published in Proccedings of the 39th International Cosmic Ray\n  Conference (ICRC 2025) in Geneva, SwitzerlandTo be published in Proccedings\n  of the 39th International Cosmic Ray Conference (ICRC 2025) in Geneva,\n  Switzerland", "summary": "The POEMMA-Balloon with Radio (PBR) is an Ultra Long Duration Balloon payload\nscheduled for launch in Spring 2027 from Wanaka, New Zealand. It will circle\nover the Southern Ocean for a mission duration as long as 50 days, serving as a\nprecursor to the dual satellite mission, Probe of Extreme Multi-Messenger\nAstrophysics (POEMMA). The PBR mission represents a significant step towards\nestablishing a space-based multi-messenger observatory. Observations from space\nwill enhance the statistics of the highest-energy cosmic rays and complement\nground-based observatories by enabling simultaneous observations of both\nhemispheres with a single instrument. Additionally, POEMMA will facilitate the\nmeasurement of Very-High-Energy Neutrinos (VHENs) following multi-messenger\nalerts of astrophysical transient events, such as gamma-ray bursts. PBR is an\nadaptation of the POEMMA mission, featuring three primary science goals: 1.\nObserve Ultra-High-Energy Cosmic Rays (UHECRs) via the fluorescence technique\nfrom suborbital space. 2. Observe horizontal high-altitude air showers (HAHAs)\nwith energies exceeding the cosmic ray knee (E > 3 PeV) using optical and radio\ndetection for the first time. 3. Follow astrophysical event alerts in the\nsearch for VHENs. This contribution provides an overview of the PBR payload and\ndiscusses the expected performance of its various detectors."}
{"id": "2509.04421", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2509.04421", "abs": "https://arxiv.org/abs/2509.04421", "authors": ["XRISM Collaboration", "Marc Audard", "Hisamitsu Awaki", "Ralf Ballhausen", "Aya Bamba", "Ehud Behar", "Rozenn Boissay-Malaquin", "Laura Brenneman", "Gregory V. Brown", "Lia Corrales", "Elisa Costantini", "Renata Cumbee", "Maria Diaz Trigo", "Chris Done", "Tadayasu Dotani", "Ken Ebisawa", "Megan E. Eckart", "Dominique Eckert", "Satoshi Eguchi", "Teruaki Enoto", "Yuichiro Ezoe", "Adam Foster", "Ryuichi Fujimoto", "Yutaka Fujita", "Yasushi Fukazawa", "Kotaro Fukushima", "Akihiro Furuzawa", "Luigi Gallo", "Javier A. Garcia", "Liyi Gu", "Matteo Guainazzi", "Kouichi Hagino", "Kenji Hamaguchi", "Isamu Hatsukade", "Katsuhiro Hayashi", "Takayuki Hayashi", "Natalie Hell", "Edmund Hodges-Kluck", "Ann Hornschemeier", "Yuto Ichinohe", "Daiki Ishi", "Manabu Ishida", "Kumi Ishikawa", "Yoshitaka Ishisaki", "Jelle Kaastra", "Timothy Kallman", "Erin Kara", "Satoru Katsuda", "Yoshiaki Kanemaru", "Richard Kelley", "Caroline Kilbourne", "Shunji Kitamoto", "Shogo Kobayashi", "Takayoshi Kohmura", "Aya Kubota", "Maurice Leutenegger", "Michael Loewenstein", "Yoshitomo Maeda", "Maxim Markevitch", "Hironori Matsumoto", "Kyoko Matsushita", "Dan McCammon", "Brian McNamara", "Francois Mernier", "Eric D. Miller", "Jon M. Miller", "Ikuyuki Mitsuishi", "Misaki Mizumoto", "Tsunefumi Mizuno", "Koji Mori", "Koji Mukai", "Hiroshi Murakami", "Richard Mushotzky", "Hiroshi Nakajima", "Kazuhiro Nakazawa", "Jan-Uwe Ness", "Kumiko Nobukawa", "Masayoshi Nobukawa", "Hirofumi Noda", "Hirokazu Odaka", "Shoji Ogawa", "Anna Ogorzalek", "Takashi Okajima", "Naomi Ota", "Stephane Paltani", "Robert Petre", "Paul Plucinsky", "Frederick S. Porter", "Katja Pottschmidt", "Kosuke Sato", "Toshiki Sato", "Makoto Sawada", "Hiromi Seta", "Megumi Shidatsu", "Aurora Simionescu", "Randall Smith", "Hiromasa Suzuki", "Andrew Szymkowiak", "Hiromitsu Takahashi", "Mai Takeo", "Toru Tamagawa", "Keisuke Tamura", "Takaaki Tanaka", "Atsushi Tanimoto", "Makoto Tashiro", "Yukikatsu Terada", "Yuichi Terashima", "Yohko Tsuboi", "Masahiro Tsujimoto", "Hiroshi Tsunemi", "Takeshi G. Tsuru", "Aysegul Tumer", "Hiroyuki Uchida", "Nagomi Uchida", "Yuusuke Uchida", "Hideki Uchiyama", "Yoshihiro Ueda", "Shinichiro Uno", "Jacco Vink", "Shin Watanabe", "Brian J. Williams", "Satoshi Yamada", "Shinya Yamada", "Hiroya Yamaguchi", "Kazutaka Yamaoka", "Noriko Yamasaki", "Makoto Yamauchi", "Shigeo Yamauchi", "Tahir Yaqoob", "Tomokage Yoneyama", "Tessei Yoshida", "Mihoko Yukita", "Irina Zhuravleva", "Elena Bellomi", "Ian Drury", "Annie Heinrich", "Julie Hlavacek-Larrondo", "Julian Meunier", "Kostas Migkas", "Lior Shefler", "Phillip C. Stancil", "Nhut Truong", "Shutaro Ueda", "Benjamin Vigneron", "Congyao Zhang", "John ZuHone"], "title": "Disentangling Multiple Gas Kinematic Drivers in the Perseus Galaxy Cluster", "comment": "36 pages, 12 figures, submitted. Corresponding authors: Congyao Zhang\n  (Masaryk Univ., UChicago), Annie Heinrich (UChicago), and Irina Zhuravleva\n  (UChicago)", "summary": "Galaxy clusters, the Universe's largest halo structures, are filled with\n10-100 million degree X-ray-emitting gas. Their evolution is shaped by\nenergetic processes such as feedback from supermassive black holes (SMBHs) and\nmergers with other cosmic structures. The imprints of these processes on gas\nkinematic properties remain largely unknown, restricting our understanding of\ngas thermodynamics and energy conversion within clusters. High-resolution\nspectral mapping across a broad spatial-scale range provides a promising\nsolution to this challenge, enabled by the recent launch of the XRISM X-ray\nObservatory. Here, we present the kinematic measurements of the X-ray-brightest\nPerseus cluster with XRISM, radially covering the extent of its cool core. We\nfind direct evidence for the presence of at least two dominant drivers of gas\nmotions operating on distinct physical scales: a small-scale driver in the\ninner ~60 kpc, likely associated with the SMBH feedback; and a large-scale\ndriver in the outer core, powered by mergers. The inner driver sustains a\nheating rate at least an order of magnitude higher than the outer one. This\nfinding suggests that, during the active phase, the SMBH feedback generates\nturbulence, which, if fully dissipated into heat, could play a significant role\nin offsetting radiative cooling losses in the Perseus core. Our study\nunderscores the necessity of kinematic mapping observations of extended sources\nfor robust conclusions on the properties of the velocity field and their role\nin the assembly and evolution of massive halos. It further offers a kinematic\ndiagnostic for theoretical models of SMBH feedback."}
{"id": "2509.03987", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2509.03987", "abs": "https://arxiv.org/abs/2509.03987", "authors": ["Armando di Matteo"], "title": "Simulating the propagation of cosmic rays heavier than iron in SimProp", "comment": "Prepared for the proceedings of the 39th International Cosmic Ray\n  Conference (ICRC2025), 15-24 July 2025, Geneva, Switzerland", "summary": "Ultra-high-energy cosmic rays (UHECRs) have long been assumed to entirely\nconsist of iron and/or lighter atomic nuclei, and this assumption has been\nhard-coded in a great deal of software for UHECR simulations and data analysis.\nHowever, in the last few years several authors have started questioning this\nassumption and entertaining the possibility that UHECRs might at least partly\nconsist of nuclei of elements heavier than iron, especially at the highest\nenergies. Thoroughly testing this hypothesis will require upgrading software so\nthat it can handle such nuclei. In this contribution I will describe the\nminimal modifications required for the last publicly released version of\nSimProp, a code for Monte Carlo simulations of the intergalactic propagation of\nUHECRs, to be able to treat heavier nuclei, and discuss the applicability of\napproximations first introduced for lighter nuclei."}
