{"id": "2602.00155", "categories": ["astro-ph.IM", "physics.comp-ph"], "pdf": "https://arxiv.org/pdf/2602.00155", "abs": "https://arxiv.org/abs/2602.00155", "authors": ["Robyn L. Munoz", "Christian T. Byrnes", "Will J. Roper"], "title": "aurel: A Python package for automatic relativistic calculations", "comment": "5 pages, aurel available at https://robynlm.github.io/aurel/ To be submitted to JOSS", "summary": "\\texttt{aurel} is an open-source Python package designed to \\emph{au}tomatically calculate \\emph{rel}ativistic quantities. It uses an efficient, flexible and user-friendly caching and dependency-tracking system, ideal for managing the highly nonlinear nature of general relativity. The package supports both symbolic and numerical calculations. The symbolic part extends \\texttt{SymPy} with additional tensorial calculations. The numerical part computes a wide range of tensorial quantities, such as curvature, matter kinematics and much more, directly from any spacetime and matter data arrays using finite-difference methods. Inputs can be either generated from analytical expressions or imported from Numerical Relativity (NR) simulations, with helper functions provided to read in data from standard NR codes. Given the increasing use of NR, \\texttt{aurel} offers a timely post-processing tool to support the popularisation of this field."}
{"id": "2602.00195", "categories": ["astro-ph.IM", "astro-ph.HE", "gr-qc"], "pdf": "https://arxiv.org/pdf/2602.00195", "abs": "https://arxiv.org/abs/2602.00195", "authors": ["Yi-kun Li", "Cheng Cheng", "Lang Cui", "Yun Fang"], "title": "Model-Agnostic Population Inference for Gravitational-Wave Astronomy: From LIGO to LISA", "comment": null, "summary": "Inferring the intrinsic population of compact binary mergers is complicated by detector selection biases and measurement uncertainties. Traditional parametric methods are limited by the need to presuppose functional forms, introducing model-dependent biases. To overcome these limitations, we introduce an inference framework powered by deep generative modeling. We develop a flexible, data-driven population model using a Correlated Compound-Mixture Density Network. This architecture integrates mixture models to handle multimodality, Gaussian copulas for parameter dependencies, and a library of flexible marginal distributions. The network is trained to approximate the posterior distribution of the population's hyperparameters using amortized variational inference with Normalizing Flows on catalogs of gravitational-wave events. We demonstrate the framework's capabilities in two distinct regimes. First, using simulated catalogs of supermassive black hole binary mergers for the Laser Interferometer Space Antenna (LISA), we show that the method accurately recovers complex three-dimensional distributions and absolute merger rates from sparse datasets, effectively correcting for selection effects and measurement uncertainties. Second, we validate the framework on real observational data from the LIGO-Virgo-KAGRA GWTC-3 catalog, successfully inferring the population of stellar-mass binary black holes using an injection-based selection effect correction. Our results confirm that the method is robust, scalable, and applicable across different detector sensitivities and source populations."}
{"id": "2602.00203", "categories": ["astro-ph.IM", "astro-ph.HE", "gr-qc"], "pdf": "https://arxiv.org/pdf/2602.00203", "abs": "https://arxiv.org/abs/2602.00203", "authors": ["Anastasios Theodoropoulos", "Nino Villanueva", "Osvaldo Gramaxo Freitas", "Tiago Fernandes", "Solange Nunes", "Alejandro Torres-Forne", "Jose A. Font", "Antonio Onofre", "Jose D. Martin-Guerrero"], "title": "An autoencoder-based surrogate waveform model for quasi-circular binary-black-hole mergers", "comment": null, "summary": "The generation of accurate waveforms from binary black hole (BBH) mergers is a major effort in Gravitational-Wave Astronomy. In recent years, machine-learning-based surrogate models for BBH waveforms have been proposed. Those offer the potential to dramatically accelerate waveform generation while maintaining accuracy competitive with that of traditional waveform approximants. In this work, we investigate the viability of autoencoders as generative models for gravitational-wave signals from quasi-circular BBH mergers. We introduce AESur3dq8, a novel surrogate waveform model based on autoencoders that enables the rapid and accurate construction of large template banks, producing millions of waveforms in under a second using modest computational resources. The model is trained on the numerical-relativity-informed surrogate NRHybSur3dq8 and subsequently fine-tuned using the SXS catalog of BBH simulations. We demonstrate that waveforms generated by AESur3dq8 achieve mismatches of order $10^{-4}$ with respect to Numerical Relativity waveforms, and that parameter estimation performed with these templates yields results fully consistent with those reported by the LIGO-Virgo-KAGRA Collaboration for observed gravitational-wave events."}
{"id": "2602.00225", "categories": ["astro-ph.IM", "astro-ph.EP"], "pdf": "https://arxiv.org/pdf/2602.00225", "abs": "https://arxiv.org/abs/2602.00225", "authors": ["Thayne Currie", "Brianna Lacy", "Yiting Li", "Mona El Morsy", "Danielle Bovie", "Kellen Lawson", "Masayuki Kuzuhara", "Naoshi Murakami"], "title": "A Roman Coronagraph Spectroscopic Mode Demonstration", "comment": "8 pages; 2 figures; Roman Coronagraph white paper", "summary": "We propose 730 nm high-contrast spectroscopic observations of selected self-luminous directly-imaged planets as a key test of the Roman Coronagraph's planet characterization capabilities. The planet sample draws from ground-based IR discoveries with the NASA headquarters-supported Subaru/OASIS survey -- HIP 99770 b and HIP 54515 b -- and ``emblematic\" planets $β$ Pic b and HR 8799 e. All of these planets are likely unsuitable for achieving the coronagraph's core TTR5 goal at 575 nm but are detectable at longer wavelength passbands. Their predicted contrasts at 730 $μm$ cover two orders of magnitude range; all companions reside within the dark hole region enabled by the shaped-pupil coronagraph at 730 nm. These observations will help to fulfill multiple Coronagraph Objectives, providing a first assessment of the wavelength dependence of speckle noise and the ability to extract accurate atmospheric information in the face of this noise. Additionally, they will provide a first experiment at extracting optical planet spectra in the face of signal contamination from a debris disk: prefiguring challenges that the Habitable Worlds Observatory may encounter with imaging Earths in exozodi-contaminated systems."}
{"id": "2602.00025", "categories": ["astro-ph.HE", "gr-qc"], "pdf": "https://arxiv.org/pdf/2602.00025", "abs": "https://arxiv.org/abs/2602.00025", "authors": ["Huang Yu-Xiang", "Guo Sen", "Liang En-Wei", "Lin Kai"], "title": "Impact of Perfect Fluid Dark Matter on the Appearance of Rotating Black Hole", "comment": null, "summary": "Understanding how dark matter affects the immediate environment of black holes (BHs) is crucial for interpreting horizon-scale observations. We study rotating BHs surrounded by perfect fluid dark matter (PFDM), exploring their observable features through both analytical and numerical approaches. Using the existence criterion of the innermost stable circular orbit (ISCO), we first derive joint constraints on the PFDM intensity parameter~k and the spin parameter~a. Within the resulting physically allowed parameter regime, we perform high-resolution, general-relativistic ray-tracing simulations of thin accretion disks at 87~GHz and 230~GHz, capturing the detailed brightness morphology and photon ring structure shaped by PFDM. By incorporating angular diameter measurements of M87^{*} and Sgr~A^{*} from the Event Horizon Telescope (EHT), we further narrow down the viable parameter space and directly compare synthetic images with EHT observations of M87^{*}. We find that the inclusion of PFDM improves the agreement with the observed compact shadow and asymmetric brightness distribution, suggesting that dark matter may leave observable imprints on horizon-scale images. Our results position PFDM as a physically motivated extension to the Kerr geometry and highlight a promising astrophysical pathway for probing dark matter near BHs with current and future VLBI campaigns."}
{"id": "2602.00290", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2602.00290", "abs": "https://arxiv.org/abs/2602.00290", "authors": ["Aditya S. Deshpande", "Patrick D. Mullen", "Alex A. Gorodetsky", "Joshua C. Dolence", "Chad D. Meyer", "Jonah M. Miller", "Luke F. Roberts"], "title": "Multigroup Thermal Radiation Transport with Tensor Trains", "comment": "22 pages, 16 figures, submitted to ApJS", "summary": "We investigate the application of tensor train (TT) algorithms to multigroup thermal radiation transport (i.e., photon radiation transport). The TT framework enables simulations at discretizations that might otherwise be computationally infeasible on conventional hardware. We show that solutions to certain multigroup problems possess an intrinsic low-rank structure, which the TT representation leverages effectively. This enables us to solve problems where the discretized solution size exceeds a trillion parameters on a single node. We consistently achieve compression factors $>$100$\\times$ and speedups $>$2$\\times$. The solver is evaluated across a range of test problems with varying levels of complexity. In addition, we further analyze the low-rank structure of the merged spatio-spectral core to evaluate the potential for additional compression via more advanced TT decompositions."}
{"id": "2602.00223", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2602.00223", "abs": "https://arxiv.org/abs/2602.00223", "authors": ["Dhvanil D. Desai", "Benjamin J. Shappee", "Christopher S. Kochanek", "Krzysztof Z. Stanek", "Chris Ashall", "John F. Beacom", "Christopher R. Burns", "Aaron Do", "Subo Dong", "Willem B. Hoogendam", "Jing Lu", "Thallis Pessi", "Jose L. Prieto", "Todd A. Thompson"], "title": "Supernova Rates and Luminosity Functions from ASAS-SN III: Over a Decade of Type Ia SNe and Their Subtypes", "comment": "16 pages, 13 figures, 4 tables", "summary": "We present volumetric rates and luminosity functions (LFs) of Type Ia supernovae (SNe Ia) from the All-Sky Automated Survey for Supernovae (ASAS-SN), covering the 11-year period from 2014 to 2024. By combining the 2014--2017 $V$-band sample with the 2018--2024 $g$-band sample, we construct a large statistical dataset of $1776$ SNe Ia. We compute completeness corrections based on injection-recovery simulations of the ASAS-SN light curves, taking into account the variations in light curve shapes. For our standard sample ($M_{g,\\mathrm{peak}}<-16.0$ mag), we extract a total volumetric SN Ia rate of $R_{\\mathrm{tot}} = (2.55 \\pm 0.12) \\times 10^4\\,\\mathrm{yr}^{-1}\\,\\mathrm{Gpc}^{-3}\\,h_{70}^3$ at a median redshift of $z=0.029$. With a statistical uncertainty of $4.7\\%$, this is the most precise local measurement to date. While the \"normal\" SNe Ia account for $(92.7 \\pm 1.9)\\%$ of this rate, the total LF reveals immense diversity, with $M_{g,\\mathrm{peak}}$ spanning over five magnitudes. The LF of SNe Iax is also broad and rises toward lower luminosities, resulting in a likely lower limit of $(4.3 \\pm 1.8)\\%$ of the total rate. We place strong constraints on the rate of SNe Ia-CSM, finding they account for only $(0.036 \\pm 0.017)\\%$ of the total local rate. Finally, we find that the low-luminosity 02es-like SNe are $7 \\pm 5$ times more common than the luminous 03fg-like SNe. This places demographic constraints on models proposing a physical continuum for these two subtypes, implying that any common channel for the two classes must strongly favor lower-luminosity explosions."}
{"id": "2602.00304", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2602.00304", "abs": "https://arxiv.org/abs/2602.00304", "authors": ["Rex Lam", "Scott Cray", "Sam Dietterich", "Calvin Firth", "Shaul Hanany", "Takumi Izawa", "Jürgen Koch", "Kuniaki Konishi", "Tomotake Matsumura", "Haruyuki Sakurai", "Yuki Sakurai", "Ryota Takaku", "Andrew Yan"], "title": "3D Printed Alumina as a Millimeter-Wave Optical Element", "comment": "Accepted for Publication in JATIS-250148. 11 Pages, 5 Figures, 2 Tables", "summary": "We present millimeter and sub-millimeter room temperature transmission and loss measurements of 3D printed alumina disc and of a disc with one-sided 3D printed sub-wavelength structures anti-reflection coatings (SWS-ARC). For four bands spanning 158 - 700~GHz we find an index of refraction consistent with $n= 3.107 \\pm 0.007$. The loss over the entire frequency band between 158~GHz and 700~GHz spans $ 1 \\cdot 10^{-3} \\leq \\tan δ\\leq 2.49 \\cdot 10^{-3}$ with 10%-30% uncertainty at the lower range of frequencies shrinking to $\\sim\\!2\\%$ at the higher frequencies. As expected, constructive and destructive interference fringes that are apparent with the flat disc data are absent with the disc that has SWS-ARC. The measured data are consistent with finite element analysis predictions that are based on the measured shape of the SWS. At frequencies between 158~GHz and 200~GHz, below the onset of diffraction effects, reflectance is reduced from a maximum of 64% to about 25%, closely matching predictions. These measurements of the index, loss, and SWS-ARC of 3D printed alumina suggest that the material and fabrication technique could be useful for astrophysical applications."}
{"id": "2602.00226", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2602.00226", "abs": "https://arxiv.org/abs/2602.00226", "authors": ["Arka Ghosh", "Uri Keshet", "Santanu Mondal"], "title": "Nested Fermi and eROSITA bubbles require very similar $\\sim10^{55}$ erg collimated Galactic-center outbursts; their asymmetry indicates an eastern density gradient", "comment": "19 pages, 15 figures. Comments welcome", "summary": "Observations indicate two nested pairs of extended bipolar bubbles emanating from the Milky-Way center - the $|b|\\sim80^\\circ$ latitude eROSITA bubbles (RBs), encompassing the smaller, $|b|\\sim 50^{\\circ}$ Fermi bubbles (FBs) - and classify the edges of both bubble pairs as strong forward shocks. Identifying each bubble pair as driven by a distinct, collimated outburst, we evolve these bubbles and constrain their origin using a stratified 1D model verified by a suite of 2D and 3D hydrodynamic simulations which reproduce X-ray observations. While the RBs are at the onset of slowdown, the FBs are still expanding ballistically into the RB-shocked medium. Observational constraints indicate that both RB and FB outbursts had (up to factor $\\sim2$-$3$ uncertainties) $\\sim4^\\circ$ half-opening angles and $\\sim 2000$ km s$^{-1}$ velocities $100$ pc from their base, carrying $\\sim10^{55}$ erg. The FBs and RBs could thus arise from identical outbursts separated by $\\sim10$ Myr; their longitudinal asymmetry favors an eastern ambient-density gradient over western wind suggestions."}
{"id": "2602.00310", "categories": ["astro-ph.IM", "stat.AP"], "pdf": "https://arxiv.org/pdf/2602.00310", "abs": "https://arxiv.org/abs/2602.00310", "authors": ["Kevin A. McKinnon", "Roeland P. van der Marel"], "title": "Simulating Roman+Gaia Combined Astrometry, Parallaxes, and Proper Motions", "comment": "24 pages, 12 figures, 4 tables", "summary": "The next generation of high-precision astrometry is rapidly approaching thanks to ongoing and upcoming missions like Euclid, LSST, and RST. We present a new tool (available at https://github.com/KevinMcK95/gaia_roman_astrometry) to simulate the astrometric precision that will be achieved when combining Gaia data with Roman images. We construct realistic Roman position uncertainties as a function of filter, magnitude, and exposure time, which are combined with Gaia precisions and user-defined Roman observing strategies to predict the expected uncertainty in position, parallax, and proper motion (PM). We also simulate the core Roman surveys to assess their end-of-mission astrometric capabilities, finding that the High Latitude and Galactic Bulge Time Domain Surveys will deliver Gaia-DR3-quality PMs down to G=26.5 mag and G=29.0 mag, respectively. Due to its modest number of repeat observations, we find that the astrometry of the High Latitude Wide Area Survey (HLWAS) is very sensitive to particular choices in observing strategies. We compare possible HLWAS strategies to highlight the impact of parallax effects and conclude that a multi-year Roman-only baseline is required for useful PM uncertainties (<100 mas/yr). This simulation tool is actively being used for ongoing Roman proposal writing to ensure astrometric requirements for science goals will be met. Subsequent work will expand this tool to include simulated observations from other telescopes to plan for a future where all surveys and datasets are harnessed together."}
{"id": "2602.00257", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2602.00257", "abs": "https://arxiv.org/abs/2602.00257", "authors": ["Noémie Globus"], "title": "Fireballs' Whispers of Their Central Engine: Relativistic Filtering of Afterglow QPOs", "comment": "6 pages, 1 figure, submitted to ApJL", "summary": "Quasi-periodic oscillations (QPOs) in gamma-ray bursts (GRBs) afterglows have been suggested as probes of the central engine. Such interpretations generally assume that the observed modulation frequency directly corresponds to an intrinsic oscillation frequency of the source. We show that this assumption is not generally valid and that interpreting such features without accounting for relativistic propagation may lead to misleading inferences about the engine nature. We show that relativistic propagation effects - most importantly integration over equal-arrival-time surfaces - act as a frequency-dependent filter that can significantly modify or suppress intrinsic variability. In the constant- $Γ$ case, the angular kernel acts as a stationary low-pass filter that suppresses high-frequency variability without altering its frequency, whereas Blandford-McKee deceleration renders the filter time-dependent and manifests observationally as an apparent frequency drift."}
{"id": "2602.00677", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2602.00677", "abs": "https://arxiv.org/abs/2602.00677", "authors": ["Arul Pandian B", "Joydeep Bagchi", "Prabu Thiagaraj", "K. B. Raghavendra Rao", "Vinutha Chandrashekar", "R Abhishek", "Arasi Sathyamurthy", "Sandhya", "Sahana Bhattramakki", "Kasturi S", "Shiv Sethi"], "title": "GBD-DART-I : Pulsars and transient source observation between 130 MHz and 350 MHz at Gauribidanur", "comment": null, "summary": "Gauribidanur Diamond Array Radio Telescope (GBD-DART) is a new small LPDA antenna array consisting of 64 short dipoles and associated receivers that has been custom developed and deployed at the Gauribidanur observatory (13.604 N, 77.427 E) to study bright Pulsars and Solar transients in the frequency range of 130-350 MHz. The LPDAs are arranged in a checkerboard layout, with opposite pairs combined to enable dual-polarised operation. A diamond-shaped (tilted square) array configuration was chosen to achieve high sidelobe suppression in the East-West and North-South directions. The tile measures 5.9 meters by 5.9 meters, with diagonals along both the North-South and East-West directions, each measuring about 8.4 meters. The LPDA array with one diamond-shaped tile has been fully commissioned and is operating in transit-observing mode, successfully detecting strong pulsars and solar flares over the last seven months. The present digital backend restricts the instantaneous bandwidth for observations to 16 MHz. The array operations are streamlined to facilitate remote operations. Apart from investigating Pulsar and Solar phenomena at low radio frequencies in selected sources, this work aims to provide a training platform for radio astronomy through simple-to-construct, low-cost radio telescopes. In this paper, we present details of the array, including antenna and array response studies, brief descriptions of front-end and backend instrumentation, and illustrative results from observations of both pulsars and solar flares. It will also provide brief details of future upgrade plans, particularly for the tiles and digital backend, to facilitate the observation of additional sources."}
{"id": "2602.00263", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2602.00263", "abs": "https://arxiv.org/abs/2602.00263", "authors": ["R. Alfaro", "C. Alvarez", "E. Anita-Rangel", "M. Araya", "J. C. Arteaga-Velazquez", "D. Avila Rojas", "H. A. Ayala Solares", "P. Bangale", "E. Belmont-Moreno", "A. Bernal", "K. S. Caballero-Mora", "T. Capistran", "A. Carraminana", "F. Carreon", "S. Casanova", "U. Cotti", "J. Cotzomi", "S. Coutino de Leon", "E. De la Fuente", "P. Desiati", "N. Di Lalla", "R. Diaz Hernandez", "B. L. Dingus", "M. A. DuVernois", "J. C. Dıaz-Velez", "K. Engel", "T. Ergin", "C. Espinoza", "K. Fang", "N. Fraija", "S. Fraija", "J. A. Garcıa-Gonzalez", "F. Garfias", "N. Ghosh", "M. M. Gonzalez", "J. A. Gonzalez", "J. A. Goodman", "S. Groetsch", "D. Guevel", "S. Hernandez-Cadena", "F. Hueyotl-Zahuantitla", "P. Huntemeyer", "A. Iriarte", "S. Kaufmann", "D. Kieda", "A. Lara", "K. Leavitt", "T. Lewis", "H. Leon Vargas", "J. T. Linnemann", "A. L. Longinotti", "G. Luis-Raya", "O. Martinez", "J. Martınez-Castro", "H. Martınez-Huerta", "J. A. Matthews", "P. Miranda-Romagnoli", "E. Moreno", "M. Mostafa", "M. Najafi", "A. Nayerhoda", "L. Nellen", "R. Noriega-Papaqui", "N. Omodei", "M. Osorio-Archila", "E. Ponce", "Y. Perez Araujo", "E. G. Perez-Perez", "Q. Remy", "A. Rodriguez Parra", "D. Rosa-Gonzalez", "M. Roth", "H. Salazar", "A. Sandoval", "J. Serna-Franco", "Y. Son", "R. W. Springer", "O. Tibolla", "K. Tollefson", "I. Torres", "R. Torres-Escobedo", "R. Turner", "E. Varela", "L. Villasenor", "I. J. Watson", "H. Wu", "S. Yu", "X. Zhang", "H. Zhou", "C. de Leon"], "title": "The Fourth HAWC Catalog of Very-High-Energy Gamma-Ray Sources", "comment": "27 pages, 21 figures, pending submission to The Astrophysical Journal", "summary": "We present an updated catalog of TeV gamma-ray sources based on the fifth pass of data from the High-Altitude Water Cherenkov (HAWC) Observatory. This release benefits from improved event reconstruction and nearly three additional years of observations. It also incorporates a systematic multi-source fitting framework, enabling more flexible and accurate modeling of the gamma-ray sky. This fitting procedure was modeled after the manual approach used in HAWC analyses of individual sources and regions, as well as other gamma-ray catalogs, like the 4FGL. In addition to more varied modeling of source morphology and spectral parameters compared to previous HAWC catalogs, this catalog uses a robust modeling of Galactic diffuse TeV emission. The fitting procedure uses both point-like and symmetric Gaussian spatial templates to model the source morphology. The spectral shape of the emission is modeled with either a simple power-law or log-parabola to explore curvature in the spectral energy distribution. We report 85 sources at the 4σ level, including 11 sources not associated with any TeVCat source using a distance-based association criterion. Distance-based association with the 1LHAASO catalog results in 22 4HWC sources without a counterpart. Additionally, there are 12 sources not associated with any physical counterpart in the Low- or High-Mass X-Ray Binary, the ATNF, or Fermi Pulsar, or SNR catalogs of sources. Five of the aforementioned sources have no counterpart in any of the catalogs searched and represent an opportunity for follow-up observations."}
{"id": "2602.00691", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2602.00691", "abs": "https://arxiv.org/abs/2602.00691", "authors": ["C. Alispach", "A. Araudo", "A. Bakalová", "M. Balbo", "V. Beshley", "J. Blažek", "J. Borkowski", "T. Bulik", "F. Cadoux", "S. Casanova", "A. Christov", "J. Chudoba", "L. Chytka", "P. Čechvala", "P. Dědic", "Y. Favre", "M. Garczarczyk", "L. Gibaud", "T. Gieras", "E. Głowacki", "P. Hamal", "M. Heller", "M. Hrabovský", "P. Janeček", "M. Jelínek", "V. Jílek", "J. Juryšek", "V. Karas", "B. Lacave", "E. Lyard", "D. Mandát", "W. Marek", "S. Michal", "J. Michałowski", "M. Miroń", "R. Moderski", "T. Montaruli", "A. Muraczewski", "S. R. Muthyala", "A. L. Müller", "A. Nagai", "K. Nalewajski", "D. Neise", "J. Niemiec", "M. Nikołajuk", "V. Novotný", "M. Ostrowski", "M. Palatka", "M. Pech", "M. Prouza", "P. Schovánek", "T. Schulz", "V. Sliusar", "J. Srba", "Ł. Stawarz", "R. Sternberger", "M. Stodulska", "J. Świerblewski", "P. Świerk", "J. Štrobl", "T. Tavernier", "P. Trávníček", "I. Troyano Pujadas", "J. Vícha", "R. Walter", "K. Ziȩtara", "R. Conceição", "L. Gibilisco", "M. Pimenta", "B. Tomé"], "title": "Prospects for the detection of gamma rays using Cherenkov telescopes enhanced by a ground array observatory", "comment": "8 pages, 7 figures. Submitted to Astroparticle Physics", "summary": "We consider the Single-Mirror Small-Size imaging atmospheric Cherenkov Telescopes (SST-1M) to be located inside a high-altitude array of Water-Cherenkov Detectors (WCDs) inspired by the Southern Wide-field Gamma-ray Observatory (SWGO). For such a hybrid observatory, using detailed Monte Carlo simulations, we show an improvement in the flux sensitivity of monocular and stereoscopic SST-1M observation by about 60% and 30% above 10 TeV, respectively, due to the improved gamma/hadron separation when additional parameters from the WCD array are used. We also discuss further benefits of the hybrid SWGO concept and its technical challenges."}
{"id": "2602.00313", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2602.00313", "abs": "https://arxiv.org/abs/2602.00313", "authors": ["Mikhail V. Medvedev", "Andrzej A. Zdziarski"], "title": "Electron-positron cascade in magnetospheres of supermassive Kerr black holes and the origin of relativistic AGN jets", "comment": "10 pages, 1 figure, submitted to ApJ", "summary": "The avalanche mechanism of plasma production in active galactic nuclei (AGNs) is detailed, and constraints on system parameters needed for efficient electron-positron pair cascades are explored. Whether an AGN falls within this favorable parameter range may explain the observed radio-loud versus radio-quiet dichotomy. On the other hand, this study shows that cascades generate orders of magnitude fewer pairs than is necessary to explain the synchrotron emission observed in luminous jets. This fact suggests the existence of either an alternative lepton source, namely pair production of photons from the hot accretion flows around AGN central black holes, or matter loading of the jets from the surrounding medium, or, most likely, both. The case of the radio galaxy 3C 120 is considered in detail."}
{"id": "2602.00736", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2602.00736", "abs": "https://arxiv.org/abs/2602.00736", "authors": ["Arul Pandian B", "Joydeep Bagchi", "Prabu Thiagaraj", "K. B. Raghavendra Rao", "Vinutha Chandrashekar"], "title": "GBD-DART-II: 175 MHz Polarimetric Observation of Pulsars from Gauribidanur and a New Pulsar Signal Processing Pipeline", "comment": null, "summary": "A new pulsar signal-processing pipeline has been developed for observing pulsars with the Diamond Array Radio Telescope at the Gauribidanur radio observatory. The array consists of 32 off-axis dual-polarised LPDAs, with a nominal gain of 22 dBi between 130 and 350 MHz and a 15-degree HPBW at 175 MHz for transit observations on pulsars. Custom-built receivers and real-time data-capture and analysis tools have been developed and used. Receiver output voltages from a transient buffer, as well as full-polar spectral data at both high and low resolutions, suitable for transient searches and pulsar studies. Additionally, full-polar folded profile archives are generated for known pulsars in subintegrations and both coherent and incoherent dedispersion. Custom-developed Python routines, FFT libraries, DSPSR, PSRCHIVE, and Presto modules have been used to build the pipeline. The functionalities of the pipeline were validated with artificially generated pulsar signals and strong celestial sources before it was released for routine observations. Presently, the pipeline is configured to observe pulsars between 170 and 196 MHz, with a daily cadence. Recorded data are reduced in-line immediately following each observation, nearly matching the observation time at a 1:1 ratio. An Intel i9 server captures the data, and an AMD R9 CPU does the primary data reduction. The archives are routinely backed up to a remote system via the internet. The paper presents the architecture of the signal processing pipeline developed, its validation, and initial polarimetric results observing five bright pulsars at 175 MHz. Results also include RM estimates and single-pulse study results for B0953+08, B0531+21, and B1133+16, as well as from monitoring the spin-down of the Crab pulsar over 200 days of observation. Finally, it presents a discussion on the potential improvements for the array."}
{"id": "2602.00662", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2602.00662", "abs": "https://arxiv.org/abs/2602.00662", "authors": ["Xiao-Fei Dong", "Yong-Feng Huang", "Chen Deng", "Ze-Cheng Zou", "Jin-Jun Geng", "Fan Xu", "Chen-Ran Hu", "Orkash Amat", "Xiu-Juan Li", "Liang Li", "Abdusattar Kurban"], "title": "Gamma-Ray Bursts: Evidence for a Common Origin of X-ray Plateaus with Diverse Temporal Decay Index", "comment": "14 pages, 8 figures, 2 tables", "summary": "A significant fraction of gamma-ray bursts (GRBs) exhibit a plateau in the early X-ray afterglow light curve, whose mechanism remains uncertain. While the post-plateau normal decay index ($α_2$) is commonly used to constrain the afterglow dynamics, the shallow-decay slope of the plateau itself ($α_1$) has received comparatively little attention. Recent observations, however, reveal substantial dispersion in $α_1$, raising the question of whether GRBs with rising, flat and mildly decaying plateaus represent intrinsically distinct populations. To address this question, we collect a uniform sample of 185 $\\textit{Swift}$ GRBs with a well-defined plateau and divide them into three groups based on $α_1$. Using a non-parametric approach, we reconstruct their X-ray luminosity functions, redshift distributions and event rates. It is found that the three groups exhibit statistically consistent properties across all diagnostics, with no evidence for group-specific features. Monte Carlo perturbation tests further show that these results are insensitive to the adopted classification boundaries of $α_1$. Our results indicate that variations in the plateau slope $α_1$ do not define distinct GRB subclasses, but instead the sample constitutes a statistically uniform population governed by a common framework."}
{"id": "2602.00779", "categories": ["astro-ph.IM", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2602.00779", "abs": "https://arxiv.org/abs/2602.00779", "authors": ["Wai-Kiu Ricky Wong", "Renbin Yan", "Zesen Lin"], "title": "Method on Using Shadow Altitude to Remove Geocoronal H$α$", "comment": "submitted to Astronomy & Astrophysics", "summary": "Spectroscopic surveys allow spatially resolved spectroscopy of galaxies to study their interstellar medium (ISM). However, observations of Galactic H$α$ emission are contaminated by geocoronal H$α$ emission. The latter is known to depend on the shadow altitude, a geometric parameter relating the line of sight to Earth's shadow cone. Using fibres on blank skys from the SDSS-IV/MaStar survey, we established an empirical relation between the geocoronal H$α$ emission and the shadow altitude, with a root mean square fractional scatter of 23.52$\\%$. This relation can be used to predict geocoronal H$α$ emission so that it can be removed from observed spectra. This removal method is advantageous when the observed targets are extensive in the sky, and it does not require a large velocity separation between the observed target and the local standard of rest. This will enable reliable studies of Galactic H$α$ in intermediate spectral resolution integral field spectroscopic surveys. We also find tentative evidences for the dependences of geocoronal emission on solar activity and the distance between the Earth and the Sun."}
{"id": "2602.00786", "categories": ["astro-ph.HE", "physics.plasm-ph"], "pdf": "https://arxiv.org/pdf/2602.00786", "abs": "https://arxiv.org/abs/2602.00786", "authors": ["L. Gudushauri", "N. L. Shatashvili", "G. Shekiladze", "S. M. Mahajan"], "title": "Flow Generation via Catastrophic Loss of Equilibrium in Weakly-Rotating Self-Gravitating Fluids: A Minimal Idealized Model", "comment": "9 pages, 6 figures, accepted for publication in Phys. Rev. E", "summary": "This paper explores the catastrophic energy transformations, in particular the ones leading to the generation of a flow in a weakly rotating self-gravitating fluid/gas found, for instance, in the vicinity of a massive compact object. Because of the similarity in the governing equations, the system dynamics is worked out exactly in parallel to the methods developed for investigating catastrophic relaxation in stellar plasmas [1-3]. In the latter a more ``complex\" equilibrium state, on slow changes in the environment, can lose its equilibrium (catastrophe), and transform to a less complex state with a very different energy mix from the original. It is shown that a similar transformation in the weakly rotating self-gravitating fluid/gas will convert much of its gravitation energy into kinetic energy in the flow. Since flows are a perennial ingredient of high-energy astrophysical systems, the energy transformation processes revealed in present study, can advance our understanding of a variety of them. Some particularly relevant examples are: macro-scale flows / structures in galaxies, accretion discs, and the dynamics and stability of a rotating star / its atmosphere."}
{"id": "2602.01319", "categories": ["astro-ph.IM", "astro-ph.CO", "gr-qc", "hep-ph"], "pdf": "https://arxiv.org/pdf/2602.01319", "abs": "https://arxiv.org/abs/2602.01319", "authors": ["Yong-Xin Zhang", "Tian-Yang Sun", "Chun-Yu Xiong", "Song-Tao Liu", "Yu-Xin Wang", "Shang-Jie Jin", "Jing-Fei Zhang", "Xin Zhang"], "title": "Factorized neural posterior estimation for rapid and reliable inference of parameterized post-Einsteinian deviation parameters in gravitational waves", "comment": "15 pages, 6 figures", "summary": "The direct detection of gravitational waves (GWs) by LIGO has strikingly confirmed general relativity (GR), but testing GR via GWs requires estimating parameterized post-Einsteinian (ppE) deviation parameters in waveform models. Traditional Bayesian inference methods like Markov chain Monte Carlo (MCMC) provide reliable estimates but suffer from prohibitive computational costs, failing to meet the real-time demands and surging data volume of future GW detectors. Here, we propose a factorized neural posterior estimation framework: we construct independent normalizing flow models for each of the nine ppE deviation parameters and effectively integrate prior information from other source parameters via a conditional embedding network. Leveraging a hybrid neural network with a convolutional neural network and a Residual Neural Network for feature extraction, our method performs rapid and statistically reliable posterior inference directly from binary black hole signals. Compared to conventional MCMC, our approach achieves millisecond-scale inference time with a speedup factor of $9 \\times 10^4$. Comprehensive validations show that the posterior estimates pass the Kolmogorov-Smirnov test and achieve empirical coverage probabilities close to theoretical targets. This work demonstrates the great potential of deep learning for GW parameter estimation and provides a viable technical solution for real-time GR tests with next-generation detectors."}
{"id": "2602.01073", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2602.01073", "abs": "https://arxiv.org/abs/2602.01073", "authors": ["Yuri Sato", "Rin Oikawa", "Kazuma Kato", "Tatsuya Matsumoto", "Kazumi Kashiyama"], "title": "Successive Partial Disruptions with Orbital Precession in a White Dwarf-Black Hole System for Repeating GRB 250702B", "comment": "8 pages, 3 figures", "summary": "The peculiar gamma-ray burst GRB 250702B is the longest event ever observed, lasting about one day and exhibiting four prompt-emission flares of $\\sim100$ s with irregular recurrence intervals of at least one hour. To explain this hierarchy of timescales, we consider a scenario in which a stellar object undergoes repeated partial tidal disruptions by a black hole (BH). We find that if a white dwarf (WD) is on a highly eccentric orbit ($e\\approx0.97$) around an intermediate-mass black hole (BH) with $M_{\\rm BH}\\lesssim10^{6}\\,M_\\odot$ and $a = 50\\,R_\\odot\\left(M_{\\rm BH}/10^{6}\\,M_\\odot\\right)^{1/3}$, the observed properties of GRB 250702B can be naturally reproduced. In this framework, the duration of each flare is determined by the viscous accretion timescale of material stripped near pericenter, with a typical mass $ΔM \\approx 2\\times10^{-2}\\,M_\\odot$. The minimum recurrence time corresponds to the orbital period, while the total activity period is set by the secular orbital evolution timescale leading to the complete disruption of the WD. Furthermore, if $M_{\\rm BH}\\gtrsim10^{5}\\,M_\\odot$ and the orbit has a minimum polar angle relative to the BH equatorial plane of $θ_{\\rm min}\\gtrsim0.12 {\\rm rad}$, relativistic frame dragging induces $\\gtrsim0.1$ rad precession of the orbital angular momentum between successive pericenter passages, comparable to a typical GRB jet half-opening angle, resulting in intermittent alignment with the observer and irregular flare spacing. The WD experiences $\\approx40$ jet-launch episodes before complete disruption, but only four are expected to be observed on-axis. The remaining off-axis jets become visible at late times, enhancing the radio afterglow by about an order of magnitude, providing a testable prediction of this scenario."}
{"id": "2602.02058", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2602.02058", "abs": "https://arxiv.org/abs/2602.02058", "authors": ["Bernardo Cornejo Avila", "Sofia Bisero", "Mickael Costa", "Antoine Ciric", "Ilja Jaroschewski", "Weizmann Kindrébéogo", "Fabian Schussler"], "title": "Astro-COLIBRI: An Innovative Platform for Real-Time Multi-Messenger Astrophysics", "comment": "Proceedings 35th annual conference on Astronomical Data Analysis Software and Systems (ADASS XXXV, Görlitz/Germany, 2025)", "summary": "The discovery of transient phenomena, such as supernovae, novae, Fast Radio Bursts (FRBs), Gamma-Ray Bursts (GRBs), and stellar flares, together with the emergence of new cosmic messengers like high-energy neutrinos and Gravitational Waves (GWs), has revolutionized astrophysics in recent years. To fully exploit the scientific potential of multi-messenger and multi-wavelength follow-up observations, as well as serendipitous detections, researchers need a tool capable of rapidly compiling and contextualizing essential information for every new event. We present Astro-COLIBRI, an advanced platform designed to meet this challenge.\n  Astro-COLIBRI is a comprehensive platform that combines a public RESTful API, real-time databases, a cloud-based alert system, and user-friendly interfaces including a website and mobile app for iOS and Android. It ingests alerts from multiple sources in real time, applies user-defined filters, and situates each event within its multi-messenger and multi-wavelength context. The platform provides clear data visualization, concise summaries of key event properties, and evaluations of observing conditions across a wide network of observatories worldwide. We here detail the architecture of Astro-COLIBRI, from the data pipelines that manage real-time alert ingestion and processing to the design of the RESTful API, which enables seamless integration with other astronomical software and services."}
{"id": "2602.01097", "categories": ["astro-ph.HE", "physics.plasm-ph"], "pdf": "https://arxiv.org/pdf/2602.01097", "abs": "https://arxiv.org/abs/2602.01097", "authors": ["Mukesh Kumar Vyas", "Asaf Pe'er"], "title": "Radiation-Driven Origin of Super-Equipartition Magnetic Fields in Accretion Discs and Outflows", "comment": "14 pages, 5 Figures", "summary": "Magnetic fields play a central role in accretion physics around black holes, yet their physical origin within accretion flows remains an open problem. In this work, we investigate the generation and subsequent evolution of magnetic fields triggered by anisotropic radiation fields in black hole accretion discs with compact rotating inner corona. We self-consistently evolve the magnetic field using the generalized field evolution MHD equation, including advection, shear-driven induction, and Hall effects. The radiation field acts as a primary field generator, while azimuthal rotation in the magnetized plasma provides rapid amplification. We find that radiation-generated fields efficiently reach a dominant toroidal component by Keplerian rotation, leading to magnetic field strengths of order $\\sim 10^{8}\\,\\mathrm{G}$ in the vicinity of a 10 solar mass black hole and accretion disc-corona emitting at luminosity equivalent to the Eddington unit. These magnetic fields are achieved within viscous timescales and reach or exceed local equipartition estimates based on gas pressure. When vertical outflows are included, the amplified magnetic fields are advected into the corona, magnetizing disc-launched winds and jet precursors with field strengths of similar order. Our results demonstrate that radiation is not merely a passive component of accretion flows, but provides a robust and unavoidable trigger for the generation of dynamically significant magnetic fields. Our results provide a physically grounded explanation for the origin of large-scale, structured magnetic fields in and around accretion discs. This mechanism offers a pathway for magnetizing accretion discs and their outflows without invoking externally supplied magnetic flux, with broad implications for X-ray binaries, active galactic nuclei and other transients such as gamma-ray bursts (GRBs)."}
{"id": "2602.02134", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2602.02134", "abs": "https://arxiv.org/abs/2602.02134", "authors": ["Bernard J. Rauscher", "D. J. Fixsen"], "title": "JWST NIRSpec's Cosmic Ray Experience at L2", "comment": null, "summary": "We characterize cosmic ray interactions in blanked-off \\JWST NIRSpec ``dark'' exposures. In its Sun/Earth-Moon L2 halo orbit, \\JWST encounters energetic ions that penetrate NIRSpec's radiation shielding. The shielded cosmic ray hit rate decreased from approximately $4.3$ to $2.3~\\mathrm{ions~cm^{-2}}~s^{-1}$ during the first three years of operation. A typical hit affects about 7.1~pixels necessitating mitigation during calibration and deposits around $6~\\mathrm{keV}$ in the $λ_\\mathrm{co} = 5.4~μ$m HgCdTe detector material (equivalent to $\\sim5200$ charges). The corresponding linear energy transfer is about $0.86~\\mathrm{keV~μm^{-1}}$. As we are currently near solar maximum, galactic cosmic ray flux is expected to increase as solar activity declines, leading to an anticipated rise in the NIRSpec rate from $2.3$ to $4.3~\\mathrm{ions~cm^{-2}}~s^{-1}$ by early 2027 and potentially reaching $\\sim6~\\mathrm{ions~cm^{-2}}~s^{-1}$ in the early 2030s. We investigate rare, large ``snowball'' hits and, less frequently, events with secondary showers that pose significant calibration challenges. We explore their possible origins as heavy ions, secondary particles from shielding, or inelastic scattering in the HgCdTe detector material. We discuss the implications of these findings for future missions including the Nancy Grace Roman Space Telescope."}
{"id": "2602.01373", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2602.01373", "abs": "https://arxiv.org/abs/2602.01373", "authors": ["Wen-Zhong Li", "Shu Zhang", "Qing-Cang Shui", "Yu-Peng Chen", "Shuang-Nan Zhang", "Hua Feng", "Ming-Yu Ge", "Lian Tao", "Jing-Qiang Peng", "Bo-Yan Chen", "Ling-Da Kong", "Peng-Ju Wang"], "title": "Investigation on Quasi-periodic Oscillation Phase Lag of RE J1034+396", "comment": "15 pages, 7 figures, accepted by ApJ", "summary": "We conduct an in-depth study of the quasi-periodic oscillation (QPO) properties of RE J1034+396, by constructing QPO phase-folded light curves from 10 XMM-Newton observations during 2020-2021. Our analysis reveals that the QPO in the source exhibits two mutually convertible lag-energy modes: \"hard lag\" and \"soft lag\". Despite different lag characteristics, the energy dependency of the root mean square (RMS) amplitude of the QPO under both modes are consistent, suggesting the two types of QPO originate from the same physical mechanism. By performing a spectral analysis, we further find a correlation between time-lag modes and spectral states: the soft lag mode typically corresponds to harder X-ray spectra and higher blackbody temperatures. Through comprehensive comparison of multiple theoretical models, we propose that the relativistic precession model (RPM) of the corona provides a plausible qualitative explanation for the observed complex phenomena, including time-lag mode transitions, and variations of spectral hardness and QPO signal strength."}
{"id": "2602.02203", "categories": ["astro-ph.IM", "gr-qc"], "pdf": "https://arxiv.org/pdf/2602.02203", "abs": "https://arxiv.org/abs/2602.02203", "authors": ["Lavinia Heisenberg", "Henri Inchauspé", "Sarah Paczkowski", "Ricardo Waibel"], "title": "LISA Non-Linear Dynamics and Tilt-To-Length Coupling", "comment": "31 pages, 22 figures", "summary": "For the LISA mission, Tilt-To-Length (TTL) coupling is expected to be one of the dominant instrumental noise contributions after laser frequency noise is suppressed based, on assumptions on the size of the coupling and angular jitter levels. This work uses for the first time a closed-loop, non-linear, and time-varying dynamics implementation to simulate detailed angular jitters for the spacecraft and optical benches. In turn, this gives an improved expectation of the TTL contribution to the interferometric output. It is shown that the TTL coupling impact is limited given current estimates on the size of coupling coefficients. A time-domain Least Squares estimator is used to infer the TTL parameters from the simulated measurements. The bias and correlations limit the estimator in the case of regular datasets with amplified TTL coefficients to a relative error of $10\\%$, but the subtraction of the TTL signal still works well. For lower readout noises, the estimation error diverges, which can be mitigated using a regularization term. Alternatively, using sinusoidal maneuvers improves the inference to a high accuracy of $0.1\\%$ for TTL coefficients around the expected level, removing all correlations in the inferred parameters. This validates the maneuver design by Wegener et al. (2025) in this closed-loop setting."}
{"id": "2602.01597", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2602.01597", "abs": "https://arxiv.org/abs/2602.01597", "authors": ["Luana Passos-Reis", "Elisabete M. de Gouveia Dal Pino", "Tarek Hassan", "Santiago Pita", "Alberto Domínguez"], "title": "A Catalogue of Variable Active Galactic Nuclei Based on Multi-Timescale Variability Analysis from Fermi-LAT Data", "comment": "4 pages, 1 figure, 1 table. Presented at High Energy Phenomena in Relativistic Outflows IX (HEPRO-IX), 2025", "summary": "Active Galactic Nuclei (AGN) sources feature supermassive black holes that launch relativistic plasma jets. They are key $γ$-ray sources providing a unique laboratory for studying extreme particle acceleration and plasma physics. Variability in $γ$-ray emission is an important signature that may constrain the size of the emission region and the physical processes driving flares. However, current large-scale $γ$-ray catalogs, such as the Fermi-LAT 4LAC-DR3, typically characterize variability only on long timescales (yearly or 60-day), lacking necessary constraints on short-term behavior from days to weeks. To address this, we systematically characterize $γ$-ray variability in AGNs across short timescales: 3-day, 7-day (weekly), and 30-day (monthly). We present a preliminary catalogue of variable AGN based on light curves from the Fermi-LAT Light Curve Repository. We show that the variability amplitude ($σ_{\\rm NXS}^{2}$) presents similar values across different timescales, potentially increasing for a subsample of sources as the observation timescale increases. This high-cadence analysis reinforces the known dichotomy between flat-spectrum radio quasars (FSRQs) and BL Lacertae objects (BL Lacs), with FSRQs consistently exhibiting stronger variability. By identifying the most luminous and variable sources at each timescale, we highlight key targets for follow-up with next-generation observatories such as the Cherenkov Telescope Array Observatory (CTAO), ASTRI Mini-Array, and the Southern Wide-field Gamma-ray Observatory (SWGO), where strong short-term variability suggests highly compact emission zones and extreme particle acceleration efficiency. This catalogue contributes to the understanding of high-energy outflows in AGN jets and provides a foundation for optimizing observational strategies through a unified variability metric across timescales."}
{"id": "2602.02253", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2602.02253", "abs": "https://arxiv.org/abs/2602.02253", "authors": ["Bernard J. Rauscher", "Dale J. Fixsen", "Gregory Mosby"], "title": "Simple Improved Reference Subtraction for H4RG, H2RG, and H1RG Near-infrared Array Detectors", "comment": null, "summary": "Teledyne's H4RG, H2RG, and H1RG near-infrared array detectors provide reference pixels embedded in their data streams. Although they do not respond to light, the reference pixels electronically mimic normal pixels and track correlated read noise. In this paper, we describe how the reference pixels can be used with linear algebra and training data to optimally reduce correlated read noise. Simple Improved Reference Subtraction (SIRS) works with common detector clocking patterns and, when applicable, relies only on post-processing existing data so long as the reference pixels are available. The resulting reference correction is optimal, in a least squares sense, when the embedded reference pixels are the only references and the reference columns on the left and right are treated as two reference streams. We demonstrate SIRS using H4RG ground test data from the Nancy Grace Roman Space Telescope Project. The Julia language SIRS software is freely available for download from the NASA GitHub. The package includes a python-3 ``backend'' that can be used to apply SIRS corrections if a SIRS calibration file has been provided by the instrument builders."}
{"id": "2602.01647", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2602.01647", "abs": "https://arxiv.org/abs/2602.01647", "authors": ["Vaidehi S. Paliya", "S. Marchesi", "X. Zhao", "D. J. Saikia", "Moumita Pal", "Somak Raychaudhury"], "title": "A Serendipitous NuSTAR Detection of a Giant Radio Source Harboring an Obscured Active Galactic Nucleus", "comment": "ApJ, in press", "summary": "Giant radio sources (GRSs) harbor the Universe's largest structures generated by individual galaxies, with projected source sizes exceeding 700 kpc. These enigmatic objects have been mainly studied at radio frequencies, and their physical properties in the high-energy domain are poorly understood. Here we present the results of a multiwavelength study focused on NuSTAR J112829+5831.8 (J1128+5831), the only known GRS serendipitously detected with the Nuclear Spectroscopic Telescope Array. Being located in proximity to the famous interacting galaxy system, Arp 299, J1128+5831 has been serendipitously observed also by the Chandra X-ray Observatory, Hubble Space Telescope, and XMM-Newton satellites. From radio observations with the Low Frequency Array, the NRAO VLA Sky Survey and the Very Large Array Sky Survey, we have determined that J1128+5831 has an overall steep radio spectrum ($α=-0.86$; $F_ν\\proptoν^α$) and a low core dominance ($C_{\\rm D}=-2.4$, in log-scale), indicating the source to be viewed at large angles. From the X-ray spectral analysis, we found J1128+5831 to harbor an obscured active galactic nucleus (AGN) with neutral hydrogen column density exceeding $10^{23}$ cm$^{-2}$. Its optical spectrum, taken with the Dark Energy Spectroscopic Instrument, exhibits prominent narrow emission lines but lacks broad components, thus confirming J1128+5831 to be a Type 2 AGN powered by a radiatively efficient accreting system. Overall, the broadband properties of J1128+5831 are consistent with those observed for the general GRS population."}
{"id": "2602.02279", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2602.02279", "abs": "https://arxiv.org/abs/2602.02279", "authors": ["Thomas Birbacher", "Jonah T. Hansen", "Felix A. Dannert", "Germain Garreau", "Adrian M. Glauser", "Ryan Meierhofer", "Julio Pino Jiménez", "Mohanakrishna Ranganathan", "Sascha P. Quanz"], "title": "The Nulling Interferometry Cryogenic Experiment (NICE): Architecture, requirements, and preliminary warm precursor results", "comment": "27 pages, 8 figures", "summary": "The success of the Large Interferometer For Exoplanets (LIFE) space mission depends on measuring the faint mid-infrared emission spectra of exoplanets while suppressing the glare of a host star. This requires an instrument capable of high-contrast nulling interferometry with exceptional sensitivity. While previous testbeds have proven the principle of deep, stable nulls, they have not combined high contrast with the high throughput and cryogenic operation required for LIFE. Here, we present the architecture of the Nulling Interferometry Cryogenic Experiment (NICE), a mid-infrared nulling testbed, to increase the technological readiness of LIFE. We derive the laboratory requirements necessary to validate the LIFE beam combiner and present the optical design of NICE. Finally, we report results from the ambient \\enquote{Warm Bench} precursor, which has successfully demonstrated the required null depth ($< 10^{-5}$) using a polarized narrowband 4.7 um source, and the required throughput (> 17%) using one of the two nulling channels."}
{"id": "2602.01659", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2602.01659", "abs": "https://arxiv.org/abs/2602.01659", "authors": ["Fan Zhang"], "title": "Revisiting neutrino-driven magnetogenesis during stellar core collapse", "comment": "7 pages, 8 figures", "summary": "The literature has not converged onto a precise depiction of the magnetogenesis process for pulsars, and it is profitable to preliminarily but exhaustively assess the viability of the plethora of alternative proposals, before substantial efforts are invested into simulating them in detail. In this note, we tackle one of them, taking notice of an earlier work that suggests neutrino ponderomotive force could spawn a magnetic field not so far off from pulsar strengths. We reexamine this mechanism with more modern technology, accounting for actual core collapse dynamics, and show that this mechanism is likely less powerful than originally envisioned."}
{"id": "2602.02321", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2602.02321", "abs": "https://arxiv.org/abs/2602.02321", "authors": ["J. R. Peterson", "D. Valls-Gabaud", "A. Dutta", "C. Kim", "G. Sembroski"], "title": "Surface Interactions in Photon Monte Carlo Simulations", "comment": "21 pages, 10 figures, ApJ Accepted", "summary": "We implement a comprehensive simulation of photon surface interactions using a Monte Carlo approach. This is effective in simulating the interaction of light with telescope mirrors and lenses. We use a full electromagnetic solution to simulate the wavelength and angular dependence at surfaces. This includes bare interfaces, monolayer interfaces, protected layer coatings, and multilayer coatings. We handle special cases when multilayer data is incomplete or when there is photo-conversion in the interface as with sensors. We implement interactions with surface micro-roughness and predict the corresponding angular distribution using a Monte Carlo implementation of the Harvey-Shack scatter theory for a microroughness power spectrum. Finally, we simulate surface interaction with contamination from dust or condensation using Mie scattering applied efficiently to individual contaminants. The combination of these implementations can efficiently simulate rough to polished surfaces of arbitrary materials that are fully cleaned or dusty. The observational consequences includes complex wavelength and spatial-dependent photometric errors, the dominant effect of the wings of point-spread-functions, dust rings, and wavelength and angle-dependent throughput losses. We find agreement with the point-spread-function wings of WIYN ODI observations of bright stars and properties of dust rings, and demonstrate the ability to disentangle mirror microroughness from the turbulence PSF patterns. The comprehensive numerical implementation of surface interactions has wide applicability in non-astronomical applications as well."}
{"id": "2602.01702", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2602.01702", "abs": "https://arxiv.org/abs/2602.01702", "authors": ["Bo-Yan Chen", "Shu Zhang", "Qing-Cang Shui", "Peng-Ju Wang", "Long Ji", "Ling-Da Kong", "Shuang-Nan Zhang", "Hua Feng", "Yu-Peng Chen", "Ming-Yu Ge", "Jing-Qiang Peng", "Wen-zhong Li"], "title": "Discovery of a New Spectral Transition in Swift J0243.6+6124 in the Sub-Eddington Regime", "comment": "19 pages, 10 figures. Accepted for publication in ApJ", "summary": "We conduct a detailed spectral analysis of the Galactic ultraluminous X-ray pulsar Swift J0243.6+6124 in its sub-Eddington regime, using Insight-HXMT and NICER observations during multiple outbursts including the 2018 giant outburst. We discover a new transition at $L_{\\rm t} \\approx 4.5 \\times 10^{37}\\ {\\rm erg\\ s^{-1}}$, accompanied by systematic evolution of spectral parameters, in particular a significant turnover in the blackbody normalization. This transition luminosity in the sub-Eddington regime represents the fifth transition identified so far in Swift J0243.6+6124, further highlighting the complexity of its accretion-powered emission. We interpret the transition in terms of a multipolar magnetic-field configuration, where weak ($\\sim 2.8 \\times 10^{12}\\ {\\rm G}$) and strong ($\\sim 1.6 \\times 10^{13}\\ {\\rm G}$) magnetic poles dominate the emission at different accretion rates. On the magnetospheric scale, this configuration is equivalent to an effective dipole field of $\\sim 6.6 \\times 10^{12}\\ {\\rm G}$, while allowing the local surface field to exceed $10^{13}\\ {\\rm G}$."}
{"id": "2602.02442", "categories": ["astro-ph.IM", "physics.ins-det"], "pdf": "https://arxiv.org/pdf/2602.02442", "abs": "https://arxiv.org/abs/2602.02442", "authors": ["Field R. Rogers", "Sean N. Pike", "Samer Alnussirat", "Robin Anthony-Petersen", "Steven E. Boggs", "Felix Hagemann", "Sophia E. Haight", "Alyson Joens", "Carolyn Kierans", "Alexander Lowell", "Brent Mochizuki", "Albert Y. Shih", "Clio Sleator", "John A. Tomsick", "Andreas Zoglauer"], "title": "Depth Calibration of Double-sided Strip Germanium Detectors for the Compton Spectrometer and Imager Satellite", "comment": "Manuscript accepted at NIM A. 9 pages, 8 figures", "summary": "Double-sided strip high-purity germanium detectors with three-dimensional position reconstruction capability have been developed over three decades, with space-based applications in high-energy astrophysics and heliophysics. Position resolution in three dimensions is key to reconstruction of Compton scattering events, including for the upcoming Compton Spectrometer and Imager (COSI) satellite mission. Two-dimensional position reconstruction is enabled by segmentation of the two detector faces into orthogonal strip contacts, enabling a pixelized analysis. The depth of an interaction cannot be measured directly but must be inferred from the charge collection time difference between the two faces of the detector. Here, we demonstrate for the first time the depth calibration of a detector with the COSI satellite geometry read out using an application specific integrated circuit (ASIC) developed for the COSI mission. In this work, we map collection time difference to depth using the Julia-based simulation package SolidStateDetectors$.$jl and validate it with comparison to the timing distributions observed in data. We also use simulations and data to demonstrate the depth resolution on a per-pixel basis, with >90% of pixels having <0.9 mm (FWHM) resolution at 59.5 keV and <0.6 mm (FWHM) resolution at 122.1 keV."}
{"id": "2602.02225", "categories": ["astro-ph.HE", "hep-th"], "pdf": "https://arxiv.org/pdf/2602.02225", "abs": "https://arxiv.org/abs/2602.02225", "authors": ["Shad Ali"], "title": "A model for the emission of SGRBs-GW from binary mergers", "comment": "139 Pages, 23 figures, Postdoctoral Report", "summary": "This report is divided into three main parts:\n   1. The first two chapters discuss the emission of Short GRB (SGRB) from binary mergers surrounded by a strong magnetic field. By introducing our model, we investigated the physics of the emission of SGRBs from rotating and charged rotating BHs. A rapidly spinning, strongly magnetized neutron star (millisecond magnetar) is the primary source of strong magnetic fields ranging from $10^{13}~\\rm to ~ 10^{16} G$. The decay of the magnetic field could power electromagnetic radiation, especially X-rays and gamma rays from NSs or NS-BH mergers as their primary sources. Considering the merger of compact bodies (NS-NS or NS-BH or BH-BH), we can obtain interesting results.\n  2. In the next two chapters, we reviewed the BH interiors to understand the nature of black hole interior information and evaporation from its initial to final phases via entropy variation. The evolution relation obtained from two types of entropy gives diverse understandings of the evaporation of BHs under Hawking radiation.\n  3. The fifth Chapter is related to BH configuration (information) entropy and the thermodynamic phase transition of $f(R)$ BH. Here, we consider a d$-$dimensional black hole (BH) in $f(R)$ gravity and analyze the effect of modified gravity on critical point parameters, the difference in number densities, and configuration entropy during the BH phase transition phenomenon. These results were also compared with charged AdS BH, the holographic dual of van der Waal's fluid, and hence the BH in modified gravity."}
{"id": "2602.02461", "categories": ["astro-ph.IM", "physics.space-ph"], "pdf": "https://arxiv.org/pdf/2602.02461", "abs": "https://arxiv.org/abs/2602.02461", "authors": ["Phoenix Alpine", "Ana M. Botti", "Brenda A. Cervantes-Vergara", "Claudio R. Chavez", "Fernando Chierchie", "Alex Drlica-Wagner", "Juan Estrada", "Erez Etzion", "Michael Lembeck", "Pilar López Maggi", "Joseph Noonan", "Brandon Roach", "Nathan Saffold", "Javier Tiffenberg"], "title": "X-ray characterization of fully-depleted p-channel Skipper-CCDs for the DarkNESS mission", "comment": null, "summary": "The Dark matter Nanosatellite Equipped with Skipper Sensors (DarkNESS) mission is a 6U CubeSat designed to search for X-ray lines from decaying dark matter using Skipper-CCDs. Thick, fully-depleted p-channel Skipper-CCDs provide low readout noise and high quantum efficiency for 1-10 keV X-rays, but their X-ray performance has not yet been demonstrated in the space environment. DarkNESS will operate in low-Earth orbit, where trapped protons induce displacement damage in the sensor that increases charge-transfer inefficiency and degrades the X-ray energy resolution. This work measures the X-ray line response of Skipper-CCDs before and after proton irradiation and quantifies the associated degradation. A sensor was exposed to 217 MeV protons at a fluence of 8.4 x 10^10 protons cm^-2, corresponding to a displacement-damage dose more than an order of magnitude above the three-year expectation for representative mid-inclination and Sun-synchronous low-Earth orbits. A 55Fe source was used to compare the energy resolution of the beam-exposed quadrant to adjacent unexposed quadrants and a non-irradiated reference sensor. These measurements provide a quantitative assessment of radiation-induced spectral degradation in Skipper-CCDs and enable an estimate of the end-of-life X-ray energy resolution expected for DarkNESS operation in low-Earth orbit."}
{"id": "2602.02275", "categories": ["astro-ph.HE", "hep-ex"], "pdf": "https://arxiv.org/pdf/2602.02275", "abs": "https://arxiv.org/abs/2602.02275", "authors": ["The Pierre Auger Collaboration", "A. Abdul Halim", "P. Abreu", "M. Aglietta", "I. Allekotte", "K. Almeida Cheminant", "A. Almela", "R. Aloisio", "J. Alvarez-Muñiz", "A. Ambrosone", "J. Ammerman Yebra", "L. Anchordoqui", "B. Andrada", "L. Andrade Dourado", "L. Apollonio", "C. Aramo", "E. Arnone", "J. C. Arteaga Velázquez", "P. Assis", "G. Avila", "E. Avocone", "A. Bakalova", "A. Baluta", "F. Barbato", "A. Bartz Mocellin", "C. Berat", "M. E. Bertaina", "M. Bianciotto", "P. L. Biermann", "V. Binet", "K. Bismark", "T. Bister", "J. Biteau", "J. Blazek", "J. Blümer", "M. Boháčová", "D. Boncioli", "C. Bonifazi", "N. Borodai", "J. Brack", "P. G. Brichetto Orchera", "A. Bueno", "S. Buitink", "M. Büsken", "A. Bwembya", "K. S. Caballero-Mora", "S. Cabana-Freire", "L. Caccianiga", "F. Campuzano", "J. Caraça-Valente", "R. Caruso", "A. Castellina", "F. Catalani", "G. Cataldi", "L. Cazon", "M. Cerda", "B. Čermáková", "A. Cermenati", "K. Cerny", "J. A. Chinellato", "J. Chudoba", "L. Chytka", "R. W. Clay", "A. C. Cobos Cerutti", "R. Colalillo", "R. Conceição", "G. Consolati", "M. Conte", "F. Convenga", "D. Correia dos Santos", "P. J. Costa", "C. E. Covault", "M. Cristinziani", "C. S. Cruz Sanchez", "S. Dasso", "K. Daumiller", "B. R. Dawson", "R. M. de Almeida", "E. -T. de Boone", "B. de Errico", "J. de Jesús", "S. J. de Jong", "J. R. T. de Mello Neto", "I. De Mitri", "D. de Oliveira Franco", "F. de Palma", "V. de Souza", "E. De Vito", "A. Del Popolo", "O. Deligny", "N. Denner", "K. Denner Syrokvas", "L. Deval", "A. di Matteo", "C. Dobrigkeit", "J. C. D'Olivo", "L. M. Domingues Mendes", "Y. Dominguez Ballesteros", "Q. Dorosti", "R. C. dos Anjos", "J. Ebr", "F. Ellwanger", "R. Engel", "I. Epicoco", "M. Erdmann", "A. Etchegoyen", "C. Evoli", "H. Falcke", "G. Farrar", "A. C. Fauth", "T. Fehler", "F. Feldbusch", "A. Fernandes", "M. Fernández Alonso", "B. Fick", "J. M. Figueira", "P. Filip", "A. Filipčič", "T. Fitoussi", "B. Flaggs", "T. Fodran", "A. Franco", "M. Freitas", "T. Fujii", "A. Fuster", "C. Galea", "B. García", "C. Gaudu", "P. L. Ghia", "U. Giaccari", "C. Glaser", "F. Gobbi", "F. Gollan", "G. Golup", "M. Gómez Berisso", "P. F. Gómez Vitale", "J. P. Gongora", "J. M. González", "N. González", "D. Góra", "A. Gorgi", "M. Gottowik", "F. Guarino", "G. P. Guedes", "L. Gülzow", "S. Hahn", "P. Hamal", "M. R. Hampel", "P. Hansen", "V. M. Harvey", "A. Haungs", "T. Hebbeker", "C. Hojvat", "J. R. Hörandel", "P. Horvath", "M. Hrabovský", "T. Huege", "A. Insolia", "P. G. Isar", "M. Ismaiel", "P. Janecek", "V. Jilek", "K. -H. Kampert", "B. Keilhauer", "A. Khakurdikar", "V. V. Kizakke Covilakam", "H. O. Klages", "M. Kleifges", "J. Köhler", "F. Krieger", "M. Kubatova", "N. Kunka", "B. L. Lago", "N. Langner", "N. Leal", "M. A. Leigui de Oliveira", "Y. Lema-Capeans", "A. Letessier-Selvon", "I. Lhenry-Yvon", "L. Lopes", "J. P. Lundquist", "M. Mallamaci", "S. Mancuso", "D. Mandat", "P. Mantsch", "F. M. Mariani", "A. G. Mariazzi", "I. C. Mariş", "G. Marsella", "D. Martello", "S. Martinelli", "M. A. Martins", "H. -J. Mathes", "J. Matthews", "G. Matthiae", "E. Mayotte", "S. Mayotte", "P. O. Mazur", "G. Medina-Tanco", "J. Meinert", "D. Melo", "A. Menshikov", "C. Merx", "S. Michal", "M. I. Micheletti", "L. Miramonti", "M. Mogarkar", "S. Mollerach", "F. Montanet", "L. Morejon", "K. Mulrey", "R. Mussa", "W. M. Namasaka", "S. Negi", "L. Nellen", "K. Nguyen", "G. Nicora", "M. Niechciol", "D. Nitz", "D. Nosek", "A. Novikov", "V. Novotny", "L. Nožka", "A. Nucita", "L. A. Núñez", "S. E. Nuza", "J. Ochoa", "M. Olegario", "C. Oliveira", "L. Östman", "M. Palatka", "J. Pallotta", "S. Panja", "G. Parente", "T. Paulsen", "J. Pawlowsky", "M. Pech", "J. Pękala", "R. Pelayo", "V. Pelgrims", "E. E. Pereira Martins", "C. Pérez Bertolli", "L. Perrone", "S. Petrera", "C. Petrucci", "T. Pierog", "M. Pimenta", "M. Platino", "B. Pont", "M. Pourmohammad Shahvar", "P. Privitera", "C. Priyadarshi", "M. Prouza", "K. Pytel", "S. Querchfeld", "J. Rautenberg", "D. Ravignani", "J. V. Reginatto Akim", "A. Reuzki", "J. Ridky", "F. Riehn", "M. Risse", "V. Rizi", "E. Rodriguez", "G. Rodriguez Fernandez", "J. Rodriguez Rojo", "S. Rossoni", "M. Roth", "E. Roulet", "A. C. Rovero", "A. Saftoiu", "M. Saharan", "F. Salamida", "H. Salazar", "G. Salina", "P. Sampathkumar", "N. San Martin", "J. D. Sanabria Gomez", "F. Sánchez", "E. Santos", "F. Sarazin", "R. Sarmento", "R. Sato", "P. Savina", "V. Scherini", "H. Schieler", "M. Schimassek", "M. Schimp", "D. Schmidt", "O. Scholten", "H. Schoorlemmer", "P. Schovánek", "F. G. Schröder", "J. Schulte", "T. Schulz", "S. J. Sciutto", "M. Scornavacche", "A. Sedoski", "S. Sehgal", "S. U. Shivashankara", "G. Sigl", "K. Simkova", "F. Simon", "R. Šmída", "S. Soares Sippert", "P. Sommers", "R. Squartini", "M. Stadelmaier", "S. Stanič", "J. Stasielak", "P. Stassi", "S. Strähnz", "M. Straub", "T. Suomijärvi", "A. D. Supanitsky", "Z. Svozilikova", "Z. Szadkowski", "F. Tairli", "M. Tambone", "A. Tapia", "C. Taricco", "C. Timmermans", "O. Tkachenko", "P. Tobiska", "C. J. Todero Peixoto", "B. Tomé", "A. Travaini", "P. Travnicek", "C. Trimarelli", "M. Tueros", "M. Unger", "R. Uzeiroska", "L. Vaclavek", "M. Vacula", "I. Vaiman", "J. F. Valdés Galicia", "L. Valore", "P. van Dillen", "E. Varela", "V. Vašíčková", "A. Vásquez-Ramírez", "D. Veberič", "I. D. Vergara Quispe", "S. Verpoest", "V. Verzi", "J. Vicha", "S. Vorobiov", "J. B. Vuta", "C. Watanabe", "A. A. Watson", "A. Weindl", "M. Weitz", "L. Wiencke", "H. Wilczyński", "B. Wundheiler", "B. Yue", "A. Yushkov", "E. Zas", "D. Zavrtanik", "M. Zavrtanik"], "title": "Search for ultra-high energy neutrons from Galactic sources with the Pierre Auger Observatory", "comment": "13 pages, 6 tables, 1 figure", "summary": "Deflections in the propagation of charged ultra-high-energy cosmic rays (UHECRs) caused by magnetic fields make the identification of their sources challenging. On the other hand, the arrival directions at Earth of neutrons point directly to their origin. The emission of UHECRs from a source is expected to be accompanied by the production of neutrons in its vicinity through interactions with ambient matter and radiation. Since free neutrons travel a mean distance $d/\\text{kpc}=9.2(E/\\text{EeV})$ before decaying, a neutron flux in the EeV range could be detected on Earth from sources of UHECRs in our Galaxy. Using cosmic-ray data from the Phase\\,I of the Surface Detector of the Pierre Auger Observatory, we search for neutron fluxes from Galactic candidate sources. We select more than 1000 objects of astrophysical interest, stacking them into target sets. The targets all have declinations within the exposure of the Observatory, ranging from $-90^\\circ$ up to $+45^\\circ$ for energies above 1 EeV (and up to $+20^\\circ$ for energies down to 0.1 EeV). Given that a neutron air shower is indistinguishable from a proton one, there is a significant background due to cosmic rays. A neutron flux from the direction of a candidate source would be identified by a celestial density of events that significantly exceeds the expected density of cosmic rays for that direction. No significant excess is found at any tested target direction, and an upper limit on the neutron flux is calculated for each candidate source."}
{"id": "2602.02367", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2602.02367", "abs": "https://arxiv.org/abs/2602.02367", "authors": ["Shiqi Yu", "Bing Theodore Zhang"], "title": "Multi-Messenger Modeling of Low-Luminosity Gamma-Ray Bursts", "comment": "14 pages plus 3 pages of appendix. 11 figures and 5 tables in total. accepted by APJ", "summary": "Low-luminosity gamma-ray bursts (LL GRBs), a subclass of the most powerful transients in the Universe, remain promising sources of high-energy astrophysical neutrinos, despite strong IceCube constraints on typical long GRBs. In this work, a novel approach is introduced to study a sample of seven LL~GRBs with their multi-wavelength observations to investigate leptohadronic processes during their prompt emission phases. The relative energy densities in magnetic fields, non-thermal electrons, and protons are constrained, with the latter defining the cosmic-ray (CR) loading factor. Our results suggest that LL~GRBs exhibit diverse emission processes, as confirmed by a machine-learning analysis of the fitted parameters. Across the seven LL~GRBs, we find the posterior medians of the CR loading factor in the range of $ξ_p \\sim 0.2$--$1.6$. GRB~060218 and GRB~100316D, the lowest-luminosity bursts ($L_{γ, \\rm iso} \\sim 10^{46}$-$10^{47}\\rm~erg~s^{-1}$) consistent with the shock-breakout (SBO) scenario, yield the highest CR loading factor and therefore are expected to produce neutrinos more efficiently. Our model predicts the expected number of neutrino signals that are consistent with current limits but would be detectable with next-generation neutrino observatories. These results strengthen the case for LL~GRBs as promising sources of high-energy astrophysical neutrinos and motivate real-time searches for coincident LL~GRB and neutrino events. Next-generation X-ray and MeV facilities will be critical for identifying more LL~GRBs and strengthening their role in multi-messenger astrophysics."}
{"id": "2602.02367", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2602.02367", "abs": "https://arxiv.org/abs/2602.02367", "authors": ["Shiqi Yu", "Bing Theodore Zhang"], "title": "Multi-Messenger Modeling of Low-Luminosity Gamma-Ray Bursts", "comment": "14 pages plus 3 pages of appendix. 11 figures and 5 tables in total. accepted by APJ", "summary": "Low-luminosity gamma-ray bursts (LL GRBs), a subclass of the most powerful transients in the Universe, remain promising sources of high-energy astrophysical neutrinos, despite strong IceCube constraints on typical long GRBs. In this work, a novel approach is introduced to study a sample of seven LL~GRBs with their multi-wavelength observations to investigate leptohadronic processes during their prompt emission phases. The relative energy densities in magnetic fields, non-thermal electrons, and protons are constrained, with the latter defining the cosmic-ray (CR) loading factor. Our results suggest that LL~GRBs exhibit diverse emission processes, as confirmed by a machine-learning analysis of the fitted parameters. Across the seven LL~GRBs, we find the posterior medians of the CR loading factor in the range of $ξ_p \\sim 0.2$--$1.6$. GRB~060218 and GRB~100316D, the lowest-luminosity bursts ($L_{γ, \\rm iso} \\sim 10^{46}$-$10^{47}\\rm~erg~s^{-1}$) consistent with the shock-breakout (SBO) scenario, yield the highest CR loading factor and therefore are expected to produce neutrinos more efficiently. Our model predicts the expected number of neutrino signals that are consistent with current limits but would be detectable with next-generation neutrino observatories. These results strengthen the case for LL~GRBs as promising sources of high-energy astrophysical neutrinos and motivate real-time searches for coincident LL~GRB and neutrino events. Next-generation X-ray and MeV facilities will be critical for identifying more LL~GRBs and strengthening their role in multi-messenger astrophysics."}
{"id": "2602.02372", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2602.02372", "abs": "https://arxiv.org/abs/2602.02372", "authors": ["Shiqi Yu", "Bing Theodore Zhang"], "title": "A Unified Framework for 10 TeV to EeV Diffuse Neutrino Sky and KM3-230213A", "comment": "6 pages plus 2 pages of appendix. 5 figures and 4 tables in total", "summary": "Establishing a unified origin that simultaneously accounts for the wide-band diffuse flux and recent ultra-high-energy (UHE) detections is a pressing challenge in multi-messenger astrophysics. Successive shock regimes in shock-breakout candidates, most notably low-luminosity gamma-ray bursts (LL GRBs), naturally introduce distinct physical environments producing a multi-component neutrino flux extending from 10 TeV to the UHE regime. Integrating prompt and afterglow phases within a unified dynamical framework yields a self-consistent explanation for this broadband emission. In this work, we discuss this framework, building on MWL observations. We show that the prompt emission from GRB~060218-like events accounts for $\\gtrsim 10\\%$ of the diffuse flux at 100~TeV, while GRB~100316D-like configurations predict a distinct flux peak near $10^{-9}\\rm~GeV~cm^{-2}~s^{-1}~sr^{-1}$ at 100~PeV, providing a physical interpretation for the 220 PeV KM3-230213A event. This decoupling explains the lack of low-energy counterparts for individual UHE detections while maintaining consistency with the total diffuse neutrino flux. Ultimately, this framework identifies SBO-like LL~GRBs as a unifying origin for these phenomena, providing a physical link across a wide band from 10 TeV to EeV energies testable by next-generation observatories, including GRAND, IceCube-Gen2, and RNO-G."}
{"id": "2602.02390", "categories": ["astro-ph.HE", "astro-ph.CO", "astro-ph.GA", "hep-ph"], "pdf": "https://arxiv.org/pdf/2602.02390", "abs": "https://arxiv.org/abs/2602.02390", "authors": ["Samyak Jain", "Dan Hooper", "Francis Halzen"], "title": "Evaluating the Contribution of Active Galactic Nuclei to the Diffuse High-Energy Neutrino Flux", "comment": "24 pages, 8 figures", "summary": "The detection of high-energy neutrinos from NGC 1068 and TXS-0506+56 suggests that active galactic nuclei (AGN) may contribute significantly to the the diffuse neutrino flux measured by IceCube. Using 10 years of publicly available IceCube data, we performed a systematic population analysis of X-ray-bright and gamma-ray-bright AGN to evaluate the extent to which this diffuse flux could originate from these sources. We find that gamma-ray-bright blazars can account for no more than 16\\% of IceCube's total diffuse flux. Although we find no evidence of neutrino emission from gamma-ray-bright, non-blazar AGN, we cannot exclude the possibility that these sources contribute significantly to the diffuse flux. In contrast, we report (pre-trials) evidence of neutrino emission from several nearby, X-ray-bright, Seyfert-type AGN, including \\mbox{NGC 1068} ($4.9σ$), SWIFT J1041.4-1740 ($2.6σ$), SWIFT J0202.4+6824A/B ($2.6σ$), SWIFT J0744.0+2914 (2.6$σ$), NGC 4151 ($2.5σ$), and NGC 3079 ($2.5σ$). Although not fully conclusive, these results suggest that IceCube may be detecting neutrinos from a larger population of Seyfert galaxies. The fact that these sources are not gamma-ray bright indicates that their neutrino production must be taking place in optically thick environments, such as in the coronae surrounding these galaxies' supermassive black holes. We also identify a $4.2σ$ correlation between the neutrinos detected by IceCube and members of the Swift-BAT catalog of X-ray-bright AGN, although this correlation is dominated by NGC 1068. We estimate that this class of sources contributes between 11.2\\% and the entirety of IceCube's total diffuse neutrino flux. These results strengthen the emerging case for the prevalence of gamma-ray-obscured AGN as significant sources of high-energy neutrinos."}
{"id": "2602.00195", "categories": ["astro-ph.IM", "astro-ph.HE", "gr-qc"], "pdf": "https://arxiv.org/pdf/2602.00195", "abs": "https://arxiv.org/abs/2602.00195", "authors": ["Yi-kun Li", "Cheng Cheng", "Lang Cui", "Yun Fang"], "title": "Model-Agnostic Population Inference for Gravitational-Wave Astronomy: From LIGO to LISA", "comment": null, "summary": "Inferring the intrinsic population of compact binary mergers is complicated by detector selection biases and measurement uncertainties. Traditional parametric methods are limited by the need to presuppose functional forms, introducing model-dependent biases. To overcome these limitations, we introduce an inference framework powered by deep generative modeling. We develop a flexible, data-driven population model using a Correlated Compound-Mixture Density Network. This architecture integrates mixture models to handle multimodality, Gaussian copulas for parameter dependencies, and a library of flexible marginal distributions. The network is trained to approximate the posterior distribution of the population's hyperparameters using amortized variational inference with Normalizing Flows on catalogs of gravitational-wave events. We demonstrate the framework's capabilities in two distinct regimes. First, using simulated catalogs of supermassive black hole binary mergers for the Laser Interferometer Space Antenna (LISA), we show that the method accurately recovers complex three-dimensional distributions and absolute merger rates from sparse datasets, effectively correcting for selection effects and measurement uncertainties. Second, we validate the framework on real observational data from the LIGO-Virgo-KAGRA GWTC-3 catalog, successfully inferring the population of stellar-mass binary black holes using an injection-based selection effect correction. Our results confirm that the method is robust, scalable, and applicable across different detector sensitivities and source populations."}
{"id": "2602.00203", "categories": ["astro-ph.IM", "astro-ph.HE", "gr-qc"], "pdf": "https://arxiv.org/pdf/2602.00203", "abs": "https://arxiv.org/abs/2602.00203", "authors": ["Anastasios Theodoropoulos", "Nino Villanueva", "Osvaldo Gramaxo Freitas", "Tiago Fernandes", "Solange Nunes", "Alejandro Torres-Forne", "Jose A. Font", "Antonio Onofre", "Jose D. Martin-Guerrero"], "title": "An autoencoder-based surrogate waveform model for quasi-circular binary-black-hole mergers", "comment": null, "summary": "The generation of accurate waveforms from binary black hole (BBH) mergers is a major effort in Gravitational-Wave Astronomy. In recent years, machine-learning-based surrogate models for BBH waveforms have been proposed. Those offer the potential to dramatically accelerate waveform generation while maintaining accuracy competitive with that of traditional waveform approximants. In this work, we investigate the viability of autoencoders as generative models for gravitational-wave signals from quasi-circular BBH mergers. We introduce AESur3dq8, a novel surrogate waveform model based on autoencoders that enables the rapid and accurate construction of large template banks, producing millions of waveforms in under a second using modest computational resources. The model is trained on the numerical-relativity-informed surrogate NRHybSur3dq8 and subsequently fine-tuned using the SXS catalog of BBH simulations. We demonstrate that waveforms generated by AESur3dq8 achieve mismatches of order $10^{-4}$ with respect to Numerical Relativity waveforms, and that parameter estimation performed with these templates yields results fully consistent with those reported by the LIGO-Virgo-KAGRA Collaboration for observed gravitational-wave events."}
{"id": "2602.00677", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2602.00677", "abs": "https://arxiv.org/abs/2602.00677", "authors": ["Arul Pandian B", "Joydeep Bagchi", "Prabu Thiagaraj", "K. B. Raghavendra Rao", "Vinutha Chandrashekar", "R Abhishek", "Arasi Sathyamurthy", "Sandhya", "Sahana Bhattramakki", "Kasturi S", "Shiv Sethi"], "title": "GBD-DART-I : Pulsars and transient source observation between 130 MHz and 350 MHz at Gauribidanur", "comment": null, "summary": "Gauribidanur Diamond Array Radio Telescope (GBD-DART) is a new small LPDA antenna array consisting of 64 short dipoles and associated receivers that has been custom developed and deployed at the Gauribidanur observatory (13.604 N, 77.427 E) to study bright Pulsars and Solar transients in the frequency range of 130-350 MHz. The LPDAs are arranged in a checkerboard layout, with opposite pairs combined to enable dual-polarised operation. A diamond-shaped (tilted square) array configuration was chosen to achieve high sidelobe suppression in the East-West and North-South directions. The tile measures 5.9 meters by 5.9 meters, with diagonals along both the North-South and East-West directions, each measuring about 8.4 meters. The LPDA array with one diamond-shaped tile has been fully commissioned and is operating in transit-observing mode, successfully detecting strong pulsars and solar flares over the last seven months. The present digital backend restricts the instantaneous bandwidth for observations to 16 MHz. The array operations are streamlined to facilitate remote operations. Apart from investigating Pulsar and Solar phenomena at low radio frequencies in selected sources, this work aims to provide a training platform for radio astronomy through simple-to-construct, low-cost radio telescopes. In this paper, we present details of the array, including antenna and array response studies, brief descriptions of front-end and backend instrumentation, and illustrative results from observations of both pulsars and solar flares. It will also provide brief details of future upgrade plans, particularly for the tiles and digital backend, to facilitate the observation of additional sources."}
{"id": "2602.00691", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2602.00691", "abs": "https://arxiv.org/abs/2602.00691", "authors": ["C. Alispach", "A. Araudo", "A. Bakalová", "M. Balbo", "V. Beshley", "J. Blažek", "J. Borkowski", "T. Bulik", "F. Cadoux", "S. Casanova", "A. Christov", "J. Chudoba", "L. Chytka", "P. Čechvala", "P. Dědic", "Y. Favre", "M. Garczarczyk", "L. Gibaud", "T. Gieras", "E. Głowacki", "P. Hamal", "M. Heller", "M. Hrabovský", "P. Janeček", "M. Jelínek", "V. Jílek", "J. Juryšek", "V. Karas", "B. Lacave", "E. Lyard", "D. Mandát", "W. Marek", "S. Michal", "J. Michałowski", "M. Miroń", "R. Moderski", "T. Montaruli", "A. Muraczewski", "S. R. Muthyala", "A. L. Müller", "A. Nagai", "K. Nalewajski", "D. Neise", "J. Niemiec", "M. Nikołajuk", "V. Novotný", "M. Ostrowski", "M. Palatka", "M. Pech", "M. Prouza", "P. Schovánek", "T. Schulz", "V. Sliusar", "J. Srba", "Ł. Stawarz", "R. Sternberger", "M. Stodulska", "J. Świerblewski", "P. Świerk", "J. Štrobl", "T. Tavernier", "P. Trávníček", "I. Troyano Pujadas", "J. Vícha", "R. Walter", "K. Ziȩtara", "R. Conceição", "L. Gibilisco", "M. Pimenta", "B. Tomé"], "title": "Prospects for the detection of gamma rays using Cherenkov telescopes enhanced by a ground array observatory", "comment": "8 pages, 7 figures. Submitted to Astroparticle Physics", "summary": "We consider the Single-Mirror Small-Size imaging atmospheric Cherenkov Telescopes (SST-1M) to be located inside a high-altitude array of Water-Cherenkov Detectors (WCDs) inspired by the Southern Wide-field Gamma-ray Observatory (SWGO). For such a hybrid observatory, using detailed Monte Carlo simulations, we show an improvement in the flux sensitivity of monocular and stereoscopic SST-1M observation by about 60% and 30% above 10 TeV, respectively, due to the improved gamma/hadron separation when additional parameters from the WCD array are used. We also discuss further benefits of the hybrid SWGO concept and its technical challenges."}
{"id": "2602.00736", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2602.00736", "abs": "https://arxiv.org/abs/2602.00736", "authors": ["Arul Pandian B", "Joydeep Bagchi", "Prabu Thiagaraj", "K. B. Raghavendra Rao", "Vinutha Chandrashekar"], "title": "GBD-DART-II: 175 MHz Polarimetric Observation of Pulsars from Gauribidanur and a New Pulsar Signal Processing Pipeline", "comment": null, "summary": "A new pulsar signal-processing pipeline has been developed for observing pulsars with the Diamond Array Radio Telescope at the Gauribidanur radio observatory. The array consists of 32 off-axis dual-polarised LPDAs, with a nominal gain of 22 dBi between 130 and 350 MHz and a 15-degree HPBW at 175 MHz for transit observations on pulsars. Custom-built receivers and real-time data-capture and analysis tools have been developed and used. Receiver output voltages from a transient buffer, as well as full-polar spectral data at both high and low resolutions, suitable for transient searches and pulsar studies. Additionally, full-polar folded profile archives are generated for known pulsars in subintegrations and both coherent and incoherent dedispersion. Custom-developed Python routines, FFT libraries, DSPSR, PSRCHIVE, and Presto modules have been used to build the pipeline. The functionalities of the pipeline were validated with artificially generated pulsar signals and strong celestial sources before it was released for routine observations. Presently, the pipeline is configured to observe pulsars between 170 and 196 MHz, with a daily cadence. Recorded data are reduced in-line immediately following each observation, nearly matching the observation time at a 1:1 ratio. An Intel i9 server captures the data, and an AMD R9 CPU does the primary data reduction. The archives are routinely backed up to a remote system via the internet. The paper presents the architecture of the signal processing pipeline developed, its validation, and initial polarimetric results observing five bright pulsars at 175 MHz. Results also include RM estimates and single-pulse study results for B0953+08, B0531+21, and B1133+16, as well as from monitoring the spin-down of the Crab pulsar over 200 days of observation. Finally, it presents a discussion on the potential improvements for the array."}
{"id": "2602.02058", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2602.02058", "abs": "https://arxiv.org/abs/2602.02058", "authors": ["Bernardo Cornejo Avila", "Sofia Bisero", "Mickael Costa", "Antoine Ciric", "Ilja Jaroschewski", "Weizmann Kindrébéogo", "Fabian Schussler"], "title": "Astro-COLIBRI: An Innovative Platform for Real-Time Multi-Messenger Astrophysics", "comment": "Proceedings 35th annual conference on Astronomical Data Analysis Software and Systems (ADASS XXXV, Görlitz/Germany, 2025)", "summary": "The discovery of transient phenomena, such as supernovae, novae, Fast Radio Bursts (FRBs), Gamma-Ray Bursts (GRBs), and stellar flares, together with the emergence of new cosmic messengers like high-energy neutrinos and Gravitational Waves (GWs), has revolutionized astrophysics in recent years. To fully exploit the scientific potential of multi-messenger and multi-wavelength follow-up observations, as well as serendipitous detections, researchers need a tool capable of rapidly compiling and contextualizing essential information for every new event. We present Astro-COLIBRI, an advanced platform designed to meet this challenge.\n  Astro-COLIBRI is a comprehensive platform that combines a public RESTful API, real-time databases, a cloud-based alert system, and user-friendly interfaces including a website and mobile app for iOS and Android. It ingests alerts from multiple sources in real time, applies user-defined filters, and situates each event within its multi-messenger and multi-wavelength context. The platform provides clear data visualization, concise summaries of key event properties, and evaluations of observing conditions across a wide network of observatories worldwide. We here detail the architecture of Astro-COLIBRI, from the data pipelines that manage real-time alert ingestion and processing to the design of the RESTful API, which enables seamless integration with other astronomical software and services."}
