{"id": "2602.11259", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2602.11259", "abs": "https://arxiv.org/abs/2602.11259", "authors": ["R. Wesson", "M. Gabler", "M. Lyons", "J. Wildman", "Mikako Matsuura", "H. -T. Janka", "B. Giudici", "P. Cigan", "H. L. Gomez", "R. Indebetouw", "A. M. S. Richards", "A. Wongwathanarat"], "title": "3D insights into SN 1987A: ALMA observations compared to hydrodynamical explosion simulations", "comment": "25 pages, 26 figures. Submitted to MNRAS", "summary": "We obtain three-dimensional distributions of CO and SiO molecules from high spatial resolution (0.03--0.06\") ALMA observations of SN 1987A at two different epochs. The evolution between these two epochs is consistent with homologous expansion. From these 3D maps, we reconstruct the 3D mass distributions of the ejecta in CO and SiO molecules, which we compare with those obtained by state-of-the-art, long-time hydrodynamical supernova explosion models computed with the Prometheus-HotB code for 10 different progenitors, including both red and blue supergiants. The models which best match the mass distributions correspond to explosions of binary-merger blue supergiant progenitors; at least two such models approximately reproduce the observed CO morphology. In contrast, the SiO velocity distribution and morphology are not as well reproduced in these models, indicating insufficient mixing of Si into the outer layers already at the progenitor stage. The theoretical models suggest a strong correlation between the centre of mass of the densest carbon- and oxygen-rich ejecta and the direction of the neutron-star kick. If such a correlation also applies to the CO emission in the ejecta of SN 1987A, the kick of the compact remnant is expected to point towards the observer, at an angle of approximately $45^\\circ$ to the north."}
{"id": "2602.11274", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2602.11274", "abs": "https://arxiv.org/abs/2602.11274", "authors": ["Silvia Conforti", "Luca Zampieri", "Michele Fiori", "Alessia Spolon", "Giampiero Naletto", "Aleksandr Burtovoi"], "title": "Evolution of the transitional millisecond pulsar PSR J1023+0038 from Aqueye+ and NICER observations", "comment": "8 pages, 4 figures. Accepted for publication in A&A", "summary": "Transitional millisecond pulsars (tMSPs) are old neutron stars spun up by accretion from a low-mass companion. These objects can switch between two emission regimes: rotation-powered radio pulsar and accreting X-ray pulsar. The origin of their optical and X-ray pulsations is still debated, although one model attributes them to synchrotron emission produced in a shock between the pulsar wind and the accretion flow. The small phase lag observed between optical and X-ray pulses in PSR J1023+0038 supports a common origin. We present a new measurement of the phase lag between optical and X-ray pulse profiles of PSR J1023+0038 and investigate the evolution of the time of passage at the ascending node ($T_{\\rm{asc}}$) up to 2023. We performed a timing analysis of optical observations obtained with Aqueye+ between 2021 and 2023 and of X-ray data from NICER in 2023. We derive updated values of $T_{\\rm{asc}}$ and measure the optical - X-ray phase lag from simultaneous observations. We find that $T_{\\rm{asc}}$ increases by about 20 s per year. In January 2023, we measure a phase lag of $0.067 \\pm 0.018$, corresponding to $112.3 \\pm 30.7\\,μ$s. Since 2017, the evolution of $T_{\\rm{asc}}$ follows a parabolic trend, indicating an increase in the orbital period and orbital separation of the system. This behaviour is consistent with non-conservative Roche-lobe overflow, with the donor losing mass at a rate much higher than the accretion rate. The phase lag measurement further supports a common origin of the optical and X-ray pulsations."}
{"id": "2602.11282", "categories": ["astro-ph.HE", "astro-ph.CO", "astro-ph.IM", "astro-ph.SR", "gr-qc"], "pdf": "https://arxiv.org/pdf/2602.11282", "abs": "https://arxiv.org/abs/2602.11282", "authors": ["Matthew Mould", "Jack Heinzel", "Sofia Alvarez-Lopez", "Cailin Plunkett", "Noah E. Wolfe", "Salvatore Vitale"], "title": "Measurement prospects for the pair-instability mass cutoff with gravitational waves", "comment": null, "summary": "Pair-instability supernovae leave behind no compact remnants, resulting in a predicted gap in the distribution of stellar black-hole masses. Gravitational waves from binary black-hole mergers probe the relevant mass range and analyses of the LIGO-Virgo-KAGRA catalog (GWTC-4) indicate a possible mass cutoff at $40$-$50M_\\odot$. However, the robustness of this result is yet to be tested. To this end, we simulate a comprehensive suite of gravitational-wave catalogs with full Bayesian parameter estimation and analyze them with parametric population models. For catalogs similar to GWTC-4, confident identification of a cutoff is not guaranteed, but GWTC-4 results are compatible with the best constraints among our simulations. Conversely, spurious false identification of a cutoff is unlikely. For catalogs expected by the end of the O4 observing run, uncertainty in the cutoff mass is reduced by $\\gtrsim20\\%$, but a cutoff at $40$-$50M_\\odot$ yields only a lower bound on the $^{12}\\mathrm{C}(α,γ)^{16}\\mathrm{O}$ reaction rate, which in terms of the S-factor at $300\\,\\mathrm{keV}$ may be $S_{300}\\gtrsim125\\,\\mathrm{keV}\\,\\mathrm{b}$ at $90\\%$ credibility by the end of O4. Relative uncertainties on the Hubble parameter $H_0$ from gravitational-wave data alone can still be up to $100\\%$. We also analyze GWTC-4 with the nonparametric PixelPop population model, finding that some mass features are more prominent than in parametric models but a sharp cutoff is not required. However, the parametric model passes a likelihood-based predictive test in GWTC-4 and the PixelPop results are consistent with those from our simulated catalogs where a cutoff is present. We use the simple focus of this study to emphasize that such tests are necessary to make astrophysical claims from gravitational-wave catalogs going forward."}
{"id": "2602.11474", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2602.11474", "abs": "https://arxiv.org/abs/2602.11474", "authors": ["Atsushi Tanimoto", "Keiichi Wada", "Yuki Kudoh", "Nozomu Kawakatu", "Mariko Nomura", "Hirokazu Odaka"], "title": "Unification Model of Active Galactic Nuclei by Photoionization Equilibrium Calculation Based on Radiative Hydrodynamic Simulations", "comment": "17 pages, 8 figures, accepted by ApJ", "summary": "To investigate the origin of the dependence of the covering factor on the Eddington ratio suggested by X-ray observations, we examined the angular distribution of HI and HII based on two-dimensional radiative hydrodynamic simulations. To calculate the Compton-thin covering factor $C_{22}$ and Compton-thick covering factor $C_{24}$ of HI alone, we performed one-dimensional photoionization equilibrium calculations with the XSTAR code based on radiative hydrodynamic simulations. The results obtained are as follows. (1) The Compton-thin covering factor $C_{22}$ of HI and HII is independent of the Eddington ratio and is approximately $70\\%$, while $C_{22}$ of HI alone is also independent of the Eddington ratio and is approximately $30\\%$. (2) The Compton-thick covering factor $C_{24}$ of HI has the same value as $C_{22}$ of HI. (3) Our $C_{24}$ is consistent with that obtained from X-ray observations. (4) Our $C_{22}$ agrees with that obtained from X-ray observations in a high Eddington ratio, while our $C_{22}$ is smaller than that from X-ray observations in a low Eddington ratio. (5) To explain the difference between $C_{22}$ obtained from theoretical calculations and that inferred from X-ray observations, a Compton-thin gas is required in regions extending at least $10~\\mathrm{pc}$ beyond the current computational regions."}
{"id": "2602.11281", "categories": ["astro-ph.IM", "cs.AI", "cs.LG", "gr-qc"], "pdf": "https://arxiv.org/pdf/2602.11281", "abs": "https://arxiv.org/abs/2602.11281", "authors": ["Alessandro Meroni", "Nicolò Oreste Pinciroli Vago", "Piero Fraternali"], "title": "DeepRed: an architecture for redshift estimation", "comment": "Accepted for publication in Neural Computing and Applications", "summary": "Estimating redshift is a central task in astrophysics, but its measurement is costly and time-consuming. In addition, current image-based methods are often validated on homogeneous datasets. The development and comparison of networks able generalize across different morphologies, ranging from galaxies to gravitationally-lensed transients, and observational conditions, remain an open challenge. This work proposes DeepRed, a deep learning pipeline that demonstrates how modern computer vision architectures, including ResNet, EfficientNet, Swin Transformer, and MLP-Mixer, can estimate redshifts from images of galaxies, gravitational lenses, and gravitationally-lensed supernovae. We compare these architectures and their ensemble to both neural networks (A1, A3, NetZ, and PhotoZ) and a feature-based method (HOG+SVR) on simulated (DeepGraviLens) and real (KiDS, SDSS) datasets. Our approach achieves state-of-the-art results on all datasets. On DeepGraviLens, DeepRed achieves a significant improvement in the Normalized Mean Absolute Deviation compared to the best baseline (PhotoZ): 55% on DES-deep (using EfficientNet), 51% on DES-wide (Ensemble), 52% on DESI-DOT (Ensemble), and 46% on LSST-wide (Ensemble). On real observations from the KiDS survey, the pipeline outperforms the best baseline (NetZ), improving NMAD by 16% on a general test set without high-probability lenses (Ensemble) and 27% on high-probability lenses (Ensemble). For non-lensed galaxies in the SDSS dataset, the MLP-Mixer architecture achieves a 5% improvement over the best baselines (A3 and NetZ). SHAP shows that the models correctly focus on the objects of interest with over 95% localization accuracy on high-quality images, validating the reliability of the predictions. These findings suggest that deep learning is a scalable, robust, and interpretable solution for redshift estimation in large-scale surveys."}
{"id": "2602.11529", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2602.11529", "abs": "https://arxiv.org/abs/2602.11529", "authors": ["Yiqin Chen", "Shi-Yi Zhao", "Zhi-Zhang Peng", "Xingjiang Zhu", "N. D. Ramesh Bhat", "Zu-Cheng Chen", "Małgorzata Curyło", "Valentina Di Marco", "George Hobbs", "Agastya Kapur", "Wenhua Ling", "Rami Mandow", "Saurav Mishra", "Daniel J. Reardon", "Christopher J. Russell", "Ryan M. Shannon", "Jacob Cardinal Tremblay", "Jingbo Wang", "Lei Zhang", "Andrew Zic"], "title": "Searching for Anisotropy in the Gravitational Wave Background Using the Parkes Pulsar Timing Array", "comment": "Accepted for publication in Physical Review D. 11 pages, 5 figures", "summary": "In recent years, several pulsar timing array collaborations have reported evidence for a nanohertz gravitational wave background (GWB). Such a background signal could be produced by supermassive binary black holes, early-Universe processes such as inflation and phase transitions, or a mixture of both. One way to disentangle different contributions to the GWB is to search for anisotropic signatures. In this work, we search for anisotropy in the GWB using the third data release of the Parkes Pulsar Timing Array. Our analysis employs both the radiometer method and the spherical harmonic basis to characterize the distribution of GWB power across the sky. We calculate the angular power in the lowest five frequency bins and compare it with detection thresholds determined under the null hypothesis of isotropy. In the 5.26 nHz frequency bin, we identify a hotspot in the reconstructed sky map with a $p$-value of $0.016$ (the lowest in our analysis), which we attribute to noise fluctuations. While our search reveals no statistically significant anisotropy, we expect that the precise measurement of angular power spectrum of the GWB will become instrumental in determining the origin of the nanohertz GWB signal."}
{"id": "2602.11620", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2602.11620", "abs": "https://arxiv.org/abs/2602.11620", "authors": ["Xu-Fang Li", "Cong-Zhan Liu", "Ai-Mei Zhang", "Zheng-Wei Li", "Xue-Feng Lu", "Zhong-Xue Xin", "Guo-Feng Wang", "Yong-Ping Li", "Yong-Jie Zhang", "Shi-Bo Shu", "Yi-Fei Zhang", "Ya-Qiong Li", "Zhi Chang", "Dai-Kang Yan"], "title": "Design and characterization of W-band and D-band calibration sources for the AliCPT-1 experiment", "comment": "13 pages, 10 figures", "summary": "Ali Cosmic Microwave Background Polarization Telescope (AliCPT-1) is the first Chinese cosmic microwave background experiment aiming to make sensitive polarization maps of the potential B-mode signal from inflationary gravitational waves. The telescope was deployed on the Tibet Ali site at 5250 m above sea level in early 2025. Before and after each observation season, the instrument performance must be carefully calibrated, including the far field beam performance, far sidelobe, spectral response, polarization angle, and cross-polar beam response. To characterize these optical performances, several calibrators have been developed. We developed a W-band source and a D-band source for the AliCPT-1 telescope's beam characterizations. We present the design and performance of the two calibration sources."}
{"id": "2602.11624", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2602.11624", "abs": "https://arxiv.org/abs/2602.11624", "authors": ["Shree Suman", "Mayukh Pahari", "Gulab Dewangan", "Ian M McHardy"], "title": "Understanding coronal geometry in NGC 4593 using Fourier frequency-resolved covariance and time-lag spectral analysis", "comment": "21 pages, 9 tables, 12 figures, accepted for publication in MNRAS", "summary": "Understanding disc-corona geometry through X-ray reverberation variability studies in Seyfert galaxies is crucial, yet our knowledge mostly relies on flux-averaged mean spectral analysis. In this study, we investigate the origin of the large X-ray variability of the Seyfert 1 galaxy NGC 4593 using two \\xmm{} observations, which are at least 65 ksec long and have a 0.3-10 keV X-ray flux difference by a factor of $\\sim$2.5. We extracted mean spectra, Fourier-frequency resolved covariance, and time-lag spectra and performed modelling of all spectra in a self-consistent manner. From the best-fit covariance spectra, we have shown that energy-dependent covariance during low flux shows dominances of direct powerlaw continuum over reflection continuum at all Fourier frequencies (2.1 $-$ 390 $\\times$ 10$^{-5}$ Hz). However, during high flux, the variabilities are dominated by the reflection components most of the time. Our results are further supported by the Fourier frequency-dependent time-lag (between soft: 0.3-1 keV and hard: 1-5 keV bands) spectral modeling during high and low fluxes. A significant change is observed in the X-ray reverberation delay timescale from 483 $\\pm$ 135 sec (during high flux) to $<$96 sec (during low flux), indicating a change in coronal size at least by a factor of $\\sim$2 (from $<$3.3 R$_g$ to $>$7.2 R$_g$) during low to high flux transitions."}
{"id": "2602.11728", "categories": ["astro-ph.IM", "hep-ex", "physics.ins-det"], "pdf": "https://arxiv.org/pdf/2602.11728", "abs": "https://arxiv.org/abs/2602.11728", "authors": ["Liangpeng Xie", "Yifei Zhang", "Zhengwei Li", "Zhouhui Liu", "Shibo Shu", "Junjie Zhou", "Xufang Li", "Haoyu Li", "He Gao", "Yudong Gu", "Xuefeng Lu", "Yong Zhao", "Congzhan Liu"], "title": "Beyond One-Thousandth Energy Resolution with an AlMn TES Detector", "comment": "6 pages, 8 figures, submitted to APL", "summary": "The superconducting Transition-Edge Sensor (TES) is a critical technology for next-generation X-ray spectrometers, known for its exceptional energy resolution. In the last decade, TESs based on AlMn alloy films have been extensively used in several cosmic microwave background (CMB) experiments. The advantages of simple fabrication process and easily tunable critical temperature make them an alternative to bilayer TESs. However, they have rarely been applied to X-ray detection until now. We developed an annular AlMn TES for X-ray detection and tested it in a dilution refrigerator with a Superconducting Quantum Interference Device (SQUID) amplifier, achieving an Full Width at Half Maximum (FWHM) of 12.1 +- 0.3 eV at 17.48 keV. To the best of our knowledge, this is the first demonstration of an AlMn TES achieving an energy resolution below 0.1%, highlighting its potential for high-resolution X-ray detection."}
{"id": "2602.11765", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2602.11765", "abs": "https://arxiv.org/abs/2602.11765", "authors": ["Jake McMillan", "Adam Ingram", "Cordelia Dashwood Brown", "Andrei Igoshev", "Matthew Middleton", "Grzegorz Wiktorowicz", "Simone Scaringi"], "title": "Population synthesis predictions of the Galactic compact binary gravitational wave foreground detectable by LISA", "comment": "14 pages, 10 figures", "summary": "We use population synthesis modelling to predict the gravitational wave (GW) signal that the Laser Interferometer Space Antenna (LISA) will detect from the Galactic population of compact binary systems. We implement a realistic star formation history with time and position-dependent metallicity, and account for the effect of supernova kicks on present-day positions. We consider all binaries that have a white dwarf (WD), neutron star (NS), or black hole primary in the present-day. We predict that the summed GW signal from all Galactic binaries will already be detectable 3 months into the LISA mission, by measuring the power spectrum of the total GW strain. We provide a simple publicly available code to calculate such a power spectrum from a user-defined binary population. In the full 4 year baseline mission lifetime, we conservatively predict that $>2000$ binaries could be individually detectable as GW sources. We vary the assumed common envelope (CE) efficiency $α$, and find that it influences both the shape of the power spectrum and the relative number of detectable systems with WD and NS progenitors. In particular, the ratio of individually detectable binaries with chirp mass $\\mathcal{M} < M_\\odot$ to those with $\\mathcal{M} \\geqslant M_\\odot$ increases with $α$. We therefore conclude that LISA may be able to diagnose the CE efficiency, which is currently poorly constrained."}
{"id": "2602.12110", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2602.12110", "abs": "https://arxiv.org/abs/2602.12110", "authors": ["K. Huynh", "V. Bajaj", "M. Marinelli", "J. Mack", "S. Shenoy", "N. Grogin"], "title": "Testing and Validation of the Updated Pixel-Based Non-Linearity Calibration File for WFC3/IR", "comment": "34 pages, 22 figures", "summary": "The WFC3\\IR channel has an innate non-linear response to incident photons, which is corrected for in the calwf3 pipeline with the NLINFILE reference file. The 2009 solution is based on an average polynomial correction for each IR quadrant and is found to be poorly constrained at high fluence levels (e-) approaching the saturation limit. Using a variety of image types, sources, and sample sequences, we test a new pixel-based linearity correction developed by Shenoy et al. (2025). In nearly all cases, the new correction improves the linearity at fluence levels higher than 50,000 e-, with improvements up to 7% for pixels with fluences approaching the saturation limit (80,000 e-) in the last ima reads. The pixel-based solution also significantly decreases the number of cosmic rays erroneously flagged (due to non-linearity correction errors) during ramp fitting in calwf3, leading to improved photometric accuracy in the calibrated flt data and higher signal-to-noise ratios, particularly in Quad 1 (upper-left detector quadrant). Because the new solution tends to make sources brighter, we recalibrate the five HST flux standards used to compute the IR zeropoints and find a negligible impact (0.1-0.2%) on the published values by Calamida et al. (2024), smaller than the RMS dispersion (0.5%) in the observed to synthetic flux ratios for all five flux standards. The new NLINFILE 9au15283i lin.fits was delivered to CRDS in October 2025 and will be used to reprocess all WFC3/IR imaging and grism observations in the MAST archive. An updated reference file a2412448i lin.fits was delivered in February 2026, improving the results at the highest fluence levels by a few tenths of a percent. Please consult the Addendum for details."}
{"id": "2602.11809", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2602.11809", "abs": "https://arxiv.org/abs/2602.11809", "authors": ["Junbo Pang", "Hong Shen", "Jinniu Hu"], "title": "Impact of crust-core connection procedures on the tidal deformability of neutron stars", "comment": "14 pages, 10 figures, 3 tables, has been accepted by Physical Review C", "summary": "We study the impact of crust-core connection procedures on various neutron-star properties, especially on the tidal deformability. We consider three types of connection procedures to treat the discontinuity in a nonunified equation of state around the crust-core transition: (1) the direct connection procedure, (2) the crossover connection procedure, and (3) the segmented method. Our results indicate that the mass-radius relations of neutron stars are almost unaffected by the details of the connection procedure. However, the tidal deformabilities of neutron stars are sensitive to the crust-core connection procedures. The tidal deformability is closely related to gravitational-wave measurements. For a canonical 1.4$M_\\odot$ neutron star, uncertainties in the tidal deformability $Λ_{1.4}$ from different connection procedures can exceed 20\\%. We find that the direct connection procedure yields significantly larger uncertainties in the tidal deformability, while the segmented method and crossover connection procedure provide relatively stable results."}
{"id": "2602.11282", "categories": ["astro-ph.HE", "astro-ph.CO", "astro-ph.IM", "astro-ph.SR", "gr-qc"], "pdf": "https://arxiv.org/pdf/2602.11282", "abs": "https://arxiv.org/abs/2602.11282", "authors": ["Matthew Mould", "Jack Heinzel", "Sofia Alvarez-Lopez", "Cailin Plunkett", "Noah E. Wolfe", "Salvatore Vitale"], "title": "Measurement prospects for the pair-instability mass cutoff with gravitational waves", "comment": null, "summary": "Pair-instability supernovae leave behind no compact remnants, resulting in a predicted gap in the distribution of stellar black-hole masses. Gravitational waves from binary black-hole mergers probe the relevant mass range and analyses of the LIGO-Virgo-KAGRA catalog (GWTC-4) indicate a possible mass cutoff at $40$-$50M_\\odot$. However, the robustness of this result is yet to be tested. To this end, we simulate a comprehensive suite of gravitational-wave catalogs with full Bayesian parameter estimation and analyze them with parametric population models. For catalogs similar to GWTC-4, confident identification of a cutoff is not guaranteed, but GWTC-4 results are compatible with the best constraints among our simulations. Conversely, spurious false identification of a cutoff is unlikely. For catalogs expected by the end of the O4 observing run, uncertainty in the cutoff mass is reduced by $\\gtrsim20\\%$, but a cutoff at $40$-$50M_\\odot$ yields only a lower bound on the $^{12}\\mathrm{C}(α,γ)^{16}\\mathrm{O}$ reaction rate, which in terms of the S-factor at $300\\,\\mathrm{keV}$ may be $S_{300}\\gtrsim125\\,\\mathrm{keV}\\,\\mathrm{b}$ at $90\\%$ credibility by the end of O4. Relative uncertainties on the Hubble parameter $H_0$ from gravitational-wave data alone can still be up to $100\\%$. We also analyze GWTC-4 with the nonparametric PixelPop population model, finding that some mass features are more prominent than in parametric models but a sharp cutoff is not required. However, the parametric model passes a likelihood-based predictive test in GWTC-4 and the PixelPop results are consistent with those from our simulated catalogs where a cutoff is present. We use the simple focus of this study to emphasize that such tests are necessary to make astrophysical claims from gravitational-wave catalogs going forward."}
{"id": "2602.11847", "categories": ["astro-ph.HE", "astro-ph.SR", "physics.space-ph"], "pdf": "https://arxiv.org/pdf/2602.11847", "abs": "https://arxiv.org/abs/2602.11847", "authors": ["S. Paul", "K. P. Arunbabu", "M. Chakraborty", "S. K. Gupta", "B. Hariharan", "Y. Hayashi", "P. Jagadeesan", "A. Jain", "M. Karthik", "H. Kojima", "S. Kawakami", "P. K. Mohanty", "Y. Muraki", "P. K. Nayak", "T. Nonaka", "A. Oshima", "M. Rameez", "K. Ramesh", "S. Shibata", "K. Tanaka"], "title": "Monitoring the upper atmospheric temperature and interplanetary magnetic field with the GRAPES-3 muon telescope", "comment": null, "summary": "Galactic Cosmic Rays (GCRs) have to travel through the heliosphere before they interact with the Earth's atmosphere. During this, they are deflected by the Sun's magnetic field, causing variations in this field to imprint on the flux, spectrum and angular distribution of GCRs detected at or near Earth. Studies of these variations over the past several decades have revealed the impact of both transient phenomena such as solar flares, coronal holes, sunspot activity and coronal mass ejections (CMEs) as well as their effects such as Forbush Decreases (FDs), precursors and Ground-Level Enhancements (GLEs). Periodic variations, such as due to the solar diurnal modulation, the 27-day solar rotation, the 11-year solar cycle, and the 22-year solar magnetic cycle have also been characterized. These Sun-induced phenomena are most prominent in GCR intensity variations up to $\\sim$30 GeV/nuc, beyond which the influence of solar modulation decreases rapidly as the gyro-radii of GCRs exceed the characteristic size of the heliosphere ($\\sim$100 AU)."}
{"id": "2602.11876", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2602.11876", "abs": "https://arxiv.org/abs/2602.11876", "authors": ["Shree Suman", "Shuvajit Khatua", "Vishal Jadoliya", "Prathamesh Narayan Gupta", "Mayukh Pahari"], "title": "Spectro-timing origin of large amplitude X-ray variability in GRS 1915+105 using AstroSat/LAXPC and SXT", "comment": "22 pages, 9 figures, 6 tables. Accepted for publication in Research in Astronomy and Astrophysics (RAA)", "summary": "The origin of the large-amplitude, quasi-periodic X-ray flux variations in several classes of the Galactic microquasar GRS~1915+105 remains unresolved. We address this issue through flux-resolved, broadband (0.8-20 keV) spectral modelling and simultaneous covariance spectral analysis during two $κ$ and two $ω$ class observations using \\textit{AstroSat}/SXT and LAXPC. The lightcurves show strong, quasi-periodic oscillations involving rapid transitions between bright bursts and deep dips on timescales of a few tens of seconds. Flux-resolved spectroscopy indicates that high-flux intervals in both classes are dominated by a hot, optically thick accretion disc with steep Comptonized emission, whereas low-flux intervals correspond to a cooler or partially recessed disc and a harder coronal continuum. These transitions involve a systematic 1-2 keV drop in disc temperature and a pronounced hardening of the Comptonized component, with flux reductions of up to a factor of five. Using covariance spectra across 0.015-5 Hz, we show that the rapid coherent variability arises almost entirely from the disc, which exhibits strong energy-dependent variations, while the Comptonized component contributes minimally. The combined results suggest that radiation-pressure-driven structural changes in the disc, with a slower coronal response, produce the observed oscillations, consistent with cyclic disc evacuation and refilling in the $κ$ and $ω$ classes."}
{"id": "2602.12051", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2602.12051", "abs": "https://arxiv.org/abs/2602.12051", "authors": ["Rui Wang", "Zhen Yan", "Zhiqiang Shen", "Zhenlong Liao", "Zhipeng Huang", "Yajun Wu", "Rongbing Zhao", "Xiaowei Wang", "Jie Liu", "Kuo Liu", "Fan Yang", "Yangyang Lin", "Chuyuan Zhang"], "title": "The Interstellar Scintillation of the Radio-Loud Magnetar XTE J1810-197", "comment": "7 pages, 5 figures, accepted by Chinese Physics Letters", "summary": "We present a comprehensive interstellar scintillation (ISS) study of the radio-loud magnetar XTE~J1810$-$197, based on six years of multi-frequency monitoring (2018$-$2024) with the Shanghai Tian Ma Radio Telescope (TMRT) at 7.0, 8.6, and 14.0~GHz. The scintillation parameters--decorrelation bandwidth $Δν_{\\rm d}$, decorrelation time $Δτ_{\\rm d}$, and drift rate $dt/dν$--are fully characterized. Our measured $Δτ_{\\rm d}$ implies $Δτ_{\\rm d} < 4$~s at 575-725~MHz under a Kolmogorov spectrum, which is shorter than the magnetar's 5.54~s spin period. This result naturally explains the previously reported absence of pulse-to-pulse coherence at these frequencies. Kinematic modeling locates the dominant scattering screen at $1.6\\pm0.1$~kpc away from the Earth, within the Sagittarius Arm. The screen coincides with the HII region JCMTSE~J180921.2$-$201932 and is unrelated to the magnetar's 2018 outburst suggested by earlier studies. A scintillation arc detected at 14.0~GHz represents the highest-frequency arc observed to date. The asymmetry of arcs is linearly correlated with a dispersion-measure gradient across the screen ($r = 0.959$, $p < 10^{-8}$). We also measure its refractive scintillation timescale, which is only $1.21\\pm0.19$~d. Clear DISS at 14~GHz effectively resolves the debate over a possible strong-to-weak scattering transition at this frequency. These results extend the ISS characterization of magnetars to previously unexplored frequencies and provide a precise probe of the ionized interstellar medium in the Sagittarius Arm."}
{"id": "2602.12115", "categories": ["astro-ph.HE", "gr-qc"], "pdf": "https://arxiv.org/pdf/2602.12115", "abs": "https://arxiv.org/abs/2602.12115", "authors": ["Keisi Kacanja", "Kanchan Soni", "Aleyna Akyuz", "Alexander H. Nitz"], "title": "Search for Sub-Solar Mass Binaries in the First Part of LIGO's Fourth Observing Run", "comment": "6 pages, 3 figures, 1 table", "summary": "We report the first results of a sub-solar mass compact binary search using the data from the first part of the fourth observing run (O4a) of the Advanced LIGO detectors. Sub-solar mass neutron stars or primordial black holes are not expected to form via standard stellar evolution, and their observation would signify a new class of astrophysical object or the discovery of dark matter. Our search covers binaries with primary masses 0.1 to 2 $\\textrm{M}_\\odot$ and secondary masses 0.1 to 1 $\\textrm{M}_\\odot$. We explicitly incorporate tidal effects up to $7\\times10^5$ for extremely low mass neutron stars. No statistically significant candidates are identified. The advanced sensitivity of the O4a run enables an improvement in the sub-solar mass black hole merger rate limits by more than $2 \\times$ over the previous three observing runs (O1-O3b). We place a $90\\%$ confidence upper limit on the merger rate $\\mathcal{R}_{90}$ for sub-solar mass black holes to be $< 1.77\\times10^4 \\textrm{Gpc}^{-3} \\textrm{yr}^{-1}$ for a chirp mass of 0.2 $\\textrm{M}_\\odot$. We place the first constraints for binary neutron stars with tidal deformabilities up to $\\sim 7\\times10^5$ and improve the merger rate estimate by a factor $\\sim 4$ in comparison to previous O3 tidal searches for tidal deformabilities $< 10^4$. We further constrain the fraction of dark matter composed of primordial black hole $f_{\\rm PBH}< 2\\%$ for a chirp mass of 0.1 $\\textrm{M}_\\odot$. Our results significantly expand the observational search space for sub-solar binaries and provide rigorous constraints on the local abundance of compact objects that may arise from non-standard formation mechanisms."}
{"id": "2602.12165", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2602.12165", "abs": "https://arxiv.org/abs/2602.12165", "authors": ["Malihe Mousapour Gharghabi", "Jamshid Ghanbari", "Mahboobe Moeen Moghaddas"], "title": "Poloidal Field Amplification through Compression-Shear Dynamics in Schwarzschild Accretion: Pathways to MAD States", "comment": null, "summary": "The amplification of magnetic fields in black hole accretion flows governs key high-energy phenomena such as magnetically arrested disks and relativistic jets. We develop a semi-analytical general relativistic framework that extends classical compressional amplification models by incorporating rotational shear, and apply it to large-scale poloidal magnetic field evolution in accretion flows around a Schwarzschild black hole. By parameterizing the azimuthal velocity as a fraction of the Keplerian value ($ξ\\in [0,1]$), from purely radial infall ($ξ=0$) to Keplerian rotation ($ξ=1$), we examine the combined effects of radial compression and shear. Purely radial flows maximize amplification of both $B_r$ and $B_θ$ due to strong compression. In rotating flows, a distinct dichotomy emerges: sub-Keplerian regimes ($ξ<1$) preferentially enhance $B_r$, whereas Keplerian rotation strengthens $B_θ$ via shear. The transition from subsonic outer regions to supersonic relativistic inner regions further accelerates magnetic growth, revealing effects absent in earlier analytical treatments. These results show that rotational support controls both amplification efficiency and magnetic geometry, with sub-Keplerian phases particularly favorable for advecting the radial flux required for MAD formation. This work provides an analytical bridge between classical accretion theory and modern GRMHD simulations, with implications for X-ray binaries, AGNs, and EHT-scale systems."}
{"id": "2602.12195", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2602.12195", "abs": "https://arxiv.org/abs/2602.12195", "authors": ["Alexandra G. Guerrero", "Daniel E. Holz"], "title": "A simple model for extracting astrophysics from black hole images", "comment": "15 pages, 7 figures", "summary": "The Event Horizon Telescope (EHT) is providing unprecedented high-resolution images of supermassive black holes. These images are fundamentally related to properties of the luminous accretion disks, since black holes themselves produce no light. We develop a simple prescription to relate observational features of black hole images to a toy model for the intensity profile of the associated accretion disk. We apply our model to the original EHT image of M87*, as well as to the reanalyzed image from the PRIMO algorithm, providing generic, simultaneous constraints on the mass of the black hole and properties of the accretion disk emission. While current images lack the resolution to confidently detect the photon ring, the consideration of multiple image parameters are found to contain enough information to provide constraints on the inner edge of the accretion disk along with the black hole mass. Using observed features of the original EHT image, we constrain the mass of M87* to be $6.6^{+1.2}_{-1.0}\\times 10^9 M_\\odot$ to 68$\\%$ confidence, and find that emission may extend all the way to the black hole horizon. When instead using constraints from the PRIMO algorithm's image along with constraints on the brightness asymmetry provided by the original EHT analysis, we find M87*'s mass to be $ 6.4^{+0.7}_{-0.7}\\times 10^9 M_\\odot$ to 68$\\%$ confidence, with the inner edge of the accretion disk between $3M$ and $5.3M$. Both analyses rule out an inner edge of the accretion disk coinciding with the innermost stable circular orbit for a Schwarzschild black hole. Furthermore, the narrow ring width reported in the PRIMO image also confidently rules out emission increasing all the way down to the black hole horizon. Further assumptions on the mass of M87* and connections between the accretion disk cutoff and physical radii allow for rudimentary black hole spin estimates."}
{"id": "2602.12272", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2602.12272", "abs": "https://arxiv.org/abs/2602.12272", "authors": ["M. Guolo", "A. Mummery", "S. van Velzen", "M. Nicholl", "S. Gezari", "Y. Yao", "K. C. Chambers", "T. de Boer", "M. E. Huber", "C. -C. Lin", "T. B. Lowe", "E. A. Magnier", "G. Paek", "R. Wainscoat"], "title": "The Wandering Supermassive Black Hole Powering the off-nuclear TDE AT2024tvd", "comment": "Submitted to ApJ Letters", "summary": "We present an analysis of the spectral energy distribution (SED) of the off-nuclear tidal disruption event (TDE) AT2024tvd during its late-time plateau phase, combining X-ray spectra and UV/optical photometry. Using a fully relativistic, compact accretion disk model with self-consistent inner-disk Comptonization, we reproduce the observed SED without significant residuals. The inferred black hole mass ${\\rm log}{10}(M{\\bullet}/M_\\odot) \\approx 6.0 \\pm 0.2$, and the inferred disk parameters place AT2024tvd within known TDE-disk scaling relations ($L_{\\rm bol}^{\\rm disk}/L_{\\rm Edd} \\propto T_{\\rm p}^4 \\propto M_{\\bullet}^{-1}$, $L_{\\rm plat} \\propto M_{\\bullet}^{2/3}$, $R_{\\rm out}/r_{\\rm g} \\propto M_{\\bullet}^{-2/3}$). Our results show that: (i) there is no \\textit{detected} star cluster or dwarf galaxy associated with the source, down to a mass limit of $\\log_{10}(M_{\\rm gal}/M_{\\odot}) \\leq 7.6$; (ii) the black hole is a wandering supermassive, rather than intermediate-mass, black hole; and (iii) the source represents an extreme case of black hole-to-host mass ratio, with $M_{\\bullet}/M_{\\rm gal} > 3\\%$, consistent with a heavily tidally stripped nucleus. The latter aligns with cosmological simulations predicting that surviving host remnants of most wandering black holes should not retain a detectable stellar overdensity when located at small halo-centric distances. We discuss differences with previous analyses of this source and highlight why our modeling approach provides a more physically consistent solution with more reliable parameter inference."}
{"id": "2602.12282", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2602.12282", "abs": "https://arxiv.org/abs/2602.12282", "authors": ["D. Mata Sanchez", "T. Munoz-Darias", "J. Casares", "M. A. P. Torres", "M. Armas Padilla"], "title": "Ubiquitous yet forgotten: broad absorptions in the optical spectra of low-mass X-ray binaries", "comment": "Main text (15 pages, 8 Figures) + Appendix (7 pages, 8 Figures). Accepted for publication in A&A", "summary": "Optical outburst spectra of low-mass X-ray binaries enable studies of extreme accretion and ejection phenomena. While some of their spectroscopic features have been analysed in detail, the appearance of broad absorptions in the optical regime has been traditionally neglected. In this work, we introduce the first population study dedicated to these features with the aim to understand their fundamental properties and discuss them in the context of their origin. We complement the study with a spectroscopic database of six low-mass X-ray binaries during outburst, in order to assess their evolution. We find that broad absorptions are ubiquitous, with the majority of black hole low-mass X-ray binaries exhibiting them in spite of a typically scarce outburst coverage. Their detection does not depend on the orbital inclination or the compact object nature, but they seem favoured in systems with orbital periods shorter than < 11 h. They predominantly occur in the hydrogen Balmer series, being stronger at shorter wavelengths, and they are detected across all X-ray states. We find that the normalised depth of these broad absorptions is anti-correlated with the system luminosity, and that they show constant line ratios over the whole sample. Based on these properties, we favour a scenario where BAs arise from a stable, optically thick layer of the accretion disc, below the hotter chromosphere-like region producing the emission line components. Our study is consistent with the continuous presence of broad absorptions during the whole outburst, with their visibility being conditioned by the emission lines filling the broad absorption profile and veiling by the X-ray reprocessed continuum."}
