{"id": "2602.18605", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2602.18605", "abs": "https://arxiv.org/abs/2602.18605", "authors": ["David V. Stark", "M. Chiaberge", "N. A. Grogin"], "title": "The Impact of Degraded Charge Transfer Efficiency on Extended Sources in ACS/WFC", "comment": "27 pages, 14 figures", "summary": "Using repeat imaging of a galaxy cluster taken over a seventeen-year baseline, we examine the impact that degraded Charge Transfer Efficiency (CTE) has on photometric measurements of extended sources using the ACS/WFC on HST. We examine how measured brightnesses depend on time since ACS installation, source location on the WFC detectors, source brightness, and local background level in individual exposures. We find that global brightness measurements using large apertures are generally reliable within $\\sim$0.05 magnitudes across the WFC detectors if exposure backgrounds are above $20e^-/{pixel}$ and sources are brighter than $\\sim300e^-$ in a single exposure. However, brightness measurements on smaller scales can suffer deficiencies in excess of 0.1 mags (sometimes, significantly more) in recent data unless sources are very close to the CCD serial registers ($\\lesssim 512$ pixels), or brighter than $\\sim3000\\,e^-$ in a single exposure. We also show how degraded CTE can result in artificial asymmetries in galaxy light distributions, which are largely mitigated if backgrounds are $>20e^-/{pixel}$ and targets are not far ($>1536$ pixels) from the serial registers. As expected, brightness measurements in later epoch data are best when using CTE-corrected images (FLC/DRC), but our results imply that the pixel-based CTE correction algorithm employed by the ACS reduction pipeline does not necessarily place charge back into its original location within extended sources. Based on this study, users are advised to keep backgrounds above the already recommended $30e^-/\\mathrm{pixel}$, ensure targets will have at least $\\sim 300e^-$ in a single exposure, and place targets close to the serial registers if analysis of their spatially resolved properties is needed."}
{"id": "2602.18923", "categories": ["astro-ph.IM", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2602.18923", "abs": "https://arxiv.org/abs/2602.18923", "authors": ["Johnny Joseph Alphonse", "Anna M. M. Scaife"], "title": "Variational views for self-supervised learning in radio astronomy", "comment": null, "summary": "Modern astronomical surveys are producing progressively larger and more complex datasets, making traditional supervised approaches that rely on extensive labelled catalogues increasingly difficult. Consequently, pre-training using self-supervised learning (SSL), which offers a scalable route by extracting structure directly from unlabelled images, is becoming attractive for many downstream applications. In this work we consider the use of coupled self-supervised representation learning approaches for radio galaxy morphology pre-training. In order to account for the more nuanced variations in radio galaxy morphology than are typically included in the augmented views of view-based SSL algorithms, we use a pre-trained Variational Autoencoder (VAE) to generate views for training a larger view-based self-supervised model. To do this, a $β$-VAE was trained on the Radio Galaxy Zoo (RGZ) dataset, where moderate regularization ($β= 2.3$) was found to provide a good balance between reconstruction quality and disentanglement of generative factors such as source multiplicity and lobe asymmetry. An analysis of the $β$-VAE reveals that Fanaroff-Riley class identity manifests as a continuous transition across the latent space, rather than being associated to a single discrete dimension. $β$-VAE reconstructions were then incorporated as generative augmentations within a view-based SSL pipeline. Our experiments show that combining these generative views with standard image augmentations improves downstream classification performance, and we present ablation studies clarifying the relative contribution of each augmentation type. These results indicate that generative and contrastive approaches are complementary, and point toward disentanglement-aware self-supervised learning as a promising direction for future radio astronomy surveys."}
{"id": "2602.18975", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2602.18975", "abs": "https://arxiv.org/abs/2602.18975", "authors": ["Tirupati Kumara Sridharan", "Robert Lehmensiek", "Yoshiharu Asaki"], "title": "The ngVLA Band-4 Water Vapor Radiometry Concept", "comment": null, "summary": "The ngVLA has adopted a standalone system with a $\\sim$~1.5 m diameter antenna and associated ambient temperature receiver and electronics at each antenna as its baseline design for water vapor radiometer (WVR). The WVR is intended to decrease calibration overheads for tropospheric phase correction for the high frequency bands (5 \\& 6; 30.5-116 GHz) to levels lower than feasible with fast switched reference gain calibration.\n  In this memo, we present an alternative concept utilizing the standard Band-4 science receivers and the main antennas. This would require the Band-4 feed to be placed between those of Bands 5 \\& 6 resulting in a beam offset of 0.8 deg, similar to the beam size of the standalone 1.5 m antenna. The main benefits of the Band-4 WVR concept are: (1) sensing water vapor in a region more representative of the Band 5 \\& 6 science beams in the lower layers of the troposphere, in the near-field of the 18 m antenna, than the 1.5 m antenna (2) significantly relaxing the stability requirements due to the lower receiver temperature of the standard Band-4 cryogenic receiver and (3) eliminating the procurement, deployment, and maintenance of a large number of standalone units. Given these advantages, it is recommended that the details and the pros and cons of Band-4 WVR implementation compared a standalone system be carefully considered."}
{"id": "2602.19135", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2602.19135", "abs": "https://arxiv.org/abs/2602.19135", "authors": ["Zhiyun Zhang", "N. Liu", "Xiaxuan Zhang", "I. Nurul Huda", "Sufen Guo", "Z. Zhu", "J. -C. Liu", "J. Yao", "Z. -W. Wang", "H. -F. Yu", "D. -D. Zhang"], "title": "Astrometric properties of reference frame sources as a function of redshift", "comment": "14 pages, 13 figures, accepted for publication in A&A", "summary": "Previous studies based on the latest realisation of the International Celestial Reference Frame (ICRF3) have suggested a correlation between astrometric properties (such as the radio-optical offset) and redshift for active galactic nuclei (AGNs). We extend these investigations by using a large, all-sky sample of approximately 22,000 compact radio sources from the Radio Fundamental catalogue (RFC) to examine this relationship in a systematic and statistically robust manner. We compiled redshifts for about 10,000 RFC sources over the range 0 < z < 5 by combining data from the Dark Energy Spectroscopic Instrument Data Release 1 and the Sloan Digital Sky Survey Data Release 17/19 with additional datasets from the NASA/IPAC Extragalactic Database. Cross-matching with Gaia Data Release 3 yielded a clean sample of 4,068 RFC objects with reliable spectroscopic redshifts and classifications (galaxies and quasi-stellar objects; QSOs). We analysed the redshift dependence of their radio astrometric properties from very long baseline interferometry (VLBI) and their optical astrometric properties from Gaia. We find that the VLBI astrometric properties show no significant dependence on redshift within the achieved level of precision. In contrast, several optical astrometric quantities exhibit clear redshift-dependent behaviour. The median absolute radio-optical offsets decrease markedly over 0 < z < 0.5, where galaxies dominate the sample, decline more gradually over 0.5 < z < 1.3, and exhibit a mild increase at z > 1.3, where QSOs dominate. Similar behaviour is observed for several Gaia astrometric quantities, including astrometric uncertainties, proper motions, and G magnitudes. These behaviours can be largely explained by the dependence of Gaia astrometric performance on G magnitude and by the evolution of the G magnitude with redshift."}
{"id": "2602.18560", "categories": ["astro-ph.HE", "astro-ph.IM", "gr-qc"], "pdf": "https://arxiv.org/pdf/2602.18560", "abs": "https://arxiv.org/abs/2602.18560", "authors": ["Federico De Santi", "Alessandro Santini", "Alexandre Toubiana", "Nikolaos Karnesis", "Davide Gerosa"], "title": "Inferring the population properties of galactic binaries from LISA's stochastic foreground", "comment": "20 pages, 15 figures, 3 tables", "summary": "Galactic binaries are expected to be the most numerous LISA sources and to produce a stochastic gravitational-wave foreground whose spectral shape encodes information about the underlying population. Extracting this information with standard hierarchical methods is challenging due to the high dimensionality of the problem and the computational cost of global-fit analyses. We present a simulation-based inference framework to measure the population properties of galactic binaries directly from the reconstructed foreground. Adopting an astrophysically agnostic parametrization in the observable space -- defined by signal amplitude, frequency, and frequency derivative -- we generate synthetic catalogs and foreground spectra using a global-fit-inspired subtraction algorithm. We then train a neural posterior estimator to map spectra to population parameters. We validate our method on simulated data and recover population parameters with good accuracy, including the total number of binaries. As a by-product, we present a GPU-accelerated version of the subtraction algorithm, which delivers a ~100X speed-up compared to previous implementations in the literature. Our results demonstrate that LISA's stochastic foreground alone carries significant information about the Galactic binary population and provide a practical step toward joint inference from resolved and unresolved sources."}
{"id": "2602.19286", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2602.19286", "abs": "https://arxiv.org/abs/2602.19286", "authors": ["Matthew M. Dallas", "Matthew R. Siebert"], "title": "Safety Acquisitions: Redundancy for non-repeatable multi-orbit STIS visits", "comment": "18 pages, 8 figures", "summary": "For observations of supernovae, kilonovae, tidal disruption events, and other non-repeatable observations, it is important the science data is taken successfully within a specific time window. Part of obtaining that data is often centering objects in the aperture to a higher accuracy than is available from Hubble Space Telescope's (HST's) blind pointing. On HST STIS the sequence of exposures responsible for this centering is the target acquisition or STIS ACQ sequence, and it is most often placed only at the beginning of a visit. Unfortunately, STIS ACQ sequences will fail if the observatory experiences issues locating guide stars in time for the start of the required exposures. If the guide stars are located at a later point in the visit, the remaining science exposures can be taken but the pointing might not be as accurate as is required. This work discusses both the frequency of this issue and the feasibility of placing redundant or \"safety\" STIS ACQ sequences in a multi-orbit visit to regain the desired pointing accuracy in an affected visit. To do so we select a subset of all 113 STIS ACQ sequences from September 2018 to September 2023 which have experienced this issue. We find that this problem occurs in ~5% of the total STIS ACQ sequences taken during that time period, with a recent increase in the rate to ~9% from March to September 2023. Since the observatory goes through periods of better or worse pointing performance, this recent increased failure rate is not guaranteed to continue. For those failed visits which span multiple orbits, ~39% never obtain a lock on the guide stars and thus take no data. Of the multi-orbit visits that do recover the guide stars, the majority (~78%) do so before the beginning of science exposures in the second orbit. We also provide advice for users on how to make a risk assessment based on the analysis presented here."}
{"id": "2602.18698", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2602.18698", "abs": "https://arxiv.org/abs/2602.18698", "authors": ["Andrew Mummery"], "title": "Accretion disks in (repeating) partial tidal disruption events: rapid state transitions, UV plateaus and flares from disk-remnant collisions", "comment": "10 pages, 4 figures. Version accepted in MNRAS", "summary": "Tidal disruption events which repeat on timescales of months-to-years represent an unambiguous signature of a partial disruption, with the surviving stellar remnant returning to pericentre to be repeatedly stripped by tidal forces. These systems therefore offer the best laboratories to study the differences between partial and full disruptions. One noteworthy observational difference between the two systems is that all known X-ray bright repeating TDEs show rapid transitions between thermal, non-thermal and completely dim states on timescales much shorter than full (non-repeating) TDEs. We argue this can be simply understood as being due to the reduction in fuel supply available to the disk, and that these systems provide evidence that all tidal disruption events undergo a state transition at Eddington ratios $f_{\\rm edd} = L_{\\rm bol}/L_{\\rm edd} \\sim 0.01$, similar to X-ray binaries. {As part of this calculation we derive a general expression for the time taken for a TDE disk to fall to a given Eddington fraction, which will be of use to both full and partial TDE science.} Perhaps surprisingly, the late-time optical/UV plateau luminosity observed from these systems is largely unaffected by this reduction in fuel supply, provided the outer disk remains in a thermal state for long enough for this emission to be detected. We then show that collisions between the returning stellar remnant and the disk formed from the last passage will produce potentially observable X-ray flares ($L_{\\rm flare} \\simeq 10^{42}$ erg/s), but that they are likely to be very difficult to detect as they are generally short-lived ($t_{\\rm flare} \\simeq 0.1-1$ hr)."}
{"id": "2602.19447", "categories": ["astro-ph.IM", "astro-ph.EP"], "pdf": "https://arxiv.org/pdf/2602.19447", "abs": "https://arxiv.org/abs/2602.19447", "authors": ["Dale Giancono", "Hadrien Devillepoix", "Robert Howie", "Denis Vida", "David Rollinson"], "title": "Photometry of Fireballs using High Frame Rate Cameras", "comment": null, "summary": "Fast sampling photometry is essential for characterising fireballs and their fragmentation episodes which link to the meteoroid internal structure. Accurate measurements remain challenging due to the large required dynamic range of up to 10 stellar magnitudes driving up operational complexity and cost. We developed an all-sky camera system operating at up to 500 frames per second featuring a novel Detection Localised Auto-brightness Control. Custom software manages high data throughput via transient detection and region-of-interest saving with real-time photometry. Two field deployments validate photometric accuracy against conventional 30 frames per second cameras and demonstrate the successful capture of a bright magnitude -15 fireball with minimal saturation. The system achieves an effective dynamic range between apparent magnitudes -3 and -17 capturing minimally saturated light curves for most fireballs. A successful semi-empirical fragmentation analysis verifies its ability to provide data for detailed physical modelling. The primary application for this validated system will be as a core component of the Global Fireball Observatory's next-generation instrumentation. The intention is to deploy it in a hybrid observatory, operating alongside a dedicated high-resolution astrometric camera. This configuration will allow the network to simultaneously capture precise trajectory data for orbit and fall-line calculations and acquire complete, unsaturated high dynamic range light curves at high temporal resolution for detailed physical analysis, combining the strengths of both systems."}
{"id": "2602.18743", "categories": ["astro-ph.HE", "hep-ex"], "pdf": "https://arxiv.org/pdf/2602.18743", "abs": "https://arxiv.org/abs/2602.18743", "authors": ["F. Alemanno", "Q. An", "P. Azzarello", "F. C. T. Barbato", "P. Bernardini", "X. J. Bi", "H. Boutin", "I. Cagnoli", "M. S. Cai", "E. Casilli", "J. Chang", "D. Y. Chen", "J. L. Chen", "Z. F. Chen", "Z. X. Chen", "P. Coppin", "M. Y. Cui", "T. S. Cui", "I. De Mitri", "F. de Palma", "A. Di Giovanni", "T. K. Dong", "Z. X. Dong", "G. Donvito", "J. L. Duan", "K. K. Duan", "R. R. Fan", "Y. Z. Fan", "F. Fang", "K. Fang", "C. Q. Feng", "L. Feng", "S. Fogliacco", "J. M. Frieden", "P. Fusco", "M. Gao", "F. Gargano", "E. Ghose", "K. Gong", "Y. Z. Gong", "D. Y. Guo", "J. H. Guo", "S. X. Han", "Y. M. Hu", "G. S. Huang", "X. Y. Huang", "Y. Y. Huang", "M. Ionica", "L. Y. Jiang", "W. Jiang", "Y. Z. Jiang", "J. Kong", "A. Kotenko", "D. Kyratzis", "S. J. Lei", "B. Li", "M. B. Li", "W. H. Li", "W. L. Li", "X. Li", "X. Q. Li", "Y. M. Liang", "C. M. Liu", "H. Liu", "J. Liu", "S. B. Liu", "Y. Liu", "F. Loparco", "M. Ma", "P. X. Ma", "T. Ma", "X. Y. Ma", "G. Marsella", "M. N. Mazziotta", "D. Mo", "Y. Nie", "X. Y. Niu", "A. Parenti", "W. X. Peng", "X. Y. Peng", "C. Perrina", "E. Putti-Garcia", "R. Qiao", "J. N. Rao", "Y. Rong", "R. Sarkar", "P. Savina", "A. Serpolla", "Z. Shangguan", "W. H. Shen", "Z. Q. Shen", "Z. T. Shen", "L. Silveri", "J. X. Song", "M. Stolpovskiy", "H. Su", "M. Su", "H. R. Sun", "Z. Y. Sun", "A. Surdo", "X. J. Teng", "A. Tykhonov", "G. F. Wang", "J. Z. Wang", "L. G. Wang", "S. Wang", "X. L. Wang", "Y. F. Wang", "D. M. Wei", "J. J. Wei", "Y. F. Wei", "D. Wu", "J. Wu", "S. S. Wu", "X. Wu", "Z. Q. Xia", "Z. Xiong", "E. H. Xu", "H. T. Xu", "J. Xu", "Z. H. Xu", "Z. L. Xu", "Z. Z. Xu", "G. F. Xue", "M. Y. Yan", "H. B. Yang", "P. Yang", "Y. Q. Yang", "H. J. Yao", "Y. H. Yu", "Q. Yuan", "C. Yue", "J. J. Zang", "S. X. Zhang", "W. Z. Zhang", "Yan Zhang", "Yi Zhang", "Y. J. Zhang", "Y. L. Zhang", "Y. P. Zhang", "Y. Q. Zhang", "Z. Zhang", "Z. Y. Zhang", "C. Zhao", "H. Y. Zhao", "X. F. Zhao", "C. Y. Zhou", "X. Zhu", "Y. Zhu", "X. Luo"], "title": "Diverse properties of electron Forbush decreases revealed by the Dark Matter Particle Explorer", "comment": "14 pages, 12 figures. Accepted for publication in PRL", "summary": "The Forbush decrease (FD) of cosmic rays is an important probe of the interplanetary environment disturbed by solar activities. In this work, we study the properties of 8 FDs electrons (including positrons) between 2 GeV and 20 GeV from January, 2016 to March, 2024, with the Dark Matter Particle Explorer. The maximum decrease amplitudes of these events are about 30% - 15%, and the amplitudes reduce with energy. The recovery time of these events shows diverse behaviors of their energy-dependence. Some of them show strong energy-dependence, while some have a nearly constant recovery time. It has been shown that such diverse behaviors could be related with the geometry of the disturbed regions of the interplanetary space by coronal mass ejections (CME), represented by the combined effect of the CME velocity, angular spread, and ejection direction."}
{"id": "2602.19814", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2602.19814", "abs": "https://arxiv.org/abs/2602.19814", "authors": ["Razmik Mirzoyan", "Alexander Hahn", "David Fink", "Antonios Dettlaff", "Daniel Mazin", "David Paneque", "Olaf Reimann", "Thomas Schweizer", "Derek Strom", "Masahiro Teshima", "Yazhou Zhao"], "title": "Direct comparison of SiPMs and PMTs in operation with a bright background and prospects of using SPADs as truly digital sensors", "comment": "4 pages, 3 figures, Proceedings of the 12th International Workshop on Ring Imaging Cherenkov Detectors (RICH2025), Accepted for publication in Nuclear Instruments and Methods in Physics Research - section A (NIM-A)", "summary": "The use of silicon photomultipliers (SiPMs) alongside conventional photomultiplier tubes (PMTs) is a remarkable technological development in modern ground-based very high energy gamma-ray astronomy. SiPMs exhibit comparable or even higher photon detection efficiencies (PDEs) than PMTs. The sensitivity of a PMT matches well the spectral shape of Cherenkov radiation from extended air showers. In contrast to a PMT, the sensitivity of a SiPM is shifted toward longer wavelengths, where the intensity of light of night sky (LoNS), considered as unwanted noise, increases significantly. It is obvious that a SiPM with a higher PDE will indeed measure more Cherenkov light than a PMT, but it will also detect significantly higher LoNS noise; the question is which factor will predominate in the signal-to-noise-ratio (SNR). To compare the performance of a PMT with that of a SiPM, we built SiPM-based modules and installed these and operated in parallel in the imaging camera of the 17 m diameter MAGIC telescope. Our long-term studies show that SiPM, despite their higher PDE, can deliver only a comparable to PMT performance. As already the name SiPM suggests, we use these semiconductor sensors analogously to classical PMTs: We amplify their small signals, digitize, and calibrate the converted amplitudes. Although SiPM is essentially a digital sensor, its common-anode design does not allow one to directly profit from it. Numerous arrays of single-photon avalanche diodes (SPADs) are being developed in various laboratories worldwide. Unlike SiPM, SPAD arrays digitize the incident photons from the outset and count their number. We will dwell on the potential further developments of SPADs."}
{"id": "2602.18783", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2602.18783", "abs": "https://arxiv.org/abs/2602.18783", "authors": ["Manoj Mandal", "Sachindra Naik"], "title": "Discovery of burst oscillations in the newly discovered millisecond X-ray pulsar SRGA J144459.2$-$604207", "comment": "Accepted for publication in ApJ", "summary": "Burst oscillations during thermonuclear X-ray bursts are powered by thermonuclear energy on the neutron star (NS) surface and typically occur close to the spin frequency of the NS. We performed a comprehensive timing analysis of all thermonuclear bursts from the newly discovered millisecond X-ray pulsar SRGA J144459.2$-$604207, observed with NICER, XMM-Newton, and NuSTAR during the 2024 outburst. A total of 39 bursts were detected, allowing for a detailed search for burst oscillations, which had not been previously observed from this source. We report the discovery of burst oscillations at 447.7$-$448.0 Hz from SRGA J144459.2$-$604207 using XMM-Newton and NuSTAR data, consistent with the spin frequency of the NS. The strongest burst oscillation in the XMM-Newton data occurred with a single-trial significance of $5.1σ$ and maximum $Z^2$ power of $\\sim31$. In the NuSTAR data, the strongest oscillation signal has a significance of $5.2σ$ and maximum $Z^2$ power of $\\sim32$. The folded pulse profile corresponding to the strongest signal in the 0.5-10 keV band of the XMM-Newton data shows a sinusoidal shape with a fractional rms amplitude of $\\sim8.5\\%$, while the measurements of the NuSTAR data (3-40 keV range) yield $\\sim21\\%$. These results represent the first detection of burst oscillations in SRGA J144459.2$-$604207. Additionally, we report the detection of 447.6 Hz oscillations occurring just before a burst onset observed with XMM-Newton. This marks only the second instance in which burst oscillations have been observed before the burst onset."}
{"id": "2602.19984", "categories": ["astro-ph.IM", "astro-ph.HE", "cs.LG"], "pdf": "https://arxiv.org/pdf/2602.19984", "abs": "https://arxiv.org/abs/2602.19984", "authors": ["Federico Incardona", "Alessandro Costa", "Farida Farsian", "Francesco Franchina", "Giuseppe Leto", "Emilio Mastriani", "Kevin Munari", "Giovanni Pareschi", "Salvatore Scuderi", "Sebastiano Spinello", "Gino Tosti"], "title": "Multivariate time-series forecasting of ASTRI-Horn monitoring data: A Normal Behavior Model", "comment": "15 pages, 12 figures", "summary": "This study presents a Normal Behavior Model (NBM) developed to forecast monitoring time-series data from the ASTRI-Horn Cherenkov telescope under normal operating conditions. The analysis focused on 15 physical variables acquired by the Telescope Control Unit between September 2022 and July 2024, representing sensor measurements from the Azimuth and Elevation motors. After data cleaning, resampling, feature selection, and correlation analysis, the dataset was segmented into fixed-length intervals, in which the first I samples represented the input sequence provided to the model, while the forecast length, T, indicated the number of future time steps to be predicted. A sliding-window technique was then applied to increase the number of intervals. A Multi-Layer Perceptron (MLP) was trained to perform multivariate forecasting across all features simultaneously. Model performance was evaluated using the Mean Squared Error (MSE) and the Normalized Median Absolute Deviation (NMAD), and it was also benchmarked against a Long Short-Term Memory (LSTM) network. The MLP model demonstrated consistent results across different features and I-T configurations, and matched the performance of the LSTM while converging faster. It achieved an MSE of 0.019+/-0.003 and an NMAD of 0.032+/-0.009 on the test set under its best configuration (4 hidden layers, 720 units per layer, and I-T lengths of 300 samples each, corresponding to 5 hours at 1-minute resolution). Extending the forecast horizon up to 6.5 hours-the maximum allowed by this configuration-did not degrade performance, confirming the model's effectiveness in providing reliable hour-scale predictions. The proposed NBM provides a powerful tool for enabling early anomaly detection in online ASTRI-Horn monitoring time series, offering a basis for the future development of a prognostics and health management system that supports predictive maintenance."}
{"id": "2602.19010", "categories": ["astro-ph.HE", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2602.19010", "abs": "https://arxiv.org/abs/2602.19010", "authors": ["Sethulakshmi Vazhayil", "Firoza K. Sutaria", "Riddhiman Sharma", "Alak K. Ray"], "title": "SN 2017hcc and SN 2023usc a comparative spectroscopic study of type IIn supernovae", "comment": "The paper has been accepted by APJ", "summary": "We report on a spectroscopic study of the bright, nearby type-IIn supernova SN 2017hcc, and SN 2023usc using data obtained from the Himalayan Chandra Telescope (HCT). SN 2017hcc is well-studied event, and our sampling covers 7 epochs, starting from +14\\,d post explosion, and continuing into the nebular stage, at +411\\,d. The type-IIn event SN 2023usc was sampled over 5 epochs from +12\\,d to +155\\,d post explosion. The nearly featureless (except H$α$) late time (+62\\,d onward) spectra of SN 2023usc, suggests a novel explosion route for this type-IIn event. Assuming a CSM model created by multi-epoch ejection of material from the pre-explosion progenitor, we present here a comparative study of both events with several other type-IIn / interacting supernovae in progenitors with persistent signatures of a CSM. We find that true narrow lines ($v \\ll 1000$\\,km\\,s$^{-1}$) emerge in the early ($\\sim$ +10\\,d) spectra only in few events (SN 2017hcc, SN 2023usc and SN 2010jl) initially classified as type-IIn in our sample -- in most cases the line velocity hovers at $\\sim 1000$\\,km\\,s$^{-1}$ even in the very early epochs. CSM line velocity being indicative of its extent and opacity, this suggests that progenitors with a highly extended CSMs, which are also optically transparent in their outer regions may be relatively rare."}
{"id": "2602.18560", "categories": ["astro-ph.HE", "astro-ph.IM", "gr-qc"], "pdf": "https://arxiv.org/pdf/2602.18560", "abs": "https://arxiv.org/abs/2602.18560", "authors": ["Federico De Santi", "Alessandro Santini", "Alexandre Toubiana", "Nikolaos Karnesis", "Davide Gerosa"], "title": "Inferring the population properties of galactic binaries from LISA's stochastic foreground", "comment": "20 pages, 15 figures, 3 tables", "summary": "Galactic binaries are expected to be the most numerous LISA sources and to produce a stochastic gravitational-wave foreground whose spectral shape encodes information about the underlying population. Extracting this information with standard hierarchical methods is challenging due to the high dimensionality of the problem and the computational cost of global-fit analyses. We present a simulation-based inference framework to measure the population properties of galactic binaries directly from the reconstructed foreground. Adopting an astrophysically agnostic parametrization in the observable space -- defined by signal amplitude, frequency, and frequency derivative -- we generate synthetic catalogs and foreground spectra using a global-fit-inspired subtraction algorithm. We then train a neural posterior estimator to map spectra to population parameters. We validate our method on simulated data and recover population parameters with good accuracy, including the total number of binaries. As a by-product, we present a GPU-accelerated version of the subtraction algorithm, which delivers a ~100X speed-up compared to previous implementations in the literature. Our results demonstrate that LISA's stochastic foreground alone carries significant information about the Galactic binary population and provide a practical step toward joint inference from resolved and unresolved sources."}
{"id": "2602.19018", "categories": ["astro-ph.HE", "nucl-ex", "nucl-th"], "pdf": "https://arxiv.org/pdf/2602.19018", "abs": "https://arxiv.org/abs/2602.19018", "authors": ["Hao Huang", "Akira Dohi", "Amira Aoyama", "Tomoshi Takeda", "Nobuya Nishimura"], "title": "Evidence of Nuclear Urca Process in the Ocean of Neutron-Star Superburst MAXI J1752$-$457", "comment": "6 pages, 4 figures", "summary": "We propose that the rapid cooling of the neutron star following its X-ray superburst in MAXI J1752$-$457 over a period of 4 days, observed by two Japanese satellites, MAXI and NinjaSat, is due to enhanced neutrino emission from cycles of electron capture and $β^{-}$ decay involving odd-$A$ nuclei (or Urca pairs) in the ocean. Hence, this work provides the first indication of the possible existence of such a ``nuclear Urca process\". The observation of MAXI J1752$-$457 implies a hot ignition layer with a maximum temperature of $\\sim4~{\\rm GK}$, located near the Urca shell in the ocean, such that the nuclear Urca process becomes dominant for up to $\\sim2$ days after the superburst. This behavior is distinct from that of normal Type-I X-ray bursts, which are triggered by hydrogen or helium burning in much shallower layers than those of superbursts. Our findings enable probing of superburst ashes through Urca pairs via long-term monitoring of crust cooling on day-long timescales."}
{"id": "2602.19864", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2602.19864", "abs": "https://arxiv.org/abs/2602.19864", "authors": ["Karen Terveer", "Sjoerd Bouma", "Stijn Buitink", "Arthur Corstanje", "Vital De Henau", "Vincent Eberle", "Torsten A. Enßlin", "Philipp Frank", "Tim Huege", "Philipp Laub", "Katharine Mulrey", "Anna Nelles", "Simon Strähnz", "Satyendra Thoudam", "Keito Watanabe"], "title": "A Bayesian Method for Air-Shower Reconstruction using Information Field Theory", "comment": "19 pages, 11 figures", "summary": "The radio detection of extensive air showers provides a powerful method for studying the origin of high-energy cosmic rays. The Low-Frequency Array (LOFAR) offers unprecedentedly detailed measurements of the radio emission footprint. However, fully exploiting this information requires advanced reconstruction techniques. In this paper, we introduce a novel framework for air shower reconstruction based on Bayesian inference and Information Field Theory (IFT). Our method is built on a fully differentiable forward model of the radio signal, which incorporates a physical emission parameterization and a precise wavefront model. Additionally, we augment this physical model with Gaussian processes to account for systematic uncertainties in both the signal fluence and arrival timing. By leveraging gradient information, our approach enables efficient (three orders of magnitude acceleration w.r.t.\\ the legacy method) and robust inference of the underlying physical shower parameters, such as primary energy and the depth of shower maximum, $X_\\text{max}$. This work provides not only point estimates but also a rigorous quantification of uncertainties. We achieve a resolution in $X_\\text{max}$ of $25\\,\\mathrm{g/cm^2}$ and a radiation energy resolution of $12\\%$ on simulations for LOFAR."}
{"id": "2602.19200", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2602.19200", "abs": "https://arxiv.org/abs/2602.19200", "authors": ["Stefano Silvestri", "Dmitry Prokhorov", "Jacco Vink", "Patrick Slane", "Yi-Jung Yang", "Niccolo Bucciantini", "Riccardo Ferrazzoli", "Ping Zhou", "Enrico Costa", "Nicola Omodei", "Chi-Yung Ng", "Paolo Soffitta", "Martin C. Weisskopf", "Luca Baldini", "Alessandro Di Marco", "Victor Doroshenko", "Jeremy Heyl", "Philip Kaaret", "Frederic Marin", "Tsunefumi Mizuno", "Melissa Pesce-Rollins", "Carmelo Sgro", "Douglas A. Swartz", "Toru Tamagawa", "Fei Xie", "Ivan Agudo", "Lucio A. Antonelli", "Matteo Bachetti", "Wayne H. Baumgartner", "Ronaldo Bellazzini", "Stefano Bianchi", "Stephen D. Bongiorno", "Raffaella Bonino", "Alessandro Brez", "Fiamma Capitanio", "Simone Castellano", "Elisabetta Cavazzuti", "Chien-Ting Chen", "Stefano Ciprini", "Alessandra De Rosa", "Ettore Del Monte", "Laura Di Gesu", "Niccolo Di Lalla", "Immacolata Donnarumma", "Michal Dovciak", "Steven R. Ehlert", "Teruaki Enoto", "Yuri Evangelista", "Sergio Fabiani", "Javier A. Garcia", "Shuichi Gunji", "Kiyoshi Hayashida", "Wataru Iwakiri", "Svetlana G. Jorstad", "Vladimir Karas", "Fabian Kislat", "Takao Kitaguchi", "Jeffery J. Kolodziejczak", "Henric Krawczynski", "Fabio La Monaca", "Luca Latronico", "Ioannis Liodakis", "Simone Maldera", "Alberto Manfreda", "Andrea Marinucci", "Alan P. Marscher", "Herman L. Marshall", "Francesco Massaro", "Giorgio Matt", "Ikuyuki Mitsuishi", "Fabio Muleri", "Michela Negro", "Stephen L. O'Dell", "Chiara Oppedisano", "Alessandro Papitto", "George G. Pavlov", "Abel L. Peirson", "Matteo Perri", "Pierre-Olivier Petrucci", "Maura Pilia", "Andrea Possenti", "Juri Poutanen", "Simonetta Puccetti", "Brian D. Ramsey", "John Rankin", "Ajay Ratheesh", "Oliver J. Roberts", "Roger W. Romani", "Gloria Spandre", "Fabrizio Tavecchio", "Roberto Taverna", "Yuzuru Tawara", "Allyn F. Tennant", "Nicholas E. Thomas", "Francesco Tombesi", "Alessio Trois", "Sergey S. Tsygankov", "Roberto Turolla", "Kinwah Wu", "Silvia Zane"], "title": "Magnetic-field Order in the Southwestern Rim of RCW 86 Constrained Using X-Ray Polarimetry", "comment": "12 pages, 5 figures", "summary": "RCW 86 is a supernova remnant whose origin has recently been linked to an off-center explosion within a cavity created by its progenitor star. In the southwestern region, the forward shock is thought to have reached the cavity wall, encountering diverse environmental conditions. We report on the spatially resolved X-ray polarimetric observation of RCW 86 with the Imaging X-ray Polarimetry Explorer (IXPE). In the 2--4.5 keV energy band we find no significant detection of polarization. Employing a dedicated background subtraction procedure and Bayesian spectropolarimetric fitting, we derive 99% upper limits on the polarization degree of the synchrotron component: 15% in higher-statistics regions and 30%--40% in lower-statistics regions. These upper limits on the polarization degree in several regions exclude the possibility of a strongly coherent magnetic field down to the subparsec scale, and that of a moderately coherent one on the scale of the synchrotron features as resolved by IXPE. The results indicate that the shocks in the southwestern rim of RCW 86 propagate more slowly than the unshocked ejecta at their locations, yet exceed the measured proper motion speeds. This behavior is consistent with reflected shocks occurring in tenuous regions of the shocked ejecta, distinct from regions that are radio-bright."}
{"id": "2602.19211", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2602.19211", "abs": "https://arxiv.org/abs/2602.19211", "authors": ["HongYu Pu", "Siming Liu"], "title": "The Apparent Asymmetric Outflows of TeV Particles from Pulsar Winds", "comment": null, "summary": "Observations of X-ray filaments attached to a couple of powerful pulsars suggest escape of TeV electrons and/or positrons (e$^{\\pm}$) from pulsar bow shocks into surrounding large scale magnetic fields. These filaments are usually asymmetric with very weak emission from the other side of the main filaments, and no significant spectral variation has been detected across these filaments, implying inefficient energy loss of emitting particles. We develop a Monte Carlo code to simulate particle transport in a large scale magnetic field and apply the model to PSR B2224+4415 (Guitar). It is shown that, with an injection power of a few tens of percent of the pulsar spin down luminosity, TeV e$^{\\pm}$ can explain the observed filament properties with a scattering mean free path along the magnetic field comparable to the length of the observed filament. The model predicts a dim diffuse symmetric X-ray background aligned with the filament on a larger scale, whose flux is proportional to the X-ray emitting e$^{\\pm}$ energy loss time for a stable e$^{\\pm}$ injection power comparable to the luminosity of this diffuse background. Observations with a large field of view and good sensitivity should be able to detect such a component."}
{"id": "2602.19214", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2602.19214", "abs": "https://arxiv.org/abs/2602.19214", "authors": ["M. A. Hashad", "A. Hammad", "Amr A. EL-Zant"], "title": "Potential periodic signals in blazars: significance, forecasting and deep learning", "comment": null, "summary": "Blazars exhibit variable emission on diverse timescales. Some light curves show signs of quasiperiodic oscillations (QPOs), which may encode clues regarding the physical processes behind the emission or point to supermassive binary black holes. We analyzed five blazars with previously reported high significance year-long QPOs, applying the Lomb-Scargle periodogram and Weighted Wavelet Z-transform methods to Fermi-LAT data up to early 2025. We furthermore examined an additional source (PKS 0139-09), where nascent QPO may be present. As the light curves showed longer term trends, we detrended the data using an STL decomposition, which often revealed a large seasonal component. We find that detrending generally leads to an increase in the strength of the QPO signal. However, except for PG 1553+113, where a clearly persistent QPO signal is present, we detect transience on a timescale of $\\lesssim$4000 days. We then forecast the light curves over the following four years, using a traditional statistical method as well as a Transformer-based deep learning model. Applied to a test set, the latter showed significant success in predicting behavior that seems unexpected from simple inspection of the past data. Analyzing the extended time series suggests a markedly weaker QPO signals over the coming years in cases where the transient behavior appears near the end of the observational data. In contrast, in the nascent candidate QPO source (PKS 0139-09) the signal is expected to strengthen significantly. These predictions, which may reflect the physical origin of the QPOs, can be tested against future data."}
{"id": "2602.19301", "categories": ["astro-ph.HE", "astro-ph.CO", "physics.data-an"], "pdf": "https://arxiv.org/pdf/2602.19301", "abs": "https://arxiv.org/abs/2602.19301", "authors": ["Agniva Roychowdhury"], "title": "Parameter Estimation Limits in Blazars", "comment": "11 pages, 7 figures; submitted to ApJL, comments welcome", "summary": "Parameter degeneracy in blazar spectral energy distributions (SEDs) is known but rarely quantified. This paper introduces a Fisher Information approach to determine theoretical limits to information extraction in the context of one-zone models. By evaluating the total Fisher Information by varying $δ$, $B$, $p$, $γ_{\\rm min}$ and $γ_{\\rm max}$, we find that EC models encode Fisher information $\\gtrsim10^4$ times less than that in SSC models, establishing differences in limits of physical information extraction even in the case of perfect sampling. Moreover, the Fisher information in both SSC and EC models exhibit strong fluctuations across the parameter space, but since the magnitudes are orders of magnitude lower in EC, limits of parameter inference are expected to be worse in FSRQ SEDs than BL Lacs. We also find that the Doppler factor $δ$ carries at least $10^{2-3}$ more Fisher information than that for $p$ and $B$ in both EC and SSC, making $δ$ the most constrained SED parameter. Applying our Fisher Information motivated framework to real flaring SEDs of Flat Spectrum Radio Quasars (FSRQs) CTA 102 and 3C 279, we show that mild variations in $δ$ and $p$ can appreciably produce the flaring SEDs starting from the quiescent model, while two other flares in 3C 279 simple geometric and spectral considerations cannot reproduce the flares, reducing the efficacy of one-zone models. We propose that time-resolved SED models are indispensable to constraining physical parameters in EC-dominated blazars."}
{"id": "2602.19335", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2602.19335", "abs": "https://arxiv.org/abs/2602.19335", "authors": ["Vishwangi Shah", "Jason W. T. Hessels", "Victoria M. Kaspi", "Kiyoshi W. Masui", "Mawson W. Sammons", "Daniel Amouyal", "Charanjot Brar", "Shami Chatterjee", "Alice P. Curtin", "Hannah Didehbani", "B. M. Gaensler", "Naman Jain", "Ronniy C. Joseph", "Afrokk Khan", "Bikash Kharel", "Adam E. Lanman", "Kyle McGregor", "Ryan Mckinven", "Mason Ng", "Kenzie Nimmo", "Ayush Pandhi", "Aaron B. Pearlman", "Alexander W. Pollak", "Paul Scholz", "Kaitlyn Shin", "Seth R. Siegel", "Kendrick Smith", "Michele Woodland"], "title": "Probing the maximum energy of fast radio bursts using thousands of sources from the Second CHIME/FRB Catalog", "comment": "Submitted to ApJ", "summary": "Quantifying the maximum energy of fast radio bursts (FRBs) can provide stringent constraints on their emission mechanisms and progenitor models. However, the most energetic bursts are rare, requiring a large sample of FRBs to detect them. In this work, we use the largest available such sample, 2,998 one-off FRBs from the Second CHIME/FRB Catalog, to obtain a lower limit on the maximum energy ($E^{\\mathrm{max}}_{\\mathrm{iso}}$) of FRBs, assuming isotropic energy distribution from FRB sources. In the absence of known redshifts ($z$) for most sources, we present a framework that uses the dispersion measures (DMs) and fluences of these FRBs, together with the probability distribution of $z$ given DM, to derive the lower limit on $E^{\\mathrm{max}}_{\\mathrm{iso}}$. We generate simulated FRB samples assuming different parameter values for a log-normal $\\mathrm{DM}_{\\mathrm{host}}$ distribution and a Schechter function form of the FRB energy function to estimate how many outliers -- FRBs with large DM contributions from the host galaxy or intervening galaxy halos -- could artificially inflate this limit. After accounting for outliers, the lower limit on $E^{\\mathrm{max}}_{\\mathrm{iso}}$ from Catalog 2 FRBs ranges between $1.2\\times10^{41}$ and $1.9\\times10^{42}$ erg, with best estimate $1.2\\times10^{42}$ erg. This limit is consistent with those derived from much smaller FRB samples. Moreover, inferred energies of hundreds of FRBs appear collectively limited around $\\sim10^{42}$ erg, suggesting a physical limit on the energy reservoir of FRB sources. The corresponding isotropic-equivalent FRB source energy is consistent with the total energy available in a magnetar's external dipole magnetic field, supporting magnetars as FRB progenitors."}
{"id": "2602.19363", "categories": ["astro-ph.HE", "physics.comp-ph"], "pdf": "https://arxiv.org/pdf/2602.19363", "abs": "https://arxiv.org/abs/2602.19363", "authors": ["Marlon M. S. Mendes", "Roberta Duarte Pereira", "Mariana Dutra da Rosa Louren", "César H. Lenzi"], "title": "Certified Uncertainty for Surrogate Models of Neutron Star Equations of State via Mondrian Conformal Prediction", "comment": null, "summary": "We present a multitask surrogate for neutron-star equations of state (EoSs) that delivers \\emph{distribution-free}, certified uncertainty via split conformal prediction (CP) and its Mondrian variant. The surrogate ingests a six-parameter piecewise-polytropic representation $(\\log_{10}p_1,Γ_1,Γ_2,Γ_3,ρ_1,ρ_2)$ -- with fixed transition densities $ρ_1$ and $ρ_2$ -- and jointly performs (i) validity classification under physical/observational constraints and (ii) regression of $M_{\\max}$, $R(M_{\\max})$, $R_{1.4}$, and $Λ_{1.4}$. Trained on a balanced set of $40{,}000$ EoSs, the model attains near-perfect discrimination (AUC $\\approx 0.997$) and sub-percent relative errors for masses and radii, with few-percent error for tidal deformability. Across $α\\in[0.05,0.25]$, empirical coverages closely track $1-α$ for both Standard and Mondrian CP; in conservative regimes, Mondrian yields narrower average physical widths at comparable coverage. To our knowledge, this is the first application of class-conditioned (Mondrian) conformal calibration to neutron-star EoS surrogates, enabling efficient, reproducible, and uncertainty-aware inference; the framework is readily extensible to functional targets (e.g., full $R(M)$ curves)."}
{"id": "2602.19546", "categories": ["astro-ph.HE", "gr-qc"], "pdf": "https://arxiv.org/pdf/2602.19546", "abs": "https://arxiv.org/abs/2602.19546", "authors": ["Zexin Hu", "Ziming Wang", "Lijing Shao"], "title": "A Realistic Pulsar - Supermassive Black Hole Timing Model", "comment": "28 pages, 12 figures", "summary": "Timing observation of pulsars orbiting around a supermassive black hole (SMBH) can measure the spacetime around the SMBH to a high precision and thus be a novel probe of the gravity theory. Future high-frequency surveys of the Galactic Centre (GC) region to be performed by the next-generation radio telescopes, such as the SKA, may discover pulsars that orbit around Sagittarius A* (Sgr A*), the SMBH dwelling in our GC. In this paper, we present a realistic pulsar-SMBH timing model based on the post-Newtonian equations of motion of the pulsar. Considering the expected timing precision in the future, we take into account several next-to-leading order light propagation time delays in the timing model. For the first time, we include the effects of proper motion of Sgr A*, which were expected to break the spin measurement degeneracy. We forecast the measurement precision of various parameters of Sgr A*, and discuss the data analysis procedure in the presence of red noise, which can be strong if the pulsar is a normal pulsar. The realistic timing model constructed in this study will serve as a useful tool in future searching and timing of pulsar-SMBH systems in the GC."}
{"id": "2602.19627", "categories": ["astro-ph.HE", "gr-qc"], "pdf": "https://arxiv.org/pdf/2602.19627", "abs": "https://arxiv.org/abs/2602.19627", "authors": ["Nina Kunert", "Guilherme Grams", "William Newton", "Edoardo Giangrandi", "Anna Puecher", "Hauke Koehn", "Violetta Sagun", "Tim Dietrich"], "title": "A unified study of nuclear physics and dark matter constraints through gravitational-wave observations of binary neutron star mergers", "comment": null, "summary": "Understanding the properties of strongly interacting matter at extreme densities is a central problem in fundamental physics, but neutron star mergers provide a natural laboratory for probing this regime. However, the complexity of the merger process complicates the interpretation of the associated gravitational-wave and electromagnetic signals. This picture becomes even more complex in the potential scenario in which dark matter accumulates around and in neutron stars, altering their structure and the associated observables. In this work, we study synthetic gravitational-wave observations of binary neutron star mergers with next-generation detectors, investigating their potential to extract both nuclear physics and dark-matter constraints. We also examine how the potential presence of fermionic, non-interacting dark matter inside neutron stars affects the inference of nuclear empirical parameters. We find that combining observations can tighten constraints on nuclear empirical parameters. However, the inferred values remain sensitive to systematic modeling biases and intrinsic degeneracies among the parameters. Conversely, our analysis reveals that even in the presence of dark matter, it will be unlikely to find decisive evidence for dark matter when analyzing gravitational-wave signals. Consequently, systematic biases in nuclear empirical parameter inference potentially resulting from the presence of dark matter are expected to be negligible even for observations with next-generation gravitational-wave detectors."}
{"id": "2602.19864", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2602.19864", "abs": "https://arxiv.org/abs/2602.19864", "authors": ["Karen Terveer", "Sjoerd Bouma", "Stijn Buitink", "Arthur Corstanje", "Vital De Henau", "Vincent Eberle", "Torsten A. Enßlin", "Philipp Frank", "Tim Huege", "Philipp Laub", "Katharine Mulrey", "Anna Nelles", "Simon Strähnz", "Satyendra Thoudam", "Keito Watanabe"], "title": "A Bayesian Method for Air-Shower Reconstruction using Information Field Theory", "comment": "19 pages, 11 figures", "summary": "The radio detection of extensive air showers provides a powerful method for studying the origin of high-energy cosmic rays. The Low-Frequency Array (LOFAR) offers unprecedentedly detailed measurements of the radio emission footprint. However, fully exploiting this information requires advanced reconstruction techniques. In this paper, we introduce a novel framework for air shower reconstruction based on Bayesian inference and Information Field Theory (IFT). Our method is built on a fully differentiable forward model of the radio signal, which incorporates a physical emission parameterization and a precise wavefront model. Additionally, we augment this physical model with Gaussian processes to account for systematic uncertainties in both the signal fluence and arrival timing. By leveraging gradient information, our approach enables efficient (three orders of magnitude acceleration w.r.t.\\ the legacy method) and robust inference of the underlying physical shower parameters, such as primary energy and the depth of shower maximum, $X_\\text{max}$. This work provides not only point estimates but also a rigorous quantification of uncertainties. We achieve a resolution in $X_\\text{max}$ of $25\\,\\mathrm{g/cm^2}$ and a radiation energy resolution of $12\\%$ on simulations for LOFAR."}
{"id": "2602.19897", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2602.19897", "abs": "https://arxiv.org/abs/2602.19897", "authors": ["James Reeves", "Shoji Ogawa", "Tracey Jane Turner", "Valentina Braito", "Satoshi Yamada", "Steven Kraemer", "Hirofumi Noda", "Anna Trindade Falcão", "Martin Elvis", "Giuseppina Fabbiano"], "title": "Winds of Change: XRISM Resolve X-ray spectroscopy of NGC 4051", "comment": "14 pages, 6 figures, submitted to ApJ", "summary": "NGC 4051 is a nearby (16.7 Mpc), Narrow Line Seyfert 1 galaxy (NLS1), which has a low black hole mass of $10^6$ M$_{\\odot}$. It is also known for its rapid X-ray variability, on timescales of kilo-seconds and has a complex, multi component wind in both the soft X-ray and Fe K bands. Here we present the first high resolution XRISM Resolve spectrum of NGC 4051, which was captured in a historically bright state for a 150 ks exposure. XRISM resolves two blue-shifted Fe K shell absorption troughs in the mean spectrum, which can be ascribed to H-like iron and arises from two outflow components with outflow velocities of 0.025c and 0.04c. A time dependent spectral analysis shows that the iron K absorption is variable on timescales of less than a day, increasing in velocity over the duration of the observation. The velocity changes may be explained either by the passage of two separate transiting absorbers, of different velocities, or by a single accelerating outflow of approximately constant column density. In the latter case, the wind acceleration is likely to be too large to be caused by radiation pressure and instead magnetic driving is favored to accelerate the wind up to 0.04c. The outflow can originate from an accretion disk wind, whose kinetic power is sub-Eddington in contrast to recent examples of winds from powerful, luminous quasars observed by XRISM."}
{"id": "2602.19921", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2602.19921", "abs": "https://arxiv.org/abs/2602.19921", "authors": ["Pieter vd Merwe", "Markus Böttcher"], "title": "Investigating polarization signatures from GRB models", "comment": "Published in ApJ", "summary": "There is still much debate around the inner workings of the GRB prompt emission phase with many questions still left unanswered. Polarization signatures offer a promising new avenue to discriminate between the various GRB prompt emission models. The aim of this study is to estimate energy and time resolved polarization signatures resulting from Inverse Compton (IC) scattering for two specific GRB prompt emission models, namely the backscatter-dominated cork model by \\citet{Vyas2} and a Compton drag model by \\citet{Lazzati2}. In order to achieve this we apply an IC polarization Monte Carlo (MC) algorithm to those two GRB models in order to estimate the expected polarization signatures. For the backscatter-dominated cork model we find polarization signatures below $\\sim 10$~\\%, likely below the detection limits of current or near-future X-ray and $γ$-ray polarimeters. Our results for the Compton drag model indicates polarization results consistent with that found by \\citet{Lazzati3}. Furthermore, we find some energy and time dependence of the estimated polarization, particularly for the polarization angle."}
{"id": "2602.19940", "categories": ["astro-ph.HE", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2602.19940", "abs": "https://arxiv.org/abs/2602.19940", "authors": ["Neeraj Singh Rawat", "L. S. Sonith", "U. S. Kamath", "Yash Bhargava", "G. C. Anupama", "Kulinder Pal Singh"], "title": "Optical observations of the fast nova V1674 Herculis", "comment": "16 pages, 25 figures,3 tables, Accepted for publication in MNRAS", "summary": "We present the evolution of optical spectra and lightcurves of the fast nova V1674 Herculis during 150 days past its eruption. Using the post-eruption AAVSO light curve, we have calculated the orbital period of V1674 Her to be 0.153 days. There is no unambiguous white dwarf spin period in our data. The optical spectra show that the ionisation increases with time. A morpho-kinematic analysis of the H$α$ line profile indicates a bipolar morphology with polar blobs and an equatorial ring. Lyman beta fluorescence is found to be the dominant mechanism for the excitation of neutral oxygen. On day 19.87, [Ne III] & [Ne V] lines are present, indicating the presence of the ONe white dwarf. On day 147.66, the nebular lines are still present, implying that the nova had not gone into quiescence yet; this spectrum is accretion-dominated."}
{"id": "2602.20110", "categories": ["astro-ph.HE", "gr-qc"], "pdf": "https://arxiv.org/pdf/2602.20110", "abs": "https://arxiv.org/abs/2602.20110", "authors": ["Mor Rozner", "Teagan A. Clarke", "Isobel M. Romero-Shaw", "Johan Samsing"], "title": "The Universal Eccentricity Distribution for Dynamical Gravitational-Wave Merger Channels", "comment": "Comments are welcome!", "summary": "We argue that all dynamical astrophysical black hole merger channels are expected to result in a common eccentricity distribution at gravitational wave (GW) frequencies relevant for LIGO/Virgo/KAGRA (LVK) in the high eccentricity limit. This follows from the large separation of scales between the GW regime required for creating eccentric mergers in LVK, and the underlying astrophysical formation environment. Our analytical solution shows exceptional agreement with numerical studies. This finding has important implications for both theoretical studies and ongoing searches for eccentric GW sources."}
{"id": "2602.20145", "categories": ["astro-ph.HE", "astro-ph.GA", "hep-ph"], "pdf": "https://arxiv.org/pdf/2602.20145", "abs": "https://arxiv.org/abs/2602.20145", "authors": ["Kohta Murase", "Shigeo S. Kimura", "Mainak Mukhopadhyay", "Mukul Bhattacharya"], "title": "IceCube's convex all-sky neutrino spectrum consistent with the magnetically powered corona scenario for active galactic nuclei", "comment": "25 pages, 11 figures, 4 tables", "summary": "High-energy multimessenger background analyses over the past decade have provided evidence for a population of hidden neutrino sources that are opaque to GeV-TeV gamma rays, a picture bolstered by recent observations of the nearby active galaxy NGC 1068. The coronal regions in the hearts of active galactic nuclei (AGNs) have been proposed as the most promising sites for such hidden nonthermal particle production, and NGC 1068 is expected to be the most neutrino-active galaxy for IceCube. We demonstrate that the latest all-sky neutrino spectrum, exhibiting a spectral bend around 3-30 TeV, is consistent with predictions of the magnetically powered corona scenario, and the models for the all-sky neutrino flux can simultaneously explain the multimessenger data from NGC 1068 within observational and modeling uncertainties. We further show, in a largely model-independent way, that the contribution from NGC 1068-like sources does not overshoot the observed medium-energy neutrino flux. Finally, we highlight the key role of the Eddington ratio, which can drive substantial variations in the predicted neutrino fluxes of nearby AGNs, and we encourage systematic multimessenger searches for the neutrino-brightest AGNs."}
{"id": "2602.19814", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2602.19814", "abs": "https://arxiv.org/abs/2602.19814", "authors": ["Razmik Mirzoyan", "Alexander Hahn", "David Fink", "Antonios Dettlaff", "Daniel Mazin", "David Paneque", "Olaf Reimann", "Thomas Schweizer", "Derek Strom", "Masahiro Teshima", "Yazhou Zhao"], "title": "Direct comparison of SiPMs and PMTs in operation with a bright background and prospects of using SPADs as truly digital sensors", "comment": "4 pages, 3 figures, Proceedings of the 12th International Workshop on Ring Imaging Cherenkov Detectors (RICH2025), Accepted for publication in Nuclear Instruments and Methods in Physics Research - section A (NIM-A)", "summary": "The use of silicon photomultipliers (SiPMs) alongside conventional photomultiplier tubes (PMTs) is a remarkable technological development in modern ground-based very high energy gamma-ray astronomy. SiPMs exhibit comparable or even higher photon detection efficiencies (PDEs) than PMTs. The sensitivity of a PMT matches well the spectral shape of Cherenkov radiation from extended air showers. In contrast to a PMT, the sensitivity of a SiPM is shifted toward longer wavelengths, where the intensity of light of night sky (LoNS), considered as unwanted noise, increases significantly. It is obvious that a SiPM with a higher PDE will indeed measure more Cherenkov light than a PMT, but it will also detect significantly higher LoNS noise; the question is which factor will predominate in the signal-to-noise-ratio (SNR). To compare the performance of a PMT with that of a SiPM, we built SiPM-based modules and installed these and operated in parallel in the imaging camera of the 17 m diameter MAGIC telescope. Our long-term studies show that SiPM, despite their higher PDE, can deliver only a comparable to PMT performance. As already the name SiPM suggests, we use these semiconductor sensors analogously to classical PMTs: We amplify their small signals, digitize, and calibrate the converted amplitudes. Although SiPM is essentially a digital sensor, its common-anode design does not allow one to directly profit from it. Numerous arrays of single-photon avalanche diodes (SPADs) are being developed in various laboratories worldwide. Unlike SiPM, SPAD arrays digitize the incident photons from the outset and count their number. We will dwell on the potential further developments of SPADs."}
{"id": "2602.19984", "categories": ["astro-ph.IM", "astro-ph.HE", "cs.LG"], "pdf": "https://arxiv.org/pdf/2602.19984", "abs": "https://arxiv.org/abs/2602.19984", "authors": ["Federico Incardona", "Alessandro Costa", "Farida Farsian", "Francesco Franchina", "Giuseppe Leto", "Emilio Mastriani", "Kevin Munari", "Giovanni Pareschi", "Salvatore Scuderi", "Sebastiano Spinello", "Gino Tosti"], "title": "Multivariate time-series forecasting of ASTRI-Horn monitoring data: A Normal Behavior Model", "comment": "15 pages, 12 figures", "summary": "This study presents a Normal Behavior Model (NBM) developed to forecast monitoring time-series data from the ASTRI-Horn Cherenkov telescope under normal operating conditions. The analysis focused on 15 physical variables acquired by the Telescope Control Unit between September 2022 and July 2024, representing sensor measurements from the Azimuth and Elevation motors. After data cleaning, resampling, feature selection, and correlation analysis, the dataset was segmented into fixed-length intervals, in which the first I samples represented the input sequence provided to the model, while the forecast length, T, indicated the number of future time steps to be predicted. A sliding-window technique was then applied to increase the number of intervals. A Multi-Layer Perceptron (MLP) was trained to perform multivariate forecasting across all features simultaneously. Model performance was evaluated using the Mean Squared Error (MSE) and the Normalized Median Absolute Deviation (NMAD), and it was also benchmarked against a Long Short-Term Memory (LSTM) network. The MLP model demonstrated consistent results across different features and I-T configurations, and matched the performance of the LSTM while converging faster. It achieved an MSE of 0.019+/-0.003 and an NMAD of 0.032+/-0.009 on the test set under its best configuration (4 hidden layers, 720 units per layer, and I-T lengths of 300 samples each, corresponding to 5 hours at 1-minute resolution). Extending the forecast horizon up to 6.5 hours-the maximum allowed by this configuration-did not degrade performance, confirming the model's effectiveness in providing reliable hour-scale predictions. The proposed NBM provides a powerful tool for enabling early anomaly detection in online ASTRI-Horn monitoring time series, offering a basis for the future development of a prognostics and health management system that supports predictive maintenance."}
