{"id": "2602.21290", "categories": ["astro-ph.HE", "physics.plasm-ph"], "pdf": "https://arxiv.org/pdf/2602.21290", "abs": "https://arxiv.org/abs/2602.21290", "authors": ["Michael P. Grehan", "Bart Ripperda", "Andrei M. Beloborodov", "Christopher Thompson", "Elias R. Most"], "title": "Global Magnetohydrodynamic Simulations of Monster Shocks in Neutron Star Magnetospheres", "comment": "24 pages, 18 figures, submitted to the Astrophysical Journal", "summary": "Waves launched from the neutron star surface or inner magnetosphere propagate through the magnetosphere as small perturbations, but can grow relative to the background magnetic field and steepen into ``monster shocks'' -- ultra-relativistic magnetized shocks which can power high-energy emission from magnetars, neutron star mergers and collapse. They occur in magnetically dominated plasma and are described by relativistic magnetohydrodynamics (MHD). We present global relativistic MHD simulations of monster shocks in unperturbed and perturbed (``wrinkled'') backgrounds with a global dipolar geometry. Our simulations confirm analytical predictions for equatorial shocks and provide new insight into the behavior of oblique shocks off the equator. Simulations where the shock is formed through Alfvén mode to fast mode conversion are also presented, demonstrating the generic nature of the monster shock mechanism. We explore how the presence of additional modes in the magnetosphere modifies the shock behavior. Modes of comparable amplitude can fragment the shock front, substantially reduce the magnetization, produce localized enhancements in the Lorentz factor relative to an unperturbed dipole background, and intermittently generate additional shocks along a line of sight."}
{"id": "2602.21291", "categories": ["astro-ph.HE", "nucl-th"], "pdf": "https://arxiv.org/pdf/2602.21291", "abs": "https://arxiv.org/abs/2602.21291", "authors": ["Tetyana Pitik", "David Radice", "Daniel Kasen", "Fabio Magistrelli", "Patrick Chi-Kit Cheong", "Sebastiano Bernuzzi"], "title": "Collapse of Magnetized White Dwarfs as site of Heavy Element Formation and Kilonova Signal", "comment": "13 pages, 11 figures", "summary": "We present the first end-to-end calculation connecting the accretion-induced collapse (AIC) of a magnetized, rapidly rotating white dwarf to observable kilonova signatures, combining 2D general-relativistic neutrino-magnetohydrodynamic simulations, followed by radiation hydrodynamics with in-situ nuclear network and 2D Monte Carlo radiative transfer with spatially resolved heating rates. Unlike all previous unmagnetized AIC models - which predicted proton-rich, $^{56}$Ni-dominated ejecta - strong magnetic fields eject ${\\sim 0.2 M_\\odot}$ of neutron-rich material $(\\langle Y_e \\rangle \\sim 0.24)$ on dynamical timescales, before neutrino irradiation can raise the electron fraction, enabling strong $r$-process nucleosynthesis up to and beyond the third peak. The resulting kilonova is lanthanide-rich $(X_{\\rm lan} \\approx 6\\%)$ and dominated by near-infrared emission. We compute synthetic light curves in the LSST and JWST bands and find striking agreement, without parameter tuning, between the observations of AT 2023vfi/GRB 230307A and our broadband light curves for polar viewing angles. These results establish magnetized AIC as a viable channel for heavy $r$-process element production and a compelling progenitor candidate for long-duration gamma-ray bursts with kilonova signatures."}
{"id": "2602.21294", "categories": ["astro-ph.HE", "hep-ph", "nucl-th"], "pdf": "https://arxiv.org/pdf/2602.21294", "abs": "https://arxiv.org/abs/2602.21294", "authors": ["Steven P. Harris", "Srimoyee Sen"], "title": "Shock-induced chiral magnetic effect", "comment": "22 pages, 8 figures", "summary": "Weak-interaction-mediated chiral imbalance generation in idealized massless electrons during core-collapse supernovae was once proposed to be the source of strong magnetic fields found in neutron stars. The effect goes by the name of chiral plasma instability (CPI). However, it was found that a finite electron mass damps out this process, inactivating the instability and preventing magnetic field growth. In this work we show that the instability can survive in the presence of abrupt density and temperature perturbation that drives the system sufficiently far out of weak equilibrium. As an example, we work with such perturbations generated by shockwaves which are common during both core collapse as well as neutron star mergers. We find that the chiral imbalance resulting from shock waves, under the right conditions of density and temperature, can sustain the chiral plasma instability despite the damping from the electron mass. Additionally, in an already magnetized medium, the chiral magnetic effect resulting from shock wave density and temperature perturbation can generate substantial ohmic heating. Our results imply that shockwaves during core-collapse supernovae and merging neutron stars can act as a source of strong heating in a magnetized medium as well as CPI."}
{"id": "2602.21412", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2602.21412", "abs": "https://arxiv.org/abs/2602.21412", "authors": ["J. C. Hanson", "R. Hartig"], "title": "Complex Analysis of Askaryan Radiation: UHE-$ν$ Identification and Reconstruction using the Hilbert Envelope of Observed Signals", "comment": null, "summary": "The detection of ultra-high energy neutrinos (UHE-$ν$), with enegies above 10 PeV, has been a long-time goal in astroparticle physics. Autonomous, radio-frequency (RF) UHE-$ν$ detetectors have been deployed in polar regions that rely on the Askaryan effect in ice for the neutrino signal. The Askaryan effect occurs when the excess negative charge within a UHE-$ν$ cascade radiates in a dense medium. UHE-$ν$ can induce cascades that radiate in the RF bandwidth above thermal backgrounds. To identify UHE-$ν$ signals in data from Askaryan-class detectors, analytic models of the Askaryan electromagnetic field have been created and matched to simulations and laboratory measurements. These models describe the Askaryan electromagnetic field, but leave the effects of signal propagation through polar ice and RF channel response to simulations. In this work, a fully analytic Askaryan model that accounts for these effects is presented. First, formulas for the observed voltage trace and its Hilbert envelope are calculated. Second, the analytic model is compared to UHE-$ν$ signals at 100 PeV from NuRadioMC, a key Monte Carlo toolset in the field. Correlation coefficients between the analytic signal envelope and MC data in excess of $0.94$ are found, and 99.99% of UHE-$ν$ signals pass a correlation threshold of $ρ\\geq 0.4$. Analysis of RF thermal noise reveals that just 0.2 background events have $ρ\\geq 0.4$ in 5 years at a 1 Hz thermal trigger rate. Finally, we describe future work related to the measurement of the logarithm of the UHE-$ν$ cascade energy."}
{"id": "2602.21280", "categories": ["astro-ph.IM", "astro-ph.CO", "astro-ph.EP", "astro-ph.GA", "astro-ph.HE", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2602.21280", "abs": "https://arxiv.org/abs/2602.21280", "authors": ["Jiwon Jesse Han", "Anirudh Chiti", "Kai-Feng Chen", "Keith Bechtol", "Andrea Bellini", "Robert Benjamin", "Adam Bolton", "Ana Bonaca", "Alex Broughton", "Esra Bulbul", "Susan Clark", "Charlie Conroy", "Suchetha Cooray", "John Franklin Crenshaw", "Tansu Daylan", "Arjun Dey", "Alex Drlica-Wagner", "Tim Eifler", "Kareem El-Badry", "Richard M. Feder", "Peter Ferguson", "Shenming Fu", "Sebastian Gomez", "Ryan Hickox", "Christopher Hirata", "Easton J. Honaker", "Xiaosheng Huang", "Alexander P. Ji", "Michael Liu", "Kevin A. McKinnon", "Geoffrey Mo", "Burcin Mutlu-Pakdil", "Adrian M. Price-Whelan", "Alessandro Savino", "David J. Schlegel", "Nora Shipp", "Jay Strader", "Federica Tarsitano", "Adrien C. R. Thob", "Kim-Vy Tran", "Roeland P. van der Marel", "Feige Wang", "Risa Wechsler", "Daniel R. Weisz", "Dennis Zaritsky", "Tianqing Zhang", "Shreya Anand", "Amirnezam Amiri", "Abhijeet Anand", "Matthew L. N. Ashby", "Finian Ashmead", "Leandro Beraldo e Silva", "Aliza Beverage", "Michael R. Blanton", "Warren R. Brown", "Anthony G. A. Brown", "Priyanka Chakraborty", "Yi-Kuan Chiang", "Jose M. Diego", "Denis Erkal", "Simone Ferraro", "Lluís Galbany", "Marla Geha", "Oleg Y. Gnedin", "Lars Hernquist", "Jason A. S. Hunt", "Valentin D. Ivanov", "Venu Kalari", "Nitya Kallivayalil", "András Kovács", "Kyle Kremer", "Ting-Wen Lan", "Denis Leahy", "Jiaxuan Li", "Ivan Minchev", "GyuChul Myung", "Ethan O. Nadler", "Joan R. Najita", "Melissa K. Ness", "Jacob Nibauer", "Fabio Pacucci", "David Parkinson", "Ekta Patel", "R. Michael Rich", "Marina Ricci", "Graziano Rossi", "Nikolina Sarcevic", "Arnab Sarkar", "Andrew K. Saydjari", "Arman Shafieloo", "Zachary Slepian", "Sangmo Tony Sohn", "David N. Spergel", "Róbert Szabó", "Christina C. Williams", "John F. Wu"], "title": "A Path to an All-Sky Survey with Roman", "comment": "Comments are welcome and encouraged", "summary": "A deep, space-based, all-sky near-infrared survey carried out with the Nancy Grace Roman Space Telescope would constitute a foundational astronomical infrastructure for decades to come. In this white paper, we present a concrete and feasible path to imaging the entire sky at $\\sim0.1''$ resolution, beginning with high-impact fields in Cycle 1 and scaling to ultra-wide coverage within the nominal mission. This first-epoch survey will reach $\\mathrm{H}\\sim25.5$ AB mag (5$σ$) and maximize synergies with contemporaneous observatories, while preserving substantial time for other ambitious Roman programs. We outline representative scheduling scenarios and an example Cycle 1 program that triples early Roman-LSST overlap and delivers high-value community data products such as LSST forced photometry, joint \\textit{Gaia}-Roman astrometry, and catalogs of Galactic substructure, stong lenses, and other rare systems. The Cycle 1 program will lay the foundation for an eventual all-sky survey, while also delivering high-impact early science. We invite broad community participation in shaping and carrying out both the initial program and the long-term vision of an all-sky Roman survey."}
{"id": "2602.21516", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2602.21516", "abs": "https://arxiv.org/abs/2602.21516", "authors": ["Xiao Tian", "Hou-Jun Lü", "XiaoXuan Liu", "Xiao-Fei Dong", "Jia Ren", "Wen-Long Zhang", "EnWei Liang"], "title": "Short-duration GRB 250221A Afterglow Driven by Two-Component Jets from merger of compact star", "comment": "14 pages, 5 figures, and 1 table. Accepted for publication in ApJ", "summary": "GRB 250221A is a short gamma-ray burst (GRB) at redshift $z=0.768$, with a duration of 1.8 s and no extended emission in either Swift/BAT or Konus-Wind bands. A remarkable re-brightening feature in both optical and X-ray bands was observed at $\\sim 0.6$ days after the burst trigger, but no supernova or kilonova signature was detected. The burst properties and empirical correlations or distributions (e.g., duration, spectral hardness, location in the Amati correlation, $\\varepsilon-$value, $f_{\\rm eff}$ parameter, and physical offset) favor a compact binary merger origin. However, a dense circumburst medium with $n\\sim 80\\rm~cm^{-3}$, obtained by adopting the energy injection into a jet to interpret the late-time re-brightening is inconsistent with the compact binary merger origin. In this paper, we propose a two-component jet model to explain the multiwavelength afterglow observations of GRB 250221A, in which the relativistic narrow jet ($\\rm θ_{c} \\sim 3.8^\\circ$) produces the prompt and the early decay afterglow emission, while the mildly relativistic wide jet ($\\rm θ_{w} \\sim 4.4^\\circ$) dominates at later times, resulting in the observed re-brightening feature. If this is the case, one can obtain a lower medium density with $n\\sim 0.72\\rm~cm^{-3}$ which is a little bit higher than that of short GRBs in merger environments, but falls into the reasonable and acceptable range. Finally, a possible kilonova emission is also discussed within the scenario of compact star merger origin of GRB 250221A."}
{"id": "2602.21507", "categories": ["astro-ph.IM", "astro-ph.GA", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2602.21507", "abs": "https://arxiv.org/abs/2602.21507", "authors": ["Samuel Lai", "Nithyanandan Thyagarajan", "O. Ivy Wong", "Foivos Diakogiannis"], "title": "Conditional Image Diffusion with Interferometric Closure Invariants: Independent EHT Imaging of Centaurus~A and 3C~279", "comment": "17 pages, 10 figures, 1 table, accepted by PASA", "summary": "We present independent imaging analyses of Event Horizon Telescope (EHT) observations of the active galactic nuclei in radio galaxy Centaurus~A and quasar 3C~279 using Generative Deep learning Image Reconstruction with Closure Terms (GenDIReCT), a recently developed machine-learning framework built on conditional diffusion models that uses interferometric closure invariants as primary observables. For Centaurus~A, our reconstruction reveals two prominent emission ridges ($\\simeq 80\\,μ$as each) along the jet sheath with a brightness ratio of $1.4\\pm 0.1$ and an opening angle of $12.3\\pm 0.3$~deg. For 3C~279, we identify three distinct components in the image, with the southern jet ejecta on sub-parsec scale exhibiting a proper motion of $4.6\\pm 1.0\\,μ$as over $\\approx 5.39$ days away from the northern components, corresponding to an apparent superluminal velocity of $\\simeq 10\\pm 2$ times light speed. These measurements are consistent with those reported by the EHT Collaboration. The results are significant because we demonstrate that: (1) imaging from interferometric aperture synthesis data, especially in VLBI and most acutely in extremely sparse arrays like the EHT, remains a severely ill-posed and challenging inverse problem, yet closure invariants preserve robust morphological information that can strongly constrain structural features, and (2) more importantly, closure-invariant imaging largely avoids calibration systematics, thus providing a fundamentally independent view of spatial structure with very high angular resolution. The generative nature of GenDIReCT further allows us to sample and characterise clusters of plausible image solutions for each dataset. As a calibration-independent, generative imaging approach, GenDIReCT offers a robust and truly independent blind-imaging tool for current and future VLBI experiments."}
{"id": "2602.21542", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2602.21542", "abs": "https://arxiv.org/abs/2602.21542", "authors": ["Xue-Rui Ouyang", "Yun-Feng Liang", "Shi-Long Chen", "Rong-Lan Li", "Ming-Xuan Lu"], "title": "Constraints on neutrino emission and hadronic flux from 1LHAASO catalog $γ$-ray sources", "comment": "19 pages, 7 figures, 4 tables. Submitted to ApJL on 24 Feb 2026", "summary": "IceCube has detected neutrino emission from the Galactic Plane (GP) at a significance of $4.5σ$, though its origin remains uncertain. Utilizing ten years of IceCube muon-track data, we investigate potential correlations between the GP neutrinos and $γ$-ray sources in the first LHAASO catalog (1LHAASO). To avoid issues caused by spectral extrapolation, this analysis focuses on sources detected by the Water Cherenkov Detector Array (WCDA). We employ an unbinned likelihood analysis to search for neutrino emission and constrain the hadronic $γ$-ray component of these sources. Neither single-source searches nor stacking analyses reveal significant neutrino signals. The stacking analysis indicates that the 1LHAASO WCDA population contributes at most $\\sim$20\\% to the diffuse GP neutrino flux measured by IceCube. The total hadronic contribution to the cumulative $γ$-ray emission from all WCDA sources is constrained to be at most $\\sim$$60\\%$, suggesting a predominantly leptonic origin for the $γ$-ray emission from the LHAASO source population. Even accounting for unresolved sources below the detection threshold, we estimate the total neutrino flux from all discrete sources (resolved plus unresolved) reaches at most about 40\\% of the observed GP neutrino flux. These results support that the bulk of the GP neutrino emission is mainly from truly diffuse processes, i.e., cosmic-ray interactions with the interstellar medium, rather than from unresolved point sources."}
{"id": "2602.21837", "categories": ["astro-ph.IM", "astro-ph.EP", "astro-ph.GA", "astro-ph.HE", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2602.21837", "abs": "https://arxiv.org/abs/2602.21837", "authors": ["Gianni Cataldi"], "title": "pythonradex: a fast Python re-implementation of RADEX with extended functionality", "comment": "8 pages, 3 figures", "summary": "A common task in astronomical research is to estimate the physical parameters (temperature, mass, density etc.) of a gas by using observed line emission. This often requires a calculation of how the radiation propagates via emission and absorption (so-called radiative transfer). In radio and infrared astronomy, the Fortran code RADEX (van der Tak et al., 2007) is a popular tool to solve the non-LTE radiative transfer of a uniform medium in a simplified geometry. I present pythonradex, a Python re-implementation of RADEX. Written in Python, it provides an easy and intuitive user interface, improved performance as well as additional functionality not included in RADEX, such as continuum effects and overlapping lines. In addition, pythonradex provides a self-consistent computation of the total flux for all geometries, including spherical geometries."}
{"id": "2602.21280", "categories": ["astro-ph.IM", "astro-ph.CO", "astro-ph.EP", "astro-ph.GA", "astro-ph.HE", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2602.21280", "abs": "https://arxiv.org/abs/2602.21280", "authors": ["Jiwon Jesse Han", "Anirudh Chiti", "Kai-Feng Chen", "Keith Bechtol", "Andrea Bellini", "Robert Benjamin", "Adam Bolton", "Ana Bonaca", "Alex Broughton", "Esra Bulbul", "Susan Clark", "Charlie Conroy", "Suchetha Cooray", "John Franklin Crenshaw", "Tansu Daylan", "Arjun Dey", "Alex Drlica-Wagner", "Tim Eifler", "Kareem El-Badry", "Richard M. Feder", "Peter Ferguson", "Shenming Fu", "Sebastian Gomez", "Ryan Hickox", "Christopher Hirata", "Easton J. Honaker", "Xiaosheng Huang", "Alexander P. Ji", "Michael Liu", "Kevin A. McKinnon", "Geoffrey Mo", "Burcin Mutlu-Pakdil", "Adrian M. Price-Whelan", "Alessandro Savino", "David J. Schlegel", "Nora Shipp", "Jay Strader", "Federica Tarsitano", "Adrien C. R. Thob", "Kim-Vy Tran", "Roeland P. van der Marel", "Feige Wang", "Risa Wechsler", "Daniel R. Weisz", "Dennis Zaritsky", "Tianqing Zhang", "Shreya Anand", "Amirnezam Amiri", "Abhijeet Anand", "Matthew L. N. Ashby", "Finian Ashmead", "Leandro Beraldo e Silva", "Aliza Beverage", "Michael R. Blanton", "Warren R. Brown", "Anthony G. A. Brown", "Priyanka Chakraborty", "Yi-Kuan Chiang", "Jose M. Diego", "Denis Erkal", "Simone Ferraro", "Lluís Galbany", "Marla Geha", "Oleg Y. Gnedin", "Lars Hernquist", "Jason A. S. Hunt", "Valentin D. Ivanov", "Venu Kalari", "Nitya Kallivayalil", "András Kovács", "Kyle Kremer", "Ting-Wen Lan", "Denis Leahy", "Jiaxuan Li", "Ivan Minchev", "GyuChul Myung", "Ethan O. Nadler", "Joan R. Najita", "Melissa K. Ness", "Jacob Nibauer", "Fabio Pacucci", "David Parkinson", "Ekta Patel", "R. Michael Rich", "Marina Ricci", "Graziano Rossi", "Nikolina Sarcevic", "Arnab Sarkar", "Andrew K. Saydjari", "Arman Shafieloo", "Zachary Slepian", "Sangmo Tony Sohn", "David N. Spergel", "Róbert Szabó", "Christina C. Williams", "John F. Wu"], "title": "A Path to an All-Sky Survey with Roman", "comment": "Comments are welcome and encouraged", "summary": "A deep, space-based, all-sky near-infrared survey carried out with the Nancy Grace Roman Space Telescope would constitute a foundational astronomical infrastructure for decades to come. In this white paper, we present a concrete and feasible path to imaging the entire sky at $\\sim0.1''$ resolution, beginning with high-impact fields in Cycle 1 and scaling to ultra-wide coverage within the nominal mission. This first-epoch survey will reach $\\mathrm{H}\\sim25.5$ AB mag (5$σ$) and maximize synergies with contemporaneous observatories, while preserving substantial time for other ambitious Roman programs. We outline representative scheduling scenarios and an example Cycle 1 program that triples early Roman-LSST overlap and delivers high-value community data products such as LSST forced photometry, joint \\textit{Gaia}-Roman astrometry, and catalogs of Galactic substructure, stong lenses, and other rare systems. The Cycle 1 program will lay the foundation for an eventual all-sky survey, while also delivering high-impact early science. We invite broad community participation in shaping and carrying out both the initial program and the long-term vision of an all-sky Roman survey."}
{"id": "2602.21507", "categories": ["astro-ph.IM", "astro-ph.GA", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2602.21507", "abs": "https://arxiv.org/abs/2602.21507", "authors": ["Samuel Lai", "Nithyanandan Thyagarajan", "O. Ivy Wong", "Foivos Diakogiannis"], "title": "Conditional Image Diffusion with Interferometric Closure Invariants: Independent EHT Imaging of Centaurus~A and 3C~279", "comment": "17 pages, 10 figures, 1 table, accepted by PASA", "summary": "We present independent imaging analyses of Event Horizon Telescope (EHT) observations of the active galactic nuclei in radio galaxy Centaurus~A and quasar 3C~279 using Generative Deep learning Image Reconstruction with Closure Terms (GenDIReCT), a recently developed machine-learning framework built on conditional diffusion models that uses interferometric closure invariants as primary observables. For Centaurus~A, our reconstruction reveals two prominent emission ridges ($\\simeq 80\\,μ$as each) along the jet sheath with a brightness ratio of $1.4\\pm 0.1$ and an opening angle of $12.3\\pm 0.3$~deg. For 3C~279, we identify three distinct components in the image, with the southern jet ejecta on sub-parsec scale exhibiting a proper motion of $4.6\\pm 1.0\\,μ$as over $\\approx 5.39$ days away from the northern components, corresponding to an apparent superluminal velocity of $\\simeq 10\\pm 2$ times light speed. These measurements are consistent with those reported by the EHT Collaboration. The results are significant because we demonstrate that: (1) imaging from interferometric aperture synthesis data, especially in VLBI and most acutely in extremely sparse arrays like the EHT, remains a severely ill-posed and challenging inverse problem, yet closure invariants preserve robust morphological information that can strongly constrain structural features, and (2) more importantly, closure-invariant imaging largely avoids calibration systematics, thus providing a fundamentally independent view of spatial structure with very high angular resolution. The generative nature of GenDIReCT further allows us to sample and characterise clusters of plausible image solutions for each dataset. As a calibration-independent, generative imaging approach, GenDIReCT offers a robust and truly independent blind-imaging tool for current and future VLBI experiments."}
{"id": "2602.21837", "categories": ["astro-ph.IM", "astro-ph.EP", "astro-ph.GA", "astro-ph.HE", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2602.21837", "abs": "https://arxiv.org/abs/2602.21837", "authors": ["Gianni Cataldi"], "title": "pythonradex: a fast Python re-implementation of RADEX with extended functionality", "comment": "8 pages, 3 figures", "summary": "A common task in astronomical research is to estimate the physical parameters (temperature, mass, density etc.) of a gas by using observed line emission. This often requires a calculation of how the radiation propagates via emission and absorption (so-called radiative transfer). In radio and infrared astronomy, the Fortran code RADEX (van der Tak et al., 2007) is a popular tool to solve the non-LTE radiative transfer of a uniform medium in a simplified geometry. I present pythonradex, a Python re-implementation of RADEX. Written in Python, it provides an easy and intuitive user interface, improved performance as well as additional functionality not included in RADEX, such as continuum effects and overlapping lines. In addition, pythonradex provides a self-consistent computation of the total flux for all geometries, including spherical geometries."}
