{"id": "2601.17106", "categories": ["astro-ph.IM", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2601.17106", "abs": "https://arxiv.org/abs/2601.17106", "authors": ["Magda Arnaboldi", "Ortwin Gerhard", "Martin Roth", "Souradeep Bhattacharya", "Johanna Hartke", "Chiara Spiniello", "Azlizan Soemitro", "Claudia Pulsoni", "Lucas Valenzuela"], "title": "Extragalactic Planetary Nebulae (xPNe). Chemical evolution and assembly histories of nearby galaxies using Oxygen and Argon abundances. From the local universe to cosmic dawn", "comment": "3 pages, 2 figures, submitted to the ESO Expanding Horizons call in December 2025", "summary": "How galaxies formed and evolved in the expanding Universe is the main science goal of Near-Field Cosmology research. Studies of the properties of galaxies' resolved stars open a widow on their ancient galactic components, probing star formation during epochs more than 10 billion years ago. Extragalactic Planetary Nebulae (xPNe) can help decipher the signatures of mergers and interactions persisting over many dynamical times by tracing elemental abundances coupled with their kinematics and spatial distributions. With new facilities, reaching higher angular resolution, area coverage and sensitivity, one can use xPNe to map Oxygen and Argon element abundances, in addition to their kinematics, to extend the Galactic Archeology investigation to the oldest stellar aggregates in our Local Universe."}
{"id": "2601.17120", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2601.17120", "abs": "https://arxiv.org/abs/2601.17120", "authors": ["Chaipat Tirapongprasert", "Matthew Ho"], "title": "Learning at the Edge: Tailed-Uniform Sampling for Robust Simulation-Based Inference", "comment": "12 pages, 11 figures, 2 tables, submitted to The Open Journal of Astrophysics", "summary": "We introduce the \\textsc{Tailed-Uniform} proposal distribution for generating training simulations in simulation-based inference. Instead of sampling parameters uniformly within bounded regions, we extend the distribution beyond prior boundaries with smooth Gaussian tails. This eliminates sharp discontinuities that cause neural posterior estimators to fail when the posterior distribution intersects or extends beyond the prior bounds. The method requires minimal hyperparameter tuning, with tail widths of 10--30\\% of the prior width proving robust across problems. We demonstrate these benefits on a synthetic Gaussian linear task and cosmological parameter inference from the matter power spectrum. We also find that \\tail-trained models outperform \\textsc{Uniform} ones near the boundaries across various training set sizes and dimensions of the parameter space. This advantage grows in higher dimensions, where boundaries dominate parameter space volume. All code is publicly available on Github at https://github.com/chaipattira/tailed-uniform-sbi."}
{"id": "2601.17159", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2601.17159", "abs": "https://arxiv.org/abs/2601.17159", "authors": ["D. Welty", "R. Bohlin", "J. Carlberg", "M. Dallas", "S. Hernandez", "A. Jones", "S. Lockwood", "S. Medallon", "E. Rickman", "D. Stapleton", "T. Wheeler"], "title": "STIS Cycle 30 Calibration Programs", "comment": "36 pages, 19 figures", "summary": "We discuss the suite of STIS calibration programs executed during HST Cycle 30, covering the period 2022 Nov 07 through 2023 Nov 05. For each of the 19 current regular calibration programs, we provide brief descriptions of the objectives, observations, analysis procedures, and results - with comparisons to the results from previous cycles and to desired accuracies, as well as references to more detailed analyses of the calibration data. Many of these calibration programs produce routine reference file deliveries or demonstrate the continuing applicability of existing reference files for processing STIS observations. This ISR provides a brief snapshot of the current instrument performance, similar to those given in annual reports for Cycles 7-10 and 17-21. Two Appendices briefly discuss the state of the onboard calibration lamps and the ongoing major effort to revise the flux calibration for the many STIS spectroscopic and imaging modes."}
{"id": "2601.17179", "categories": ["astro-ph.IM", "astro-ph.GA", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2601.17179", "abs": "https://arxiv.org/abs/2601.17179", "authors": ["Pierre F. L. Maxted", "Dominic M. Bowman", "Thomas G. Wilson", "Sophie Rosu", "Keivan G. Stassun", "Simon J. Murphy", "Ayush Moharana", "Amaury H. M. J. Triaud", "Axel Hahlin", "John Southworth"], "title": "Detached eclipsing binary star science in the 2040s", "comment": "White paper submitted to the ESO call \"Expanding Horizons: Transforming Astronomy in the 2040s\". 4 pages, no figures", "summary": "Detached eclipsing binary stars (DEBS) are currently the best source of accurate and precise fundamental stellar parameters. This makes DEBS crucial targets for constraining the impact of various physical processes on stellar structure and evolution. Long-period binaries are particularly interesting because their separation minimises interactions between the components. This makes long-period binaries more comparable to single stars. However, the current sample of DEBS with high precision stellar parameters are dominated by short-period systems (e.g. ~90% of the Gaia DR3 eclipsing binaries have periods < 5 days). Facilities capable of performing detailed studies of long-period DEBS will be essential to further improve our understanding of stellar structure and evolution. Such facilities would need to be able to obtain spectroscopic observations of more distant objects at high resolution and cadence. 2-8m class telescopes with echelle spectrographs and an ability to monitor a large sample of stars would be required."}
{"id": "2601.17004", "categories": ["astro-ph.HE", "gr-qc", "hep-ph"], "pdf": "https://arxiv.org/pdf/2601.17004", "abs": "https://arxiv.org/abs/2601.17004", "authors": ["Tiyasa Kar", "Atul Kedia", "Ramkumar Radhakrishnan"], "title": "Thermodynamic Characteristics of a Fermi Gas with an Invariant Energy Scale and its Astrophysical Implications", "comment": "16 pages, 4 figures", "summary": "We investigate the thermodynamics of a relativistic Fermi gas governed by a modified dispersion relation in the Magueijo Smolin (MS) formulation of Doubly Special Relativity (DSR), characterized by the presence of an invariant ultraviolet energy (deformation) scale. We study the system in two physically distinct regimes: the near degenerate low temperature limit, and the high temperature regime. In the low temperature regime, we derive the thermodynamic quantities using the standard Sommerfeld expansion. In the high temperature regime, we evaluate all thermodynamic quantities numerically from the exact grand canonical potential and demonstrate that the thermodynamics of the Fermi gas reduces to the standard relativistic ideal gas behavior. We apply the resulting low temperature equation of state to study compact astrophysical objects, namely, non rotating white dwarfs and neutron stars. Helium white dwarfs exhibit a strong dependence on the deformation scale, while white dwarfs composed of heavier elements are less affected. For neutron stars, the modified equation of state leads to configurations that are smaller in radius and lower in mass than is by nucleonic equations of state. Our results highlight how modified relativity theories can be probed by studying astrophysical objects."}
{"id": "2601.17222", "categories": ["astro-ph.IM", "astro-ph.CO", "cs.LG"], "pdf": "https://arxiv.org/pdf/2601.17222", "abs": "https://arxiv.org/abs/2601.17222", "authors": ["Jonathan Soriano", "Tuan Do", "Srinath Saikrishnan", "Vikram Seenivasan", "Bernie Boscoe", "Jack Singal", "Evan Jones"], "title": "Improving Generalization and Uncertainty Quantification of Photometric Redshift Models", "comment": "27 pages, 16 figures, 7 Tables, accepted for publication in AJ", "summary": "Accurate redshift estimates are a vital component in understanding galaxy evolution and precision cosmology. In this paper, we explore approaches to increase the applicability of machine learning models for photometric redshift estimation on a broader range of galaxy types. Typical models are trained with ground-truth redshifts from spectroscopy. We test the utility and effectiveness of two approaches for combining spectroscopic redshifts and redshifts derived from multiband ($\\sim$35 filters) photometry, which sample different types of galaxies compared to spectroscopic surveys. The two approaches are (1) training on a composite dataset and (2) transfer learning from one dataset to another. We compile photometric redshifts from the COSMOS2020 catalog (TransferZ) to complement an established spectroscopic redshift dataset (GalaxiesML). We used two architectures, deterministic neural networks (NN) and Bayesian neural networks (BNN), to examine and evaluate their performance with respect to the Legacy Survey of Space and Time (LSST) photo-$z$ science requirements. We also use split conformal prediction for calibrating uncertainty estimates and producing prediction intervals for the BNN and NN, respectively. We find that a NN trained on a composite dataset predicts photo-$z$'s that are 4.5 times less biased within the redshift range $0.3<z<1.5$, 1.1 times less scattered, and has a 1.4 times lower outlier rate than a model trained on only spectroscopic ground truths. We also find that BNNs produce reliable uncertainty estimates, but are sensitive to the different ground truths. This investigation leverages different sources of ground truths to develop models that can accurately predict photo-$z$'s for a broader population of galaxies crucial for surveys such as Euclid and LSST."}
{"id": "2601.17299", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.17299", "abs": "https://arxiv.org/abs/2601.17299", "authors": ["Shyam S. Sharma", "Tetsuya Hashimoto", "Tomotsugu Goto", "Sanjay Kudale", "Sujin Eie", "Simon C. -C. Ho"], "title": "Single-Pulse Correlations in PSR B0329+54: Implications for Radio Emission Zones", "comment": "Accepted in the Astrophysical Journal (APJ) on 23-Jan-2026", "summary": "Individual radio pulses from a pulsar are directly linked to the underlying emission processes and the associated magnetic field geometry within its magnetosphere. Thus, single-pulse studies across frequencies can provide crucial insights into the physics of radio emission. Multiple studies have investigated single-pulse correlations in PSR B0329+54 with widely separated discrete frequencies, reporting the broadband nature of pulsar emission. However, understanding the frequency evolution of these correlations has been limited by poor frequency sampling, and the physical origin of these correlations remains unexplored. We present a detailed study of single-pulse correlations in PSR B0329+54 at low radio frequencies using the upgraded Giant Meterwave Radio Telescope (uGMRT), with well-sampled time series spanning 300-1460 MHz. We derived an inverted flux spectrum for this pulsar, with a turnover near 470 MHz. We used flux-calibrated and scintillation-corrected single pulses to study correlations across frequencies. Our results show that maximum correlations consistently occur near the longitude of the central component, with correlation strength exceeding 69\\% for all frequency combinations, while outer components exhibit correlations above 46\\%. These findings indicate very strong inter-frequency correlations, with no anticorrelations detected. No cross-component correlations were observed; only corresponding components correlate across frequencies. The longitudes of maximum correlation do not coincide with the intensity peaks of the average profile. We also examine how correlations vary with frequency at selected fiducial longitudes. The observations reported in this work favor curvature radiation from relativistic charge bunches in the pulsar plasma; however, reproducing the correlation curves along with spectra remains an open challenge."}
{"id": "2601.17831", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2601.17831", "abs": "https://arxiv.org/abs/2601.17831", "authors": ["Zehao Liu", "Xiyan Peng", "Zhenghong Tang", "Zhaoxiang Qi", "Shilong Liao", "Yong Yu"], "title": "2MASS Re-processing I: The Search for Faint Objects", "comment": "17 pages, 16 figures", "summary": "We present an automated, DAOFind-based pipeline developed to reprocess J-band Atlas All Sky Release Survey Images from the Two Micron All Sky Survey (2MASS). By optimizing the detection parameters and implementing a screening procedure that jointly evaluates the signal-to-noise ratio and central sharpness, the pipeline effectively identifies faint point sources that were previously undetected. Applying this method to eight representative sky regions improves the 2MASS detection limit from 16.20 to 16.60 mag and increases the number of detected point sources by approximately 21.36% relative to the 2MASS Point Source Catalog, with a false-positive rate of only 4.80%. These results demonstrate that the proposed reprocessing pipeline can substantially enhance the scientific yield of archival 2MASS data, providing valuable faint-source supplements for studies of time-domain variability, Galactic structure, and cold, low-luminosity objects."}
{"id": "2601.17324", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.17324", "abs": "https://arxiv.org/abs/2601.17324", "authors": ["Zhaodong Shi", "Rui-zhi Yang"], "title": "On the hadronic origin of the very high energy $γ$-ray emission surrounding the young massive stellar cluster Westerlund 1", "comment": "Accepted by Journal of High Energy Astrophysics. 32 pages, 6 figures, and 2 tables", "summary": "The Westerlund 1 (Wd 1) is the most massive known young star cluster in the Galaxy, and an extended $γ$-ray source HESS J1646-458 surrounding it has been detected up to 80 TeV in the very high energy, implying that cosmic rays (CRs) are accelerated effectively in the region. However, the dominant radiation process contributing to the $γ$-ray emission is not well constrained. In the present work, we develop a model of CR acceleration at the termination shock in the superbubble inflated by the interaction of the cluster wind from the Wd 1 with the surrounding interstellar medium. We then calculate the flux and radial profile of $γ$ rays produced by the inelastic collisions of the hadronic CRs with the ambient gas. Our results with reasonable parameters can explain well the spectrum and radial profile of the $γ$-ray emission of HESS J1646-458, and consequently the $γ$-ray emission of HESS J1646-458 is likely to be of hadronic origin."}
{"id": "2601.17882", "categories": ["astro-ph.IM", "astro-ph.CO", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.17882", "abs": "https://arxiv.org/abs/2601.17882", "authors": ["Soorya Narayan", "Anupreeta More", "Sunil Choudhary", "Sudhagar Suyamprakasam", "Sukanta Bose"], "title": "SiGMa-Net II: Distinguishing Binary Black Holes from Glitches", "comment": "8 pages, 5 figures, no appendix", "summary": "With increasing sensitivity of the gravitational wave (GW) detectors, we expect a significant rise in the detectable GW events. To process, analyse and identify such large amounts of GW signals arising from mergers of Binary Black Holes (BBH), we need both speed and accuracy. In the search for (massive) BBH signals, the biggest hurdle is posed by the various non-gaussian noise transients called glitches. Compared to our previous work, which used a simple convolutional neural network to distinguish BBHs from Blip glitches, this work uses transfer learning with InceptionNetV3 to distinguish BBHs from six types of most popular glitches from the third observing run of LIGO. While the glitches are real and identified via GravitySpy, the BBH signals are simulated and then injected into the real detector noise for each of the two LIGO detectors. We generate Sine-Gaussian Projection (SGP) maps by cross-correlating data with Sine-Gaussian functions of varied quality factors ($Q$) and central frequencies ($f_0$) and projected on the $Q$ - $f_0$ plane. We find that SGP maps make it easier to distinguish BBHs from glitches that look very similar to BBHs in the Time-Frequency maps like the Blips, while also maintaining significant morphological differences between BBHs and the more frequent glitches - Scattered Light and Fast Scattering. Our network has an accuracy of $87%$, a TPR of 0.83 for an FPR of 0.1 on our test dataset. It is also robust, retaining its level of accuracy, when tested on real BBH events identified in the first three observing runs of LIGO. Our proposed method shows the viability of using the SGP maps and neural networks for fast identification of GW events improving the efficiency of standard search pipelines."}
{"id": "2601.17499", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.17499", "abs": "https://arxiv.org/abs/2601.17499", "authors": ["Salvatore Orlando"], "title": "Deciphering the Remnants of Core-Collapse Supernovae: Reconstructing Progenitor Star Properties and Explosion Mechanisms", "comment": "Invited presentation at the Conference \"Multifrequency Behaviour of High Energy Cosmic Sources - XV\" (MULTIF2025). 9-14 June, 2025, Mondello, Palermo, Italy", "summary": "(Abridged) Recent JWST observations of Cassiopeia A (Cas A) reveal unprecedented ejecta substructure, including a web of filaments and the enigmatic \"Green Monster\" (GM), characterized by nearly circular holes and rings. These features provide new constraints on supernova (SN) explosion physics and ejecta-circumstellar medium (CSM) interactions. We present high-resolution three-dimensional hydrodynamic and magnetohydrodynamic simulations of a neutrino-driven SN explosion tailored to Cas A, following the system from core collapse to an age of $\\sim 1000$ yr. The models include key physical processes such as hydrodynamic instabilities, Ni-bubble effects, radiative cooling, non-equilibrium ionization, and electron-ion temperature equilibration. Our results show that the filamentary ejecta network naturally forms during the early explosion due to the interaction of neutrino-driven bubbles and instabilities, retaining a memory of the initial conditions before being progressively modified by the reverse shock. The GM morphology is reproduced by the interaction of dense ejecta clumps with an asymmetric, forward-shocked CSM shell, with radiative cooling enhancing fragmentation and generating the observed holes and rings. Overall, our study demonstrates that Cas A's complex morphology reflects both the imprint of the explosion mechanism and subsequent ejecta-CSM interactions."}
{"id": "2601.18227", "categories": ["astro-ph.IM", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2601.18227", "abs": "https://arxiv.org/abs/2601.18227", "authors": ["Jean-Marie Malherbe"], "title": "150 years of ground-based solar instrumentation at Meudon observatory (1876-2026)", "comment": "arXiv admin note: text overlap with arXiv:2401.15998. text overlap with arXiv:2401.15998. text overlap with arXiv:2401.15998. text overlap with arXiv:2401.15998", "summary": "The Sun has been observed through a telescope for four centuries. However, its study made a prodigious leap at the end of the nineteenth century with the appearance of photography and spectroscopy, then at the beginning of the following century with the invention of the coronagraph and monochromatic filters, and finally in the second half of the twentieth century with the advent of large ground-based telescopes and space exploration. This article retraces the main stages of solar instrumental developments in Meudon, from its foundation by Jules Janssen in 1876 to the present day, limited to ground-based or balloon instrumentation, designed in Meudon and installed there or in other places (Nan{\\c c}ay, Pic du Midi, Canary Islands). The Meudon astronomers played a pioneering role in the history of solar physics through the experimentation of innovative techniques. After the golden age of inventions, came the time of large instruments, studied in Meudon but often installed in more favourable sites, and that of space, in a framework of international collaboration, but this is not discussed here."}
{"id": "2601.17792", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.17792", "abs": "https://arxiv.org/abs/2601.17792", "authors": ["Yutaro Nagai", "Teruaki Enoto", "Masahiro Tsujimoto", "Hiroya Yamaguchi", "Yuto Mochizuki", "Ehud Behar", "Lia Corrales", "Paul A. Draghis", "Ken Ebisawa", "Natalie Hell", "Timothy R. Kallman", "Richard L. Kelley", "Pragati Pradhan", "Shinya Yamada", "Toshiyuki Azuma", "Xiao-Min Tong"], "title": "Energy shift of Fe-K fluorescence lines due to low ionization demonstrated with XRISM in Centaurus X-3", "comment": "14 pages, 6 figures, 3 tables", "summary": "The Fe K$α$ fluorescence line at 6.4 keV is a powerful probe of cold matter surrounding X-ray sources and has been widely used in various astrophysical contexts. The X-ray microcalorimeter spectrometer onboard XRISM can measure line shifts with unprecedented precision of $\\sim$0.2 eV, equivalent to a line-of-sight velocity of $\\sim$10 km s$^{-1}$. At this level of accuracy, however, several factors that influence the line energy must be carefully considered prior to astrophysical interpretation. One such important factor is the ionization degree, Fe$^{q+}$. The K$α$ line shifts redward by $\\sim$4 eV as $q$ increases from 0 (neutral) to 8 (Ar-like). Additionally, the accompanying Fe K$β$ line at 7.06 keV shifts blueward by $\\sim$30 eV from $q=0$ to 8. We demonstrate that this effect is actually observable in the XRISM data of the high-mass X-ray binary Centaurus X-3 (Cen X-3). We advocate that the differential energy shift between the K$α$ and K$β$ line provides a robust estimate of $q$ by decoupling from other effects that shift the two lines in the same direction. We derived $q \\sim 5$ (Sc-like) for the fluorescing matter by comparing the observation with atomic structure calculations of our own and in the literature. By accounting for the derived charge state and the corresponding shift in the rest-frame line energy, we made corrections for this effect and reached a consistent residual shift among the K$α$, K$β$, and the optical measurement attributable to the systemic velocity of the system. Consequently, we obtained a new constraint on the location of the cold matter. This ionization effect needs to be assessed in all use cases of the Fe K$α$ line shift beyond Cen X-3, and the proposed metric is generally applicable to all of them."}
{"id": "2601.18311", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.18311", "abs": "https://arxiv.org/abs/2601.18311", "authors": ["Leo Hirata", "Yuki Amano", "Moto Togawa", "Hiroyuki A. Sakaue", "Nobuyuki Nakamura", "Makoto Sawada", "Hiromasa Suzuki", "Masaki Oura", "Hiroya Yamaguchi"], "title": "Photoexcitation spectroscopy of highly charged ions for application to astronomy using a compact electron beam ion trap (EBIT) at the synchrotron radiation facility SPring-8", "comment": "8 pages, 6 figures, accepted for publication in Plasma and Fusion Research", "summary": "In the past few decades, X-ray astronomy satellites equipped with grating spectrometers and microcalorimeters have enabled high-resolution spectroscopic observations of astrophysical objects. The need for accurate atomic data has arose as we attempt detailed analysis of the high-resolution spectra they provide. This is because current spectral models, which heavily rely on theoretical calculations, entail non-negligible uncertainties. We employ a plasma spectroscopy device called electron beam ion trap (EBIT) to experimentally obtain precise atomic data. An EBIT with a design that allows combined operation with synchrotron radiation facilities was developed based on the Heidelberg Compact EBIT and installed at ISAS/JAXA for this purpose. We conducted a spectroscopic experiment using the JAXA-EBIT at the synchrotron radiation facility SPring-8, and successfully obtained high-resolution spectra of the L$α$ resonance transition of Ne-like Fe$^{16+}$ ions, 3C, as well as the K$α$ resonance transition of He-like O$^{6+}$ ions. We also measured another Ne-like Fe$^{16+}$ L$α$ resonance transition, 3G, and constrained an upper limit of the oscillator strength ratio of 3G to 3C, using our experimental results. The experimental values obtained in this study will be applied to observational studies of astrophysical objects as a part of the plasma spectral modeling."}
{"id": "2601.17851", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.17851", "abs": "https://arxiv.org/abs/2601.17851", "authors": ["Hua Yue", "Lin Nie", "Yi-Qing Guo", "Hong-Bo Hu"], "title": "Joint constraint on the propagation origin of the cosmic-ray spectral knee from energy spectrum and anisotropy observations", "comment": "13 pages, 7 figures, accepted for publication in the Astrophysical Journal", "summary": "The origin mechanism of the cosmic-ray knee region remains an unresolved mystery, with acceleration, interaction, and propagation models drawing significant attention. The latest experimental observations of the PeV total spectrum, composition energy spectrum, and anisotropy-particularly the precise measurements of the proton spectrum by the LHAASO experiment-have provided crucial breakthroughs in uncovering its origin. Based on the latest LHAASO measurements of the proton energy spectrum, combined with cosmic-ray spectral and anisotropy data, this study proposes that the spectral index variation in the knee region arises from changes in the propagation coefficient. By introducing a knee position $\\rm \\mathcal{R}_{knee}$ and an index variation $\\rm δ_{knee}$, we construct a rigidity-dependent double-power-law diffusion model to reproduce the knee-region spectral structure. Through modifications to the diffusion coefficient, we successfully replicate the observed knee-region spectral structure in the LHAASO proton spectrum and calculate the corresponding anisotropy. Under current data and model dependencies, a joint analysis of the energy spectrum and anisotropy does not support the propagation origin model of the cosmic-ray knee at a 95\\% confidence level. We hope that future LHAASO experiments will provide precise measurements of the energy spectra and anisotropies of various nuclei in the knee region, thereby offering a definitive test of the propagation model as the origin mechanism of the knee-region spectral structure."}
{"id": "2601.18668", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2601.18668", "abs": "https://arxiv.org/abs/2601.18668", "authors": ["Fabian Schüssler", "H. Ashkar", "W. Kiendrébéogo", "M. Seglar-Arroyo", "M. de Bony", "A. Berti", "E. Ruiz-Velasco", "R. Le Montagner"], "title": "tilepy: A Flexible Open-Source Scheduling Engine for Time-Domain and Multi-Messenger Astronomy", "comment": "Proceedings 35th annual conference on Astronomical Data Analysis Software and Systems (ADASS XXXV, Görlitz/Germany, 2025)", "summary": "The era of multi-messenger astrophysics requires rapid and efficient follow-up of transient events, many of which, such as gravitational waves (GW), gamma-ray bursts (GRB), and high-energy neutrinos, suffer from poor sky localisation. We present tilepy, a Python-based software designed to optimize observation schedules for these events. We here detail the modular architecture of tilepy, which separates high-level scheduling logic from low-level tiling and pointing tools, enabling full adaptability for ground- and space-based observatories. Furthermore, we describe the integration of tilepy into the Astro-COLIBRI platform, providing the community with a user-friendly interface and API for triggering complex observation campaigns in real time."}
{"id": "2601.17955", "categories": ["astro-ph.HE", "physics.flu-dyn", "physics.plasm-ph"], "pdf": "https://arxiv.org/pdf/2601.17955", "abs": "https://arxiv.org/abs/2601.17955", "authors": ["Chandranathan Anandavijayan", "Pallavi Bhat"], "title": "Spectral Evolution and Current Sheet Analysis as Probes of Reconnection-Mediated Decay in Magnetically Dominated Turbulence", "comment": "23 pages, 20 figures", "summary": "The decay of magnetically dominated turbulence exhibits robust inverse transfer of magnetic energy even in the absence of net magnetic helicity, challenging traditional cascade-based phenomenology. While recent studies suggest that magnetic reconnection governs the evolution of such systems, a comprehensive understanding has been lacking. Here we test a reconnection-mediated model for decaying magnetic turbulence in two-dimensional (strict-2D), 2.5D, and three-dimensional (3D) systems with both helical and nonhelical initial conditions. We show that the magnetic-energy decay timescale scales with the Lundquist number in a manner consistent with Sweet-Parker-type reconnection rather than Alfvenic or purely resistive timescales. We develop a broken power-law model for the magnetic energy spectra and provide analytic predictions for the temporal evolution of energy across both sub-inertial and inertial ranges, which are confirmed by high-resolution simulations. In nonhelical turbulence, these results favor anastrophy as the dominant constraint over helicity fluctuations. Using Minkowski functionals to analyze reconnecting current sheets in real space, we find that the structures controlling the decay are substantially smaller than the global magnetic correlation scale, implying local Lundquist numbers well below the system-scale value. This explains the weak sensitivity of global decay laws to current-sheet resolution and that the current-sheet aspect ratios converge toward Sweet-Parker predictions only at sufficiently high resolution. Together, these results establish magnetic reconnection as the organizing principle underlying inverse transfer, spectral evolution, and decay in magnetically dominated turbulence, providing a unified picture applicable across dimensionality and helicity regimes with direct implications for astrophysical plasmas."}
{"id": "2601.18139", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2601.18139", "abs": "https://arxiv.org/abs/2601.18139", "authors": ["Akash Garg", "Aman Kumar", "Ajit Kembhavi", "Ranjeev Misra", "Aniruddha Kembhavi", "N. S. Philip", "Rohan Pattnaik", "Shreya Watwe"], "title": "Neuro-Parametric Spectral Classification of Black Hole and Neutron Star X-ray Binary Systems", "comment": "11 pages, 7 figures, Submitted to ApJ (under review)", "summary": "We perform the classification of black hole and neutron star X-ray binary systems using deep neural networks applied to archival RXTE X-ray spectral data. We first construct two neural network models: one trained using only spectral flux values and another trained using both fluxes and their associated errors. Both models achieve high classification accuracies of ~90-94 %. To gain physical interpretability of these networks, we fit all spectra with a simple phenomenological model consisting of a thermal disk component and a power-law. From this analysis, we identify the blackbody temperature, power-law index, the ratio of blackbody to power-law flux, the reduced $χ^2$, and the variance of the data as key parameters that likely contribute to the classification. We validate this inference by designing an additional neural network trained exclusively on this reduced parameter set, without using the spectral data directly. This parameter-based model achieves a classification accuracy comparable to that of the spectral models. Our results show that deep neural networks can not only classify compact objects in X-ray binaries with high accuracy but can also be interpreted in terms of physically meaningful spectral parameters derived from conventional X-ray spectral analysis. This framework offers a promising, mission-agnostic approach for compact object classification in current and future X-ray surveys."}
{"id": "2601.18040", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2601.18040", "abs": "https://arxiv.org/abs/2601.18040", "authors": ["Takeru Murase", "Hidetoshi Sano", "Kohei Matsubara", "Yasuo Fukui", "Junya Nishi", "Sabrina Einecke", "Miroslav Filipovic", "Rina Kasai", "Ren Matsusaka", "Gavin Rowell", "Hiroshi Sodoh", "Hiromasa Suzuki", "Yosuke Shibata", "Kisetsu Tsuge", "Hiroshi Takaba", "Toshihiro Handa"], "title": "Gas Kinematics and Cosmic-Ray Acceleration in the Gamma-ray SNRs W41 and G22.7-0.2", "comment": "16 pages, 8 figures, accepted for publication in The Astrophysical Journal (ApJ)", "summary": "We present a study of the interstellar medium associated with the two middle-aged supernova remnants (SNRs) W41 and G22.7-0.2, both detected in TeV gamma-rays. Using high-angular-resolution $^{12}$CO($J$ = 1-0) data from the Nobeyama 45-m telescope and HI data from the VLA, we investigated the spatial and kinematic properties of molecular and atomic gas that interact with the SNRs. We identified associated clouds in the velocity ranges of +50-+80 km s$^{-1}$ for W41 and +76-+110 km s$^{-1}$ for G22.7-0.2. Column density analysis indicates that target protons are dominated by molecular hydrogen, while atomic hydrogen contributes less than $\\sim$10-15% even after correction for self-absorption. The mean proton densities are $\\sim$1.2$\\times$10$^{3}$ cm$^{-3}$ for W41 and $\\sim$5.3$\\times$10$^{2}$ cm$^{-3}$ for G22.7-0.2. From the gamma-ray luminosities, we estimate the total energy of accelerated cosmic-ray protons as $W_\\mathrm{p}$ $\\sim$3$\\times$10$^{47}$~erg for W41 and $\\sim$1$\\times$10$^{48}$ erg for G22.7-0.2, corresponding to 0.03-0.1% of the canonical supernova explosion energy. hese $W_\\mathrm{p}$ values agree with the decreasing trend in $W_\\mathrm{p}$ observed in the middle-aged SNRs within the previously reported SNR age-$W_\\mathrm{p}$ relation."}
{"id": "2601.18262", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2601.18262", "abs": "https://arxiv.org/abs/2601.18262", "authors": ["Mario Cazzolla", "Francesco De Paolis", "Antonio Franco", "Achille Nucita"], "title": "Revisiting a Quasar Microlensing Event Towards AGN~J1249+3449", "comment": "13 Pages, 7 Figures, 4 Tables. Accepted for Publication on Universe. 2026", "summary": "The gravitational wave event GW190521 seems to be the only BH merger event possibly correlated with an electromagnetic counterpart, which appeared about 34 days after the GW event. This work aims to confirm that the electromagnetic bump towards the Active Galactic Nucleus (AGN) J1249+3449 can be explained within the framework of the gravitational microlensing phenomenon. In particular, considering the data of the Zwicky Transient Facility (ZTF), what emerges from a detailed analysis of the observed light curve using three fitting models (Point Source Point Lens, Finite Source Point Lens, Uniform Source Binary Lens) is that the optical bump can be explained as a microlensing event caused by a lens with mass {$\\sim\\,$0.1 $M_{\\odot}$}, lying in the host galaxy of the AGN in question.} %MDPI: Please confirm if the bold formatting is necessary; if not, please remove it."}
{"id": "2601.18051", "categories": ["astro-ph.HE", "nucl-th"], "pdf": "https://arxiv.org/pdf/2601.18051", "abs": "https://arxiv.org/abs/2601.18051", "authors": ["Mia Kumamoto", "Catherine Welch"], "title": "Neutrino opacities in magnetic fields for binary neutron star merger simulations", "comment": "25 pages, 8 figures", "summary": "Neutrino interactions play a central role in transport and flavor evolution in the ejecta of binary neutron star mergers. Simulations suggest that neutron star mergers may produce magnetic fields as strong as $10^{17}$ G, but computational difficulties have hampered the inclusion of magnetic field effects in neutrino interaction rates. In this paper we give approximate interaction rates for neutrinos in the presence of strong magnetic fields, including the effects of Landau quantization and anomalous magnetic moments with errors of order $\\sqrt{T/M}$. We also comment on a neutrino production channel from individual neutrons that can produce low-energy $ν\\barν$ pairs even at low density."}
{"id": "2601.18542", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2601.18542", "abs": "https://arxiv.org/abs/2601.18542", "authors": ["Austin MacMaster", "Adam Rogers", "Jason Fiege", "Rebecca Man", "Samar Safi-Harb"], "title": "XFit: Global Optimization and Degeneracy Mapping in X-ray Spectral Modeling", "comment": "Accepted for publication in ApJ. 23 pages, 12 figures", "summary": "The standard approach to modeling X-ray spectral data relies on local optimization methods, such as the Levenberg-Marquardt algorithm. While effective for simple models and speedy spectral fitting, these local optimizers are prone to becoming trapped in local minima, particularly in high-dimensional or degenerate parameter spaces, and typically require extensive user intervention. In this work, we introduce XFit, a global optimization method for fitting X-ray data, which makes extensive use of the Ferret evolutionary algorithm. XFit enables automated exploration of complex parameter spaces, efficient mapping of confidence intervals, and identification of degenerate solutions that may be overlooked by local methods. We demonstrate the performance of XFit using two representative X-ray sources: the Central Compact Object in Cassiopeia A and the supernova remnant G41.1-0.3. These examples span both low- and high-dimensional models, allowing us to illustrate the advantages of global optimization. In both cases, XFit produces solutions that are consistent with or improve upon those found with traditional methods, while also revealing alternative fits or degenerate solutions within statistically acceptable confidence levels. The automated mapping of parameter space offered by XFit makes it a powerful complement to existing spectral fitting tools, particularly as models and data quality become increasingly complex. Future work will expand the application of XFit to broader datasets and more physically motivated models."}
{"id": "2601.18139", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2601.18139", "abs": "https://arxiv.org/abs/2601.18139", "authors": ["Akash Garg", "Aman Kumar", "Ajit Kembhavi", "Ranjeev Misra", "Aniruddha Kembhavi", "N. S. Philip", "Rohan Pattnaik", "Shreya Watwe"], "title": "Neuro-Parametric Spectral Classification of Black Hole and Neutron Star X-ray Binary Systems", "comment": "11 pages, 7 figures, Submitted to ApJ (under review)", "summary": "We perform the classification of black hole and neutron star X-ray binary systems using deep neural networks applied to archival RXTE X-ray spectral data. We first construct two neural network models: one trained using only spectral flux values and another trained using both fluxes and their associated errors. Both models achieve high classification accuracies of ~90-94 %. To gain physical interpretability of these networks, we fit all spectra with a simple phenomenological model consisting of a thermal disk component and a power-law. From this analysis, we identify the blackbody temperature, power-law index, the ratio of blackbody to power-law flux, the reduced $χ^2$, and the variance of the data as key parameters that likely contribute to the classification. We validate this inference by designing an additional neural network trained exclusively on this reduced parameter set, without using the spectral data directly. This parameter-based model achieves a classification accuracy comparable to that of the spectral models. Our results show that deep neural networks can not only classify compact objects in X-ray binaries with high accuracy but can also be interpreted in terms of physically meaningful spectral parameters derived from conventional X-ray spectral analysis. This framework offers a promising, mission-agnostic approach for compact object classification in current and future X-ray surveys."}
{"id": "2601.18262", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2601.18262", "abs": "https://arxiv.org/abs/2601.18262", "authors": ["Mario Cazzolla", "Francesco De Paolis", "Antonio Franco", "Achille Nucita"], "title": "Revisiting a Quasar Microlensing Event Towards AGN~J1249+3449", "comment": "13 Pages, 7 Figures, 4 Tables. Accepted for Publication on Universe. 2026", "summary": "The gravitational wave event GW190521 seems to be the only BH merger event possibly correlated with an electromagnetic counterpart, which appeared about 34 days after the GW event. This work aims to confirm that the electromagnetic bump towards the Active Galactic Nucleus (AGN) J1249+3449 can be explained within the framework of the gravitational microlensing phenomenon. In particular, considering the data of the Zwicky Transient Facility (ZTF), what emerges from a detailed analysis of the observed light curve using three fitting models (Point Source Point Lens, Finite Source Point Lens, Uniform Source Binary Lens) is that the optical bump can be explained as a microlensing event caused by a lens with mass {$\\sim\\,$0.1 $M_{\\odot}$}, lying in the host galaxy of the AGN in question.} %MDPI: Please confirm if the bold formatting is necessary; if not, please remove it."}
{"id": "2601.18357", "categories": ["astro-ph.HE", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2601.18357", "abs": "https://arxiv.org/abs/2601.18357", "authors": ["Vishnu Varma", "Bernhard Müller"], "title": "Resolution Dependence in Magnetohydrodynamic Simulations of Neutrino-Driven Core-Collapse Supernovae", "comment": "16 pages, 15 figures. Submitted for publication in MNRAS", "summary": "We investigate the role of resolution and initial magnetic field strength on core-collapse supernovae in simulations of a non-rotating $13 \\mathrm{M_\\odot}$ progenitor. Specifically, we study the effect on shock revival, explosion dynamics, and the properties of the compact remnant. We run four models with different numerical grid resolutions with an initial central dipole field strength of $\\mathord{\\approx}10^{12}\\, \\mathrm{G}$. Two of those resolutions are also run with a weaker central magnetic field of $\\mathord{\\approx}10^{10}\\, \\mathrm{G}$ . The shock revival time for all models is largely independent of resolution and initial magnetic field strength, but we find higher explosion energies when the initial magnetism is stronger and at higher resolutions. We find that models with strong magnetic fields have lower neutrino luminosity and energies, due to a proto-neutron star (PNS) that is deformed by the strong magnetic fields. At higher resolutions, magnetic fields are amplified more efficiently in the gain region and in the PNS via the small-scale dynamo. Although the strong magnetic fields do not directly drive the explosion, they have a subsidiary impact on the explosion mechanism and compensate for the reduced neutrino heating. Stronger magnetic energies in the PNS also affect energy and angular momentum redistribution, leading to more extended and vigorous PNS convection zones at higher resolutions."}
{"id": "2601.18411", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.18411", "abs": "https://arxiv.org/abs/2601.18411", "authors": ["A. D. Supanitsky", "S. E. Nuza"], "title": "Exploring the role of accretion shocks in galaxy clusters as sources of ultrahigh-energy cosmic rays", "comment": "Accepted for publication in PRD", "summary": "Recently, the Pierre Auger Observatory has found strong evidence supporting the extragalactic origin of the most energetic cosmic rays. Despite several observed excesses in the distribution of arrival directions for the highest energy cosmic rays, the sources remain unidentified. Accretion shocks in galaxy clusters have been proposed as potential sources in the past. These immense shock waves, which can have radii on the order of megaparsecs, are generated by the infall of material from the intergalactic medium into the gravitational potential wells of galaxy clusters. In this work, we investigate the possibility that ultrahigh-energy cosmic rays are accelerated in these regions. Nearby massive galaxy clusters, including Virgo, are treated as a discrete component of the cluster mass distribution. Less massive galaxy clusters, as well as distant massive ones, are assumed to follow a continuous distribution in agreement with cluster mass statistics. We fit the flux at Earth and the composition profile measured by the Pierre Auger Observatory, assuming the injection of different nuclear species by these sources, to determine the values of the model parameters. Our results indicate that cosmic ray acceleration in cluster accretion shocks may account for at least a fraction of the observed UHECR flux at energies below the suppression scale. At higher energies, direct acceleration from the thermal pool would be feasible only if local fluctuations create favorable conditions, such as magnetic fields about an order of magnitude stronger than those typically expected in cluster accretion shocks, or for particular shock normal-magnetic field configurations."}
{"id": "2601.18542", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2601.18542", "abs": "https://arxiv.org/abs/2601.18542", "authors": ["Austin MacMaster", "Adam Rogers", "Jason Fiege", "Rebecca Man", "Samar Safi-Harb"], "title": "XFit: Global Optimization and Degeneracy Mapping in X-ray Spectral Modeling", "comment": "Accepted for publication in ApJ. 23 pages, 12 figures", "summary": "The standard approach to modeling X-ray spectral data relies on local optimization methods, such as the Levenberg-Marquardt algorithm. While effective for simple models and speedy spectral fitting, these local optimizers are prone to becoming trapped in local minima, particularly in high-dimensional or degenerate parameter spaces, and typically require extensive user intervention. In this work, we introduce XFit, a global optimization method for fitting X-ray data, which makes extensive use of the Ferret evolutionary algorithm. XFit enables automated exploration of complex parameter spaces, efficient mapping of confidence intervals, and identification of degenerate solutions that may be overlooked by local methods. We demonstrate the performance of XFit using two representative X-ray sources: the Central Compact Object in Cassiopeia A and the supernova remnant G41.1-0.3. These examples span both low- and high-dimensional models, allowing us to illustrate the advantages of global optimization. In both cases, XFit produces solutions that are consistent with or improve upon those found with traditional methods, while also revealing alternative fits or degenerate solutions within statistically acceptable confidence levels. The automated mapping of parameter space offered by XFit makes it a powerful complement to existing spectral fitting tools, particularly as models and data quality become increasingly complex. Future work will expand the application of XFit to broader datasets and more physically motivated models."}
{"id": "2601.18551", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2601.18551", "abs": "https://arxiv.org/abs/2601.18551", "authors": ["Paloma Thevenet", "Jeonguk Kim", "Guang-Yao Zhao", "Bong Won Sohn", "Suk-Jin Yoon"], "title": "Multi-epoch VLBI observations of the blazar 3C 66A: Spatial twisting and temporal oscillation of the parsec-scale jet", "comment": "17 pages, 7 figures + 9 appendix pages, A&A in press", "summary": "Previous VLBI kinematic studies of the blazar 3C 66A have unveiled complex jet kinematic behaviors. Using follow-up high-resolution VLBI observations and archival data, we investigate the morphology and the variations in orientation and core flux density of the 3C 66A jet to gain a deeper insights into its kinematic behavior and physical origins. We performed KVN and VERA array (KaVA) observations at 22/43 GHz over three epochs in 2014 and collected 109 sets of Very Long Baseline Array (VLBA) archival data at 43 GHz between 1996 - 2025. We imaged the parsec-scale jet and parameterized it using circular Gaussian fittings to the UV visibilities. Finally, we derived the inner jet PA and the core flux densities for the VLBA data. The jet presents a twisted morphology in the KaVA maps. The PA of the fitted Gaussian components is in the range between 170 deg and 195 deg. Our kinematic analysis using the VLBA data indicates that the PA oscillates with an amplitude of 7.77 pm 0.79 deg and a period of 10.94 pm 0.22 years, presented for the first time in this work. This oscillation is topped by a continuous clockwise shift of the PA by -0.83 pm 0.07 deg/year. We also identified a strong core flux variability with possible periodicity and a 2 sigma correlation between the core flux density and the inner jet PA change. We discuss possible physical models that could explain the observed features for this object; in particular, a supermassive black hole binary (SMBHB) system, Lense Thirring (LT) effect, and jet or disk instabilities. The oscillation and continuous shift of the PA and the possible radio flux periodicity, together with the optical flux periodicity of approximately 2 years that had previously been confirmed in several independent studies, favor a jet precession scenario driven by orbital motion and disk-orbit misalignment in a SMBHB system."}
{"id": "2601.18596", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.18596", "abs": "https://arxiv.org/abs/2601.18596", "authors": ["Pierrick Martin", "Mickael Coriat", "Barbara Olmi", "Elena Amato", "Niccolò Bucciantini", "Alexandre Marcowith", "Sarah Recchia"], "title": "Radio streaks in the Lighthouse Nebula discovered with MeerKAT -- Particles escaping from the tail and illuminating the ambient magnetic field", "comment": "8 pages, 7 figures, submitted. Comments welcome", "summary": "Bow-shock pulsar wind nebulae are valuable sources to investigate the dynamics of relativistic pulsar winds and the mechanisms by which they are converted into cosmic-ray leptons at the highest energies. The Lighthouse Nebula is one such object, famous for the high velocity of its pulsar and a long misaligned X-ray jet that is understood as a specific escape channel for the most energetic particles. We aim to get a better understanding of how the bulk of non-thermal particles are released into the interstellar medium. We focus on GHz radio observations, which probe lower-energy particles that are dominant in number and long-lived, thus offering a picture of how escape proceeds in the long run. We analyze 10.5h of MeerKAT observations in the 0.9-1.7GHz band. MeerKAT observations reveal a highly structured synchrotron nebula downstream of pulsar PSR J1101-6101. A cometary tail is detected up to beyond 5pc from the pulsar, while a system of multiple transverse two-sided emission streaks is observed for the first time. No radio counterpart of the misaligned X-ray jet is seen. The radio streaks are interpreted as the occasional charge-independent release of energetic leptons from the tail into the surrounding medium, as a result of dynamical instabilities and reconfiguration in the downstream flow. The intensity layout suggests that most of the particle content of the nebula is discharged into the ambient medium within several parsec. Once escaped, particles light up the ambient magnetic field, which appears to have a coherence length of at least a few parsec. The length and persistence of the streaks indicate a low level of magnetic turbulence, possibly slightly enhanced with respect to average cosmic-ray transport conditions in the Galaxy. Such a confinement may result from self-generated turbulence by resonant streaming instability, or be due to past activity of the progenitor star."}
{"id": "2601.18607", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.18607", "abs": "https://arxiv.org/abs/2601.18607", "authors": ["Chris Done"], "title": "Disk-jet-wind coupling from stellar mass to supermassive black holes", "comment": "Invited talk presented at the 87th Fujihara Seminar: The 50th Anniversary Workshop of the Disk Instability Model in Compact Binary Stars (DIM50TH2025), held on 22-26 September 2025 in Tomakomai, Japan. To be published in the Proceedings of Science https://pos.sissa.it/493/", "summary": "Black holes are the simplest possible objects, characterised by only mass and spin. We see them via accretion, so there is one more fundamental parameter which is the mass accretion rate. Here I will review how the data from both stellar and supermassive black holes can be fit into a framework where there is a major spectral transition at $\\dot{m}=L/L_{\\rm Edd}\\sim 0.01$ where the optically thick disc is replaced by a hot flow. This dramatic spectral change also affects the expected properties of thermal and radiatively powered winds, matching the overall properties of winds seen in new XRISM data from the stellar mass binaries, though there can also be additional UV and dust driven winds in supermassive black holes. The radio data in stellar and supermassive black holes are clear that the hot flow (not the disc) connects to the radio jet, and the radio-X-ray 'fundamental plane' can be qualitatively understood if the radio quiet AGN and stellar mass black holes have low to moderate spins, with the jet power set as a constant fraction of the accretion power. A small fraction of AGN (radio loud) instead have much higher (factor $100-1000\\times$) radio-to-X-ray ratio at the same black hole mass and mass accretion rates. I speculate that these have higher jet power due to high black hole spin. I review the multiple issues still remaining in this picture, most of which are connected to the geometry and nature of the X-ray corona, and the conflicting constraints on this which come from reflection spectroscopy and polarimetry."}
{"id": "2601.18635", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.18635", "abs": "https://arxiv.org/abs/2601.18635", "authors": ["Luigi Foschini"], "title": "The growing family of gamma-ray narrow-line Seyfert 1 galaxies", "comment": "23 pages, 12 figures, 1 table. Presented at: \"Observations and physics of NLS1 galaxies: AGN at their extreme\", November 26-28, 2025, European Southern Observatory, Vitacura, Santiago (Chile)", "summary": "The revision of the fourth Fermi Large Area Telescope (LAT) catalog of gamma-ray point sources (rev4FGL) revealed that the gamma-ray sky is populated by emerging populations of jetted active galactic nuclei (AGN) other than blazars and radio galaxies. Narrow-Line Seyfert 1, Seyfert 1, intermediate, and Seyfert 2 galaxies, changing-look AGN, plus a number of ambiguous or unclassified sources. After a short historical introduction on the gamma-ray observations of Seyfert-type AGN, I explore the main statistical properties of 1477 jetted AGN from the rev4FGL with spectroscopic redshift, and also the cross-match with Very Large Baseline Array (VLBA) radio observations at 15~GHz from the Monitoring Of Jets in Active galactic nuclei with VLBA Experiments (MOJAVE) program. I then discuss the difference between gamma and non-gamma jetted AGN, and the implications on the classification."}
{"id": "2601.18649", "categories": ["astro-ph.HE", "physics.plasm-ph"], "pdf": "https://arxiv.org/pdf/2601.18649", "abs": "https://arxiv.org/abs/2601.18649", "authors": ["J. Pratt"], "title": "Closure models for the feedback of energetic particles on plasma turbulence", "comment": "14 pages, 2 figures,", "summary": "Energetic particles interact with the plasma surrounding them, resonating with certain plasma waves to stabilize them while destabilizing others, and changing the character of the background turbulence in ways that have not been fully quantified or understood. Interaction with the turbulent background plasma is key to the acceleration of many types of energetic particles including high-energy cosmic rays, solar energetic particles, and pick-up ions. This is a process that would ideally be described by a kinetic model, a type of model that follows a probability distribution function (PDF) for all particles in 7-dimensional space. Because of the high dimensionality of a kinetic model, such simulations use the largest computational resources available, and are yet unable to simulate a realistic number of particles, reach the large scales necessary for astrophysical problems, or use high-precision numerical methods. Two available alternatives to kinetic plasma models have been explored: a multi-fluid model, and a hybrid fluid/Fokker-Planck model. These methods are hampered by the physical modeling of the coupling. We develop a new model, which follows the PDF for all particles; this can be viewed as a step toward physical realism above a multi-fluid MHD model, while also being more computationally efficient than a kinetic model. The equations we develop model both the background plasma and the energetic particles self-consistently. Over the last decade, similar PDF methods have been developed to a high level of sophistication to model reactive flows and turbulent combustion for engineering applications. For treatment of the feedback of the energetic particles on a background plasma, a PDF closure approach should evaluate the mean characteristics, including the density, with better statistical quality than will particle-sampling procedures."}
{"id": "2601.18725", "categories": ["astro-ph.HE", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2601.18725", "abs": "https://arxiv.org/abs/2601.18725", "authors": ["Luis E. Rodríguez", "Andreas Reisenegger", "Denis González-Caniulef", "Cristóbal Petrovich"], "title": "Explaining the thermal emission of old neutron stars with rotochemical heating and magnetized superconducting protons", "comment": null, "summary": "The detection of likely thermal ultraviolet emission from a few old neutron stars suggests that at least one internal heating mechanism is present in these stars. One proposed mechanism is rotochemical heating, in which the continuous contraction of the neutron star due to its spin-down produces chemical imbalances that induce Urca reactions, and the latter deposit heat in the neutron star core. If the protons in the star are superconducting, their energy gap suppresses the reactions, except in microscopic magnetized regions (such as quantized flux tubes) in which the protons act as if they were normal. Therefore, the strength of the internal magnetic field controls the rate at which reactions proceed and thus affects the thermal evolution of the neutron star. Here, we present the first comprehensive study of the effect of an internal magnetic field in the superconducting interior on rotochemical heating. We simulate the evolution of neutron stars for different internal magnetic field strengths and neutron energy gaps, comparing the results to Hubble Space Telescope observations of old neutron stars. All the observational data can be accounted for if the proton energy gap is large ($\\sim 1.5\\,\\mathrm{MeV}$) and the neutron energy gap is small ($\\lesssim 0.1\\,\\mathrm{MeV}$) or vanishing, while the millisecond pulsar PSR~J0437$-$4715 needs to have a very weak internal magnetic field. Our results suggest that neutron-star cores are characterized by a large proton pairing gap and a small or vanishing neutron gap, and that millisecond pulsars have very weak internal magnetic fields. Under these conditions, rotochemical heating alone can account for the observed thermal emission of old neutron stars."}
{"id": "2601.17882", "categories": ["astro-ph.IM", "astro-ph.CO", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.17882", "abs": "https://arxiv.org/abs/2601.17882", "authors": ["Soorya Narayan", "Anupreeta More", "Sunil Choudhary", "Sudhagar Suyamprakasam", "Sukanta Bose"], "title": "SiGMa-Net II: Distinguishing Binary Black Holes from Glitches", "comment": "8 pages, 5 figures, no appendix", "summary": "With increasing sensitivity of the gravitational wave (GW) detectors, we expect a significant rise in the detectable GW events. To process, analyse and identify such large amounts of GW signals arising from mergers of Binary Black Holes (BBH), we need both speed and accuracy. In the search for (massive) BBH signals, the biggest hurdle is posed by the various non-gaussian noise transients called glitches. Compared to our previous work, which used a simple convolutional neural network to distinguish BBHs from Blip glitches, this work uses transfer learning with InceptionNetV3 to distinguish BBHs from six types of most popular glitches from the third observing run of LIGO. While the glitches are real and identified via GravitySpy, the BBH signals are simulated and then injected into the real detector noise for each of the two LIGO detectors. We generate Sine-Gaussian Projection (SGP) maps by cross-correlating data with Sine-Gaussian functions of varied quality factors ($Q$) and central frequencies ($f_0$) and projected on the $Q$ - $f_0$ plane. We find that SGP maps make it easier to distinguish BBHs from glitches that look very similar to BBHs in the Time-Frequency maps like the Blips, while also maintaining significant morphological differences between BBHs and the more frequent glitches - Scattered Light and Fast Scattering. Our network has an accuracy of $87%$, a TPR of 0.83 for an FPR of 0.1 on our test dataset. It is also robust, retaining its level of accuracy, when tested on real BBH events identified in the first three observing runs of LIGO. Our proposed method shows the viability of using the SGP maps and neural networks for fast identification of GW events improving the efficiency of standard search pipelines."}
{"id": "2601.18311", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.18311", "abs": "https://arxiv.org/abs/2601.18311", "authors": ["Leo Hirata", "Yuki Amano", "Moto Togawa", "Hiroyuki A. Sakaue", "Nobuyuki Nakamura", "Makoto Sawada", "Hiromasa Suzuki", "Masaki Oura", "Hiroya Yamaguchi"], "title": "Photoexcitation spectroscopy of highly charged ions for application to astronomy using a compact electron beam ion trap (EBIT) at the synchrotron radiation facility SPring-8", "comment": "8 pages, 6 figures, accepted for publication in Plasma and Fusion Research", "summary": "In the past few decades, X-ray astronomy satellites equipped with grating spectrometers and microcalorimeters have enabled high-resolution spectroscopic observations of astrophysical objects. The need for accurate atomic data has arose as we attempt detailed analysis of the high-resolution spectra they provide. This is because current spectral models, which heavily rely on theoretical calculations, entail non-negligible uncertainties. We employ a plasma spectroscopy device called electron beam ion trap (EBIT) to experimentally obtain precise atomic data. An EBIT with a design that allows combined operation with synchrotron radiation facilities was developed based on the Heidelberg Compact EBIT and installed at ISAS/JAXA for this purpose. We conducted a spectroscopic experiment using the JAXA-EBIT at the synchrotron radiation facility SPring-8, and successfully obtained high-resolution spectra of the L$α$ resonance transition of Ne-like Fe$^{16+}$ ions, 3C, as well as the K$α$ resonance transition of He-like O$^{6+}$ ions. We also measured another Ne-like Fe$^{16+}$ L$α$ resonance transition, 3G, and constrained an upper limit of the oscillator strength ratio of 3G to 3C, using our experimental results. The experimental values obtained in this study will be applied to observational studies of astrophysical objects as a part of the plasma spectral modeling."}
