{"id": "2602.02507", "categories": ["astro-ph.HE", "physics.comp-ph"], "pdf": "https://arxiv.org/pdf/2602.02507", "abs": "https://arxiv.org/abs/2602.02507", "authors": ["Christian Y. Cardall", "Reuben D. Budiardja", "R. Daniel Murphy", "Eirik Endeve"], "title": "GenASiS: General Astrophysical Simulation System. II. Self-gravitating Baryonic Matter", "comment": "23 pages, 20 figures, to be submitted to Astrophysical Journal Supplement Series", "summary": "GenASiS (General Astrophysical Simulation System) is a code being developed initially and primarily, though not exclusively, for the simulation of core-collapse supernovae on the world's leading capability supercomputers. This paper -- the second in a series -- documents capabilities for Newtonian self-gravitating fluid dynamics, including tabulated microphysical equations of state treating nuclei and nuclear matter (`baryonic matter'). Computation of the gravitational potential of a spheroid, and simulation of the gravitational collapse of dust and of an ideal fluid, provide tests of self-gravitation against known solutions. In multidimensional computations of the adiabatic collapse, bounce, and explosion of spherically symmetric pre-supernova progenitors -- which we propose become a standard benchmark for code comparisons -- we find that the explosions are prompt and remain spherically symmetric (as expected), with an average shock expansion speed and total kinetic energy that are inversely correlated with the progenitor mass at the onset of collapse and the compactness parameter."}
{"id": "2602.02575", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2602.02575", "abs": "https://arxiv.org/abs/2602.02575", "authors": ["Sattvik Yadav"], "title": "Formation and Evolution of Antimatter Objects", "comment": null, "summary": "The fundamental question of baryogenesis and the problem of matter-antimatter asymmetry motivate this study into the formation and evolution of antimatter objects in the early Universe. Hypothesize is the existence of isolated antimatter domains in a baryon-asymmetric Universe that survive until the era of first star formation ($Z \\approx 20$). By assuming CPT-symmetry, the thermodynamics, mechanics, and energy dynamics of an antimatter gas cloud (composed of antihydrogen and antihelium) are treated symmetrically to their primordial matter counterparts. Analysis demonstrates the physical feasibility of the gravitational collapse process for a conservatively estimated antimatter domain ($\\approx 5 \\times 10^3 M_{\\odot}$). The initial conditions easily satisfy the Jeans and Bonnor-Ebert mass criteria, indicating a high propensity for instability and runaway collapse. The subsequent dynamical evolution, driven by $\\bar{H}_2$ cooling, is predicted to proceed identically to that of Population III star formation, leading to the formation of a dense, adiabatic anti-protostellar core. The theoretical viability of a true antistar hinges upon a critical assumption: the physical possibility of antinuclear fusion (e.g., the antiproton cycle) under extreme core conditions. Assuming this symmetry holds, the collapse is predicted to yield massive antistars ($\\gtrsim 22 M_{\\odot}$). This suggests that if antimatter domains formed in the early Universe, they likely underwent stellar formation. Observational constraints on the existence of these objects must rely on the detection of characteristic high-energy $γ$-ray or X-ray signals resulting from matter-antimatter annihilation at the domain boundaries or during mass accretion."}
{"id": "2602.02651", "categories": ["astro-ph.HE", "gr-qc", "hep-ph"], "pdf": "https://arxiv.org/pdf/2602.02651", "abs": "https://arxiv.org/abs/2602.02651", "authors": ["Alessandro Lella", "Giuseppe Lucente", "Daniel Kresse", "Robert Glas", "H. -Thomas Janka", "Alessandro Mirizzi"], "title": "Gravitational-Wave Signals for Supernova Explosions of Three-Dimensional Progenitors", "comment": "37 pages, 23 figures, 1 table; submitted to PRD", "summary": "Core-collapse supernovae (SNe) are sources of gravitational waves (GWs) produced by hydrodynamical instabilities and highly time-dependent anisotropies of the neutrino radiation. In this work we analyze both contributions to the GW signal for two state-of-the-art three-dimensional (3D) SN models computed with the Prometheus-Vertex neutrino-hydrodynamics code. In contrast to the far majority of models analyzed for GWs so far, our core-collapse simulations were started with 12.28 M_sun (18.88 M_sun) progenitors, whose final hour (7 min) of convective oxygen-shell burning was computed in 3D and featured a vigorous oxygen-neon shell merger. The corresponding large-scale asymmetries in the oxygen layer are conducive to buoyancy-aided neutrino-driven explosions. The models were continuously evolved in 3D from the pre-collapse evolution until 5.11 s (1.68 s) after the core bounce. The GW signals result from the well-known dynamical phenomena in the SN core such as prompt postshock convection, neutrino-driven convection, the standing accretion shock instability, proto-neutron star oscillations, and anisotropic ejecta expansion. They do not exhibit any new or specific features that can be unambiguously connected to the powerful pre-collapse activity in the progenitors, but we identify interesting differences compared to results in the literature. We also discuss measurement prospects by interferometers, confirming that GW signals from future Galactic SNe will be detectable with existing and next-generation experiments working in the frequency range f ~ 1-2000 Hz."}
{"id": "2602.02656", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2602.02656", "abs": "https://arxiv.org/abs/2602.02656", "authors": ["Taj Jankovič", "Clément Bonnerot", "Sergey Karpov", "Aleksej Jurca"], "title": "Radiation-hydrodynamics of star-disc collisions for quasi-periodic eruptions", "comment": "Submitted to A&A, comments are welcome!", "summary": "Quasi-periodic eruptions (QPEs) are recently discovered transients of unknown nature occurring near supermassive black holes, which feature bright X-ray bursts separated by hours to days. A promising model for QPEs is the star-disc collisions model, where a star repeatedly interacts with an accretion disc around a black hole, creating shocks that expel dense outflows of gas from which radiation emerges. We investigate the dynamics of the star-disc collisions, the properties of the outflows, and the resulting radiation signatures. Our study focuses on the generic case where the star remains unperturbed by the collision and the stellar crossing time through the disc is sufficiently long for shocked gas to flow around the star. We performed a three-dimensional (3D) radiation-hydrodynamics simulation of the star-disc collision. The star was modeled as a solid, spherical body, and the interaction was simulated for a small, local section of the accretion disc. We found that star-disc collisions generate a nearly paraboloidal bow shock. The heating of gas is not confined to the column of gas directly ahead of the star but also extends laterally as the shock front expands sideways while traveling with the star. As the star crosses the disc, it injects momentum preferentially along its direction of motion, leading to an asymmetric redistribution of energy and momentum. As a result, two outflows emerge on opposite sides of the disc with different properties: the forward outflow expands faster, contains more mass, carries more energy, and is about twice as luminous as the backward outflow. Our findings suggest that the asymmetry in outflow properties and luminosity arises naturally from the collision dynamics, offering a possible explanation for the alternating strong-weak flare patterns observed in several QPE sources."}
{"id": "2602.02661", "categories": ["astro-ph.IM", "astro-ph.CO"], "pdf": "https://arxiv.org/pdf/2602.02661", "abs": "https://arxiv.org/abs/2602.02661", "authors": ["Christian H. Bye", "David R. DeBoer", "Matt Dexter", "Aaron Ewall-Wice", "Adam Fahs", "Pranav Karthik", "Komal Kaur", "Bahram Khalichi", "Wei Liu", "Raul A. Monsalve", "Aaron R. Parsons", "Reid Parsons", "Richard R. Rodriguez", "Richard J. Saeed", "Charlie G. Tolley", "Dominic Vazquez", "Dirk Wright"], "title": "The Electromagnetically Isolated Global Signal Estimation Platform (EIGSEP)", "comment": "Submitted to RASTI", "summary": "The Electromagnetically Isolated Global Signal Estimation Platform (EIGSEP) is a new instrument designed to measure the global 21-cm signal from Cosmic Dawn and the Epoch of Reionization, redshifted to frequencies below 250 MHz. To reduce spectral structure in the antenna beam associated with ground scattering, EIGSEP uses a shaped bowtie antenna suspended in a canyon 100 m above the ground. We describe the current system design of EIGSEP, including the rotating antenna platform, a transmitter antenna to characterise the beam of the bowtie antenna, and auxiliary ground antennas. We then discuss the EIGSEP calibration scheme, which incorporates traditional Dicke switching in the receiver, and novel approaches that include beam mapping, beam modulation, and interferometric cross-correlation. The instrument has been deployed near Marjum Pass, Utah, for testing and initial data collection. We discuss the site characteristics and present initial field measurements."}
{"id": "2602.02677", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2602.02677", "abs": "https://arxiv.org/abs/2602.02677", "authors": ["Nikhil Sarin", "Ellen Lindsjö", "Lisa Kelsey", "Matthew Grayling", "Jesper Sollerman", "Steve Schulze", "Adam Miller", "Madeleine Ginolin", "Erin Hayes", "Conor Omand", "Kaisey Mandel", "Aaron Do", "Suhail Dhawan", "Joel Johansson"], "title": "Lightcurve Modelling of 2,205 ZTF DR2 Type~Ia Supernovae: Implications for SN Ia Physics and Cosmology", "comment": "Submitted. 24 pages 21 figures", "summary": "We fit the multi-band light curves of 2,205 Type Ia supernovae (SNe~Ia) from the Zwicky Transient Facility DR2 with a one-zone radioactive decay model with a phenomenological addition to include Fe recombination physics. We find a strong correlation between inferred nickel mass and SALT2 stretch, which within our simplified modelling is linked to larger ejecta masses providing longer diffusion times, providing a physical basis for the brighter-slower relation. SN~Ia in low-mass hosts ($\\log_{10}(M_*/M_\\odot) < 10$) produce $12\\%$ more $^{56}$Ni than those in high-mass hosts ($ΔM_{\\rm Ni} = 0.13~M_\\odot$), linking the host-galaxy mass step to ejecta properties and hinting at metallicity or age-dependent burning efficiencies. This suggests that standardisation based on physical parameters may remove the mass-step. SN~1991T-like events show higher ejecta masses (median $1.64~M_\\odot$ vs. $1.38~M_\\odot$ for normals) and produce $30\\%$ more $^{56}$Ni, with $84\\%$ having super-Chandrasekhar masses. Through Hierarchical modelling of $902$ SNe ($z \\leq 0.06$), we find thermonuclear supernovae can be well described by a Gaussian distribution in ejecta mass and nickel mass with $μ_{\\rm ej} = 1.26 \\pm 0.01~M_\\odot$ ($σ_{\\rm ej} = 0.33 \\pm 0.01~M_\\odot$) and $μ_{\\rm Ni} = 0.64 \\pm 0.06~M_\\odot$ ($σ_{\\rm Ni} = 0.42 \\pm 0.02~M_\\odot$), respectively. This leads to inferred fractions of $43 \\pm 2\\%$ sub-$M_{\\rm Ch}$ ($<1.2~M_\\odot$), $34 \\pm 1\\%$ near-$M_{\\rm Ch}$ ($1.2$--$1.5~M_\\odot$), and $24 \\pm 2\\%$ super-$M_{\\rm Ch}$ ($>1.5~M_\\odot$) events. This work provides a step towards holistic physical characterization of the local SN~Ia population, reinforcing the physical basis of SN~Ia standardization while quantifying diversity and environmental dependencies critical for understanding progenitor physics and mitigating systematics in precision cosmology."}
{"id": "2602.02844", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2602.02844", "abs": "https://arxiv.org/abs/2602.02844", "authors": ["Jenna E. Ryon", "Norman A. Grogin"], "title": "Serial Charge Transfer Efficiency in ACS/WFC", "comment": "28 pages, 20 figures", "summary": "We present a dedicated study of CCD serial ($x$-direction) charge transfer efficiency (CTE) in ACS/WFC. Following past studies of parallel ($y$-direction) CTE, we use the serial CTE trails behind hot pixels in calibration dark frames to characterize charge trapping and release in the serial registers of the WFC detectors. Serial CTE trails are sharper and longer than parallel CTE trails. Many fewer charge traps come into play during serial pixel transfers than parallel transfers, which explains why parallel CTE is much worse than serial CTE. We find that serial CTE can cause losses of $\\sim$0.005-0.02~mag in stellar photometry and shift stellar centroids by $\\sim$0.01-0.035 pixels. The pixel-based algorithm in CALACS that corrects for parallel CTE losses in WFC data has been modified to include a correction for serial CTE losses. The PCTETAB reference file has also been updated to include serial CTE parameters. The pixel-based correction for serial CTE currently runs only on full-frame WFC images obtained after SM4 (May 2009). Shortly following the publication of this report, science data corrected for both parallel and serial CTE will be available in the MAST archive."}
{"id": "2602.02691", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2602.02691", "abs": "https://arxiv.org/abs/2602.02691", "authors": ["Samaporn Tinyanont", "Kittipong Wangnok", "Jennifer E. Andrews", "Ryan J. Foley", "Methawee Kaewmookda", "Jacob E. Jencson", "Armin Rest", "Katie Auchettl", "K. A. Bostroem", "David A. Coulter", "Poemwai Chainakun", "Ryan Chornock", "Kyle W. Davis", "Ori D. Fox", "Lluís Galbany", "Thomas R. Geballe", "Brian Hsu", "Wynn Jacobson-Galán", "Saurabh W. Jha", "Ravjit Kaur", "Mansi M. Kasliwal", "Ryan M. Lau", "Natalie LeBaron", "Raffaella Margutti", "Seong Hyun Park", "Jeniveve Pearson", "Anthony L. Piro", "Conor L. Ransome", "Aravind P. Ravi", "Jeonghee Rho", "César Rojas-Bravo", "Sam Rose", "David J. Sand", "Nathan Smith", "Manisha Shrestha", "Bhagya M. Subrayan", "Stefano Valenti"], "title": "An infrared echo from a circumstellar disk in the hydrogen- and helium-poor SN 2024aecx", "comment": "Submitted to the ApJ", "summary": "We present near-infrared (NIR) spectroscopy of the hydrogen- and helium-poor (Type Ic) supernova (SN) 2024aecx that displays a strong NIR excess emerging 32 days post peak. SN 2024aecx is a peculiar SN Ic that exhibited luminous shock-cooling emission at early times, suggestive of close-in circumstellar medium (CSM), unexpected for this class of SNe. Its early NIR spectra are typical for a SN Ic but with strong CI absorption features. By ~32 days post peak, the spectra show a strong NIR excess, while maintaining normal optical colors, unprecedented for SNe Ic. We find that the NIR excess is well fit with a single-temperature, optically thin dust model with declining temperature, increasing mass, and roughly constant luminosity over time. The NIR excess appears too promptly for dust to have formed in the SN ejecta, indicating an IR echo from pre-existing dust in the CSM. The IR echo is likely powered by the relatively slowly evolving SN peak light, and not the brief shock cooling emission, as the latter requires unrealistically high CSM densities to explain the observed dust mass. We consider different potential CSM geometries and find that a thick face-on disk with an inner edge around $5\\times 10^{16}$ cm can best explain the dust mass and temperature evolution. In this scenario, the SN shock should start interacting with this CSM $440\\pm200$ days post explosion. CSM around SN Ic is rare, and follow-up observations of SN 2024aecx will probe the mass-loss process responsible for removing hydrogen and helium from their progenitor star."}
{"id": "2602.03233", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2602.03233", "abs": "https://arxiv.org/abs/2602.03233", "authors": ["Sunho Jin", "Jooyeon Geem", "Masateru Ishiguro", "Woojin Park", "Heeyoung Oh", "Chan Park", "Seungwon Choi", "Yoonsoo P. Bach", "Hyeonwoo Ju", "Jinguk Seo", "Bumhoo Lim", "Myungshin Im"], "title": "SQUIDPOL: Seoul National University QUadruple Imaging Device for POLarimetry", "comment": "15 pages, 12 figures. Submitted to JKAS on February 3, 2026", "summary": "We present SQUIDPOL, a low-cost, multi-channel optical imaging polarimeter that performs simultaneous linear polarization measurements using a rotating half-wave plate, a non-polarizing beam splitter, and four wire-grid filters. We show that the off-the-shelf non-polarizing beam splitter introduces measurable polarization-dependent systematics, which can bias polarimetric measurements if left uncorrected. We quantify this effect for both transmitted and reflected beams and incorporate a correction scheme into the data-analysis pipeline. On-sky validation demonstrates stable and reproducible performance, achieving a polarization accuracy of about 0.15 percent for bright polarized standard stars. Mounted on the 60-cm Ritchey-Chretien telescope (focal length 4200 mm, f/7) at the Pyeongchang Observatory of Seoul National University, SQUIDPOL provides an effective common field of view of 13.5 by 8.2 arcminutes with a pixel scale of 0.45 arcseconds per pixel and supports standard B, V, R_C, and I_C filters."}
{"id": "2602.02733", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2602.02733", "abs": "https://arxiv.org/abs/2602.02733", "authors": ["Prodromos Fotiadis", "Nick Loudas", "Nikolaos D. Kylafis", "Joachim Trümper"], "title": "Cyclotron lines in subcritical X-ray pulsars: Monte Carlo simulations reveal the origin of the observed variability", "comment": "14 pages, 11 figures, 2 tables. Submitted for publication to A&A", "summary": "Observed cyclotron resonant scattering features (CRSFs) in X-ray pulsars (XRPs) exhibit strong variability. In the subcritical luminosity regime, the centroid energy ($E_{CRSF}$) and line width ($σ_{CRSF}$) often show positive correlations with the X-ray luminosity. We investigate the physical origin of the observed variability quantitatively, focusing on the effects of resonant scattering and Doppler shift induced by the plasma flow in the accretion funnel. We developed a relativistic Monte Carlo code to perform detailed radiative transfer calculations in the accretion funnel above the hotspot and derive angle-dependent spectra. Analytical plasma density and velocity profiles were adopted to account for the effects of radiation pressure on the flow. Approximate resonant scattering cross-sections were employed. We varied the accretion luminosity to explore the resulting variability of the CRSF properties. The emergent spectra exhibit a prominent, asymmetric CRSF accompanied by a broad blue wing. The CRSF is systematically redshifted relative to the classical cyclotron energy, with the magnitude of the redshift decreasing at higher luminosities and for larger viewing angles $θ$. Both $E_{CRSF}$ and $σ_{CRSF}$ correlate positively with luminosity for all viewing angles. Their absolute values, however, depend strongly on the viewing angle, indicating substantial variability over the pulse cycle and sensitivity to the system geometry. At fixed luminosity, $E_{CRSF}$ ($σ_{CRSF}$) decreases (increases) with increasing $\\cosθ$. Consequently, phase-resolved observations are expected to reveal an anticorrelation between the CRSF centroid energy and width. When applied to the XRP GX 304$-$1, the model reproduces the observed CRSF variability over nearly an order of magnitude in luminosity for geometries in which the accretion funnel is predominantly viewed edge-on."}
{"id": "2602.03401", "categories": ["astro-ph.IM", "astro-ph.GA", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2602.03401", "abs": "https://arxiv.org/abs/2602.03401", "authors": ["A. Soulain", "B. Lopez", "A. Matter", "F. Lykou", "P. Boley", "M. Scheuck", "R. van Boekel", "J. -C. Augereau", "M. leTessier", "J. Bouvier", "P. Berio", "P. Ábrahám", "N. Anugu", "J. -P. Berger", "R. Burn", "W. -C. Danchi", "W. J. de Wit", "F. Drewes", "V. Fleury", "V. Hocdé", "W. Jaffe", "Á Kóspál", "E. Koumpia", "J. -B. Lebouquin", "J. S. Martin", "H. Meheut", "F. Millour", "N. Nardetto", "E. Pantin", "K. Perraut", "R. Petrov", "L. N. A van Haastere", "J. Varga", "G. Weigelt", "S. Wolf"], "title": "Unlocking the dynamics of Young Stellar Objects: Time-Domain Interferometry with six 4-m class telescopes", "comment": "3 pages, 2 figures, White paper presented for Expanding Horizons Transforming Astronomy in the 2040s", "summary": "The dynamics of the inner regions of young stellar objects (YSOs) is driven by a variety of physical phenomena, from magnetospheres and accretion to the dust sublimation rim and inner disk flows. These inner environments evolve on timescales of hours to days, exactly when bursts, dips, and rapid structural changes carry the most valuable information about star and planet formations, but remain hardly reachable with current facilities. A better reactive infrastructure with six or more telescopes, combined with alerts from large time-domain surveys (e.g., at the era of LSST/Rubin type facilities), and equipped with instruments spanning from the V-band to the thermal infrared (N), would provide the instantaneous uv-coverage and spectral diagnostics needed to unambiguously interpret and image these events as they happen. Such a world's first time-domain interferometric observatory would enable qualitatively new science: directly linking optical and infrared variability to spatially resolved changes in magnetospheric accretion, inner-disk geometry, and dust and gas dynamics in the innermost astronomical unit. Crucially, connecting these processes to outer-scale unresolved information from JWST, ALMA, and the ELT would yield a complete tomography of the planet-forming region."}
{"id": "2602.02923", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2602.02923", "abs": "https://arxiv.org/abs/2602.02923", "authors": ["Anindya Saha", "Anandmayee Tej", "Santiago del Palacio", "Michaël De Becker", "Paula Benaglia", "Ramananda Santra", "Ishwara Chandra CH"], "title": "Investigating particle acceleration in the Wolf-Rayet bubble NGC 2359", "comment": "15 pages, 7 figures, and 5 tables. Accepted for publication in A&A", "summary": "Massive stars have been proposed as candidates to be major factories of Galactic cosmic rays (GCRs). However, this claim lacks enough empirical evidence, especially for isolated stars. The powerful stellar winds from massive stars impact the ambient medium producing strong shocks suitable for accelerating relativistic particles. The detection of non-thermal emission-particularly synchrotron emission in low radio frequencies-serves as a key proof of particle acceleration sites. We aim to assess the potential of isolated massive stars as sources of GCRs. We observed the Wolf-Rayet bubble, NGC 2359, using the upgraded Giant Metrewave Radio Telescope at Band 3 (250-500 MHz) and Band 4 (550-950 MHz). Additionally, we used complementary archival radio datasets at different frequencies to derive the broad spectral energy distribution (SED) for several regions within the bubble. To further characterize the interaction between the stellar wind and the ambient medium, we introduced a composite SED model including synchrotron and free-free emission, and two low-frequency turnover processes, the Razin-Tsytovich (RT) effect and free-free absorption (FFA).We used a Bayesian inference approach to fit the SEDs and constrain the electron number density and magnetic field strength. The SEDs of several regions reveal spectral indices steeper than -0.5, indicative of synchrotron emission. and show a turnover below ~1 GHz. Our SED modelling suggests that the observed turnover is primarily caused by the RT effect, with a minor contribution from internal FFA. Our analysis confirms the presence of synchrotron radiation within NGC 2359. This is the second detection of non-thermal emission in a stellar bubble surrounding a WR star, reinforcing the idea that such environments are sites of relativistic particle acceleration and supporting the hypothesis that isolated massive stars are sources of GCRs of at least GeV energies."}
{"id": "2602.03574", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2602.03574", "abs": "https://arxiv.org/abs/2602.03574", "authors": ["Euclid Collaboration", "F. Cogato", "B. Kubik", "R. Barbier", "S. Conseil", "E. Medinaceli", "Y. Copin", "E. Franceschi", "L. Valenziano", "N. Aghanim", "B. Altieri", "S. Andreon", "N. Auricchio", "C. Baccigalupi", "M. Baldi", "A. Balestra", "S. Bardelli", "P. Battaglia", "A. Biviano", "E. Branchini", "M. Brescia", "J. Brinchmann", "S. Camera", "G. Cañas-Herrera", "V. Capobianco", "C. Carbone", "J. Carretero", "S. Casas", "M. Castellano", "G. Castignani", "S. Cavuoti", "A. Cimatti", "C. Colodro-Conde", "G. Congedo", "C. J. Conselice", "L. Conversi", "L. Corcione", "A. Costille", "F. Courbin", "H. M. Courtois", "R. da Silva", "H. Degaudenzi", "G. De Lucia", "H. Dole", "F. Dubath", "X. Dupac", "S. Dusini", "A. Ealet", "S. Escoffier", "M. Farina", "R. Farinelli", "F. Faustini", "S. Ferriol", "F. Finelli", "N. Fourmanoit", "M. Frailis", "M. Fumana", "S. Galeotta", "K. George", "W. Gillard", "B. Gillis", "C. Giocoli", "J. Gracia-Carpio", "A. Grazian", "F. Grupp", "S. V. H. Haugan", "W. Holmes", "F. Hormuth", "A. Hornstrup", "P. Hudelot", "K. Jahnke", "M. Jhabvala", "E. Keihänen", "S. Kermiche", "A. Kiessling", "R. Kohley", "M. Kümmel", "M. Kunz", "H. Kurki-Suonio", "A. M. C. Le Brun", "S. Ligori", "P. B. Lilje", "V. Lindholm", "I. Lloro", "G. Mainetti", "D. Maino", "E. Maiorano", "O. Mansutti", "S. Marcin", "O. Marggraf", "M. Martinelli", "N. Martinet", "F. Marulli", "R. J. Massey", "S. Mei", "Y. Mellier", "M. Meneghetti", "E. Merlin", "G. Meylan", "A. Mora", "M. Moresco", "L. Moscardini", "C. Neissner", "S. -M. Niemi", "C. Padilla", "S. Paltani", "F. Pasian", "K. Pedersen", "W. J. Percival", "V. Pettorino", "S. Pires", "G. Polenta", "M. Poncet", "L. A. Popa", "F. Raison", "A. Renzi", "J. Rhodes", "G. Riccio", "E. Romelli", "M. Roncarelli", "C. Rosset", "E. Rossetti", "R. Saglia", "Z. Sakr", "A. G. Sánchez", "D. Sapone", "B. Sartoris", "M. Schirmer", "P. Schneider", "M. Scodeggio", "A. Secroun", "G. Seidel", "S. Serrano", "P. Simon", "C. Sirignano", "G. Sirri", "L. Stanco", "J. Steinwagner", "P. Tallada-Crespí", "D. Tavagnacco", "A. N. Taylor", "I. Tereno", "S. Toft", "R. Toledo-Moreo", "F. Torradeflot", "I. Tutusaus", "J. Valiviita", "T. Vassallo", "A. Veropalumbo", "Y. Wang", "J. Weller", "A. Zacchei", "F. M. Zerbi", "E. Zucca", "M. Ballardini", "M. Bolzonella", "E. Bozzo", "C. Burigana", "R. Cabanac", "M. Calabrese", "A. Cappi", "T. Castro", "J. A. Escartin Vigo", "G. Fabbian", "L. Gabarra", "J. García-Bellido", "V. Gautard", "S. Hemmati", "J. Macias-Perez", "R. Maoli", "J. Martín-Fleitas", "N. Mauri", "R. B. Metcalf", "P. Monaco", "A. Pezzotta", "M. Pöntinen", "I. Risso", "V. Scottez", "M. Sereno", "M. Tenti", "M. Tucci", "M. Viel", "M. Wiesmann", "Y. Akrami", "G. Alguero", "I. T. Andika", "G. Angora", "S. Anselmi", "M. Archidiacono", "F. Atrio-Barandela", "L. Bazzanini", "D. Bertacca", "M. Bethermin", "F. Beutler", "A. Blanchard", "L. Blot", "M. Bonici", "S. Borgani", "M. L. Brown", "S. Bruton", "A. Calabro", "B. Camacho Quevedo", "F. Caro", "C. S. Carvalho", "Y. Charles", "A. R. Cooray", "O. Cucciati", "S. Davini", "F. De Paolis", "G. Desprez", "A. Díaz-Sánchez", "S. Di Domizio", "J. M. Diego", "V. Duret", "M. Y. Elkhashab", "A. Enia", "Y. Fang", "A. G. Ferrari", "A. Finoguenov", "A. Fontana", "A. Franco", "K. Ganga", "T. Gasparetto", "E. Gaztanaga", "F. Giacomini", "F. Gianotti", "G. Gozaliasl", "A. Gruppuso", "M. Guidi", "C. M. Gutierrez", "A. Hall", "H. Hildebrandt", "J. Hjorth", "J. J. E. Kajava", "Y. Kang", "V. Kansal", "D. Karagiannis", "K. Kiiveri", "J. Kim", "C. C. Kirkpatrick", "S. Kruk", "M. Lattanzi", "L. Legrand", "F. Lepori", "G. Leroy", "G. F. Lesci", "J. Lesgourgues", "T. I. Liaudat", "M. Magliocchetti", "A. Manjón-García", "F. Mannucci", "C. J. A. P. Martins", "L. Maurin", "M. Miluzio", "A. Montoro", "C. Moretti", "G. Morgante", "S. Nadathur", "K. Naidoo", "P. Natoli", "A. Navarro-Alsina", "S. Nesseris", "L. Pagano", "E. Palazzi", "D. Paoletti", "F. Passalacqua", "K. Paterson", "L. Patrizii", "A. Pisani", "D. Potter", "G. W. Pratt", "S. Quai", "M. Radovich", "W. Roster", "S. Sacquegna", "M. Sahlén", "D. B. Sanders", "E. Sarpa", "A. Schneider", "D. Sciotti", "E. Sellentin", "L. C. Smith", "K. Tanidis", "F. Tarsitano", "G. Testera", "R. Teyssier", "S. Tosi", "A. Troja", "A. Venhola", "D. Vergani", "G. Verza", "P. Vielzeuf", "S. Vinciguerra", "N. A. Walton", "A. H. Wright"], "title": "Euclid. Properties and performance of the NISP signal estimator", "comment": null, "summary": "The Euclid spacecraft, located at the second Lagrangian point of the Sun-Earth system, hosts the Near-Infrared Spectrometer and Photometer (NISP) instrument. NISP is equipped with a mosaic of 16 HgCdTe-based detectors to acquire near-infrared photometric and spectroscopic data. To meet the spacecraft's constraints on computational resources and telemetry bandwidth, the near-infrared signal is processed onboard via a dedicated hardware-software architecture designed to fulfil the stringent Euclid's data-quality requirements. A custom application software, running on the two NISP data processing units, implements the NISP signal estimator: an ad-hoc algorithm which delivers accurate flux measurements and simultaneously estimates the quality of signal estimation through the quality factor parameter. This paper investigates the properties of the NISP signal estimator by evaluating its performance during the early flight operations of the NISP instrument. First, we revisit the assumptions on which the inference of the near-infrared signal is based and investigate the origin of the main systematics of the signal estimator through Monte Carlo simulations. Then, we test the flight performance of the NISP signal estimator. Results indicate a systematic bias lower than 0.01 e/s for 99% of the NISP pixel array, well within the noise budget of the estimated signal. We also derive an analytical expression for the variance of the NISP signal estimator, demonstrating its validity, particularly when the covariance matrix is not pre-computed. Finally, we provide a robust statistical framework to interpret the QF parameter, analyse its dependence on the signal estimator bias, and show its sensitivity to cosmic ray hits on NISP detectors. Our findings corroborate previous results on the NISP signal estimator and suggest a leading-order correction based on the agreement between flight data and simulations."}
{"id": "2602.03032", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2602.03032", "abs": "https://arxiv.org/abs/2602.03032", "authors": ["Michael J. Moss", "Amy Y. Lien", "S. Bradley Cenko", "Sylvain Guiriec", "Craig B. Markwardt"], "title": "How Distance Affects GRB Prompt Emission Measurements", "comment": "19 pages, 14 figures", "summary": "We investigated how Gamma-Ray Burst (GRB) prompt emission measurements are affected by increasing distance to the source. We selected a sample of 26 bright GRBs with measured redshifts $z<1$ observed by the Burst Alert Telescope (BAT) on board the Neil Gehrels Swift Observatory (Swift) and simulated what BAT would have observed if the GRBs were at larger redshifts. We measured the durations of the simulated gamma-ray signals using a Bayesian block approach and calculated the enclosed fluences and peak fluxes. As expected, we found that almost all durations (fluences) measured for simulated high-$z$ GRBs were shorter (less) than their true durations (energies) due to low signal-to-noise ratio emission becoming completely dominated by background, i.e., the ``tip-of-the-iceberg'' effect. This effect strongly depends on the profile and intensity of the source light curve. Due to the uniqueness of GRB light curves, there is no common behavior in the evolution of measured durations with redshift. We compared our synthetic high-$z$ (i.e., $z>3$) GRBs to a sample of 72 observed high-$z$ bursts and found that the two samples were not inconsistent with being drawn from the same underlying population. We conclude that: (i) prompt emission durations (fluences) of high-$z$ GRBs observed by Swift/BAT are most likely underestimations, sometimes by factors of $\\sim$several tens ($\\sim2$), and (ii) changes in the average GRB prompt emission duration and fluence with increasing redshift are consistent with the tip-of-the-iceberg effect."}
{"id": "2602.03621", "categories": ["astro-ph.IM", "physics.comp-ph"], "pdf": "https://arxiv.org/pdf/2602.03621", "abs": "https://arxiv.org/abs/2602.03621", "authors": ["J. C. Dolence", "H. R. Hammer", "H. Park", "B. Prather", "B. R. Ryan", "R. T. Wollaeger"], "title": "A Method for Thermal Radiation Transport Using Backward Characteristic Tracing", "comment": "Submitted to Journal of Computational Physics", "summary": "Thermal radiation transport is a challenging problem in computational physics that has long been approached primarily in one of a few standard ways: approximate moment methods (for instance P$_1$ or M$_1$), implicit Monte Carlo, discrete ordinates, and long characteristics. In this work we consider the efficacy of the Method of (Long) Characteristics (MOC) applied to thermal radiation transport. Along the way we develop three major ideas: transporting MOC particles backwards in time from quadrature grids at the end of the timestep, limiting the computational cost of these backward characteristics by terminating transport once optical depths along rays become sufficiently large, and timestep-dependent closures with multigroup MOC solutions for a gray low-order system. We apply this method to a suite of standard radiation transport and radiation hydrodynamics test problems. We compare the method to several standard analytic and semi-analytic solutions, as well as implicit Monte Carlo, P$_1$, and discrete ordinates (S$_n$). We see that the method: gives excellent agreement with known results, has stability for large time steps, has the diffusion limit for large spatial cells, and achieves $\\sim$20-70\\% performance improvement when terminating optical depths at O(10-100) in the grey Marshak and crooked pipe problems. However, for the Coax radiation-hydrodynamics problem, we see that MOC is approximately two to three times slower than IMC-DDMC and S$_n$ in its current implementation."}
{"id": "2602.03078", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2602.03078", "abs": "https://arxiv.org/abs/2602.03078", "authors": ["Han-Long Peng", "Shan-Shan Weng", "Ming-Yu Ge", "Shi-Qi Zhou", "Erbil Gügercinoğlu", "Wen-Tao Ye", "You-Li Tuo", "Liang Zhang", "Juan Zhang", "Shi-Jie Zheng", "Yu-Jia Zheng", "Xian-Ao Wang"], "title": "Long-term timing evolution of four Anomalous X-Ray Pulsars", "comment": "21 pages, 10 figures, 10 tables, accepted for publication in ApJ", "summary": "Anomalous X-ray pulsars (AXPs) and soft gamma-ray repeaters (SGRs) are believed to be manifestations of magnetars. Typically, AXPs exhibit higher X-ray luminosities, whereas SGRs are generally fainter and display significantly high signal-to-noise ratios only during their outburst phases. In this work, we report the long-term timing evolution of four AXPs: 1E 2259+586, 4U 0142+61, 1RXS J170849.0-400910 and 1E 1841-045, which were regularly monitored with NICER from 2017 to 2024. Over this period, we identify a total of 10 timing events. In addition to one glitch and one anti-glitch in 1E 2259+586 reported in literature, we detect another 8 new timing events: 5 glitches, 2 anti-glitches, and 1 unusual state transition event. Notably, both anti-glitches were observed in 4U 0142+61, making it the most frequent source of such events, and there is a hint of regular evolution in its pulse profile. In the case of 1RXS J170849.0-400910, it continues to exhibit pronounced high-frequency timing anomalies and undergoes a state transition event. Finally, we study the evolution of the pulse profiles and find that the profiles of 1E 2259+586 and 4U 0142+61 both evolve. This is consistent with the earlier finding that pulse profile evolution is a generic feature of magnetars."}
{"id": "2602.03752", "categories": ["astro-ph.IM", "physics.optics"], "pdf": "https://arxiv.org/pdf/2602.03752", "abs": "https://arxiv.org/abs/2602.03752", "authors": ["Ishan Rana", "Suvrath Mahadevan", "Megan Delamer", "Ceiwynn Longworth"], "title": "Star Grazing with Alumina Grass: Antireflection coatings in the visible and near-infrared on IPX-Clear Microlenses assisted by Grass-like Alumina", "comment": "14 pages, 8 figures. Author's version of Paper 13899-47 presented at SPIE Photonics West Advanced Fabrication Technologies for Micro/Nano Optics and Photonics XIX, January 2026. To appear in SPIE Proceedings Vol. 13899", "summary": "Two-photon polymerization (2PP) enables fabrication of high-precision micro-optics with complex freeform geometries, opening a new parameter space for custom astronomical optics. Among available resins, the newly developed IPX Clear is particularly well suited for visible applications, offering high transmission across the visible-near-IR, low surface roughness, and excellent shape fidelity. However, Fresnel reflections at the air-polymer interface introduce significant optical losses, which are detrimental in low-signal astronomy. Previous studies show grass-like alumina coatings on glass and fused silica can raise average transmission from 91.9% to approximately 99% over 400-900 nm. Here we explore the feasibility of Atomic Layer Deposition (ALD) to apply such coatings to IPX-Clear micro-optics over 400-1700 nm. Grass-like alumina anti-reflective (AR) coatings can approximate the ideal index condition by creating a gradual refractive-index transition from air to bulk IPX Clear, suppressing surface reflections. While grass-like coatings are established on bulk optics and conformal ALD films have been applied to 2PP micro-optics, we demonstrate - for the first time - alumina grass on 2PP microlenses made with the new IPX-Clear resin. We discuss key challenges and process steps, and observe that alumina-grass-coated microlenses lose only approximately 0.3% of photons to reflection in the 400-850 nm range. Future work will test performance across the full 400-1700 nm band and explore improved environmental resilience, e.g., a SiO2 overcoat. Combined with the high optical transparency of IPX Clear, these coatings enable custom-designed, highly efficient microlenses for astronomical applications."}
{"id": "2602.03079", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2602.03079", "abs": "https://arxiv.org/abs/2602.03079", "authors": ["Yu-Feng Luo", "Shan-Shan Weng", "Qing-Zhong Liu", "Ming-Yu Ge", "Han-Long Peng", "Shi-Qi Zhou", "Shi-Jie Gao", "Yu-Jia Zheng", "Yan Zhang"], "title": "The orbital parameters of gamma-ray binary PSR~J2032+4127", "comment": "7 pages, 3 figure, 2 tables, accepted for publication in ApJ", "summary": "PSR~J2032+4127 is the only one of gamma-ray binary, that exhibits pulsations in gamma-ray. Previous research has indicated that the pulsar and the Be star MT91 213 orbit each other in a highly eccentric orbit with an extremely long period, with the pulsar reaching its periastron on November 13, 2017. Since its launch, the \\fermi{} satellite has been monitoring this pulsar for 16 years, covering the 8 years before and the 8 years after the pulsar passed its periastron. Using these data, we present an analysis of pulse arrival times, and precisely determine the orbital parameters for the first time: the orbital period of $P_{\\rm orb} \\sim 52.3$ yr, the eccentricity of $e \\sim 0.98$, the semimajor axis of $a$sin$i \\sim 25.3$ AU, and the orbital inclination of $\\sim$ 47.1$^\\circ$ -- 55.1$^\\circ$. We also reveal another small glitch occurred in 2021, MJD $\\sim$ 59500."}
{"id": "2602.03427", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2602.03427", "abs": "https://arxiv.org/abs/2602.03427", "authors": ["Jialian Liu", "Xiaofeng Wang", "Liyang Chen", "Alexei V. Filippenko", "Thomas G. Brink", "WeiKang Zheng", "Andrea Pastorello", "Paolo Ochner", "Irene Albanese", "Andrea Reguitti", "Giorgio Valerin", "Yongzhi Cai", "Jujia Zhang", "Liping Li", "Zhenyu Wang", "Liangduan Liu", "Yuhao Zhang"], "title": "SN 2024igg: A Super-Chandrasekhar/03fg-like SN exhibiting C II-dominated spectra after explosion", "comment": "13 pages, 8 figures, submitted to A&A", "summary": "We present and analyze photometric and spectroscopic observations of the Type Ia supernova (SN Ia) 2024igg, another ``super-Chandrasekhar'' (or 03fg-like) SN whose strong C II $\\lambda6580$ feature was initially misidentified as H$α$, thereby constraining its progenitor system, explosion parameters, and physical scenario. SN 2024igg shows many characteristics in common with other 03fg-like objects, such as high ultraviolet flux, slowly declining light curves ($Δm_{15}(B)=0.90\\pm0.08$ mag), low expansion velocities, along with strong and persistent C II absorption. Meanwhile, this SN exhibits some remarkable properties within this subgroup, including a moderately low optical luminosity ($M_{\\rm max}(B)=-18.99\\pm0.15$ mag), a short rise time less than 18.5 days, and strong C II $\\lambda6580$. The bolometric analysis yields a $^{56}$Ni mass of $M_{\\rm Ni}=0.547\\pm0.082$ $M_{\\rm \\odot}$ and an ejecta mass of $1.54^{+0.22}_{-0.19}$ $M_{\\rm \\odot}$, marginally exceeding the Chandrasekhar mass. Our TARDIS result indicates that most of the features in the earliest spectrum could be attributed to C II, which is consistent with a model where a supernova explodes within a carbon-rich circumstellar medium (CSM). The CSM interaction would produce a density peak in the ejecta, offering a natural explanation for the slowly evolving line velocities near $-$8000 km s$^{-1}$. The CSM may stem from the debris of a secondary white dwarf in a white-dwarf merger or the envelope of an asymptotic giant branch star. Combined with the unshifted forbidden lines in the spectrum taken at $t\\approx\\ +$135 days, we suggest that SN 2024igg comes from a symmetric explosion on a secular timescale after the merger."}
{"id": "2602.03502", "categories": ["astro-ph.HE", "astro-ph.GA", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2602.03502", "abs": "https://arxiv.org/abs/2602.03502", "authors": ["D. V. Badmaev", "A. M. Bykov", "M. E. Kalyashova"], "title": "Shells and bubbles around compact clusters of massive stars: 3D MHD simulations", "comment": "13 pages, 7 figures, author's translation, to be published in Astronomy Letters, 51, No.6 (2025)", "summary": "We present the results of three-dimensional magnetohydrodynamic (3D MHD) simulations of the plasma flow structure in the vicinity of a compact cluster of young massive stars. The cluster is considered at the evolutionary stage dominated by Wolf-Rayet stars. This stage occurs in clusters with ages of several million years, close to the onset of supernova explosions; the well-known objects Westerlund 1 and 2 are the prototypes. The collisions of powerful winds from massive stars in the cluster core, calculated as interactions of individual outflows, are accompanied by their partial thermalization and produce a collective cluster wind. The MHD dynamics of the cluster wind bubble expansion into the interstellar medium is considered, depending on the density of the surrounding medium with a uniform magnetic field. We show that when expanding into a cold neutral medium, the cluster wind is able to reshape its surrounding environment over the Wolf-Rayet star lifetime, sweeping up more than $10^4$ $M_{\\odot}$ of gas in $\\sim 2 \\times 10^5$ yr and producing extended, thin and dense shells with an amplified magnetic field. In a cold neutral medium with a density of $\\sim 20$ cm$^{-3}$ and a magnetic field of $\\sim 3.5$ $μ$G, a thin shell forms around the cluster wind bubble, characterized by a cellular structure in its density and magnetic field distributions. The cellular magnetic field structure appears in parts of the shell expanding transversely to the orientation of the external magnetic field. Magnetic fields in the shell are amplified to strengths $\\gtrsim 50$ $μ$G. The formation of the cellular structure is associated with the development of instabilities. The expansion of the bubble into a warm neutral interstellar medium also leads to the formation of a shell with an amplified magnetic field."}
{"id": "2602.03629", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2602.03629", "abs": "https://arxiv.org/abs/2602.03629", "authors": ["Max M. Briel", "Anastasios Fragkos", "Monica Gallegos-Garcia", "Anarya Ray", "Michael Zevin", "Abhishek Chattaraj", "Jeff J. Andrews", "Vicky Kalogera", "Seth Gossage", "Philipp M. Srivastava", "Elizabeth Teng"], "title": "A case for Case A: detailed look at binary black hole formation through stable mass transfer", "comment": "Submitted to A&A", "summary": "In isolated binary evolution, binary black hole (BBH) mergers are generally formed through stable mass transfer (SMT) or common envelope evolution. In recent years, the SMT channel has received significant attention due to detailed binary models showing increased mass transfer stability compared to previous studies. In this work, we perform a full zero-age-main-sequence to compact object merger analysis using detailed binary models at eight metallicities between $10^{-4}Z_\\odot$ and $2Z_\\odot$ to self-consistently model the population properties of BBH mergers in the SMT channel, determined their progenitor initial conditional, and investigate the binary physics governing their formation and metallicity dependence. We use the population synthesis code POSYDON to determine the population of BBH mergers from SMT. Using its extended grids of MESA binary models, we determine the essential physics in the formation of BBH mergers. SMT produces BBH mergers predominantly from systems with $P_{ZAMS}\\leq10$ days. In these systems, both the initial mass transfer between two stars and the subsequent interaction between the remaining star and the first-born BH take place while the respective donor star is on the main-sequence (Case A). We find a limited contribution from wider Case B/C systems. Without a natal kick, the SMT channel does not produce BBH mergers above $Z>0.2Z_\\odot$ due to orbital widening from stellar wind mass loss. The primary BH mass distribution shows a strong dependence on metallicity, while the mass ratio prefers unity independent of metallicity due to mass ratio reversal. Additionally, the $χ_{eff}$ distributions contain peaks at $χ_{eff}=0$ and ~0.15 of which the former disappears at high metallicities. A mass-scaled natal kick leave this sub-population unchanged but introduce a low-mass, unequal mass ratio sub-population that merges due to their high eccentricity."}
