{"id": "2601.03422", "categories": ["astro-ph.IM", "astro-ph.CO"], "pdf": "https://arxiv.org/pdf/2601.03422", "abs": "https://arxiv.org/abs/2601.03422", "authors": ["Ismael Mendoza", "Derek Hansen", "Runjing Liu", "Zhe Zhao", "Ziteng Pang", "Axel Guinot", "Camille Avestruz", "Jeffrey Regier", "the LSST Dark Energy Science Collaboration"], "title": "Simulation-Based Inference for Probabilistic Galaxy Detection and Deblending", "comment": "23 pages, 11 figures, 2 tables, to be submitted to the Open Journal of Astrophysics", "summary": "Stage-IV dark energy wide-field surveys, such as the Vera C. Rubin Observatory Legacy Survey of Space and Time (LSST), will observe an unprecedented number density of galaxies. As a result, the majority of imaged galaxies will visually overlap, a phenomenon known as blending. Blending is expected to be a leading source of systematic error in astronomical measurements. To mitigate this systematic, we propose a new probabilistic method for detecting, deblending, and measuring the properties of galaxies, called the Bayesian Light Source Separator (BLISS). Given an astronomical survey image, BLISS uses convolutional neural networks to produce a probabilistic astronomical catalog by approximating the posterior distribution over the number of light sources, their centroids' locations, and their types (galaxy vs. star). BLISS additionally includes a denoising autoencoder to reconstruct unblended galaxy profiles. As a first step towards demonstrating the feasibility of BLISS for cosmological applications, we apply our method to simulated single-band images whose properties are representative of year-10 LSST coadds. First, we study each BLISS component independently and examine its probabilistic output as a function of SNR and degree of blending. Then, by propagating the probabilistic detections from BLISS to its deblender, we produce per-object flux posteriors. Using these posteriors yields a substantial improvement in aperture flux residuals relative to deterministic detections alone, particularly for highly blended and faint objects. These results highlight the potential of BLISS as a scalable, uncertainty-aware tool for mitigating blending-induced systematics in next-generation cosmological surveys."}
{"id": "2601.03436", "categories": ["astro-ph.IM", "cs.AI"], "pdf": "https://arxiv.org/pdf/2601.03436", "abs": "https://arxiv.org/abs/2601.03436", "authors": ["Nikhil Mukund", "Yifang Luo", "Fan Zhang", "Lisa Barsotti", "Erik Katsavounidis"], "title": "MARVEL: A Multi Agent-based Research Validator and Enabler using Large Language Models", "comment": "18 pages, 7 figures", "summary": "We present MARVEL (https://ligogpt.mit.edu/marvel), a locally deployable, open-source framework for domain-aware question answering and assisted scientific research. It is designed to address the increasing demands of a digital assistant for scientific groups that can read highly technical data, cite precisely, and operate within authenticated networks. MARVEL combines a fast path for straightforward queries with a more deliberate DeepSearch mode that integrates retrieval-augmented generation and Monte Carlo Tree Search. It explores complementary subqueries, allocates more compute to promising branches, and maintains a global evidence ledger that preserves sources during drafting. We applied this framework in the context of gravitational-wave research related to the Laser Interferometer Gravitational-wave Observatory. Answers are grounded in a curated semantic index of research literature, doctoral theses, LIGO documents, and long-running detector electronic logbooks, with targeted web searches when appropriate. Because direct benchmarking against commercial LLMs cannot be performed on private data, we evaluated MARVEL on two publicly available surrogate datasets that capture comparable semantic and technical characteristics. On these benchmarks, MARVEL matches a GPT-4o mini baseline on literature-centric queries and substantially outperforms it on detector-operations content, where domain retrieval and guided reasoning are decisive. By making the complete framework and evaluation datasets openly available, we aim to provide a reproducible foundation for developing domain-specific scientific assistants."}
{"id": "2601.03818", "categories": ["astro-ph.IM", "physics.plasm-ph", "physics.space-ph"], "pdf": "https://arxiv.org/pdf/2601.03818", "abs": "https://arxiv.org/abs/2601.03818", "authors": ["Š. Štverák", "D. Herčík", "P. Hellinger", "M. Popďakunik", "G. R. Lewis", "G. Nicolaou", "C. J. Owen", "Yu. V. Khotyaintsev", "M. Maksimovic"], "title": "Modelling spacecraft-emitted electrons measured by SWA-EAS experiment on board Solar Orbiter mission", "comment": "Submitted to Astronomy & Astrophysics", "summary": "Thermal electron measurements in space plasmas typically suffer at low energies from spacecraft emissions of photo- and secondary electrons and from charging of the spacecraft body. We examine these effects by use of numerical simulations in the context of electron measurements acquired by the Electron Analyser System (SWA-EAS) on board the Solar Orbiter mission. We employed the Spacecraft Plasma Interaction Software to model the interaction of the Solar Orbiter spacecraft with solar wind plasma and we implemented a virtual detector to simulate the measured electron energy spectra as observed in situ by the SWA-EAS experiment. Numerical simulations were set according to the measured plasma conditions at 0.3~AU. We derived the simulated electron energy spectra as detected by the virtual SWA-EAS experiment for different electron populations and compared these with both the initial plasma conditions and the corresponding real SWA-EAS data samples. We found qualitative agreement between the simulated and real data observed in situ by the SWA-EAS detector. Contrary to other space missions, the contamination by cold electrons emitted from the spacecraft is seen well above the spacecraft potential energy threshold. A detailed analysis of the simulated electron energy spectra demonstrates that contamination above the threshold is a result of cold electron fluxes emitted from distant spacecraft surfaces. The relative position of the break in the simulated spectrum with respect to the spacecraft potential slightly deviates from that in the real observations. This may indicate that the real potential of the SWA-EAS detector with respect to ambient plasma differs from the spacecraft potential value measured on board. The overall contamination is shown to be composed of emissions from a number of different sources and their relative contribution varies with the ambient plasma conditions."}
{"id": "2601.03921", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.03921", "abs": "https://arxiv.org/abs/2601.03921", "authors": ["V. Barbosa Martins", "N. Jordana Mitjans", "S. Garrappa", "A. Franckowiak", "E. O. Ofek", "S. Ben-Ami", "J. Borowska-Naguszewska", "V. Fallah Ramazani", "R. Konno", "D. Kuesters", "R. D. Parsons", "D. Polishook", "I. Sadeh", "O. Savushkin", "E. Segre", "N. Strotjohann", "S. Weimann"], "title": "Science with a large field-of-view polarization survey: The Large Array Survey Telescope Polarization Node (LAST-P)", "comment": "Accepted for publication in Publications of the Astronomical Society of the Pacific (PASP) on January 6, 2026. Corresponding authors: V. Barbosa Martins, N. Jordana Mitjans, S. Garrappa, A. Franckowiak, E. O. Ofek", "summary": "Optical polarimetry provides information on the geometry of the emitting region, the magnetic field configuration and the properties of dust in astrophysical sources. Current state-of-the-art instruments typically have a small field of view (FoV), which poses a challenge for conducting wide surveys. We propose the construction of the Large Array Survey Telescope Polarization Node (LAST-P), a wide-field array of optical polarimeters. LAST-P is designed for high-cadence ($\\lesssim 1$ day) polarization monitoring of numerous astrophysical transients, such as the early phases of gamma-ray bursts, supernovae, and novae. Furthermore, LAST-P will facilitate the creation of extensive polarization catalogs for X-ray binaries and white dwarfs, alongside a large FoV study of the interstellar medium. In survey mode, LAST-P will cover a FoV of 88.8 deg$^2$. With a 15 x 1-minute exposure, the instrument will be capable of measuring polarization of sources as faint as Gaia Bp-magnitude $\\sim$20.9. The precision on the linear polarization degree (PD) will reach 0.7\\%, 1.5\\%, and 3.5\\% for sources with magnitudes 17, 18, and 19, respectively, for a seeing of 2.7 arcsec, air mass of about 1 for observations in dark locations. We propose three distinct non-simultaneous survey strategies, among them an active galactic nuclei (AGN) strategy for long-term monitoring of $\\sim$200 AGN with $<$1-day cadence. In this paper, we present the predicted sensitivity of the instrument and outline the various science cases it is designed to explore."}
{"id": "2601.03337", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.03337", "abs": "https://arxiv.org/abs/2601.03337", "authors": ["Daniel A. Perley", "Anna Y. Q. Ho", "Zoë McGrath", "Michael Camilo", "Cassie Sevilla", "Ping Chen", "Genevieve Schroeder", "Taya Govreen-Segal", "Aleksandra Bochenek", "Yu-Jing Qin", "James H. Gillanders", "Benjamin Amend", "Joseph P. Anderson", "Igor Andreoni", "Amar Aryan", "Eric C. Bellm", "Joshua S. Bloom", "Thomas de Boer", "Jonathan Carney", "Ilaria Caiazzo", "Ken C. Chambers", "Panos Charalampopoulos", "Ting-Wan Chen", "Tracy X. Chen", "Eric R. Coughlin", "Michael Coughlin", "Michel Dennefeld", "Georgios Dimitriadis", "Christoffer Fremling", "Danielle Frostig", "Avishay Gal-Yam", "Lluís Galbany", "Anjashay Gangopadhyay", "Melzie Ghendrih", "Matthew J. Graham", "Mariusz Gromadzki", "Steven L. Groom", "Claudia P. Gutiérrez", "K. -Ryan Hinds", "Mark E. Huber", "Cosimo Inserra", "Benjamin C. Kaiser", "Mansi M. Kasliwal", "Niilo E. Koivisto", "Chien-Cheng Lin", "Chang Liu", "Thomas B. Lowe", "Eugene Magnier", "Ashish A. Mahabal", "Andrew Milligan", "Paloma Minguez", "Geoffrey Mo", "Tomás E. Müller-Bravo", "Matt Nicholl", "Priscila J. Pessi", "Giuliano Pignata", "Josiah Purdum", "Nabeel Rehemtulla", "R. Michael Rich", "Anwesha Sahu", "Avinash Singh", "Stephen J. Smartt", "Jesper Sollerman", "Gokul Srinivasaragavan", "Shubham Srivastav", "Robert D. Stein", "Steve Schulze", "Jack W. Tweddle", "Richard Wainscoat", "Jacob L. Wise", "Lin Yan", "David R. Young"], "title": "AT2024wpp: An Extremely Luminous Fast Ultraviolet Transient Powered by Accretion onto a Black Hole", "comment": "Submitted to MNRAS", "summary": "We present the discovery of AT 2024wpp (\"Whippet\"), a fast and luminous 18cow-like transient. At a redshift of z=0.0868, revealed by Keck Cosmic Web Imager spectroscopy of its faint and diffuse star-forming host, it is the fourth-nearest example of its class to date. Rapid identification of the source in the Zwicky Transient Facility data stream permitted ultraviolet-through-optical observations to be obtained prior to peak, allowing the first determination of the peak bolometric luminosity (2x10^45 erg/s), maximum photospheric radius (10^15 cm), and total radiated energy (10^51 erg) of an 18cow-like object. We present results from a comprehensive multiwavelength observing campaign, including a far-UV spectrum from the Cosmic Origins Spectrograph on the Hubble Space Telescope and deep imaging extending >100 days post-explosion from the Very Large Telescope, Hubble Space Telescope, Very Large Array, and Atacama Large Millimetre Array. We interpret the observations under a model in which a powerful rapidly-accreting central engine blows a fast (~0.15c) wind into the surrounding medium and irradiates it with X-rays. The high Doppler velocities and intense ionization within this wind prevent any identifiable features from appearing in the ejecta or in the surrounding circumstellar material, even in the far-ultraviolet. Weak H and He signatures do emerge in the spectra after 35 days in the form of double-peaked narrow lines. Each peak is individually narrow (full width ~3000 km/s) but the two components are separated by ~6600 km/s, indicating stable structures of denser material, possibly representing streams of tidal ejecta or an ablated companion star."}
{"id": "2601.03925", "categories": ["astro-ph.IM", "astro-ph.CO", "physics.optics"], "pdf": "https://arxiv.org/pdf/2601.03925", "abs": "https://arxiv.org/abs/2601.03925", "authors": ["Xiaodong Ren", "Rustam Balafendiev", "Jon E. Gudmundsson"], "title": "Polarization rotation through differential transmission in refractive CMB telescopes identified using a hybrid physical optics method", "comment": null, "summary": "We identify a polarization rotation systematic in the far field beams of refractive cosmic microwave background (CMB) telescopes caused by differential transmission in anti-reflection (AR) coatings of optical elements. This systematic was identified following the development of a hybrid physical optics method that incorporates full-wave electromagnetic simulations of AR coatings to model the full polarization response of refractive systems. Applying this method to a two-lens CMB telescope with non-ideal AR coating, we show that polarization-dependent transmission can produce a rotation of the far-field polarization angle that varies across the focal plane with a typical amplitude of 0.05-0.5 degrees. If ignored in analysis, this effect can produce temperature to polarization leakage and Stokes Q/U mixing."}
{"id": "2601.03349", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.03349", "abs": "https://arxiv.org/abs/2601.03349", "authors": ["Chris Nagele", "Julian H. Krolik", "Rongrong Liu", "Brooks E. Kinch", "Jeremy D. Schnittman"], "title": "Simulation-Based Prediction of Black Hole Spectra: From $10M_\\odot$ to $10^8 M_\\odot$", "comment": "Submitted to ApJ, comments welcome", "summary": "It has long been thought that black hole accretion flows are driven by magnetohydrodynamic (MHD) turbulence, and there are now many general relativistic global simulations illustrating the dynamics of this process. However, many challenges must be overcome in order to predict observed spectra from luminous systems. Ensuring energy conservation, local thermal balance, and local ionization equilibrium, our post-processing method incorporates all the most relevant radiation mechanisms: relativistic Compton scattering, bremsstrahlung, and lines and edges for 30 elements and all their ions. Previous work with this method was restricted to black holes of $10 M_\\odot$; here, for the first time, we extend it to $10^8 M_\\odot$ and present results for two sub-Eddington accretion rates and black hole spin parameter 0.9. The spectral shape predicted for stellar-mass black holes matches the low-hard state for the lower accretion rate and the steep power law state for the higher accretion rate. For high black hole mass, both accretion rates yield power-law continua from $\\sim 0.5 - 50$~keV whose X-ray slopes agree well with observations. For intermediate mass black holes, we find a soft X-ray excess created by inverse Compton scattering of low-energy photons produced in the thermal part of the disk; this mechanism may be relevant to the soft X-ray excess commonly seen in massive black holes. Thus, our results show that standard radiation physics applied to GRMHD simulation data can yield spectra reproducing a number of the observed properties of accreting black holes across the mass spectrum."}
{"id": "2601.03966", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2601.03966", "abs": "https://arxiv.org/abs/2601.03966", "authors": ["Gregory Hellbourg"], "title": "Can Dynamic Spectrum Sharing Protect Passive Radio Sciences?", "comment": "24 pages", "summary": "Dynamic Spectrum Sharing (DSS) is increasingly promoted as a key element of modern spectrum policy, driven by the rising demand from commercial wireless systems and advances in spectrum access technologies. Passive radio sciences, including radio astronomy, Earth remote sensing, and meteorology, operate under fundamentally different constraints. They rely on exceptionally low interference spectrum and are highly vulnerable to even brief radio frequency interference. We examine whether DSS can benefit passive services or whether it introduces new failure modes and enforcement challenges. We propose just-in-time quiet zones (JITQZ) as a mechanism for protecting high value observations and assess hybrid frameworks that preserve static protection for core passive bands while allowing constrained dynamic access in adjacent frequencies. We analyze the roles of propagation uncertainty, electromagnetic compatibility constraints, and limited spectrum awareness. Using a game theoretic framework, we show why non-cooperative sharing fails, identify conditions for sustained cooperation, and examine incentive mechanisms including pseudonymetry-enabled attribution that promote compliance. We conclude that DSS can support passive radio sciences only as a high-reliability, safety-critical system. Static allocations remain essential, and dynamic access is viable only with conservative safeguards and enforceable accountability."}
{"id": "2601.03372", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.03372", "abs": "https://arxiv.org/abs/2601.03372", "authors": ["Conor M. B. Omand", "Nikhil Sarin", "Gavin P. Lamb", "Daniel A. Perley", "Andrew Mummery", "Hamid Hamidani", "Steve Schulze", "Emma R. Beasor", "Aleksandra Bochenek", "Helena-Margaret S. Grabham", "Sorcha R. Kennelly", "Nguyen M. Khang", "Shiho Kobayashi", "Genevieve Schroeder", "William N. Stone", "Cairns Turnbull", "Jacob Wise"], "title": "Multiwavelength Modeling of the Luminous Fast Blue Optical Transient AT2024wpp", "comment": "Submitted to MNRAS. Comments welcome", "summary": "Luminous fast blue optical transients (LFBOTs) are a growing class of enigmatic energetic transients. They show fast rises and declines, high temperatures throughout their evolution, and non-thermal emission in radio and X-rays. Their power source is currently unknown, but proposed models include engine-driven supernovae, interaction-powered supernovae, shock cooling emission, intermediate mass black hole tidal disruption events (IMBH TDEs), and Wolf-Rayet/black hole mergers, among others. AT2024wpp is the most optically luminous LFBOT to date and has been observed extensively at multiple wavelengths, including radio, optical, UV, and X-rays. We take models from multiple scenarios and fit them to the AT2024wpp optical, radio, and X-ray light curves to determine if which of these scenarios can best describe all aspects of the data. We show that none of the multiwavelength light curve models can reasonably explain the data, although other physical arguments favour a stellar mass/IMBH TDE of a low mass star and a synchrotron blast wave. We discuss how this scenario can be tested with late-time observations, and what other scenarios could possibly explain the broadband data."}
{"id": "2601.03373", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.03373", "abs": "https://arxiv.org/abs/2601.03373", "authors": ["Conor M. B. Omand"], "title": "Late-Time Infrared Cooling in Magnetar-Driven Supernovae", "comment": "Submitted to MNRAS. Comments welcome", "summary": "A central magnetar engine is commonly invoked to explain energetic supernovae, which should have multiple signals in multiwavelength emission. Photoionization from the pulsar wind nebula (PWN) can create distinct spectroscopic signals in the nebular phase. Recent models suggest infrared emission, particularly from Ne II, can be prominent at late times. This work examines the cooling power of optical and infrared transitions to determine which lines contribute strongly to cooling and on what timescale. The models show infrared cooling becomes strong at $\\sim$ 3 years post-explosion and dominates by 6 years, with [Ne II] 12.8$μ$m being the strongest coolant. The fraction of total cooling in the infrared increases sharply once the PWN luminosity decreases below 10$^{40}$ erg s$^{-1}$, and this fraction also increases with increasing ejecta mass and decreasing average PWN photon energy. However, the emission from [Ne II] 12.8$μ$m increases with increasing PWN luminosity and increasing ejecta mass. Cooling at 1 year is dominated by optical O and S lines, with infrared Ar, Ni, and Ne lines becoming strong at 3 years. Optical cooling is almost negligible at 6 years, with the supernova cooling almost entirely through mid- and far-infrared transitions. JWST spectroscopy with MIRI should be able to detect these lines out to $z \\sim 0.1$. Supernovae with higher magnetic fields transition to infrared cooling on earlier timescales, while infrared-dominated supernovae should have strong emission from neutral atoms and emit strongly in radio at sub-decade timescales."}
{"id": "2601.03456", "categories": ["astro-ph.HE", "astro-ph.GA", "gr-qc"], "pdf": "https://arxiv.org/pdf/2601.03456", "abs": "https://arxiv.org/abs/2601.03456", "authors": ["Amanda M. Farah", "Aditya Vijaykumar", "Maya Fishbach"], "title": "The steep redshift evolution of the hierarchical merger rate may cause the $z$-$χ_{\\rm eff}$ correlation", "comment": "9 pages, 4 figures (with appendices: 18 pages, 12 figures). Also see Vijaykumar et al., posted simultaneously", "summary": "There is growing evidence from gravitational-wave observations that some merging black holes are created from previous mergers. Using the prediction that these hierarchically-merged black holes have dimensionless spin magnitudes of $χ\\approx 0.69$, we identify a subpopulation in the gravitational-wave data consistent with a hierarchical-merger origin in dense star clusters. This subpopulation's primary mass distribution peaks at $16.7^{+3.1}_{-4.6},\\mathrm{M}_{\\odot}$, which is approximately twice as large as its secondary mass distribution's mode ($8.0^{+29.7}_{-2.3},\\mathrm{M}_{\\odot}$), and its spin tilt distribution is consistent with isotropy. Our inferred secondary mass distributions imply that isolated binary evolution may still be needed to explain the entirety of the $9\\,\\mathrm{M}_{\\odot}$ peak. Surprisingly, we find that the rate of hierarchical mergers may evolve more steeply with redshift than the rest of the population ($98.5\\%$ credibility): the fraction of all binary black holes that are hierarchically formed at $z=0.1$ is $0.05^{+0.05}_{-0.04}$, compared to $0.17^{+0.13}_{-0.12}$ at $z=1$. This provides an explanation for the previously-discovered broadening of the effective spin distribution with redshift. Our results have implications for star cluster formation histories, as they suggest the potential existence of a high-redshift population of massive, compact clusters."}
{"id": "2601.03457", "categories": ["astro-ph.HE", "astro-ph.GA", "gr-qc"], "pdf": "https://arxiv.org/pdf/2601.03457", "abs": "https://arxiv.org/abs/2601.03457", "authors": ["Aditya Vijaykumar", "Amanda M. Farah", "Maya Fishbach"], "title": "The maximum mass ratio of hierarchical mergers may cause the $q$-$χ_{\\rm eff}$ correlation", "comment": "12 pages, 8 figures (4 in main text + 4 in appendices). Also see Farah et al. posted simultaneously to arXiv", "summary": "Regardless of their initial spins, the merger of two roughly equal mass black holes (BHs) produces a remnant BH of dimensionless spin $0.69$. Such remnants can merge with other black holes in dense stellar environments and produce hierarchical mergers. Analyzing the latest catalog binary black hole (BBH) mergers from the LIGO-Virgo-KAGRA detectors, we identify a subpopulation with primary spins consistent with such hierarchical mergers. Consistent with astrophysical expectations for mergers of second generation BHs with first generation BHs, we find that this subpopulation has mass ratios below $0.59^{+0.18}_{-0.23}$. We also infer that $19$-$88\\%$ of the BBH population below this mass ratio is consistent with belonging to the hierarchically-merged population. Our results offer a natural explanation for the narrowing of the effective inspiral spin distribution with mass ratio observed in other studies."}
{"id": "2601.03696", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.03696", "abs": "https://arxiv.org/abs/2601.03696", "authors": ["Ze-Xi Li", "Liang Zhang", "Lian Tao", "Zi-Han Yang", "Qing-Chang Zhao", "Shu-Jie Zhao", "Rui-Can Ma", "Zi-Xu Yang", "Pan-Ping Li", "Xiang Ma", "Yue Huang", "Shu-Mei Jia", "Shuang-Nan Zhang", "Hua Feng", "Jin-Lu Qu", "Shu Zhang"], "title": "Characteristics of the High-frequency Humps in the Black hole X-ray Binary Swift J1727.8--1613", "comment": null, "summary": "We present a detailed timing analysis of the two high-frequency humps observed in the power density spectrum of Swift J1727.8--1613 up to 100 keV, using data from the Hard X-ray Modulation Telescope (Insight-HXMT). Our analysis reveals that the characteristic frequencies of the humps increase with energy up to $\\sim30$ keV, followed by a plateau at higher energies. The fractional rms amplitudes of the humps increase with energy, reaching approximately 15\\% in the 50-100 keV band. The lag spectrum of the hump is characterized primarily by a soft lag that varies with energy. Our results suggest that the high-frequency humps originate from a corona close to the black hole. Additionally, by applying the relativistic precession model, we constrain the mass of Swift J1727.8--1613 to $2.84 < M / M_{\\odot} < 120.01$ and the spin to $0.14 < a < 0.43$ from the full-energy band dataset, using triplets composed of a type-C quasi-periodic oscillation and two high-frequency humps. When considering only the high-energy bands with stable characteristic frequencies, we derive additional constraints of $2.84 < M/M_{\\odot} < 13.98$ and $0.14 < a < 0.40$."}
{"id": "2601.03861", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.03861", "abs": "https://arxiv.org/abs/2601.03861", "authors": ["Matteo Pracchia", "Om Sharan Salafia"], "title": "Short gamma-ray burst progenitors have short delay times", "comment": null, "summary": "Short gamma-ray bursts (SGRBs) are thought to be primarily associated with binary neutron star (BNS) mergers. The SGRB population can therefore be scrutinized to look for signatures of the delay time between the formation of the progenitor massive star binary and the eventual merger, which could produce an evolution of the cosmic rate density of such events whose shape departs from that of the cosmic star formation history (CSFH). To that purpose, we study a large sample of SGRBs within a hierarchical Bayesian framework, with a particular focus on the delay time distribution (DTD) of the population. Following previous studies, we model the DTD either as a power-law with a minimum time delay or as a log-normal function. We consider two models for the intrinsic SGRB luminosity distribution: an empirical luminosity function (ELF) with a doubly broken power-law shape, and one based on a quasi-universal structured jet (QUSJ) model. Regardless of the chosen parametrization, we find average time delays $10\\lesssim \\langle τ_\\mathrm{d}\\mathrm\\rangle/\\mathrm{Myr}\\lesssim 800$ and a minimum delay time $τ_\\mathrm{d,min}\\lesssim 350\\,\\mathrm{Myr}$, in contrast with previous studies that found long delay times of few Gyr. We demonstrate that the cause of the longer inferred time delays in past studies most likely resides in an incorrect treatment of selection effects."}
{"id": "2601.03873", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.03873", "abs": "https://arxiv.org/abs/2601.03873", "authors": ["MAGIC Collaboration", "K. Abe", "S. Abe", "J. Abhir", "A. Abhishek", "V. A. Acciari", "A. Aguasca-Cabot", "I. Agudo", "T. Aniello", "S. Ansoldi", "L. A. Antonelli", "A. Arbet Engels", "C. Arcaro", "K. Asano", "A. Babić", "U. Barres de Almeida", "J. A. Barrio", "L. Barrios-Jiménez", "I. Batković", "J. Baxter", "J. Becerra González", "W. Bednarek", "E. Bernardini", "J. Bernete", "A. Berti", "J. Besenrieder", "C. Bigongiari", "A. Biland", "O. Blanch", "G. Bonnoli", "Ž. Bošnjak", "E. Bronzini", "I. Burelli", "A. Campoy-Ordaz", "A. Carosi", "R. Carosi", "M. Carretero-Castrillo", "A. J. Castro-Tirado", "D. Cerasole", "G. Ceribella", "Y. Chai", "A. Cifuentes", "J. L. Contreras", "J. Cortina", "S. Covino", "G. D'Amico", "P. Da Vela", "F. Dazzi", "A. De Angelis", "B. De Lotto", "R. de Menezes", "M. Delfino", "J. Delgado", "C. Delgado Mendez", "F. Di Pierro", "R. Di Tria", "L. Di Venere", "A. Dinesh", "D. Dominis Prester", "A. Donini", "D. Dorner", "M. Doro", "L. Eisenberger", "D. Elsaesser", "J. Escudero", "L. Foffano", "L. Font", "S. Fröse", "S. Fukami", "Y. Fukazawa", "M. Garczarczyk", "S. Gasparyan", "M. Gaug", "J. G. Giesbrecht Paiva", "N. Giglietto", "F. Giordano", "P. Gliwny", "N. Godinović", "T. Gradetzke", "R. Grau", "D. Green", "J. G. Green", "P. Günther", "D. Hadasch", "A. Hahn", "T. Hassan", "L. Heckmann", "J. Herrera Llorente", "D. Hrupec", "R. Imazawa", "D. Israyelyan", "I. Jiménez Martínez", "J. Jiménez Quiles", "J. Jormanainen", "S. Kankkunen", "D. Kerszberg", "M. Khachatryan", "J. Konrad", "P. M. Kouch", "H. Kubo", "J. Kushida", "M. Láinez", "A. Lamastra", "E. Lindfors", "S. Lombardi", "F. Longo", "R. López-Coto", "M. López-Moya", "A. López-Oramas", "S. Loporchio", "A. Lorini", "L. Lulić", "E. Lyard", "P. Majumdar", "M. Makariev", "G. Maneva", "M. Manganaro", "S. Mangano", "K. Mannheim", "M. Mariotti", "M. Martínez", "P. Maruševec", "A. Mas-Aguilar", "D. Mazin", "S. Menchiari", "S. Mender", "D. Miceli", "J. M. Miranda", "R. Mirzoyan", "M. Molero González", "E. Molina", "H. A. Mondal", "A. Moralejo", "T. Nakamori", "C. Nanci", "V. Neustroev", "L. Nickel", "C. Nigro", "L. Nikolić", "K. Nilsson", "K. Nishijima", "K. Noda", "S. Nozaki", "Y. Ohtani", "A. Okumura", "J. Otero-Santos", "S. Paiano", "D. Paneque", "R. Paoletti", "J. M. Paredes", "M. Peresano", "M. Persic", "M. Pihet", "F. Podobnik", "P. G. Prada Moroni", "E. Prandini", "G. Principe", "M. Ribó", "J. Rico", "C. Righi", "N. Sahakyan", "T. Saito", "F. G. Saturni", "K. Schmitz", "F. Schmuckermaier", "J. L. Schubert", "A. Sciaccaluga", "G. Silvestri", "J. Sitarek", "D. Sobczynska", "A. Stamerra", "J. Strišković", "Y. Suda", "H. Tajima", "M. Takahashi", "R. Takeishi", "F. Tavecchio", "P. Temnikov", "K. Terauchi", "T. Terzić", "M. Teshima", "A. Tutone", "S. Ubach", "J. van Scherpenberg", "S. Ventura", "G. Verna", "I. Viale", "A. Vigliano", "C. F. Vigorito", "V. Vitale", "I. Vovk", "R. Walter", "F. Wersig", "M. Will", "T. Yamamoto", "J. A. Acosta-Pulido", "G. A. Borman", "W. Boschin", "V. Bozhilov", "M. I. Carnerero", "D. Carosati", "C. Casadio", "W. Chamani", "W. P. Chen", "G. Damljanovic", "S. A. Ehgamberdiev", "K. E. Ergashev", "M. Giroletti", "T. S. Grishina", "M. A. Gurwell", "M. K. Hallum", "E. Järvelä", "H. E. Jermak", "S. G. Jorstad", "M. D. Jovanovic", "E. N. Kopatskaya", "K. Kuratov", "O. M. Kurtanidze", "S. O. Kurtanidze", "A. Lähteenmäki", "E. G. Larionova", "L. V. Larionova", "V. M. Larionov", "H. C. Lin", "N. Marchili", "A. P. Marscher", "C. McCall", "M. Minev", "D. O. Mirzaqulov", "I. Myserlis", "M. G. Nikolashvili", "T. Pursimo", "C. M. Raiteri", "I. Reva", "S. Righini", "A. C. Sadun", "S. S. Savchenko", "E. Semkov", "P. S. Smith", "I. A. Steele", "M. Tornikoski", "Yu. V. Troitskaya", "I. S. Troitskiy", "A. A. Vasilyev", "M. Villata", "O. Vince", "Z. R. Weaver"], "title": "First detection of VHE gamma-ray signal from the FSRQ TON 0599", "comment": "17 pages, 8 figures, 8 tables, accepted for publication in MNRAS", "summary": "TON 0599 (z=0.7247) belongs to the few flat spectrum radio quasars (FSRQs) detected in the very high energy (VHE, $E > 100$ GeV) gamma-ray band. Its redshift makes it currently one of the farthest VHE gamma-ray sources. It was detected for the first time with the MAGIC telescopes on 2017 December 15, and observed until December 29. The flux reached a maximum of about 50 per cent of the Crab Nebula flux above 80 GeV on the second night of observation, after which we witnessed a gradual decrease of the flux. The VHE gamma-ray spectrum connects smoothly to the one in the high energy ($E > 100$ MeV) band obtained from simultaneous observations with Fermi-LAT. It features a cut-off at energies around 50 GeV, indicating the location of the gamma-ray emission zone beyond the broad line region. In addition, we were able to follow the spectral evolution during the fading phase of the flare. Multiwavelength analysis based on observations in optical, near-infrared, and radio bands acquired by the Whole Earth Blazar Telescope (WEBT) Collaboration from November to March, as well as observations in X-ray and optical$-$UV bands with instruments on board the Swift satellite, shows strong correlation between different bands. We model the broadband emission with a simple one-zone leptonic model, where the high-energy peak is predominantly produced by external Compton (EC) scattering of photons from the dusty torus."}
{"id": "2601.03939", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.03939", "abs": "https://arxiv.org/abs/2601.03939", "authors": ["Giovanni Cozzolongo", "Alessio Fiori", "Massimiliano Razzano", "Pablo M. Saz Parkinson"], "title": "Search for gamma-ray variability around Fermi-LAT pulsar glitches", "comment": "This paper has been accepted by A&A", "summary": "Pulsars are the most numerous class of Galactic gamma-ray sources detected by the Fermi Large Area Telescope (LAT). Young pulsars occasionally experience sudden timing discontinuities called glitches, characterized by rapid changes in rotational parameters, usually followed by a return to regular rotation. PSR J2021+4026 is unique among Fermi-LAT pulsars, exhibiting quasiperiodic switches between two states with varying spin-down rates approximately every 3-4 years, correlated with sudden changes in gamma-ray emission features. This study searched for gamma-ray emission variability in pulsars correlated with glitch occurrence. We introduced a novel approach to analyzing LAT gamma-ray pulsars through systematic examination of variability associated with spin-down rate changes. We tracked rotation and gamma-ray emission changes for seven promising glitches selected based on observed spin-down rate variations. Using 14 years of Fermi-LAT data, we conducted binned likelihood spectral analysis of data windows around selected glitch epochs. We improved best-fit parameter precision by incorporating likelihood weights calculated from diffuse background models, accounting for systematic error contributions. The phase-averaged flux and spectral parameters of analyzed pulsars showed no significant variation across investigated glitches. The 95% upper limits on relative flux change indicate the Vela pulsar flux is unchanging, with a 0.5% upper limit on relative change, making it promising for further searches. The connection between glitch dynamics and gamma-ray emission remains unclear, and PSR J2021+4026 remains unique in its gamma-ray variability properties. We conclude that comprehensive investigation of glitches is warranted to further unravel their underlying mechanisms."}
{"id": "2601.03950", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.03950", "abs": "https://arxiv.org/abs/2601.03950", "authors": ["Shuo Xiao", "Zheng-Huo Jiang", "Di Li"], "title": "Evidence for a Damped Millisecond Quasi-Periodic Structure in a Fast Radio Burst", "comment": "Under review", "summary": "Fast radio bursts (FRBs) are millisecond-duration transients of unknown origin, likely associated with compact astrophysical objects. We report evidence for a damped millisecond quasi-periodic structure in a non-repeat FRB~20190122C. The burst consists of eight closely spaced radio pulses separated by $\\sim$1 ms, with pulse amplitudes exhibiting an exponential decay starting from the brightest component. Combined Gaussian fitting and time-series analysis reveal a quasi-periodic oscillation (QPO) at $\\sim$1 kHz. The observed QPO is consistent with damped magnetospheric oscillations. Assuming an Alfvén wave origin, we estimate a surface magnetic field of $\\sim 10^{12}$ G and a characteristic spin period of $\\sim$1 s, favoring a low-field magnetar or young neutron star scenario. The absence of frequency drift and the presence of exponential damping disfavor a merger-driven origin. These results suggest the first detection of an exponentially decaying QPO in any FRB, marking a rare detection of coherent oscillatory behavior in FRBs."}
{"id": "2601.03962", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.03962", "abs": "https://arxiv.org/abs/2601.03962", "authors": ["I. Stephens", "L. Rhodes", "A. J. Cooper", "S. E. Motta", "J. S. Bright"], "title": "Exploring the potential for ultra-relativistic jets in Scorpius X-1 with low angular resolution radio observations", "comment": "6 pages, 6 Figures, 3 Tables. Accepted in MNRAS", "summary": "Scorpius X-1 (Sco X-1) is a neutron star X-ray binary in which the neutron star is accreting rapidly from a low mass stellar companion. At radio frequencies, Sco X-1 is highly luminous and has been observed to have jet ejecta moving at mildly relativistic velocities away from a radio core, which corresponds to the binary position. In this Letter, we present new radio observations of Sco X-1 taken with the Karl G. Jansky Very Large Array. Using a fast imaging method, we find that the 10 and 15GHz data show a number of flares. We interpret these flares as the possible launching of fast jets ($βΓ$>2), previously observed in Sco X-1 and called ultra-relativistic flows, and their interaction with slower moving jet ejecta. Using the period between successive flares, we find that it is possible for the fast jets to remain undetected, as a result of the fast jet velocity being sufficiently high to cause the jet emission to be beamed in the direction of the motion and out of our line of sight. Our findings demonstrate that the ultra-relativistic flows could be explained by the presence of fast jets in the Sco X-1 system."}
{"id": "2601.04129", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.04129", "abs": "https://arxiv.org/abs/2601.04129", "authors": ["Pietro Monti-Guarnieri", "Gianfranco Paternò", "Alexei Sytov", "Elisabetta Cavazzuti", "Luigi Costamante", "Sara Cutini", "Matteo Duranti", "Pierluigi Fedeli", "Richard J. Gaitskell", "Vincenzo Guidi", "Viktar Haurylavets", "Savvas M. Koushiappas", "Francesco Longo", "Sofia Mangiacavalli", "Andrea Mazzolari", "Michela Prest", "Marco Romagnoni", "Alessia Selmi", "Victor Tikhomirov", "Valerio Vagelli", "Erik Vallazza", "Laura Bandiera"], "title": "Satellite-borne γ-ray astrophysics from coherent interactions in oriented crystals", "comment": null, "summary": "High-density and high-Z crystals are a key element of most space-borne $γ$-ray telescopes operating at GeV energies (such as Fermi-LAT). The lattice structure is usually neglected in the development of a crystalline detector, although its effects on the energy deposit development should be taken into account, since the interactions of a high energy ($\\sim$~GeV) photon or e$^\\pm$ impinging along the axis of an oriented crystal are different than the ones observed in a fully isotropic medium. Specifically, if the angle between a photon (e$^\\pm$) trajectory and the crystal axis is smaller than $\\sim$ 0.1$^\\circ$, a large enhancement of the pair production (bremsstrahlung) cross-section is observed. Consequently, a photon-induced shower inside an oriented crystal develops within a much more compact region than in an amorphous medium. Moreover, for photon energies above a few GeV and incidence angles up to several degrees, the pair-production cross-section exhibits a pronounced dependence on the angle between the crystal axis and the photon polarization vector. \\\\ In this work we show that these effects could be exploited to develop a novel class of light-weight pointing space-borne $γ$-ray telescopes, capable of achieving an improved sensitivity and resolution, thanks to a better shower containment in a smaller volume with respect to non-oriented crystalline detectors. We also show that an oriented tracker-converter system could be used to measure the polarization of a $γ$-ray source above few GeV, in a regime that remains unexplorable through any other detection technique. This novel detector concept could open new pathways in the study of the physics of extreme astrophysical environments and potentially improve the detector sensitivity for indirect Dark Matter searches in space."}
{"id": "2601.04141", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.04141", "abs": "https://arxiv.org/abs/2601.04141", "authors": ["Keigo Fukumura", "Alessandro Peca", "Roberto Serafinelli", "Mauro Dadina"], "title": "Implications of Non-equatorial Relativistic Accretion Flows for Ultra-Fast Inflows in AGNs", "comment": "accepted to ApJ (11 pages, 4 figures)", "summary": "Motivated by a number of X-ray observations of active galactic nuclei (AGNs) that exhibit a potential signature of ultra-fast inflows (UFIs), we consider in this work a scenario that UFIs can be physically identified as weakly-magnetized hydrodynamic accretion flows that is guided and channeled by poloidal magnetic field into low-to-mid latitude above the equatorial disk. In the context of general relativistic hydrodynamics (GRHD) under a weak-field limit in Kerr spacetime, we present a set of preliminary results by numerically calculating the physical property of GRHD flows (e.g. kinematics and density distribution) in an effort to simulate redshifted absorption line spectra. Our model demonstrates that such GRHD accretion off the equatorial plane (i.e. $v \\gsim 0.1c$ where $c$ is the speed of light in the vicinity of AGN closer than $\\sim 100$ \\sw radii) can manifest itself as UFIs in the form of redshifted absorption signature assuming the observed characteristics such as column density of $N_H \\sim 10^{23}$ cm$^{-2}$ and ionization parameter of $\\log (ξ\\rm{[erg~cm~s^{-1}])} \\sim 3$ as also seen in recent multi-epoch {\\it NuSTAR} observations among other data."}
{"id": "2601.04156", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.04156", "abs": "https://arxiv.org/abs/2601.04156", "authors": ["David A. Coulter", "Conor Larison", "Justin D. R. Pierel", "Seiji Fujimoto", "Vasily Kokorev", "Joseph F. V. Allingham", "Takashi J. Moriya", "Matthew Siebert", "Yoshihisa Asada", "Rachel Bezanson", "Maruša Bradač", "Gabriel Brammer", "John Chisholm", "Dan Coe", "Pratika Dayal", "Michael Engesser", "Steven L. Finkelstein", "Ori D. Fox", "Lukas J. Furtak", "Anton M. Koekemoer", "Thomas Moore", "Minami Nakane", "Masami Ouchi", "Richard Pan", "Robert Quimby", "Armin Rest", "Johan Richard", "Luke Robbins", "Louis-Gregory Strolger", "Fengwu Sun", "Tommaso Treu", "Hiroto Yanagisawa", "Abdurro'uf", "Aadya Agrawal", "Ricardo Amorín", "Joseph P. Anderson", "Rodrigo Angulo", "Hakim Atek", "Franz E. Bauer", "Larry D. Bradley", "Volker Bromm", "Mateusz Bronikowski", "Christopher J. Conselice", "Christa DeCoursey", "James M. DerKacy", "Guillaume Desprez", "Suhail Dhawan", "Jose M. Diego", "Eiichi Egami", "Andreas Faisst", "Brenda Frye", "Sebastian Gomez", "Mauro González-Otero", "Massimo Griggio", "Yuichi Harikane", "Kohei Inayoshi", "Saurabh W. Jha", "Yolanda Jiménez-Teja", "Jeyhan S. Kartaltepe", "Patrick L. Kelly", "Lindsey A. Kwok", "Zachary G. Lane", "Xiaolong Li", "Ivo Lobbe", "Ray A. Lucas", "Georgios E. Magdis", "Nicholas S. Martis", "Jorryt Matthee", "Ashish K. Meena", "Rohan P. Naidu", "Gaël Noirot", "Masamune Oguri", "Estefania Padilla Gonzalez", "Massimo Pascale", "Tanja Petrushevska", "Massimo Ricotti", "Daniel Schaerer", "Stefan Schuldt", "Melissa Shahbandeh", "William Sheu", "Koji Shukawa", "Akiyoshi Tsujita", "Eros Vanzella", "Qinan Wang", "John Weaver", "Rogier Windhorst", "Yi Xu", "Yossef Zenati", "Adi Zitrin"], "title": "A spectroscopically confirmed, strongly lensed, metal-poor Type II supernova at z = 5.13", "comment": "36 pages, 6 figures", "summary": "Observing supernovae (SNe) in the early Universe (z > 3) provides a window into how both galaxies and individual stars have evolved over cosmic time, yet a detailed study of high-redshift stars and SNe has remained difficult due to their extreme distances and cosmological redshifting. To overcome the former, searches for gravitationally lensed sources allow for the discovery of magnified SNe that appear as multiple images - further providing the opportunity for efficient follow-up. Here we present the discovery of \"SN Eos\": a strongly lensed, multiply-imaged, SN II at a spectroscopic redshift of z = 5.133 +/- 0.001. SN Eos exploded in a Lyman-α emitting galaxy when the Universe was only ~1 billion years old, shortly after it reionized and became transparent to ultraviolet radiation. A year prior to our discovery in JWST data, archival HST imaging of SN Eos reveals rest-frame far ultraviolet (~1,300Å) emission, indicative of shock breakout or interaction with circumstellar material in the first few (rest-frame) days after explosion. The JWST spectroscopy of SN Eos, now the farthest spectroscopically confirmed SN ever discovered, shows that SN Eos's progenitor star likely formed in a metal-poor environment (<= 0.1 Z_{\\odot}), providing the first direct evidence of massive star formation in the metal-poor, early Universe. SN Eos would not have been detectable without the extreme lensing magnification of the system, highlighting the potential of such discoveries to eventually place constraints on the faint end of the cosmic star-formation rate density in the very early Universe."}
{"id": "2601.04179", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.04179", "abs": "https://arxiv.org/abs/2601.04179", "authors": ["A. Rossi", "L. Izzo", "K. Maeda", "P. Schady", "D. B. Malesani", "D. A. Kann", "S. Klose", "L. Amati", "P. D'Avanzo", "A. de Ugarte Postigo", "K. E. Heintz", "A. Kumar", "V. Lipunov", "A. Martin-Carrillo", "A. Melandri", "A. M. Nicuesa Guelbenzu", "S. R. Oates", "S. Schulze", "J. Selsing", "R. L. C. Starling", "G. Stratta", "D. Vlasenko", "P. Balanutsa", "R. Brivio", "V. D'Elia", "B. Milvang-Jensen", "E. Palazzi", "D. A. Perley", "A. Rau", "J. Sollerman", "N. R. Tanvir", "T. Zafar"], "title": "GRB 180728A and SN 2018fip: the nearest high-energy cosmological gamma-ray burst with an associated supernova", "comment": "21 pages, 21 figures, 6 tables, submitted to Astronomy & Astrophysics", "summary": "The long GRB 180728A, at a redshift of $z = 0.1171$, stands out due to its high isotropic energy of $E_{γ,iso} \\sim 2.5 \\times 10^{51}$ erg, in contrast with most events at redshift $z<0.2$. We analyze the properties of GRB 180728A's prompt emission, afterglow, and associated supernova SN 2018fip, comparing them with other GRB-SN events. This study employs a dense photometric and spectroscopic follow-up of the afterglow and the SN up to 80 days after the burst, supported by image subtraction to remove the presence of a nearby bright star, and modelling of both the afterglow and the supernova. GRB 180728A lies on the $E_{p,i}-E_{γ,iso}$ plane occupied by classical collapsar events, and the prompt emission is one of the most energetic at $z < 0.2$ after GRB 030329 and GRB 221009A. The afterglow of GRB 180728A is less luminous than that of most long GRBs, showing a shallow early phase that steepens around 5 hours (0.2 days). The GRB exploded in an irregular, low-mass, blue, star-forming galaxy, typical of low-z collapsar events. Because of the relatively faint afterglow, the light curve bump of SN 2018fip dominates the optical emission already after $\\sim$3 days and is one of the best sampled to date. The strong suppression below $\\sim$ 4000 angstrom and a largely featureless continuum in the early 6--9 days spectra favor aspherical two-component ejecta with a high-velocity collimated component ($> 20,000 km s^{-1}$), dominant early-on, and a more massive, low-velocity component, which dominates at much later epochs. Our findings indicate that asymmetries need to be considered in order to better understand GRB-SNe. In any case, SN 2018fip shares many characteristics with typical GRB-SNe. Its kinetic energy is below the common range of $10^{52}-10^{53}$ erg and does not correlate with the high energy of the GRB, highlighting the diversity of the GRB-SN energy budget partition."}
{"id": "2601.03921", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.03921", "abs": "https://arxiv.org/abs/2601.03921", "authors": ["V. Barbosa Martins", "N. Jordana Mitjans", "S. Garrappa", "A. Franckowiak", "E. O. Ofek", "S. Ben-Ami", "J. Borowska-Naguszewska", "V. Fallah Ramazani", "R. Konno", "D. Kuesters", "R. D. Parsons", "D. Polishook", "I. Sadeh", "O. Savushkin", "E. Segre", "N. Strotjohann", "S. Weimann"], "title": "Science with a large field-of-view polarization survey: The Large Array Survey Telescope Polarization Node (LAST-P)", "comment": "Accepted for publication in Publications of the Astronomical Society of the Pacific (PASP) on January 6, 2026. Corresponding authors: V. Barbosa Martins, N. Jordana Mitjans, S. Garrappa, A. Franckowiak, E. O. Ofek", "summary": "Optical polarimetry provides information on the geometry of the emitting region, the magnetic field configuration and the properties of dust in astrophysical sources. Current state-of-the-art instruments typically have a small field of view (FoV), which poses a challenge for conducting wide surveys. We propose the construction of the Large Array Survey Telescope Polarization Node (LAST-P), a wide-field array of optical polarimeters. LAST-P is designed for high-cadence ($\\lesssim 1$ day) polarization monitoring of numerous astrophysical transients, such as the early phases of gamma-ray bursts, supernovae, and novae. Furthermore, LAST-P will facilitate the creation of extensive polarization catalogs for X-ray binaries and white dwarfs, alongside a large FoV study of the interstellar medium. In survey mode, LAST-P will cover a FoV of 88.8 deg$^2$. With a 15 x 1-minute exposure, the instrument will be capable of measuring polarization of sources as faint as Gaia Bp-magnitude $\\sim$20.9. The precision on the linear polarization degree (PD) will reach 0.7\\%, 1.5\\%, and 3.5\\% for sources with magnitudes 17, 18, and 19, respectively, for a seeing of 2.7 arcsec, air mass of about 1 for observations in dark locations. We propose three distinct non-simultaneous survey strategies, among them an active galactic nuclei (AGN) strategy for long-term monitoring of $\\sim$200 AGN with $<$1-day cadence. In this paper, we present the predicted sensitivity of the instrument and outline the various science cases it is designed to explore."}
