{"id": "2601.06253", "categories": ["astro-ph.HE", "astro-ph.CO", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2601.06253", "abs": "https://arxiv.org/abs/2601.06253", "authors": ["Philip F. Hopkins", "Dalya Baron", "Joanna M. Piotrowska"], "title": "Masers and Broad-Line Mapping Favor Magnetically-Dominated AGN Accretion Disks", "comment": "16 pages, 5 figures+3 tables. Table 3 summarizes the most important conclusions. Submitted to the Open Journal of Astrophysics. Comments welcome", "summary": "We present a novel and powerful constraint on the physics of supermassive black hole (BH) accretion disks. We show that in the outer disk (radii $R \\gtrsim 0.01\\,$pc or $\\gtrsim 1000\\,R_{G}$), models supported by thermal or radiation pressure predict disk masses which are much larger than the BH mass and increase with radius - i.e. rapidly-rising, extremely non-Keplerian rotation curves. More generally, we show that any observational upper limit to the deviation from Keplerian potentials at these radii directly constrains the physical form of the pressure in disks. We then show that existing maser and broad line region (BLR) kinematic observations immediately rule out the classic thermal-pressure-dominated Shakura Sunyaev-like $α$-disk model, and indeed rule out any thermal or radiation (or cosmic-ray) pressure-dominated disk, as the required temperatures and luminosities of the gas at large radii would exceed those observed by orders of magnitude. We show that models where the pressure comes entirely from turbulence (without thermal, radiation, or magnetic sources) could in principle be viable but would require turbulent Toomre $Q \\gtrsim 100$, far larger than predicted by self gravitating/gravito-turbulent models. However, recently proposed models of magnetic pressure-dominated disks agree with all of the observational constraints. These magnetically-dominated models also appear to agree better with constraints on maser magnetic fields, compared to the other possibilities. Observations appear to strongly favor the hypothesis that the outer regions of BH accretion disks are in the 'hyper-magnetized' state."}
{"id": "2601.06278", "categories": ["astro-ph.HE", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2601.06278", "abs": "https://arxiv.org/abs/2601.06278", "authors": ["Mattias Lazda", "Kenzie Nimmo", "Maria R. Drout", "Benito Marcote", "Jason W. T. Hessels", "Eli Wiston", "Raffaella Margutti", "Omar Ould-Boukattine", "Tanmoy Laskar", "Jacco Vink", "Ryan Chornock", "James K. Leung", "Deanne L. Coppejans", "Dan Milisavljevic", "Juan Mena-Parra", "Dan Patnaude"], "title": "VLBI Observations of SN 2012au Reveal a Compact Radio Source a Decade Post Explosion", "comment": "Submitted to ApJ, comments welcome", "summary": "Three leading models have been put forth to justify the observed radio re-brightening associated with stripped-envelope supernovae (SESNe) years post-explosion: radiation from an emerging pulsar wind nebula (PWN), shock interaction with a dense circumstellar medium (CSM), or emission from off-axis, relativistic jets. SN~2012au is a particularly intriguing SESN in this regard as observations obtained $\\gtrsim$ 6 years post-explosion have shown \\emph{both} (i) optical emission features consistent with a young PWN and (ii) a radio re-brightening. We present the results of our Very-Long-Baseline-Interferometric (VLBI) observations of SN 2012au performed between 8 to 13 years post core-collapse. Our VLBI observations reveal a luminous, steadily fading radio source that remains compact ($\\leq1.4\\times10^{17}~\\mathrm{cm}$) and stationary ($\\leq0.36c$) over the course of our campaign. Overall, we find that our VLBI measurements can be readily explained by a $\\sim$decade-old PWN, potentially explained by shock interaction with specific CSM geometries, and are unlikely to be explained by emission from an off-axis, relativistic jet. Assuming a PWN origin, our observations require that the initial spin-down luminosity of the central pulsar be between $10^{36}~\\mathrm{erg~s^{-1}}\\leq\\dot{E}_0\\leq10^{42}~\\mathrm{erg~s^{-1}}$ and radio efficiency factor be $η_\\mathrm{R}\\geq3\\times10^{-6}$. These results are consistent with independent inferences obtained using optical spectroscopy of SN~2012au, alongside inferences of known Galactic systems. If a PWN origin is confirmed, SN 2012au would represent the first extragalactic PWN emerging from a modern day SN, providing a novel opportunity to study the formation properties of a decade-old pulsar."}
{"id": "2601.06313", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.06313", "abs": "https://arxiv.org/abs/2601.06313", "authors": ["Sol Gutiérrez-Lara", "Daniel C. M. Palumbo", "Michael D. Johnson"], "title": "The Role of Interferometric Phase in Measuring Black Hole Photon Rings", "comment": "12 pages, 7 figures, under review in ApJ", "summary": "The Event Horizon Telescope (EHT) captured the first images of a black hole using Very Long Baseline Interferometry (VLBI). In the near future, extensions of the EHT such as the Black Hole Explorer (BHEX) will allow access to finer-scale features, such as a black hole's ''photon ring.'' In the Kerr spacetime, this image structure arises from strong gravitational lensing near the black hole that results in a series of increasingly demagnified images of each emitting region that exponentially converge to a limiting critical curve. Exotic black hole alternatives, such as wormholes, can introduce additional photon rings. Hence, precisely characterizing multi-ring images is a promising pathway for measuring black hole parameters, such as spin, as well as exploring non-Kerr spacetimes. Here, we examine the interferometric response of multi-ring systems using a series of 1) simple geometric toy models, 2) synthetic BHEX and EHT observations of geometric models, and 3) semi-analytic accretion models with ray-tracing in the Kerr spacetime. We find that interferometric amplitude is more sensitive to the shape of the photon ring, while interferometric phase is more sensitive to its displacement, which is most sensitive to black hole spin. We find that for models similar to Messier 87* (M87*), the relative displacement of the first strongly lensed image from the weakly lensed direct image is approximately $1\\,μ{\\rm as}$ per unit dimensionless spin, yielding an expected phase signature on a 25 G$λ$ baseline of $\\sim44^\\circ$ per unit spin."}
{"id": "2601.06409", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.06409", "abs": "https://arxiv.org/abs/2601.06409", "authors": ["Simon Chiche", "Krijn D. de Vries", "Simona Toscano"], "title": "Radio Signatures of Cosmic-Ray Particle Showers in Deep In-Ice Antennas", "comment": "9 pages, 5 figures, 39th International Cosmic Ray Conference (ICRC2025)", "summary": "To detect ultra-high-energy neutrinos, experiments such as ARA and RNO-G target the radio emission induced by these particles as they cascade in the ice, using deep in-ice antennas at the South Pole or in Greenland. In this context, it is essential to first characterize the in-ice radio signature from cosmic-ray-induced particle showers, which constitute a primary background for neutrino detection, and represent the fist in-situ detection of in-ice particle cascades with radio antennas. This characterization will help validate the detection principle and assist in calibration. To achieve this goal, we used FAERIE, the \"Framework for the simulation of Air shower Emission of Radio for in-Ice Experiments\", that combines CoREAS and GEANT4 to simulate the radio emission of cosmic ray showers deep in the ice. Using this tool, we analyze in-ice radio signatures of cosmic-ray showers, including polarization, timing, and radiation energy, as well as their dependence on shower parameters. These insights will facilitate the first cosmic-ray detections and improve cosmic-ray/neutrino discrimination."}
{"id": "2601.06417", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2601.06417", "abs": "https://arxiv.org/abs/2601.06417", "authors": ["Simon Chiche", "Simona Toscano", "Krijn D. de Vries"], "title": "In-ice Radio Signatures of Cosmic Ray Particle Cascades", "comment": "20 pages, 16 figures", "summary": "To detect ultra-high-energy neutrinos, experiments such as the Askaryan Radio Array and the Radio Neutrino Observatory in Greenland target the radio emission induced by these particles as they cascade in the ice, using deep in-ice antennas at the South Pole or in Greenland. A crucial step toward this goal is the characterization of the in-ice radio emission from cosmic-ray-induced particle showers. These showers form a primary background for neutrino searches, but can also be used to validate the detection principle and provide calibration signals for in-ice radio detectors. In this work, we use the Monte-Carlo framework FAERIE to perform the first characterization of cosmic ray signals with simulations that incorporate both their in-air and in-ice emissions. We investigate cosmic ray signatures such as their radiation energy, timing, polarization and frequency spectrum and quantify how they depend on shower properties. These results provide key guidelines for cosmic-ray identification and cosmic-ray neutrino discrimination in future in-ice radio experiments."}
{"id": "2601.06418", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2601.06418", "abs": "https://arxiv.org/abs/2601.06418", "authors": ["Simon Chiche", "Olivier Martineau-Huynh", "Matias Tueros", "Krijn D. de Vries"], "title": "Radio Morphing: Fast computation of inclined air shower radio emission", "comment": "13 pages, 9 figures", "summary": "The preparation of next-generation large-scale radio experiments requires running a fast and efficient number of simulations to explore multiple detector configurations over vast areas and develop novel methods for the reconstruction of air shower parameters. While Monte Carlo simulations are accurate and reliable tools, they are too computationally expensive to explore the full parameter space of these new detectors within a reasonable timescale. We introduce a new version of Radio Morphing, a semi-analytical tool designed to simulate the radio emission of any cosmic-ray induced air shower with zenith angle $θ>60^{\\circ}$, at any desired antenna position, from the simulation data of a few reference showers at given positions. We present the latest performances of Radio Morphing which now provides simulation of air shower radio signals with average relative differences on the peak amplitude below $17\\%$ on raw traces, below $15\\%$ with a $3σ$ trigger threshold, below $13\\%$ in the $[50-200]\\,\\rm MHz$ band, and even below $\\sim 10\\%$ in the $[30-80]\\,\\rm MHz$ band. These results are combined with a computation time reduced by more than four orders of magnitude, compared to standard Monte Carlo simulations."}
{"id": "2601.06233", "categories": ["astro-ph.IM", "astro-ph.EP"], "pdf": "https://arxiv.org/pdf/2601.06233", "abs": "https://arxiv.org/abs/2601.06233", "authors": ["Joanna K. Barstow", "Beth Biller", "Mei Ting Mak", "Sarah Rugheimer", "Amaury Triaud", "Hannah R. Wakeford"], "title": "Exoplanet characterization with NASA's Habitable Worlds Observatory", "comment": "White paper submitted to the UK Space Agency's initiative \"UK Space Frontiers 2035\" https://www.gov.uk/government/publications/uk-space-frontiers-2035-astro-planetary-and-helio", "summary": "Exoplanet atmosphere characterization has seen revolutionary advances over the last few years, providing us with unique insights into atmospheric chemistry, dynamics and planet formation mechanisms. However, true solar system analog planets remain inaccessible. A major goal for exoplanet science over the coming decades is to observe, and characterize, temperate rocky planets and cool gas giants in orbit around solar-type stars, with the prospect of detecting signs of habitability or even life. Characterization and categorization of these planets relies on direct spectroscopic observations capable of identifying molecular species in their atmospheres; however, these observations represent a substantial engineering challenge due to the extreme contrast between a temperate, Earth-sized exoplanet and its parent star. NASA's next flagship mission, the Habitable Worlds Observatory (HWO) - planned for launch in the mid-2040s - will boast a coronagraphic instrument capable of reaching the needed 10$^{-10}$ contrast, on an ultrastable platform enabling long integration times to achieve the required signal to noise. HWO will cover near-ultraviolet to the near-infrared wavelengths, enabling detections of key biosignature molecules and habitability indicators such as ocean glint and a vegetation `red edge'. Via early involvement in this groundbreaking observatory, including a potential UK instrument contribution, the UK exoplanet community now has an important opportunity to influence the telescope's design. To maintain our international competitiveness, we must be at the forefront of observational campaigns with HWO when it eventually launches, and this comes with the need for parallel development in laboratory astrophysics and computational modelling. Maximising our exploitation of this transformative NASA mission requires consistent financial support in these areas across the next two decades."}
{"id": "2601.06480", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2601.06480", "abs": "https://arxiv.org/abs/2601.06480", "authors": ["Jeremiah D. Paul", "Richard M. Plotkin"], "title": "Ruling Out Compact Jets as the Dominant Source of Radio Emission in Radio-quiet, High Eddington-ratio Active Galactic Nuclei", "comment": "Accepted for publication in ApJ. 21 pages, 5 figures, 2 tables", "summary": "The origin of core radio emission in radio-quiet active galactic nuclei (AGNs) is still actively debated. General relativistic magnetohydrodynamics simulations often predict the launching of moderately large-scale jets from super-Eddington accretion flows, but this prediction seems at odds with observations indicating most high/super-Eddington AGNs appear radio quiet. Here, we use the ratio of radio to X-ray luminosities as a multiwavelength diagnostic to probe the origin of radio emission in a sample of 69 radio-quiet, high/super-Eddington AGNs with black-hole masses $M_{\\rm BH} \\sim 10^{5}-10^{9}~M_\\odot$. With this wide dynamic range in $M_{\\rm BH}$, we adapt existing formalisms for how jetted radio emission and accretion-powered X-ray emission scale with black hole mass into the super-Eddington regime. We find that the radio/X-ray luminosity ratios observed across this $M_{\\rm BH}$ range are inconsistent with a jet-dominated model for radio emission. We discuss how our results may instead be consistent with a corona-dominated radio emission origin with a contribution from outflows at higher accretion rates."}
{"id": "2601.06236", "categories": ["astro-ph.IM", "astro-ph.EP"], "pdf": "https://arxiv.org/pdf/2601.06236", "abs": "https://arxiv.org/abs/2601.06236", "authors": ["Joanna K. Barstow", "Hannah R. Wakeford", "Sarah L. Casewell", "Vatsal Panwar"], "title": "Transiting exoplanets as the immediate future for population-level atmospheric science", "comment": "White paper submitted to the UK Space Agency's initiative \"UK Space Frontiers 2035\" https://www.gov.uk/government/publications/uk-space-frontiers-2035-astro-planetary-and-helio", "summary": "The transit method, during which a planet's presence is inferred by measuring the reduction in flux as it passes in front of its parent star, is a highly successful exoplanet detection and characterization technique. During transit, the small fraction of starlight that passes through a planet's atmosphere emerges with the fingerprints of atmospheric gases, aerosols and structure. During eclipse, the relatively small contribution of light from the planet itself may be observed as the planet is occulted by the star. For planets in near-edge-on, short-period orbits, observing the system throughout an entire orbit allows the varying flux from the planet to be extracted as the illuminated `dayside' rotates in and out of view. With spectroscopic observations, we can characterize not only the overall composition of the atmosphere, but also glean insights into atmospheric structure and dynamics. With over 6,000 transiting planets now discovered, such observations are currently our only window into a consistent sample of planetary atmospheres large enough to attempt a population-level study, a critical next step for our understanding of atmospheric science. The vast exoplanet population provides a laboratory for atmospheric physics, including chemistry, dynamics, cloud processes and evolution; extending these results to a larger number of targets will allow us to explore the effects of equilibrium temperature, gravity, mass and parent star type on atmospheric properties, as well as map observable trends to formation scenarios. These findings are critical for addressing STFC's Science Vision Challenge B: how do stars and planetary systems develop and how do they support the existence of life?. Here we outline how the UK must fit within this strategic context, suggest approaches and development for the future, and outline the unique capabilities and leadership of scientists across the UK."}
{"id": "2601.06577", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.06577", "abs": "https://arxiv.org/abs/2601.06577", "authors": ["Zexi Niu", "Ning-Chen Sun", "Emmanouil Zapartas", "Dimitris Souropanis", "Yingzhen Cui", "Justyn R. Maund", "JeffJ. Andrews", "Max M. Briel", "Morgan Fraser", "Seth Gossage", "Matthias U. Kruckow", "Camille Liotine", "Zhengwei Liu", "Philipp Podsiadlowski", "Philipp M. Srivastava", "Elizabeth Teng", "Xiaofeng Wang", "Yi Yang", "Jifeng Liu"], "title": "A binary merger product as the direct progenitor of a Type II-P supernova", "comment": "Accepted for publication in Science Bulletin. 11 pages and 3 pages Supplementary materials", "summary": "Type II-P supernovae (SNe II-P) are the most common class of core-collapse SNe in the local Universe and play critical roles in many aspects of astrophysics. Since decades ago theorists have predicted that SNe II-P may originate not only from single stars but also from interacting binaries. While ~20 SNII-P progenitors have been directly detected on pre-explosion images, observational evidence still remains scarce for this speculated binary progenitor channel. In this work, we report the discovery of a red supergiant progenitor for the Type II-P SN 2018gj. While the progenitor resembles those of other SNe II-P in terms of effective temperature and luminosity, it is located in a very old environment and SN 2018gj has an abnormally short plateau in the light curve. With state-of-the-art binary evolution simulations, we find these characteristics can only be explained if the progenitor of SN 2018gj is the merger product of a close binary system, which developed a different interior structure and evolved over a longer timescale compared with single-star evolution. This work provides the first compelling evidence for the long-sought binary progenitor channel toward SNe II-P, and our methodology serves as an innovative and pragmatic tool to motivate further investigations into this previously hidden population of SNe II-P from binaries."}
{"id": "2601.06342", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2601.06342", "abs": "https://arxiv.org/abs/2601.06342", "authors": ["Sarah Steiger", "Pin Chen", "Laurent Pueyo"], "title": "Incorporating Wavefront Error, Wavefront Sensing and Control, and Sensitivities into Exposure Time Calculations for Future Space Missions with the Error Budget Software (EBS)", "comment": "44 pages, 11 figures, accepted for publication in the Journal of Astronomical Telescopes, Instruments, and Systems (JATIS)", "summary": "A primary goal of NASA's Habitable Worlds Observatory (HWO) mission concept is to explore the Habitable Zones (HZ) of ~100 stellar systems and acquire spectra of ~25 terrestrial-type planets (with planet/star flux ratios on the order of 1E-10) which places tight constraints on the performance of observatory systems. In particular, coronagraph instrumentation needs to be matured for higher throughput, deeper contrasts, and better broadband performance, while also considering their sensitivity and ability to mitigate the impact of telescope instability and wavefront error (WFE), which can have a profound impact on exo-Earth imaging. The success of various proposed HWO mission architectures is often represented by the estimated exo-Earth candidate yield. Computation of the minimum exposure time to achieve the required signal-to-noise on a given target, using an exposure time calculator (ETC), is a key part of yield estimation. The impacts of coronagraph sensitivity, WFE, and wavefront sensing and control (WFS&C) have been well studied in the context of developing error budgets for missions and instruments such as the Roman Coronagraph Instrument, but there is currently no easily accessible way to incorporate the effects of these key parameters into calculating exposure times for HWO. To address this, we developed the Error Budget Software (EBS) - an open-source tool that synthesizes sensitivity, WFE, and WFS&C information for a variety of temporal and spatial scales and directly interfaces with the open-source yield code EXOSIMS to produce exposure times. We demonstrate how EBS can be used for mission error budgeting using the example of the Ultrastable Observatory Roadmap Team (USORT) observatory design. This includes both single and multi-variate parameter explorations using EBS where we identify trends between raw contrast and wavefront error, and detector noise and energy resolution."}
{"id": "2601.06994", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.06994", "abs": "https://arxiv.org/abs/2601.06994", "authors": ["Marc Van den Bossche", "Geoffroy Lesur", "Guillaume Dubus"], "title": "Magnetic winds in resistive compact binary discs", "comment": "Talk presented at the 87th Fujihara Seminar: The 50th Anniversary Workshop of the Disk Instability Model in Compact Binary Stars (DIM50TH2025), held on 22-26 September 2025 in Tomakomai, Japan. To be published in the Proceedings of Science https://pos.sissa.it/493/", "summary": "Dwarf Novae and low-mass X-ray binaries are eruptive binary systems comprised of a Roche-lobe overflowing solar-type star and an accreting compact object. Their recurrence time can be explained by a low-accreting phase, the quiescence, during which the angular momentum transport parameter is inferred to be $α\\approx 0.01$ by the Disc Instability Model. Non-magnetics mechanisms, such as spiral wave transport, only achieve angular momentum transport an order of magnitude too low, at best, because these discs are so thin in quiescence. During this phase, the Magneto-rotational Instability is known to be suppressed by the increased resistivity of the weakly ionised plasma. Studying these thin magnetised discs is a numerical challenge because of the wide range of scales to be resolved. Thanks to the new GPU-accelerated code Idefix, we produce global 3D MHD simulations of a very thin disc $(H/R = 0.01)$ for the first time. We explore the possibility that an MHD wind arises and increases accretion in low magnetic Reynolds number $(\\mathrm{Rm}\\approx100)$ and realistic plasma parameter ($β\\approx 1000$) regimes. We observe that the MRI is only quenched in the resistive disc bulk but survives in the disc atmosphere. This drives strong accretion and wind launching. We quantify the efficiency of the resulting wind and measure its global effect on the disc. We explore the effect of the initial disc magnetisation and compare the accretion/ejection regime with and without resistivity."}
{"id": "2601.06386", "categories": ["astro-ph.IM", "astro-ph.EP"], "pdf": "https://arxiv.org/pdf/2601.06386", "abs": "https://arxiv.org/abs/2601.06386", "authors": ["Niki Parenteau", "Giada Arney", "Eleanora Alei", "Ruslan Belikov", "Svetlana", "Berdyugina", "Dawn Cardace", "Ligia F. Coelho", "Kevin Fogarty", "Kenneth Gordon", "Jonathan Grone", "Natalie Hinkel", "Nancy Kiang", "Ravi Kopparapu", "Joshua Krissansen-Totton", "Emilie LaFleche", "Jacob Lustig-Yaeger", "Eric Mamajek", "Avi Mandell", "Taro Matsuo", "Connor Metz", "Mark Moussa", "Stephanie Olson", "Lucas Patty", "Bill Philpot", "Sukrit Ranjan", "Edward Schwieterman", "Clara Sousa-Silva", "Anna Grace Ulses", "Sara Walker", "Daniel Whitt"], "title": "NASA Decadal Astrobiology Research and Exploration Strategy (NASA-DARES 2025) White Paper -- Habitable Worlds Observatory Living Worlds Science Cases: Research Gaps and Needs", "comment": "This white paper was submitted to the NASA Decadal Astrobiology Research and Exploration Strategy (NASA-DARES 2025) RFI. 5 pages, 1 figure", "summary": "Executive Summary: The Habitable Worlds Observatory (HWO) is the first astrophysics flagship mission with a key cross-divisional astrobiology science goal of searching for signs of life on rocky planets beyond our solar system. The Living Worlds Working Group under the Science, Technology, and Architecture Review Team (START) was charged with investigating how HWO could characterize potentially habitable exoplanets orbiting stars in the solar neighborhood, search for signs of life, and interpret potential biosignatures within a false positive and false negative framework. In particular, we focused on (1) identifying biosignatures that have spectral features in the UV-Vis-NIR wavelength range and defining their measurement requirements, (2) determining additional information needed from the planet and planet system to interpret biosignatures and assess the likelihood of false positives, and (3) assembling current knowledge of likely HWO target stars and identify which properties of host stars and systems are most critical to know in advance of HWO. The Living Worlds atmospheric biosignatures science case is considered one of the key drivers in the design of the observatory. An additional 10 astrobiology science cases were developed that collectively revealed key research gaps and needs required to fully explore the observatory parameter space and perform science return analyses. Investment in these research gaps will require coordination across the Science Mission Directorate and fall under the purview of the new Division-spanning astrobiology strategy."}
{"id": "2601.07031", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.07031", "abs": "https://arxiv.org/abs/2601.07031", "authors": ["Yossef Zenati", "Ethan T. Vishniac", "Amir Jafari"], "title": "The Structure of Poloidal Fields Embedded in Thin Disks", "comment": "Submitted to APJ; comments welcome!", "summary": "Many accreting systems are modeled as geometrically thin disks. Simulations of accretion disks cannot be extended to this regime, although local models can address the behavior of narrow annuli. A global model needs to account for the interactions between a large-scale poloidal field, accreted from the environment, and the disk. The disk magnetosphere can be modeled subject to the boundary conditions imposed by the disk. These depend on the structure of the magnetic field as it crosses the disk and the degree to which the disk can support a bend in the field lines. Building on earlier work we derive a set of equations describing a stationary disk with an embedded poloidal field. We derive a modified induction equation that incorporates tensorial turbulent diffusivities and a helicity-regulated $α$-effect. We quantify how helicity conservation introduces a nonlinear backreaction on the large-scale dynamo, dynamically coupling turbulent diffusion and $α$-quenching. We discuss the challenges encountered in finding a unique solution under stationary flows $E_φ=0$, which balances the inflow of $B_z$ due to accretion, the outflow due to radial diffusion of $B_z$, and the vertical movement of $B_r$ due to turbulent diffusion and buoyancy. The vertical profiles of both the azimuthal diffusion coefficient $D_{ijk}$ and the helicity-driven $α_{ij}$ demonstrate that changes in the radial gradient can restructure the magnetic field geometry. The ability of disks to sustain large bending angles in the poloidal field implies that angular momentum flux through the magnetosphere can dominate over internal transport even for weak fields. Competing factors can result in non-unique solutions, necessitating extra constraints and diagnostics that highlight the role of isotropic turbulence and helicity regulation in magnetized disk environments."}
{"id": "2601.06452", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2601.06452", "abs": "https://arxiv.org/abs/2601.06452", "authors": ["Duncan Eddy", "Mykel J. Kochenderfer"], "title": "Brahe: A Modern Astrodynamics Library for Research and Engineering Applications", "comment": null, "summary": "Brahe is a modern satellite dynamics library for research and engineering applications. The representation and prediction of satellite motion is the fundamental problem of astrodynamics. Current research and applications in space situational awareness, satellite task planning, and space mission operations require accurate and efficient numerical tools to perform coordinate transformations, model perturbations, and propagate orbits. While the core algorithms for predicting and modeling satellite motion have been known for decades, there is a lack of modern, open-source software that implements these algorithms in a way that is accessible to researchers and engineers. brahe is designed to address these challenges by providing a modern, open-source astrodynamics library that is quick-to-deploy, composable, extensible, and easy-to-learn."}
{"id": "2601.07173", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.07173", "abs": "https://arxiv.org/abs/2601.07173", "authors": ["Zhipeng Huang", "Zhen Yan", "Zhiqiang Shen", "Hao Tong", "Mingyu Ge", "Zhifu Gao", "Yajun Wu", "Rongbing Zhao", "Jie Liu", "Rui Wang", "Xiaowei Wang", "Fan Yang", "Chuyuan Zhang", "Zhenlong Liao", "Yangyang Lin"], "title": "Does the radio-active phase of XTE~J1810$-$197 recur following the same evolutionary pattern?", "comment": "14 pages, 5 figures, Accepted by SCIENCE CHINA Physics, Mechanics & Astronomy", "summary": "Magnetars are the most strongly magnetized compact objects known in the Universe and are regarded as one of the primary engines powering a variety of enigmatic, high-energy transients. However, our understanding of magnetars remains highly limited, constrained by observational sample size and radiative variability. XTE~J1810$-$197, which re-entered a radio-active phase in 2018, is one of only six known radio-pulsating magnetars. Leveraging the distinctive capability for simultaneous dual-frequency observations, we utilized the Shanghai Tianma Radio Telescope (TMRT) to monitor this magnetar continuously at both 2.25 and 8.60~GHz, capturing its entire evolution from radio activation to quenching. This enabled precise characterization of the evolution in its integrated profile, spin frequency, flux density, and spectral index ($α$, defined by $S \\propto f^α$). The first time derivative of its spin frequency $\\dotν$ passed through four distinct phases -- rapid decrease, violent oscillation, steady decline, and stable recovery -- before returning to its pre-outburst value concomitant with the cessation of radio emission. Remarkably, both the amplitudes and the characteristic time-scales of these $\\dotν$ variations match those observed during the previous outburst that began in 2003, providing the first demonstration that post-outburst rotational evolution and radiative behavior in a magnetar are repeatable. A twisted-magnetosphere model can qualitatively account for this repeatability as well as for the progressive narrowing and abrupt disappearance of the radio pulse radiation, thereby receiving strong observational support."}
{"id": "2601.06859", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2601.06859", "abs": "https://arxiv.org/abs/2601.06859", "authors": ["Maryam Raouph", "Andreas Schrimpf"], "title": "Computing Natural Magnitudes in the Photometric Systems of Astronomical Plates using Gaia DR3 SEDs", "comment": "A&A accepted; submitted for language editing", "summary": "Context. Accurate photometric calibration of astronomical photographic plates remains a fundamental challenge in astronomy, especially when bridging historical photographic data with modern observations due to the mismatch of spectral sensitivities of photographic plates and passbands of modern calibration catalogs. Aims. We intend to derive consistent natural magnitudes for celestial sources within the intrinsic photometric systems of astronomical photographic plates by using Gaia Data Release 3 (DR3) blue photometer (BP) and red photometer (RP) low-resolution spectral data and to show its superiority to former methods. Methods. We compiled spectral characteristic data for emulsions and filters applied in photometric observations using glass plates. The collected color sensitivities, modified by atmospheric reddening depending on the air mass, are then used to compute accurate natural magnitudes and fluxes of objects in the photographic plates through synthetic photometry, utilizing a catalog of Gaia spectral energy distributions (SEDs) over the wavelength range 330 nm to 1050 nm (XP spectra). This process uses GaiaXPy, a Python library designed to handle Gaia DR3 spectral data. These natural magnitudes are then compared with results from the color term method used to compile the data in existing photoplate archives. Results. Comparing the synthetic magnitudes with those existing in the Archives of Photographic PLates for Astronomical USE (APPLAUSE), we were able to reveal systematic errors of the existing data in the range of +/-0.3 mag and higher. In addition, the presented method allows for an accommodation of stars with similar color index but of different luminosity classes as well as an effective correction of atmospheric reddening at higher air masses, approximately 0.2 mag."}
{"id": "2601.07259", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.07259", "abs": "https://arxiv.org/abs/2601.07259", "authors": ["D. Allard", "J. Aublin", "B. Baret", "E. Parizot"], "title": "What can be learnt from UHECR anisotropies observations Paper III: Update with new data and Galactic magnetic fields models", "comment": "21 pages, 18 figures", "summary": "Context. At large angular scales, the Pierre Auger Observatory has reported a significant dipole modulation in right ascension, while at intermediate angular scales, localized flux excesses have been identified by both the Auger and Telescope Array collaborations. These observations were investigated in the first two papers of this series. Aims. We examine the implications of these anisotropy measurements and assess to what extent they can be used to constrain the origin of UHECRs and the astrophysical or physical parameters of viable source scenarios.\n  Methods. As in the first two papers of this series, we generate realistic UHECR sky maps for a wide range of astrophysical models consistent with current spectral and composition constraints, assuming that UHECR sources trace the distribution of galaxies in the Universe. We update our previous studies by incorporating the most recent models of the Galactic magnetic field and apply the same large- and intermediate-scale anisotropy analyses as those used by the Auger Collaboration to simulated datasets with current experimental exposure.\n  Results. The main novelty of this third paper is the improved compatibility between simulations and data, in particular regarding the reconstructed dipole direction, when using several of the recently proposed Galactic magnetic field models. Despite this progress, our main conclusions remain unchanged: although the observed anisotropies are compatible with an extragalactic origin of UHECRs, present data and magnetic-field uncertainties do not allow strong constraints to be placed on the nature, spatial distribution, or density of UHECR sources.\n  Conclusions. Further progress in the interpretation of UHECR anisotropies will require improved constraints on cosmic magnetic fields, advances in source modeling, and significantly larger experimental exposures"}
{"id": "2601.07130", "categories": ["astro-ph.IM", "cs.NE"], "pdf": "https://arxiv.org/pdf/2601.07130", "abs": "https://arxiv.org/abs/2601.07130", "authors": ["Nicholas J. Pritchard", "Richard Dodson", "Andreas Wicenec"], "title": "The Potential Impact of Neuromorphic Computing on Radio Telescope Observatories", "comment": "40 pages, 7 figures, 7 tables, in-review", "summary": "Radio astronomy relies on bespoke, experimental and innovative computing solutions. This will continue as next-generation telescopes such as the Square Kilometre Array (SKA) and next-generation Very Large Array (ngVLA) take shape. Under increasingly demanding power consumption, and increasingly challenging radio environments, science goals may become intractable with conventional von Neumann computing due to related power requirements. Neuromorphic computing offers a compelling alternative, and combined with a desire for data-driven methods, Spiking Neural Networks (SNNs) are a promising real-time power-efficient alternative. Radio Frequency Interference (RFI) detection is an attractive use-case for SNNs where recent exploration holds promise. This work presents a comprehensive analysis of the potential impact of deploying varying neuromorphic approaches across key stages in radio astronomy processing pipelines for several existing and near-term instruments. Our analysis paves a realistic path from near-term FPGA deployment of SNNs in existing instruments, allowing the addition of advanced data-driven RFI detection for no capital cost, to neuromorphic ASICs for future instruments, finding that commercially available solutions could reduce the power budget for key processing elements by up to three orders of magnitude, transforming the operational budget of the observatory. High-data-rate spectrographic processing could be a well-suited target for the neuromorphic computing industry, as we cast radio telescopes as the world's largest in-sensor compute challenge."}
{"id": "2601.07337", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2601.07337", "abs": "https://arxiv.org/abs/2601.07337", "authors": ["Arghajit Jana", "Claudio Ricci", "Alessia Tortosa", "George Dimopoulos", "Benny Trakhtenbrot", "Franz E. Bauer", "Matthew J. Temple", "Michael Koss", "Kriti Kamal Gupta", "Hsian-Kuang Chang", "Yaherlyn Diaz", "Dragana Illic", "Kristína Kallová", "Elena Shablovinskaya"], "title": "Multi-wavelength properties of changing-state active galactic nuclei: I. the evolution of soft excess and X-ray continuum", "comment": "13 pages, 8 figures, 4 tables. Accepted for publication in Astronomy & Astrophysics", "summary": "Changing-state active galactic nuclei (CSAGNs) exhibit rapid variability, with mass accretion rates that can change by several orders of magnitude in a few years. This provides us with a unique opportunity to study the evolution of the inner accretion flow almost in real time. Here, we used over 1000 observations to study the broadband X-ray spectra of a sample of five CSAGNs, spanning three orders of magnitude in Eddington ratio ($λ_{\\rm Edd}$), using phenomenological models to trace the evolution of key spectral components. We derive several fundamental parameters, such as the photon index, soft excess strength, reflection strength, and luminosities of the soft excess and primary continuum. We find that the soft excess and primary continuum emissions show a very strong positive correlation ($p \\ll 10^{-10}$), suggesting a common physical origin. The soft excess strength does not show any dependency on the reflection parameter, suggesting that in these objects the soft excess is not dominated by a blurred ionized reflection process. On the other hand, the strength of the soft excess is found to be strongly positively correlated with the Eddington ratio ($p \\ll 10^{-10}$), and we find that the soft excess vanishes below $\\log λ_{\\rm Edd} \\sim -2.5$. Moreover, we find a clear `V'-shaped relation for $Γ-λ_{\\rm Edd}$, with a break at $\\log λ_{\\rm Edd} = -2.47 \\pm 0.09$. Our findings indicate a change in the geometry of the inner accretion flow at low Eddington ratios, and that the soft excess is primarily produced via warm Comptonization."}
{"id": "2601.07425", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2601.07425", "abs": "https://arxiv.org/abs/2601.07425", "authors": ["Long Wang", "David M. Hernandez", "Zepeng Zheng", "Wanhao Huang"], "title": "A free-fall-based switching criterion for P^3 T N-body methods in collisional stellar systems", "comment": "18 pages, 22 figures, accept for publication in ApJ", "summary": "The P$^3$T scheme is a hybrid method for simulating gravitational $N$-body systems. It combines a fast particle-tree (PT) algorithm for long-range forces with a high-accuracy particle-particle (PP, direct $N$-body) solver for short-range interactions. Preserving both PT efficiency and PP accuracy requires a robust PT-PP switching criterion. We introduce a simple free-fall-based switching criterion for general stellar systems, alongside the commonly used velocity-dispersion-based ($σ$-based) criterion. Using the \\textsc{petar} code with the P$^3$T scheme and slow-down algorithmic regularization for binaries and higher-order multiples, we perform extensive simulations of star clusters to evaluate how each criterion affects energy conservation and binary evolution. For systems in virial equilibrium, we find that the free-fall-based criterion is generally more accurate for low-$σ$ or loose clusters containing binaries, whereas the $σ$-based criterion is better suited for high-$σ$ systems. Under subvirial or fractal initial conditions, both criteria struggle to maintain high energy conservation; however, the free-fall-based criterion improves as the tree timestep is reduced, whereas the $σ$-based degrades due to its low-accuracy treatment of two-body encounters."}
{"id": "2601.07357", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.07357", "abs": "https://arxiv.org/abs/2601.07357", "authors": ["Roman Krivonos", "Alexey Vikhlinin", "Andrei Bykov", "Sergey Sazonov", "Maïca Clavel"], "title": "Direct detection of the non-thermal X-ray emission from the Arches star cluster", "comment": "9 pages, 7 figures, 3 tables. Accepted for publication in Astronomy Letters", "summary": "The compact stellar clusters have emerged as particularly promising candidates for cosmic rays (CR) accelerators. The star clusters, recently observed in gamma-rays, are also known sources of non-thermal X-ray emission, which is due to synchrotron or inverse-Compton scattering of relativistic electrons. Thus, the search for the non-thermal X-ray emission from stellar clusters is of particular interest. Until recent time the X-ray emission of the Arches star cluster in the Galactic Center was mixed with non-thermal emission of the surrounding molecular cloud, associated with reflection of hard X-ray irradiation. This reflected emission has been observed to fade, giving us a chance to characterize intrinsic non-thermal emission of the Arches cluster. In this work we demonstrate that Fe K_alpha line emission at 6.4 keV, attributed to the reflected non-thermal emission of the molecular cloud in 2000-2010, is not detected in deep observations with XMM-Newton in 2020 and Chandra in 2022, leaving stellar cluster well isolated. We showed that the Arches non-thermal emission is localized in the cluster's core and characterized by a relatively weak, hard (Gamma~1.5) power-law spectral continuum with 2-10 keV flux of ~10E-13 ergs/s/cm^2."}
{"id": "2601.07439", "categories": ["astro-ph.IM", "cs.DC"], "pdf": "https://arxiv.org/pdf/2601.07439", "abs": "https://arxiv.org/abs/2601.07439", "authors": ["Julián Garrido", "Susana Sánchez", "Edgar Ribeiro João", "Roger Ianjamasimanana", "Manuel Parra", "Lourdes Verdes-Montenegro"], "title": "Advanced computing for reproducibility of astronomy Big Data Science, with a showcase of AMIGA and the SKA Science prototype", "comment": "18 pages, 3 figures. Proceedings of the Square Kilometre Array - Cutting Edge Astronomical Facilities & Advanced Computing, 2025 Astrophysics and space Science Series (to be published by 2026)", "summary": "The Square Kilometre Array Observatory (SKAO) faces un- precedented technological challenges due to the vast scale and complexity of its data. This paper provides an overview of research by the AMIGA group to address these computing and reproducibility challenges. We present advancements in semantic data models, analysis services integrated into federated infrastructures, and the application to astronomy studies of techniques that enhance research transparency. By showcasing these astronomy work, we demonstrate that achieving reproducible science in the Big Data era is feasible. However, we conclude that for the SKAO to succeed, the development of the SKA Regional Centre Network (SRCNet) must explicitly incorporate these reproducibility requirements into its fundamental architectural design. Embedding these standards is crucial to enable the global community to conduct verifiable and sustainable research within a federated environment."}
{"id": "2601.07387", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.07387", "abs": "https://arxiv.org/abs/2601.07387", "authors": ["Filippo Bolis", "Emanuele Sobacchi", "Fabrizio Tavecchio"], "title": "Temporal variability of polarization in blazars", "comment": "11 pages, 6 figures. Accepted for publication in A&A", "summary": "We investigate the temporal variability of polarization of synchrotron radiation from blazar jets. Multiwavelength observations revealed high-amplitude rotations of the electric vector position angle (EVPA), both in the optical and in the X-rays. More often, the polarization degree and the EVPA show a seemingly erratic variability. To interpret these observations, we present a geometric and deterministic model in which off-axis, compact emitting features (i.e.,~blobs) propagate along the jet with the local velocity of the flow. The dynamics of the blobs is determined by the jet electromagnetic fields, which are calculated self-consistently using an analytical model of magnetically dominated outflows. The jet is axisymmetric, and its electromagnetic fields do not have a turbulent component. We show that the observed polarization is sensitive to the initial spatial configurations of the blobs. For the same jet structure, we observe several remarkably complex polarization patterns, including large EVPA rotations of $180^{\\circ}$ or more in both directions and more erratic fluctuations. Simultaneous high-amplitude variations of the polarization degree and the EVPA can coincide with peaks of the observed luminosity. However, seemingly uncorrelated variations are also possible. We discuss the feasibility of constraining the particle acceleration mechanism from multifrequency polarimetric observations."}
{"id": "2601.07708", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2601.07708", "abs": "https://arxiv.org/abs/2601.07708", "authors": ["Anthony Mallama", "Richard E. Cole", "Hui Zhi", "Brad Young", "Jay Respler", "Olga Zamora", "Michelle Dadighat"], "title": "Brightness Characterization and Modeling for Amazon Leo Satellites", "comment": "This manuscript was reviewed by two referees assigned by the IAU Centre for the Protection of the Dark and Quiet Sky", "summary": "The mean apparent magnitude of Amazon Leo satellites is 6.28 based on 1,938 observations. For spacecraft in their operational mode, 92% exceeded the brightness limit recommended by the IAU for interference with research, while 25% distract from aesthetic appreciation of the night sky. The reflective characteristics are similar to Version 1 Starlink spacecraft."}
{"id": "2601.07394", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.07394", "abs": "https://arxiv.org/abs/2601.07394", "authors": ["Toshiki Sato", "Shin-ichiro Fujimoto", "Koji Mori", "Jun Kurashima", "Hiroshi Nakajima", "Paul P. Plucinsky", "Manan Agarwal", "Liyi Gu", "Adam Foster", "Kai Matsunaga", "Hiroyuki Uchida", "Aya Bamba", "Jacco Vink", "Yukikatsu Terada", "Hironori Matsumoto", "Lia Corrales", "Hiroshi Murakami", "Satoru Katsuda", "Makoto Sawada", "Haruto Sonoda", "Ehud Behar", "Masahiro Ichihashi", "Hiroya Yamaguchi"], "title": "Asymmetric distribution of Fe-peak elements in Cassiopeia A revealed by XRISM", "comment": "13 pages, 4 figures, 2 tables, accepted for publication in ApJ", "summary": "The elemental abundances of the Fe-peak elements (such as Cr, Mn, Fe and Ni) and Ti are important for understanding the environment of explosive nuclear burning for the core-collapse supernovae (CC SNe). In particular, the supernova remnant Cassiopeia A, which is well known for its asymmetric structure, contains three ``Fe-rich blobs,'' and the composition of the Fe-peak elements within these structures could be related to the asymmetry of the supernova explosion. We report a highly asymmetric distribution of the Fe-peak elements in Cassiopeia A as revealed by XRISM observations. We found that the southeastern Fe-rich region has a significant Mn emission above the 4$σ$ confidence level, while the northwestern Fe-rich region has no clear signature. In addition to the significant difference in Mn abundance across these regions, our observations show that the Ti/Fe, Mn/Cr, and Ni/Fe ratios vary from region to region. The observed asymmetric distribution of Fe-peak elements could be produced by (1) the mixing of materials from different burning layers of the supernova, (2) the asymmetric distribution of the electron fraction in the progenitor star and/or (3) the local dependence of the neutrino irradiation in the supernova innermost region. Future spatially resolved spectroscopy of Cassiopeia A using X-ray microcalorimeters will enable more detailed measurements of the distribution and composition of these elements, providing a unique tool for testing asymmetric supernova physics."}
{"id": "2601.06417", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2601.06417", "abs": "https://arxiv.org/abs/2601.06417", "authors": ["Simon Chiche", "Simona Toscano", "Krijn D. de Vries"], "title": "In-ice Radio Signatures of Cosmic Ray Particle Cascades", "comment": "20 pages, 16 figures", "summary": "To detect ultra-high-energy neutrinos, experiments such as the Askaryan Radio Array and the Radio Neutrino Observatory in Greenland target the radio emission induced by these particles as they cascade in the ice, using deep in-ice antennas at the South Pole or in Greenland. A crucial step toward this goal is the characterization of the in-ice radio emission from cosmic-ray-induced particle showers. These showers form a primary background for neutrino searches, but can also be used to validate the detection principle and provide calibration signals for in-ice radio detectors. In this work, we use the Monte-Carlo framework FAERIE to perform the first characterization of cosmic ray signals with simulations that incorporate both their in-air and in-ice emissions. We investigate cosmic ray signatures such as their radiation energy, timing, polarization and frequency spectrum and quantify how they depend on shower properties. These results provide key guidelines for cosmic-ray identification and cosmic-ray neutrino discrimination in future in-ice radio experiments."}
{"id": "2601.07450", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.07450", "abs": "https://arxiv.org/abs/2601.07450", "authors": ["Mridweeka Singh", "Devendra K. Sahu", "Raya Dastidar", "Rishabh Singh Teja", "Anjasha Gangopadhyay", "G. C. Anupama", "D. Andrew Howell", "K. Azalee Bostroem", "Curtis McCully", "Jamison Burke", "Arti Joshi", "Daichi Hiramatsu", "Hyobin Im", "Shubham Srivastav", "Kuntal Misra"], "title": "A Study of Two Type IIb Supernovae: SNe 2008aq and 2019gaf", "comment": "14 pages, 16 figures, accepted for publication in Monthly Notices of the Royal Astronomical Society", "summary": "We present photometric and spectroscopic studies of two core-collapse supernovae (SNe) 2008aq and 2019gaf in the optical wavelengths. Light curve and spectral sequence of both the SNe are similar to those of other Type IIb SNe. The pre-maximum spectrum of SN~2008aq showed prominent H $α$ lines, the He lines started appearing in the near maximum spectrum. The near maximum spectrum of SN~2019gaf shows shallow H$α$ absorption and He lines with almost similar strength. Both the SNe show transition from hydrogen-dominated spectra to helium-dominated spectra within a month after maximum brightness. The velocity evolution of SN~2008aq matches well with those of other well-studied Type IIb SNe, while SN~2019gaf shows higher velocities. Close to maximum light, the H $α$ and He I line velocities of SN~2019gaf are $\\sim$ 2000 km sec$^{-1}$ and $\\sim$ 4000 km sec$^{-1}$ higher than other well-studied Type IIb SNe. Semi-analytical modeling indicates SN~2019gaf to be a more energetic explosion with a smaller ejecta mass than SN~2008aq. The zero-age main-sequence (ZAMS) mass of the progenitor estimated using the nebular spectra of SN~2008aq ranges between 13 to 20 M$_\\odot$, while for SN~2019gaf, the inferred ZAMS mass is between 13 to 25 M$_\\odot$. The [O I] to [Ca II] lines flux ratio favors a less massive progenitor star in a binary system for both the SNe."}
{"id": "2601.06418", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2601.06418", "abs": "https://arxiv.org/abs/2601.06418", "authors": ["Simon Chiche", "Olivier Martineau-Huynh", "Matias Tueros", "Krijn D. de Vries"], "title": "Radio Morphing: Fast computation of inclined air shower radio emission", "comment": "13 pages, 9 figures", "summary": "The preparation of next-generation large-scale radio experiments requires running a fast and efficient number of simulations to explore multiple detector configurations over vast areas and develop novel methods for the reconstruction of air shower parameters. While Monte Carlo simulations are accurate and reliable tools, they are too computationally expensive to explore the full parameter space of these new detectors within a reasonable timescale. We introduce a new version of Radio Morphing, a semi-analytical tool designed to simulate the radio emission of any cosmic-ray induced air shower with zenith angle $θ>60^{\\circ}$, at any desired antenna position, from the simulation data of a few reference showers at given positions. We present the latest performances of Radio Morphing which now provides simulation of air shower radio signals with average relative differences on the peak amplitude below $17\\%$ on raw traces, below $15\\%$ with a $3σ$ trigger threshold, below $13\\%$ in the $[50-200]\\,\\rm MHz$ band, and even below $\\sim 10\\%$ in the $[30-80]\\,\\rm MHz$ band. These results are combined with a computation time reduced by more than four orders of magnitude, compared to standard Monte Carlo simulations."}
{"id": "2601.07491", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.07491", "abs": "https://arxiv.org/abs/2601.07491", "authors": ["Gang Cao", "Xiongbang Yang"], "title": "The combined X-ray and $γ$-ray modeling of millisecond pulsars PSR J0030+0451 in the dissipative magnetospheres", "comment": "Accepted by ApJ", "summary": "Modeling of the NICER X-ray light curves of millisecond pulsars PSR J0030+0451 provides a strong evidence for the existence of non-dipole magnetic fields. We study the X-ray and $γ$-ray emission of PSR J0030+0451 in the dissipative dipole plus off-centred quadrupole magnetospheres. The dissipative FF+AE dipole magnetospheres by combining force-free (FF) and Aristotelian electrodynamics (AE) are solved by a 3D pseudo-spectral method in the rotating coordinate system. We use the FF+AE dipole plus off-centred quadrupole fields with minimum free parameters to reproduce two hotspot configurations found by the NICER observations. The X-ray and $γ$-ray emission from PSR J0030+0451 are simultaneously computed by using a ray-tracing method and a particle trajectory method. The modelled X-ray and $γ$-ray emission is then directly compared with those of PSR J0030+0451 from the NICER and Fermi observations. Our results can well reproduce the observed trends of the NICER X-ray and Fermi $γ$-ray emission for PSR J0030+0451."}
{"id": "2601.07501", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.07501", "abs": "https://arxiv.org/abs/2601.07501", "authors": ["Ralf Kissmann", "David Huber", "Philipp Gschwandtner"], "title": "High-resolution simulations of non-thermal emission from LS 5039", "comment": "15 pages, 14 figures, accepted for publication in A&A", "summary": "In a previous study, we investigated the relativistic wind dynamics in the LS 5039 system. In this work, we analyse energetic-particle transport within this modelling context, where we simulate the high-energy particle distribution and ensuing emission of non-thermal radiation. From these high-resolution simulations, we compute the non-thermal emission from this system and compare it to corresponding observations. We modelled the LS 5039 system assuming a wind-driven scenario. Our numerical model uses a joint simulation of the dynamical wind interaction together with the transport of energetic leptons from the shocked pulsar wind. We computed the non-thermal emission from this system in a post-processing step from the resulting distribution of energetic leptons. In this computation, we took into account the synchrotron and inverse Compton emission, relativistic beaming, and γγ-absorption in the stellar radiation field. We investigated the dynamical variation of the energetic particle spectra on both orbital and on short timescales. Our model successfully reproduces many of the spectral features of LS 5039. We also find a better correspondence between our predicted orbital light curves and the corresponding observations in soft x-rays, low-energy, and high-energy gamma rays than in our previous modelling efforts. We find that our high-resolution and large-scale simulations can successfully capture the relevant parts of the wind-collision region that are related to particle acceleration and emission of non-thermal radiation. The quality of the fit strengthens the wind-driven assumption underlying our model. Desirable extensions for the future include a dynamical magnetic-field model for the synchrotron regime, a revision of our injection parameters, and a consideration of an additional hadronic component that could explain recent observations in the 100~TeV regime."}
{"id": "2601.07542", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.07542", "abs": "https://arxiv.org/abs/2601.07542", "authors": ["Zexi Niu", "Ning-chen Sun", "Emmanouil Zapartas", "Conor L. Ransome", "Justyn R. Maund", "Cesar Rojas-Bravo", "Jifeng Liu"], "title": "Revealing the diversity of Type IIn supernova progenitors through their environments", "comment": "Submitted to ApJ. 15 pages plus 16 pages for Appendix", "summary": "Type IIn supernovae (SNe IIn) are hydrogen-rich explosions embedded in dense circumstellar medium (CSM), which gives rise to their characteristic narrow hydrogen emission lines. The nature of their progenitors and pre-explosion mass loss remains, however, poorly understood. Using high-resolution Hubble Space Telescope (HST) imaging, we analyze the local stellar environments of a volume-limited sample (z < 0.02) of 31 SNe IIn. The environments of SNe IIn are found to be very diverse; the SN could reside within a star-forming region (Class 1), outside a star-forming region (Class 2), or in much older environments without any obvious signs of star formation (Class 3). The bright SNe IIn (Mpeak < -19.5 mag) predominantly occur in Class 1 environments, indicative of very massive progenitors, while the faint SNe IIn (Mpeak < -15.5 mag) are associated with Classes 2 and 3 environments, suggesting the least massive progenitors. Meanwhile, normal SNe IIn with -19.5 < Mpeak < -15.5 mag occur in all three types of environments, suggesting a diversity in their progenitor mass, lifetime, and evolutionary pathways. Moreover, the directly detected SN IIn progenitors are systematically brighter and/or bluer than the youngest stellar populations in their environments, suggesting that they were either in a non-quiescent state when observed or had experienced binary interactions. These results point to a significantly diverse origin for progenitors of SNe IIn, spanning a wide range of masses, evolutionary stages, and potential binary interaction histories."}
{"id": "2601.07560", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.07560", "abs": "https://arxiv.org/abs/2601.07560", "authors": ["G. S. Bisnovatyi-Kogan", "E. A. Patraman"], "title": "Uniform models of neutron and quark (strange) stars in General Relativity", "comment": "11 pages, 10 figures", "summary": "Models of neutron and strange stars are considered in the approximation of a uniform density distribution. A universal algebraic equation, valid for any equation of state, is used to find the approximate mass of a star of a given density without resorting to the integration of differential equations. Equations of state for neutron stars had been taken for degenerate neutron gas and for more realistic ones, used by Bethe, Malone, Johnson (1975). Models of homogeneous strange stars for the equation of state in the \"quark bag model\" have a simple analytical solution. The solutions presented in the paper for various equations of state differ from the exact solutions obtained by the numerical integration of differential equations by at most $ \\sim 20 \\%$.\n  The formation of strange stars is examined as a function of the deconfinement boundary (DB), at which quarks become deconfined. Existing experimental data indicate that matter reaches very high densities in the vicinity of the DB. This imposes strong constraints on the maximum mass of strange stars and prohibits their formation at the final stages of stellar evolution, because the limiting mass of neutron stars is substantially higher and corresponds to considerably lower matter densities."}
{"id": "2601.07589", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.07589", "abs": "https://arxiv.org/abs/2601.07589", "authors": ["Nicolas J. Bacon", "Alex J. Cooper", "Dimitrios Kantzas", "James H. Matthews", "Rob Fender"], "title": "Cosmic rays, gamma rays and neutrinos from discrete black hole X-ray binary ejecta", "comment": "10 pages, 7 figures. Accepted by MNRAS", "summary": "The origin of cosmic rays from outside the Solar system are unknown, as they are deflected by the interstellar magnetic field. Supernova remnants are the main candidate for cosmic rays up to PeV energies but due to lack of evidence, they cannot be concluded as the sources of the most energetic Galactic CRs. We investigate discrete ejecta produced in state transitions of black hole X-ray binary systems as a potential source of cosmic rays, motivated by recent $>100$ TeV $γ$-ray detections by LHAASO. Starting from MAXI J1820+070, we examine the multi-wavelength observations and find that efficient particle acceleration may take place (i.e. into a robust power-law), up to $\\sim2\\times 10^{16}μ^{-1/2}$ eV, where $μ$ is the ratio of particle energy to magnetic energy. From these calculations, we estimate the global contribution of ejecta to the entire Galactic spectrum to be $\\sim1\\%$, with the cosmic ray contribution rising to $\\sim5\\%$ at PeV energies, assuming roughly equal energy in non-thermal protons, non-thermal electrons and magnetic fields. In addition, we calculate associated $γ$-ray and neutrino spectra of the MAXI J1820+070 ejecta to investigate new detection methods with CTAO, which provide strong constraints on initial ejecta size of order $10^7$ Schwarzschild radii ($10^{-5}$ pc) assuming a period of adiabatic expansion."}
{"id": "2601.07592", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.07592", "abs": "https://arxiv.org/abs/2601.07592", "authors": ["Colin J. Clark", "Serena Valtolina", "Lars Nieder", "Rutger van Haasteren"], "title": "Timing Gamma-ray Pulsars using Gibbs Sampling", "comment": "14 pages, 5 figures", "summary": "Timing analyses of gamma-ray pulsars in the Fermi Large Area Telescope data set can provide sensitive probes of many astrophysical processes, including timing noise in young pulsars, orbital period variations in redback binaries, and the stochastic gravitational wave background (GWB). These goals can require careful accounting of stochastic noise processes, but existing methods developed to achieve this in radio pulsar timing analyses cannot be immediately applied to the discrete gamma-ray arrival time data. To address this, we have developed a new method for timing gamma-ray pulsars, in which the timing model fit is transformed into a weighted least squares problem by randomly assigning each photon to an individual Gaussian component of a template pulse profile. These random assignments are then numerically marginalised over through a Gibbs sampling scheme. This method allows for efficient estimation of timing and noise model parameters, while taking into account uncertainties in the pulse profile shape. We simulated Fermi-LAT data sets for gamma-ray pulsars with power-law timing noise processes, showing that this method provides robust estimates of timing noise parameters. We also describe a Gaussian-process model for orbital period variations in black-widow and redback binary systems that can be fit using this new timing method. We demonstrate this method on the black-widow binary millisecond pulsar B1957+20, where the orbital period varies significantly over the LAT data, but which provides one of the most stringent gamma-ray upper limits on the GWB."}
{"id": "2601.07595", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.07595", "abs": "https://arxiv.org/abs/2601.07595", "authors": ["The IceCube Collaboration", "The LIGO Scientific Collaboration", "The Virgo Collaboration", "The KAGRA Collaboration"], "title": "Deep Search for Joint Sources of Gravitational Waves and High-Energy Neutrinos with IceCube During the Third Observing Run of LIGO and Virgo", "comment": null, "summary": "The discovery of joint sources of high-energy neutrinos and gravitational waves has been a primary target for the LIGO, Virgo, KAGRA, and IceCube observatories. The joint detection of high-energy neutrinos and gravitational waves would provide insight into cosmic processes, from the dynamics of compact object mergers and stellar collapses to the mechanisms driving relativistic outflows. The joint detection of multiple cosmic messengers can also elevate the significance of the common observation even when some or all of the constituent messengers are sub-threshold, i.e. not significant enough to declare their detection individually. Using data from the LIGO, Virgo, and IceCube observatories, including sub-threshold events, we searched for common sources of gravitational waves and high-energy neutrinos during the third observing run of Advanced LIGO and Advanced Virgo detectors. Our search did not identify significant joint sources. We derive constraints on the rate densities of joint sources. Our results constrain the isotropic neutrino emission from gravitational-wave sources for very high values of the total energy emitted in neutrinos (> $10^{52} - 10^{54}$ erg)."}
{"id": "2601.07649", "categories": ["astro-ph.HE", "astro-ph.SR", "physics.space-ph"], "pdf": "https://arxiv.org/pdf/2601.07649", "abs": "https://arxiv.org/abs/2601.07649", "authors": ["Hui-Ming Zhang", "Su-Jie Lin", "Jie Feng", "Jie-Teng Jiang", "Li-Li Yang"], "title": "A Unified Charge-Dependent Modulation Model for AMS-02 Proton and Antiproton Fluxes during Solar Minimum", "comment": "10 pages, 8 figures", "summary": "We develop a unified charge-dependent solar modulation model by solving the three-dimensional Parker transport equation, incorporating a realistic wavy heliospheric current sheet to treat drift effects self-consistently. Using a local interstellar spectrum from GALPROP constrained by Voyager data, we fit the model to time-resolved proton and antiproton fluxes measured by the Alpha Magnetic Spectrometer - 02 (AMS-02) during the solar-quiet period (May 2011 to June 2022). To enable rapid parameter scans, we employ neural-network-based surrogate models to compute propagation and modulation matrices efficiently. The results demonstrate that the model simultaneously describes the observed proton and antiproton fluxes with physically reasonable parameters, providing a unified account of charge-dependent modulation."}
{"id": "2601.07688", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.07688", "abs": "https://arxiv.org/abs/2601.07688", "authors": ["Zheng-Hang Yu", "Chen-Wei Wang", "Shao-Lin Xiong", "Shuang-Xi Yi", "Wen-Long Zhang", "Wen-Jun Tan", "Yan-Qiu Zhang", "Chao Zheng", "Hao-Xuan Guo", "Jia-Cong Liu", "Yang-Zhao Ren", "Yue Wang", "Sheng-Lun Xie", "Wang-Chen Xue", "Jin-Peng Zhang", "Peng Zhang", "Zheng-Hua An", "Ce Cai", "Pei-Yi Feng", "Min Gao", "Ke Gong", "Dongya Guo", "Yue Huang", "Bing Li", "Cheng-Kui Li", "Xiao-Bo Li", "Xin-Qiao Li", "Ya-Qing Liu", "Xiao-Jing Liu", "Xiang Ma", "Wenxi Peng", "Rui Qiao", "Li-Ming Song", "Jin Wang", "Jin-Zhou Wang", "Ping Wang", "Xiang-Yang Wen", "Shuo Xiao", "Sheng Yang", "Shu-Xu Yi", "Qi-Bin Yi", "Da-Li Zhang", "Fan Zhang", "Shuang-Nan Zhang", "Yan-Ting Zhang", "Zhen Zhang", "Xiao-Yun Zhao", "Yi Zhao", "Shi-Jie Zheng"], "title": "Brightest GRB flare observed in GRB 221009A: bridge the last gap between flare and prompt emission in GRB", "comment": "27 pages, 5 figures, accepted for publication in ApJL", "summary": "Flares are usually observed during the afterglow phase of Gamma-Ray Bursts (GRBs) in soft X-ray, optical and radio bands, but rarely in gamma-ray band. Despite the extraordinary brightness, GECAM-C has accurately measured both the bright prompt emission and flare emission of GRB 221009A without instrumental effects, offering a good opportunity to study the relation between them. In this work, we present a comprehensive analysis of flare emission of GRB 221009A, which is composed of a series of flares. Among them, we identify an exceptionally bright flare with a record-breaking isotropic energy $E_{\\rm iso} = 1.82 \\times 10^{53}$ erg of GRB flares. It exhibits the highest peak energy ever detected in GRB flares, $E_{\\rm peak} \\sim 300$ keV, making it a genuine gamma-ray flare. It also shows rapid rise and decay timescales, significantly shorter than those of typical X-ray flares observed in soft X-ray or optical band, but comparable to those observed in prompt emissions. Despite these exceptional properties, the flare shares several common properties with typical GRB flares. We note that this is the first observation of a GRB flare in the keV-MeV band with sufficiently high temporal resolution and high statistics, which bridges the last gap between prompt emission and flare."}
{"id": "2601.07745", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.07745", "abs": "https://arxiv.org/abs/2601.07745", "authors": ["Diego Hernando Gonzalez-Buitrago", "Maria Teresa Garcia-Diaz", "Andres Eduardo Montoya-Olivo", "Santiago Sanchez-Sanjuan", "Hernan Avila-Mogollon"], "title": "A COLIBRI Photometric Study of SN 2025bvm: A Normal, Slowly Declining Type Ia Supernova", "comment": "9 pages, 9 figures,", "summary": "We present 121 days of multi-band (\\Bband, \\gband, \\rband, \\iband) optical photometry of the Type Ia supernova SN 2025bvm, obtained with the COLIBRI telescope at OAN-SPM. The light curves show a photometric decline of $Δm_{15}(B) = 0.867 \\pm 0.051$~mag, characteristic of a slow-declining Type Ia supernova. After correcting for host galaxy extinction ($E(B-V)_{host} = 0.308 \\pm 0.030$~mag) and adopting a distance of 70~Mpc, we derive a peak absolute magnitude of $M_B = -19.13 \\pm 0.40$~mag. This luminosity is fully consistent with its slow decline rate, placing SN 2025bvm within the population of normal Type Ia supernovae. We conclude that SN 2025bvm is a normal Type Ia supernova, whose photometric properties, such as a slow late-time decline and a prominent \\iband-band secondary maximum, suggest an explosion that resulted in a particularly massive ejecta."}
