{"id": "2601.22220", "categories": ["astro-ph.HE", "gr-qc"], "pdf": "https://arxiv.org/pdf/2601.22220", "abs": "https://arxiv.org/abs/2601.22220", "authors": ["Thomas W. Baumgarte", "Stuart L. Shapiro"], "title": "Subsolar mass black holes from stellar collapse induced by primordial black holes", "comment": "5 pages", "summary": "While no gravitational-wave detection of subsolar mass black holes has been confirmed to date, a number of candidate detections invite us to speculate on the origin of such black holes should a detection be confirmed. It is generally assumed that the observation of a black hole with subsolar mass $M_{\\rm obs}$ would provide strong evidence for primordial black holes (PBHs). The mass $M_{\\rm PBH}$ of the PBH, however, does not necessarily have to be equal to $M_{\\rm obs}$, as it would in what we term a ``direct PBH scenario\". Instead, a black hole of mass $M_{\\rm obs}$ may form in a capture of a much smaller primordial black hole, $M_{\\rm PBH} \\ll M_{\\rm obs}$, by a dwarf star of mass $M_* \\simeq M_{\\rm obs}$, followed by the total consumption of the star by the PBH. We provide some rough estimates and demonstrate that such an ``indirect PBH scenario\" may also lead to significant populations of black holes with mass $M_{\\rm obs}$, especially in dwarf galaxies, and may be able to explain rare subsolar mass events."}
{"id": "2601.22229", "categories": ["astro-ph.HE", "astro-ph.CO", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2601.22229", "abs": "https://arxiv.org/abs/2601.22229", "authors": ["Philip F. Hopkins", "Emily Silich", "Jack Sayers", "Sam B. Ponnada", "Isabel Sands"], "title": "Observational Implications of Cosmic Ray-Inverse Compton 'Boosted' Cool Cores in Clusters", "comment": "48 pages, 31 figures. Key results/observations summarized in Table 1, which refers readers to the relevant sections for different comparisons. Submitted to the Open Journal of Astrophysics. Comments welcome", "summary": "X-ray luminous cool-core (CC) galaxy clusters contain powerful cosmic ray (CR) sources. High-energy CRs powering GHz synchrotron lose energy rapidly, but long-lived (~Gyr-old) populations of 0.1-1 GeV CRs persist, propagating to ~100 kpc distances and radiating via inverse-Compton (IC) scattering of CMB photons. We explore observable consequences of such CR-IC emission. This produces remarkably thermal X-ray spectra, which could contribute significantly to emission in CC centers. These naturally connect to ultra-steep radio sources and radio mini-halos at younger ages, but become undetectable in most radio, hard-X-ray, and $γ$-ray searches (though future imaging may detect them), while reproducing apparent density, temperature, entropy, and mass deposition rates of CCs. This would provide an alternative resolution of the cooling flow problem: clusters may appear as strong CCs because of strong CR-IC, while not actually cooling so rapidly. This predicts many observed correlations between AGN/jet properties, radio galaxy and minihalo properties, cooling radii, cavity radii and apparent X-ray cooling luminosity $L_{\\rm X,cool}$. Since $L_{\\rm X,cool}$ is actually from CR-IC, the observed radio-X-ray ($L_{\\rm radio}-L_{\\rm X,cool}$), apparent cavity power ($P_{\\rm cav}-L_{\\rm X,cool}-L_{\\rm radio}$), and strong CC-AGN correlations are predicted without free parameters. Since CR-IC leads to X-ray overestimates of thermal pressure, the ratio of SZ to X-ray pressures should drop in CC centers. CR-IC also suppresses abundances inferred from X-ray relative to optical/UV measurements in CC centers. Both of these appear to be seen in sufficiently-resolved CCs. Effects on cluster cosmology, hydrostatic mass estimation, and non-thermal pressure/turbulence estimators are small. Redshift evolution of CC surface brightness profiles could provide strong constraints or imply CR-IC at high-$z$."}
{"id": "2601.22251", "categories": ["astro-ph.HE", "astro-ph.CO"], "pdf": "https://arxiv.org/pdf/2601.22251", "abs": "https://arxiv.org/abs/2601.22251", "authors": ["Sibel Döner", "Turgay Caglar", "Krista L. Smith", "Serap Ak", "Andrea Botteon", "M. Kiyami Erdim", "John A. ZuHone"], "title": "X-Ray Analysis of an Off-Axis Merger Stage Binary Galaxy Cluster: PSZ2 G279.79+39.09", "comment": "Accepted by the ApJ", "summary": "We present an X-ray analysis of the merging galaxy cluster system PSZ2 G279.79+39.09 ($z=0.29$) using archival XMM-Newton and Chandra observations. The surface brightness image is bimodal, elongated east-west with a projected core separation of $\\sim 1.35$ Mpc. We measure gas temperatures of 5.36 keV for the eastern subcluster (PSZ-E) and 5.44 keV for the western component (PSZ-W). Assuming isothermal intracluster gas, the hydrostatic masses are $\\log(M_{500}/M_\\odot)=14.76$ for PSZ-E and 14.54 for PSZ-W, implying a mass ratio of $\\sim 1:1.7$. PSZ-E shows X-ray concentration indices of $c_{40}/c_{400}=0.124$ and $c_{100}/c_{500}=0.278$, together with a centroid shift of $w=0.016$, indicating a disturbed halo that still hosts a compact cool core; PSZ-W is comparably disturbed even in its core. Both subclusters exhibit ICM asymmetries consistent with ram-pressure stripping, and PSZ-W displays an X-ray tail extending nearly to the outskirts of PSZ-E. The orientation and length of this tail support an off-axis merger geometry. Thermodynamic maps reveal a hot ($\\sim 7.3$ keV), high-pressure, high-entropy bridge between the cores. From the Rankine-Hugoniot temperature jump, we infer a Mach number $M=1.41^{+0.33}_{-0.30}$, consistent with a weak merger shock propagating at $1620^{+500}_{-420}$ km s$^{-1}$. These results indicate a merger with a non-zero impact parameter, likely observed near core passage ($\\lesssim 0.5$ Gyr before or after), with the pre-pericenter scenario slightly preferred based on the projected separation and thermodynamic structure."}
{"id": "2601.22266", "categories": ["astro-ph.HE", "hep-ph"], "pdf": "https://arxiv.org/pdf/2601.22266", "abs": "https://arxiv.org/abs/2601.22266", "authors": ["Mainak Mukhopadhyay", "Shigeo S. Kimura"], "title": "High energy neutrinos from pulsar-powered optical transients: LFBOTs as potential origin of the KM3NeT event KM3-230213A", "comment": "14 pages, 8 figures", "summary": "Recently, the KM3NeT Collaboration reported the detection of an ultra-high energy ($\\sim 220$ PeV) neutrino event, KM3-230213A. In this work, we perform a detailed investigation into whether this event could originate from the diffuse neutrino flux produced by a class of pulsar-powered optical transients. In particular, we consider populations of ordinary supernovae (SNe), super-luminous supernovae (SLSNe), and luminous fast blue optical transients (LFBOTs) with a newly formed magnetar as the central engine. We discuss both the thermal electromagnetic and non-thermal neutrino emission from such sources. We scan the parameter space of the dipolar magnetic field strength and the initial spin period to determine characteristic optical emission properties and lightcurve timescales of these transients. Additionally, our scan identifies which classes of these transients can reproduce the required diffuse flux level and neutrino energies. Combining our results, we conclude that a diffuse neutrino flux from a population of LFBOTs can explain the KM3NeT event. Therefore, pulsar-powered optical transients may serve as promising sources for the current and upcoming high-energy and ultra-high energy neutrino telescopes."}
{"id": "2601.23168", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2601.23168", "abs": "https://arxiv.org/abs/2601.23168", "authors": ["Samuel Day-Weiss", "Nicholas Galitzki", "Atsuto Takeuchi", "Kam Arnold", "Kathleen Harrington", "Masaya Hasegawa", "Bradley R. Johnson", "Akito Kusaka", "Aashrita Mangu", "Jack Orlowski-Scherer", "Lyman A. Page", "Yoshinori Sueno", "Osamu Tajima", "Alex Thomas", "Yuhan Wang", "Edward J. Wollack", "Kyohei Yamada"], "title": "The Simons Observatory: On-sky performance of radio-transparent multi-layer insulation (RT-MLI) using Styroace-II Styrofoam", "comment": "8 pages, 2 figures", "summary": "We present the on-sky performance of a Radio-Transparent Multi-Layer Insulation filter (RT-MLI) that uses Styroace-II styrofoam to reject ambient thermal radiation from entering a 0.42 m diameter aperture to a sub-100 mK bolometric detector array cooled by a dilution-refrigerator. We find that greater than 90% of the expected incident infra-red (IR) radiation is rejected, resulting in $<$12 W of measured transmitted power. Transmitted power in the detector passbands is consistent with a lower bound of 95%. We address filter design and placement, thermal loading, and mm-wave transmission."}
{"id": "2601.22309", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.22309", "abs": "https://arxiv.org/abs/2601.22309", "authors": ["Megan Wang", "Christos Panagiotou", "Kishalay De", "Erin Kara", "Megan Masterson", "Foteini Oikonomou"], "title": "Testing the Association of Supermassive Black Hole Infrared Flares and High-energy Neutrinos", "comment": "10 pages, 3 figures, accepted for publication by ApJL", "summary": "The physical origin of the observed cosmic neutrinos remains an open question and the subject of active research. While matter accretion onto supermassive black holes is long thought to accelerate particles to high energies, it has recently been suggested that tidal disruption events, and accretion flares in general, with prominent IR echoes can account for a fraction of the diffuse high-energy neutrino signal. Motivated by this result, we compile a sample of nearby accretion flares detected in the NEOWISE survey featuring strong IR echoes, and we cross-match it with the latest catalog of neutrino alerts, IceCat-1. We recover only a single spatial coincidence between the two catalogs, consistent with a chance coincidence. We find no temporal and spatial coincidences between the two samples, which, given the properties of our sample, appears to challenge previous conclusions. We discuss the physical implications of our results and potential future explorations."}
{"id": "2601.23176", "categories": ["astro-ph.IM", "astro-ph.EP", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2601.23176", "abs": "https://arxiv.org/abs/2601.23176", "authors": ["Christian Robles", "Suvrath Mahadevan"], "title": "HEP digital micromirror devices for precision solar spectroscopy", "comment": "14 pages, 11 figures. Author's version of Paper 13918-28 presented at SPIE Photonics West, Emerging Digital Micromirror Device Based Systems and Applications XVIII, January 2026. To appear in SPIE Proceedings Vol. 13918", "summary": "We present the motivation and early tests for a novel solar instrument that will harness the new High Efficiency Pixel (HEP) Texas Instruments DLP801RE Digital Micromirror Device (DMD) as a reconfigurable spatial light modulator. This design enables real-time, dynamic configuration of the field of view for targeted spectroscopy of magnetically active regions and full-disk observations. Optical efficiency was validated through simulations and laser testing. Destructive window removal allowed for detailed structural analysis, confirming the elimination of central vias present in previous models. We measured a contrast ratio of 250:1, currently limited by the evaluation board's duty cycle rather than the DMD itself. Furthermore, we successfully simulated artificial planetary transits, recovering depths ranging from gas giants to a 40 ppm rocky planet transit. These results demonstrate the HEP DMD's potential for high-precision solar and exoplanetary science applications."}
{"id": "2601.22392", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2601.22392", "abs": "https://arxiv.org/abs/2601.22392", "authors": ["Scott Hagen", "Chris Done", "Gabriele A. Matzeu", "Hirofumi Noda"], "title": "Unveiling BLR Structure in AGN with High Resolution X-Ray Spectra: An Analytic Approach to Wind Emission Line Profiles", "comment": "13 pages, 7 figures, 3 appendices. Re-submitted to A&A after addressing initial referee comments, comments welcome", "summary": "XRISM has provided an unprecedented view of the emission and absorption lines in the X-ray. Notably, early results showed significant complexity to the Fe-K$α$ line profile in AGN, with clear contributions from at least three emitting structures: an inner disc, intermediary broad line region (BLR) scale material, and an outer torus. This poses a new challenge for the modelling of the emission lines, as while fast sophisticated models exist for disc line-profiles, large scale-height material is typically much more complex. In this paper we aim to address this gap, by building a fully analytic model for the emission line profiles from a wind, aimed towards BLR scale material, motivated on previous reverberation studies suggesting a wind on the inner edge of the BLR. Our approach gives a physically motivated, yet computationally fast, model for the intermediary component to the Fe-K$α$ complex seen in the XRISM data. We demonstrate our model on the XRISM observations of NGC 4151 from the performance verification phase, showing that it gives a good description of the data, with physically reasonable parameters for BLR scale material. We also show that our model naturally gives the smooth line profile seen in the data, due to the large spatial extent of a wind. Finally, we make our model code public to the community, and name it xwind."}
{"id": "2601.23276", "categories": ["astro-ph.IM", "cs.CV", "cs.LG"], "pdf": "https://arxiv.org/pdf/2601.23276", "abs": "https://arxiv.org/abs/2601.23276", "authors": ["Shuhong Liu", "Xining Ge", "Ziying Gu", "Lin Gu", "Ziteng Cui", "Xuangeng Chu", "Jun Liu", "Dong Li", "Tatsuya Harada"], "title": "Denoising the Deep Sky: Physics-Based CCD Noise Formation for Astronomical Imaging", "comment": null, "summary": "Astronomical imaging remains noise-limited under practical observing constraints, while standard calibration pipelines mainly remove structured artifacts and leave stochastic noise largely unresolved. Learning-based denoising is promising, yet progress is hindered by scarce paired training data and the need for physically interpretable and reproducible models in scientific workflows. We propose a physics-based noise synthesis framework tailored to CCD noise formation. The pipeline models photon shot noise, photo-response non-uniformity, dark-current noise, readout effects, and localized outliers arising from cosmic-ray hits and hot pixels. To obtain low-noise inputs for synthesis, we average multiple unregistered exposures to produce high-SNR bases. Realistic noisy counterparts synthesized from these bases using our noise model enable the construction of abundant paired datasets for supervised learning. We further introduce a real-world dataset across multi-bands acquired with two twin ground-based telescopes, providing paired raw frames and instrument-pipeline calibrated frames, together with calibration data and stacked high-SNR bases for real-world evaluation."}
{"id": "2601.22464", "categories": ["astro-ph.HE", "astro-ph.IM", "gr-qc"], "pdf": "https://arxiv.org/pdf/2601.22464", "abs": "https://arxiv.org/abs/2601.22464", "authors": ["Tian-Xiao Wang", "Yan Wang", "Alejandro Torres-Orjuela", "Yi-Ren Lin", "Hui-Min Fan", "Verónica Vázquez-Aceves", "Yi-Ming Hu"], "title": "Constructing a gravitational wave analysis pipeline for extremely large mass ratio inspirals", "comment": "20 pages, 9 figures, submitted to PRD, comments welcome", "summary": "Extremely large mass-ratio inspirals (XMRIs), consisting of a brown dwarf orbiting a supermassive black hole, emit long-lived and nearly monochromatic gravitational waves in the millihertz band and constitute a promising probe of strong-field gravity and black-hole properties. However, dedicated data-analysis pipelines for XMRI signals have not yet been established. In this work, we develop, for the first time, a hierarchical semi-coherent search pipeline for XMRIs tailored to space-based gravitational-wave detectors, with a particular focus on the TianQin mission. The pipeline combines a semi-coherent multi-harmonic $\\mathcal{F}$-statistic with particle swarm optimization, and incorporates a novel eccentricity estimation method based on the relative power distribution among harmonics. We validate the performance of the pipeline using simulated TianQin data for a Galactic center XMRI composed of a brown dwarf and Sgr A*. For a three-month observation, the pipeline successfully recovers the signal and achieves high-precision parameter estimation, including fractional uncertainties of $<10^{-6}$ in the orbital frequency, $\\lesssim10^{-3}$ in the eccentricity, $\\lesssim2\\times10^{-3}$ in the black-hole mass, and $\\lesssim10^{-3}$ in the black-hole spin. Our framework establishes a practical foundation for future XMRI searches with space-based detectors and highlights the potential of XMRIs as precision probes of stellar dynamics and strong-field gravity in the vicinity of supermassive black holes."}
{"id": "2601.22464", "categories": ["astro-ph.HE", "astro-ph.IM", "gr-qc"], "pdf": "https://arxiv.org/pdf/2601.22464", "abs": "https://arxiv.org/abs/2601.22464", "authors": ["Tian-Xiao Wang", "Yan Wang", "Alejandro Torres-Orjuela", "Yi-Ren Lin", "Hui-Min Fan", "Verónica Vázquez-Aceves", "Yi-Ming Hu"], "title": "Constructing a gravitational wave analysis pipeline for extremely large mass ratio inspirals", "comment": "20 pages, 9 figures, submitted to PRD, comments welcome", "summary": "Extremely large mass-ratio inspirals (XMRIs), consisting of a brown dwarf orbiting a supermassive black hole, emit long-lived and nearly monochromatic gravitational waves in the millihertz band and constitute a promising probe of strong-field gravity and black-hole properties. However, dedicated data-analysis pipelines for XMRI signals have not yet been established. In this work, we develop, for the first time, a hierarchical semi-coherent search pipeline for XMRIs tailored to space-based gravitational-wave detectors, with a particular focus on the TianQin mission. The pipeline combines a semi-coherent multi-harmonic $\\mathcal{F}$-statistic with particle swarm optimization, and incorporates a novel eccentricity estimation method based on the relative power distribution among harmonics. We validate the performance of the pipeline using simulated TianQin data for a Galactic center XMRI composed of a brown dwarf and Sgr A*. For a three-month observation, the pipeline successfully recovers the signal and achieves high-precision parameter estimation, including fractional uncertainties of $<10^{-6}$ in the orbital frequency, $\\lesssim10^{-3}$ in the eccentricity, $\\lesssim2\\times10^{-3}$ in the black-hole mass, and $\\lesssim10^{-3}$ in the black-hole spin. Our framework establishes a practical foundation for future XMRI searches with space-based detectors and highlights the potential of XMRIs as precision probes of stellar dynamics and strong-field gravity in the vicinity of supermassive black holes."}
{"id": "2601.22465", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.22465", "abs": "https://arxiv.org/abs/2601.22465", "authors": ["Zhen Pan", "Dong Lai"], "title": "A Formation Crisis of Repeating Partial Tidal Disruption Events", "comment": "14 pages, 9 figures", "summary": "A number of candidate repeating partial tidal disruption events (rpTDEs) have been reported in recent years. If these events are confirmed, the high fraction of observed rpTDEs among all tidal disruption events (TDEs) is in tension with prediction of the loss cone channel. We further point out an inequality $M_\\bullet \\lesssim 4\\times 10^6 M_\\odot (T_{\\rm obt}/10\\ {\\rm yr})^{4/9}$ that must be satisfied for rpTDEs of solar type stars in the loss cone channel, where $M_\\bullet$ is the central supermassive black hole (SMBH) mass and $T_{\\rm obt}$ is the orbital period of the star. However the majority of reported rpTDE candidates potentially violate this inequality, indicating an alternative formation channel. In the commonly invoked Hills mechanism, the captured stars produced by tidal disruption of near-contact binaries can evade this inequality and may be the dominant source of rpTDEs. If the same process operates in the Galactic Center, there should exist a population of hypervelocity stars (HVSs) ejected with velocities as high as $3.6\\times 10^3 (M_\\bullet/10^6 M_\\odot)^{1/6}\\ {\\rm km\\ s}^{-1}$, which however have not been detected. A complete search for HVSs in the Milky Way will be critical for testing this prediction."}
{"id": "2601.22810", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2601.22810", "abs": "https://arxiv.org/abs/2601.22810", "authors": ["Kobelev P. G.", "Yanke V. G"], "title": "Approximation of the reception coefficients of cosmic rays neutron component for latitude measurement", "comment": "14 pages, 6 figures, 1 table, 12 references", "summary": "When solving scientific and applied problems, such as latitude monitoring, it is important to correctly exclude primary cosmic ray variations from observation data. Therefore, the purpose of this study was to develop and implement a method for correcting monitoring data, the key point of which was to obtain reception coefficients as a function of latitude. This resulted in an approximation of the rigidity dependence of the zeroth and first harmonic cosmic rays anisotropy coefficients, calculated for a ground-based cosmic ray detectors network. Analysis of the obtained results showed that the approximation was performed with high accuracy, and the results are suitable for use in latitude measurements during marine expeditions."}
{"id": "2601.22683", "categories": ["astro-ph.HE", "gr-qc", "hep-th"], "pdf": "https://arxiv.org/pdf/2601.22683", "abs": "https://arxiv.org/abs/2601.22683", "authors": ["Arthur G. Suvorov", "Kostas Glampedakis"], "title": "On the dynamics of magnetoviscous warped discs around compact objects", "comment": "19 pages, 10 figures, 1 table. Comments welcome !", "summary": "Accretion discs that are tilted with respect to their compact hosts can warp out-of-plane through general relativistic frame-dragging. Warp influences disc dynamics in ways that have been studied extensively, especially as regards instabilities that might lead to rapid angular-momentum cancellation between neighbouring rings of fluid and mass infall. We provide a review of warped-disc phenomena here, revisiting key hydrodynamical assumptions that impact calculations of the shear viscosity controlling instability thresholds. Relativistic effects at the level of gas-parcel orbits are included, as are external Lorentz forces applied by the compact primary's magnetic field. Semi-analytic analysis reveals that intense magnetic fields can bring about new branches of warp modes and avoided crossings that significantly reduce the perpendicular viscosity at sub-Eddington accretion rates. Critical strengths required for misaligned torques to tear a thin disc may thus relax for systems like neutron star X-ray binaries or radio-loud active galactic nuclei."}
{"id": "2601.22726", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.22726", "abs": "https://arxiv.org/abs/2601.22726", "authors": ["Cheng-Liang Jiao", "Liying Zhu", "Er-gang Zhao", "Xiang-dong Shi"], "title": "A unified framework for hot accretion flows with finite angular momentum: from Bondi-like to disc-like regimes", "comment": null, "summary": "Observations of X-ray luminous elliptical galaxies suggest that the accretion rate onto the central supermassive black hole can reach a substantial fraction of the Bondi rate. However, classical accretion theory applicable to such hot accretion flows treats spherically symmetric Bondi accretion and disc-like advection-dominated accretion flows (ADAFs) as two distinct limiting cases, lacking a unified framework for flows with finite angular momentum. In this work, we develop such a framework that continuously connects these two regimes. Our model naturally recovers the Bondi solution in the limit of vanishing angular momentum and approaches the properties of classical ADAFs at high angular momentum, while providing a physically well-defined description of the intermediate regime where neither limiting case is strictly applicable. We further demonstrate that the accretion rate is jointly regulated by the angular momentum of the ambient gas and the gas viscosity. For sufficiently large but physically reasonable viscosity, the accretion rate can remain at a significant fraction of the Bondi rate even in the presence of substantial gas rotation. These results offer a natural explanation for how such accretion rates can be sustained despite finite angular momentum in realistic galactic environments."}
{"id": "2601.22741", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.22741", "abs": "https://arxiv.org/abs/2601.22741", "authors": ["Justine Crook-Mansour", "Rob Fender", "Alex Andersson", "Hao Qiu", "Andrew K. Hughes", "Jakob van den Eijnden", "Fraser J. Cowie", "Sara Motta", "Itumeleng Monageng", "Lorenzo Ducci", "Sandro Mereghetti", "Andries Mathiba", "Dougal Dobie", "Tara Murphy", "David L. Kaplan", "Francesco Carotenuto", "Phil Charles"], "title": "Detection of an Extremely Luminous Radio Counterpart to the Be/X-ray Binary A0538-66", "comment": "Accepted for publication in MNRAS Letters", "summary": "We present the discovery of radio emission from the Be/X-ray binary A0538-66 with the Australian Square Kilometre Array Pathfinder (ASKAP), and results from a subsequent weekly monitoring campaign with the MeerKAT radio telescope. A0538-66, located in the Large Magellanic Cloud, hosts a neutron star with a short spin period ($P \\approx 69$ ms) in a highly eccentric $\\approx16.6$-day orbit. Its rare episodes of super-Eddington accretion, rapid optical and X-ray flares, and other peculiar properties make it an interesting system among high-mass X-ray binaries. Our MeerKAT data reveal that it is also one of the most radio-luminous neutron star X-ray binaries observed to date, reaching $\\approx 3 \\times 10^{22}~\\text{erg}~\\text{s}^{-1} \\text{Hz}^{-1}$, with radio emission that appears to be orbitally modulated. We consider several possible mechanisms for the radio emission, and place A0538-66 in context by comparing it to similar systems."}
{"id": "2601.22747", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2601.22747", "abs": "https://arxiv.org/abs/2601.22747", "authors": ["V. N. Zirakashvili", "S. I. Rogovaya"], "title": "Ultra-High Energy Cosmic Rays from the Galactic Center", "comment": "7 pages, 2 figures, oral talk at ISCRA-2025, Moscow", "summary": "It is shown that Eddington-like accretion event in the Galactic center several million years ago and particle acceleration at accompanying shocks and jets could explain the observed cosmic ray spectrum at energies above 1 PeV. Cosmic ray particles are confined in extended (several hundred kiloparsec in size) Galactic halo. It is shown that the halo magnetic field could be as small as $2\\times 10^{-7}$ G for the effective confinement."}
{"id": "2601.22749", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.22749", "abs": "https://arxiv.org/abs/2601.22749", "authors": ["Riki Matsui", "Shigeo S. Kimura", "Kohta Murase", "Bing Theodore Zhang"], "title": "Prediction of multi-wavelength emissions associated with X-ray flare and extended emission of GRBs", "comment": "16 pages, 7 Figures, 3 tables", "summary": "Gamma-ray bursts (GRBs) are one of the most extreme transients in the universe, but their explosion and emission mechanism remains unclear. To investigate the nature of GRB jets, here we focus on X-ray flares (XFs) and extended emissions (EEs), which are X-ray emissions that occur 100 to 1000 seconds after the main burst. They can be observed by recently developed multi-wavelength facilities. In this paper, we calculate emissions across multi-wavelengths associated with XFs and EEs under the hypothesis that XFs and EEs are optically-thin synchrotron emissions from nonthermal electrons in relativistic jets. Considering ranges of the dissipation radius $r_{\\rm diss}$ and the Lorentz factor $Γ$ of the jet, we determine the parameter space in which a detectable emission can be produced at each wavelength. We found that simultaneous ultraviolet and very-high-energy gamma-ray emission associated with XFs or EEs can be detected by Swift/UVOT, SVOM/VT, and CTAO approximately every three years. The detection and non-detection rates for each detector are key to determining the uncertain yet essential values necessary for understanding the physics of GRB jets."}
{"id": "2601.22810", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2601.22810", "abs": "https://arxiv.org/abs/2601.22810", "authors": ["Kobelev P. G.", "Yanke V. G"], "title": "Approximation of the reception coefficients of cosmic rays neutron component for latitude measurement", "comment": "14 pages, 6 figures, 1 table, 12 references", "summary": "When solving scientific and applied problems, such as latitude monitoring, it is important to correctly exclude primary cosmic ray variations from observation data. Therefore, the purpose of this study was to develop and implement a method for correcting monitoring data, the key point of which was to obtain reception coefficients as a function of latitude. This resulted in an approximation of the rigidity dependence of the zeroth and first harmonic cosmic rays anisotropy coefficients, calculated for a ground-based cosmic ray detectors network. Analysis of the obtained results showed that the approximation was performed with high accuracy, and the results are suitable for use in latitude measurements during marine expeditions."}
{"id": "2601.22836", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.22836", "abs": "https://arxiv.org/abs/2601.22836", "authors": ["Megumi Shidatsu", "Maxime Parra"], "title": "X-ray Spectroscopy of Disk Winds in Black Hole X-ray Binaries", "comment": "To be published in Proceedings of Science, 87th Fujihara Seminar: The 50th Anniversary Workshop of the Disk Instability Model in Compact Binary Stars", "summary": "Powerful outflows along the accretion disk, known as disk winds, are sometimes launched in black hole X-ray binaries. These winds often manifest themselves in X-ray spectra as blueshifted, highly ionized absorption lines. Previous observations suggest that the mass loss rate from the disk due to disk winds can be comparable to or even more than the mass accretion rate onto the black hole, indicating that disk winds likely play crucial roles in shaping the accretion disk structure and affecting the surrounding environment. However, the mechanisms driving these winds, as well as how their structure changes in response to variations in the mass accretion rate, remain poorly understood. The X-ray Imaging and Spectroscopy Mission (XRISM), launched in September 2023, is equipped with Resolve, a cutting-edge X-ray micro-calorimeter that delivers unprecedented spectral resolution. Resolve is expected to significantly advance our understanding of wind launching mechanisms and their impact on accretion processes and environments. In this article, we review the progress made in the pre-XRISM era, highlight key results obtained from XRISM observations to date, and outline future prospects."}
{"id": "2601.22894", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.22894", "abs": "https://arxiv.org/abs/2601.22894", "authors": ["Ishika Palit", "Indu Kalpa Dihingia", "Yosuke Mizuno", "Hsiang-Yi Karen Yang"], "title": "Equatorially Asymmetric Magnetic Fields and Their Impact on Black Hole Accretion Dynamics", "comment": "21 pages, 15 figures, Accepted for publication in ApJ", "summary": "We investigate the impact of equatorial asymmetry in the magnetic field geometry on accretion dynamics around a spinning black hole using axisymmetric general relativistic magnetohydrodynamic simulations. We consider a Fishbone--Moncrief torus orbiting a Kerr black hole with spin parameter $a = 0.9375$, threaded by large-scale magnetic fields that are asymmetric about the equatorial plane. The degree of equatorial asymmetry in the magnetic field is parametrized by an angle, with values of $30^\\circ$, $45^\\circ$, and $60^\\circ$. We examine how this equatorially asymmetric initial magnetic field configuration influences the magnetic field structure, accretion flow morphology, and angular momentum transport across a range of initial plasma beta values ($β= 0.007, 0.005, 0.001$). We find that such deformation in the magnetic field leads to noticeable changes in the inner disk structure, asymmetric outflow patterns in the poloidal plane, and time-dependent variations in accretion rates. These effects are generally more pronounced at lower beta values, where magnetic pressure dominates; in particular, the $30^\\circ$ case at $β= 0.001$ exhibits strong and persistent asymmetric inflows and outflows. Our results demonstrate that equatorially asymmetric magnetic field configurations can significantly influence the structure and variability of relativistic accretion flows. These findings motivate future extensions to full three-dimensional studies, where black hole magnetosphere can be explored in a more general setting."}
{"id": "2601.23205", "categories": ["astro-ph.HE", "physics.soc-ph"], "pdf": "https://arxiv.org/pdf/2601.23205", "abs": "https://arxiv.org/abs/2601.23205", "authors": ["A. De Rújula"], "title": "Human versus Artificial Inteligence; a significant example in astrophysics, alas", "comment": "4 pages, no figure", "summary": "There are two well documented models of gamma ray bursts (GRBs), the \"Standard' model and the \"Cannonball\" model. They have often been reviewed [1] and sometimes compared [2]. Here, to avoid understandable biases, I show below the results of an experiment: letting an AI compare the data and the two models. All of what follows (but two references, two footnotes and the next sentence) is the result of asking Perplexity.ai to perform this confrontational task. It should be easy for an impartial reader to reach very clear conclusions."}
{"id": "2601.23242", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2601.23242", "abs": "https://arxiv.org/abs/2601.23242", "authors": ["Shilong Chen", "Abhishek Das", "B. Theodore Zhang", "Shigeo S. Kimura", "Kohta Murase", "Yunfeng Liang"], "title": "Physical origin of very-high-energy gamma rays from the low-luminosity active galactic nucleus NGC 4278 and implications for neutrino observations", "comment": "13 pages, 6 figures, 3 tables, Submitted to ApJ on 09 Jan 2026", "summary": "Relativistic jets in active galactic nuclei (AGNs) are known to accelerate particles to extreme energies, yet the physical origin of very-high-energy (VHE) emission from low-luminosity AGNs (LL AGNs) remains unclear. NGC 4278, a local LLAGN, has recently been identified as a VHE source following detections by LHAASO. In this study, we present a multi-wavelength and multi-messenger analysis to investigate the physical origin of this emission. Swift-XRT monitoring reveals a quasi-quiescent state characterized by a low X-ray flux. Modeling the broadband spectral energy distribution with the leptohadronic code AMES, we find that a standard one-zone synchrotron self-Compton (SSC) model underpredicts the VHE flux by $\\sim$70% due to the insufficient target photon density provided by the weak X-ray emission, unless a high Doppler factor ($δ\\gtrsim 5$) is invoked. Alternatively, an external inverse-Compton (EIC) scenario-scattering seed photons from a radiatively inefficient accretion flow (RIAF)-successfully reproduces the broadband spectral energy distribution with a modest jet power and Doppler factor. We further explore the neutrino production within a leptohadronic framework. The predicted muon neutrino event rate is highest in the EIC quiescent model, reaching $N_{ν_μ} \\sim 0.001$ for a 15-year IceCube observation (assuming 0.1% of the Eddington luminosity is partitioned into high-energy protons). Future multi-messenger observations are essential to unveil the details of the high-energy processes of NGC 4278."}
