{"id": "2602.07247", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2602.07247", "abs": "https://arxiv.org/abs/2602.07247", "authors": ["Yuexin Zhang", "Mariano Méndez", "James F. Steiner", "Federico García", "Candela Bellavita", "Ole König", "Erin Kara", "Santiago Ubach Ramirez", "Honghui Liu", "Zuobin Zhang", "Liang Zhang", "Zi-Xu Yang", "Kevin Alabarta", "Sandeep K. Rout", "Diego Altamirano"], "title": "A NICER view of the corona through time-dependent Comptonization of the quasi-periodic oscillations in nine black-hole X-ray binaries", "comment": "Accepted for publication in MNRAS", "summary": "We present a systematic study of the evolution of the corona geometry in nine black hole X-ray binaries (BHXRBs) using archival data from NICER. We identify 171 observations exhibiting quasi-periodic oscillations (QPOs) across various spectral states and model the time-averaged energy spectra of the source, as well as the energy-dependent rms and phase-lag spectra of the QPO, with the time-dependent Comptonization model vKompthdk. This allows us to simultaneously constrain the corona size and feedback fraction during outbursts. By using the power color hue diagnostics, we identify different spectral states, and observe that the QPO frequency increases from $\\sim$0.1 Hz to $\\sim$10 Hz in the low-hard and hard-intermediate states (LHS and HIMS), and remains approximately constant at 4--5~Hz in the soft-intermediate state (SIMS). The corona size shows significant evolution: the corona is large ($\\sim10^4$--$10^5$ km) in the LHS, contracts rapidly to $\\sim10^3$ km in the HIMS, and exhibits a flare-like expansion near the HIMS-to-SIMS transition. In the SIMS and high-soft state (HSS), the corona becomes compact and stable (4000--8000~km). The feedback fraction of the corona photons increases during the periods in which the corona contracts and decreases during the periods in which the corona expands, indicating a change of the disk-corona coupling. Our results are consistent with previous QPO-based studies using vKompthdk on some individual sources. This work, however, provides the first view of the coronal evolution across outbursts for a diverse BHXRB sample, offering critical insights into coronal behavior as a function of the spectral state of the source."}
{"id": "2602.07419", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2602.07419", "abs": "https://arxiv.org/abs/2602.07419", "authors": ["Shu-Jin Hou", "Rui Xue", "Fang-Kun Peng", "Zhi-Gang Li", "Tong Liu", "Ren-Xin Xu"], "title": "Imprints of gravitational waves from magnetar spindown in GRB X-ray afterglows", "comment": "7 pages, 3 figures, 1 tables. Accepted for publication in MNRAS", "summary": "Given that newborn magnetars are considered potential central engines of gamma-ray bursts (GRBs), there is strong motivation to identify gravitational wave (GW) signatures within GRB samples. If the X-ray afterglow of a GRB is powered by a magnetar, and the initial spindown of the magnetar is dominated by the GW radiation induced by $r$-mode instability or magnetic-field-induced deformation, the decay of the X-ray flux would record the information of the GW radiation. We find that GRB 130603B potentially represents a rare and precious case where the spindown of the central magnetar is dominated in-turn by $r$-mode and magnetic distortion-induced GW radiation. By fitting the X-ray light curve of GRB 130603B in this model, we obtain the initial spin period of magnetar $\\sim 5.3\\times 10^{-4}$ s, the effective dipole magnetic field strength $\\sim 5.2\\times 10^{14}$ G, the ellipticity of the magnetar $\\sim 1.3\\times 10^{-4}$, and the amplitude of $r$-mode oscillation $\\sim3.3\\times 10^{-2}$. It may serve as a reliable approach for investigating neutron star physics by comparing the parameters estimated using the method presented in this manuscript with those obtained from future GW observations."}
{"id": "2602.07452", "categories": ["astro-ph.HE", "physics.plasm-ph"], "pdf": "https://arxiv.org/pdf/2602.07452", "abs": "https://arxiv.org/abs/2602.07452", "authors": ["Claudio Meringolo", "Luciano Rezzolla"], "title": "FPIC: a new Particle-In-Cell code for stationary and axisymmetric black-hole spacetimes", "comment": "14 pages, 10 figures", "summary": "In this paper we present a newly developed GRPIC code framework called FPIC, providing a detailed description of the Maxwell-equations solver, of the particle ``pushers'', and of the other algorithms that are needed in this approach. We describe in detail the code, which is written in Fortran and exploits parallel architectures using MPI directives both for the fields and particles. FPIC adopts spherical Kerr-Schild coordinates, which encode the overall spherical topology of the problem while remaining regular at the event horizon. The Maxwell equations are evolved using a finite-difference time-domain solver with a leapfrog scheme, while multiple particle ``pushers'' are implemented for the evolution of the particles. In addition to well-known algorithms, we introduce a novel hybrid method that dynamically switches between the most appropriate scheme based on the violation of the Hamiltonian energy. We first present results for neutral particles orbiting around black holes, both in the Schwarzschild and Kerr metrics, monitoring the evolution of the Hamiltonian error across different integration schemes. We apply our hybrid approach, showing that it is capable of achieving improved energy conservation at reduced computational cost. We apply FPIC to investigate the Wald solution, first in electrovacuum and subsequently in plasma-filled configurations. In the latter case, particles with negative energy at infinity are present inside the ergosphere, indicating that the Penrose process is active. Finally, we present the split-monopole solution in a plasma-filled environment and successfully reproduce the Blandford-Znajek luminosity, finding very good agreement with analytical predictions."}
{"id": "2602.07489", "categories": ["astro-ph.HE", "hep-ph"], "pdf": "https://arxiv.org/pdf/2602.07489", "abs": "https://arxiv.org/abs/2602.07489", "authors": ["Abdaljalel E. Alizzi", "Zurab K. Silagadze"], "title": "Astrophysical positronium and Dicke superradiance", "comment": "29 pages, 3 figures, to be published in Physical Review D", "summary": "Dicke superradiance is a fascinating phenomenon in which a large number of atoms cooperate to produce a brief and very intense burst of spontaneous emission. This phenomenon has been well studied in the laboratory, but its astrophysical aspects have only recently attracted the attention of a small number of researchers. Since the phenomenon of Dicke superradiance is relatively little known to the wider astrophysical community, we provide a fairly detailed review of its elementary theory in the appendix and speculate on the significance of superradiance for astrophysical hydrogen and positronium, given the abundant formation of the latter near the galactic center."}
{"id": "2602.07130", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2602.07130", "abs": "https://arxiv.org/abs/2602.07130", "authors": ["Wei Liu", "Jonathon Kocz", "Dan Werthimer"], "title": "An Open-Source High-Level Graphical Signal Processing Language with Simulation and HDL Generation", "comment": "18 pages, 25 figures", "summary": "The CASPER (Collaboration for Astronomy Signal Processing and Electronic Research) toolflow is a widely used framework for designing and implementing digital signal processing systems, particularly in the field of radio astronomy. It provides a set of tools and libraries that enable researchers to create custom hardware and software solutions for processing astronomical data. The CASPER toolflow has been instrumental in the development of Field-Programmable Gate Array (FPGA) based digital instruments for various radio telescopes, enabling for real-time data processing and analysis. However, the current frontend tool that CASPER uses for high-level FPGA design is based on Model Composer integrated into MATLAB/Simulink, which is a proprietary software. In this paper, we introduce Scilab as a new frontend tool for the CASPER toolflow. Scilab is an open-source software platform for numerical computation and data visualization, which offers a similar environment to MATLAB/Simulink for designing CASPER blocks, generating FPGA Intellectual Property (IP) cores, and simulating Digital Signal Processing (DSP) systems. We present our implementation of Scilab in the CASPER toolflow and demonstrate its capabilities by developing an FPGA based spectrometer on a RFSoC4x2, a commonly used CASPER platform well suited to radio astronomy applications. We have also developed Scilab support for other CASPER compatible platforms. Our results show that Scilab can successfully be used as an alternate frontend for CASPER-based designs."}
{"id": "2602.07610", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2602.07610", "abs": "https://arxiv.org/abs/2602.07610", "authors": ["Lin Nie", "Yi-Qing Guo", "Si-Ming Liu"], "title": "Two-component $γ$-Ray Structure from the CR Sources Within Dense Clouds", "comment": "15 pages, 6 figures", "summary": "Recent observations have revealed that several cosmic ray (CR) sources themselves exhibit pronounced double power-law features in their radiation spectra. Combined with the phenomenon of two-component structure in the observed CR energy spectrum supported by multi-messenger data, this raises a fundamental question: can the two-component structure of the cosmic ray energy spectrum and the double power-law feature of the gamma-ray radiation energy spectrum from supernova remnants be understood within a unified picture? In this study, we propose a two-component model that incorporates the re-acceleration of background ``sea\" CR particles by astrophysical sources to systematically explain the formation of double power-law spectra within those sources. Our model successfully reproduces the gamma-ray observations of multiple CR sources. The results support that double power-law structures may be a generic feature of Galactic CR sources within crushed clouds. This work offers a new theoretical perspective on the origin and propagation of cosmic rays, and its predictions may be further tested with future observations of a larger sample of CR sources."}
{"id": "2602.07133", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2602.07133", "abs": "https://arxiv.org/abs/2602.07133", "authors": ["Benjamin Kuhn"], "title": "WFC3/UVIS: External CTE Monitoring 2009-2024", "comment": "16 pages, 3 Figures, 9 Tables", "summary": "This report examines Charge Transfer Efficiency (CTE) flux losses in the Wide Field Camera 3 UVIS detector aboard the Hubble Space Telescope. Spanning approximately 14 years of observations from October 2009 to February 2024, the study analyzes CTE flux loss trends across various total background levels and source fluxes. In addition to analyzing the present state of CTE flux losses, we provide updated coefficients for the empirical model for point source photometry corrections in both non-CTE-corrected (FLT) and CTE-corrected (FLC) data. Between 2009 and 2023, the rate of CTE flux loss for a 500-2000 e$^-$ source, farthest from the readout, in FLT data with a 1-3 e$^-$/pix background, is measured to be $\\sim$0.05 $Δ$mag/2051 pix/year. The recommended minimum total background level to mitigate CTE losses remains at 20-25 e$^-$/pix. At that level, we find that 500-2000 e$^-$ sources, farthest from the readout, in 2024 FLT data can suffer $\\sim$23$\\%$ flux loss/2051 pix. The FLC data provide some relief, but we measure a $\\sim$12$\\%$ flux loss/2051 pix in 2024. There continues to be a slight over-correction in some FLC results that contain backgrounds above 40 e$^-$/pix. In 2024, 8000-20000 e$^-$ sources farthest from the readout in a 40, 60, or 90 e$^-$/pix background are over-corrected by $\\sim$1, 2, and 3$\\%$, respectively."}
{"id": "2602.07620", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2602.07620", "abs": "https://arxiv.org/abs/2602.07620", "authors": ["Lin Nie", "Hua Yue", "Yi-Qing Guo", "Si-Ming Liu"], "title": "A Multi-messenger Search for a Nearby Microquasar Contributor to the Cosmic Ray Knee", "comment": "10 pages, 10 figures", "summary": "Recently, LHAASO has detected five microquasars with high confidence, which are associated with SS 433, V4641 Sgr, GRS 1915+105, MAXI J1820+070, and Cygnus X-1, respectively. Except for Cygnus X-1, the maximum energies of gamma-ray photons emitted from these sources all exceed 100 TeV, strongly suggesting that microquasars are capable of accelerating cosmic-ray particles to energies above the PeV range. This work investigates the origin of the cosmic-ray knee region based on gamma-ray observational data from the aforementioned sources, combined with cosmic-ray proton, helium, and all-particle energy spectra, as well as anisotropy observations. Calculations indicate that these known sources contribute negligibly to the cosmic-ray knee region. However, further joint analysis reveals that a single microquasar located in a region approximately on the 2.6 kiloparsec scale in the anti-Galactic center direction can reasonably reproduce the observed cosmic-ray proton, helium, and all-particle energy spectra, as well as anisotropy features detected near Earth. We propose that this region may host one or several unidentified microquasars or similar systems, whose accelerated cosmic rays could dominate the observational characteristics of the knee region."}
{"id": "2602.07284", "categories": ["astro-ph.IM", "cs.AI", "physics.pop-ph"], "pdf": "https://arxiv.org/pdf/2602.07284", "abs": "https://arxiv.org/abs/2602.07284", "authors": ["S. G. Djorgovski"], "title": "Imagining the Alien: Human Projections and Cognitive Limitations", "comment": "11 pages, from the refereed proceedings of the Inspiration of Astronomical Phenomena XII (INSAP XII) conference held in Corfu, Greece, May 2024, eds. N. Campion, J. Hatch, H. Henry, C. Impey and V. Shrimplin", "summary": "Imagining what life on other planets, and intelligent life in particular, may be like is a long-running theme in human culture. It is a manifestation of the innate human curiosity about the Cosmos, and it has inspired numerous works of art and folklore, including whole literary and other media genres. It is a profound question, with philosophical and existential implications. There is also an obvious connection with religious beliefs, as gods and other superhuman beings were imagined in the heavens. Speculations about alien beings grew in time, and today, it is a scientific subject of astrobiology, and it is pursued through serious searches for life and intelligence in the universe. However, almost all imaginings of the alien map terrestrial life forms and human cultural, historical, and psychological phenomena to the putative aliens. This lack of individual and collective imagination may reflect our biological and cultural evolution, as our minds are formed through our experiences, perceptions of the world, and interactions with our terrestrial and human environments. As such, imagining aliens is mainly a cultural phenomenon and may reflect the intrinsic cognitive limitations of the human mind. Interestingly, we did create what is effectively an alien intelligence on this planet in the form of now rapidly evolving Artificial Intelligence (AI). As its capabilities grow, it may give us new insights into what extraterrestrial advanced intelligences may be like."}
{"id": "2602.07661", "categories": ["astro-ph.HE", "astro-ph.CO", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2602.07661", "abs": "https://arxiv.org/abs/2602.07661", "authors": ["Ming-Hsueh Hsieh", "H. -Y. Karen Yang", "John ZuHone"], "title": "Effects of Viscosity on Sloshing Cold Fronts in Galaxy Clusters", "comment": "10 pages, 13 figures", "summary": "The viscous properties of the intracluster medium (ICM) remain poorly constrained. Cold fronts-sharp discontinuities formed during cluster mergers-offer a potential avenue to probe the effective viscosity of the ICM. Velocity shear across these fronts should generate Kelvin-Helmholtz instabilities (KHI), unless viscosity or magnetic tension suppresses them. We perform cluster merger simulations incorporating four ICM viscosity models: (A) inviscid, (B) isotropic Spitzer viscosity, (C) anisotropic Braginskii viscosity, and (D) Braginskii viscosity limited by microinstabilities. The isotropic Spitzer viscosity (case B) strongly suppresses KHI, producing smooth cold front surfaces, while the inviscid (A) and microinstability-limited (D) cases show prominent ripples. The Braginskii case (C) yields intermediate suppression. We also vary the plasma $β$ parameter ($β\\approx$ 100 and 1600) to examine how a changing magnetic field strength affects the results. Stronger magnetic fields further suppress KHI, leading to smoother fronts and reduced differences between different viscosity models, while also widening the range of permitted pressure anisotropies when microinstability-based limiters are present. These results indicate that both viscosity and magnetic fields play crucial roles in stabilising sloshing cold fronts in galaxy clusters."}
{"id": "2602.07448", "categories": ["astro-ph.IM", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2602.07448", "abs": "https://arxiv.org/abs/2602.07448", "authors": ["Thomas Berkefeld", "Alexander Bell", "Reiner Volkmer", "Frank Heidecke", "Tobias Preis", "Thomas Sonner", "Eiji Nakai", "Andreas Korpi-Lagg", "Achim Gandorfer", "Sami K. Solanki", "Jose Carlos del Toro Iniesta", "Yukio Katsukawa", "Pietro Bernasconi", "Alex Feller", "Tino L. Riethmüller", "Alberto Álvarez-Herrero", "Masahito Kubo", "Valentín Martínez Pillet", "H. N. Smitha", "David Orozco Suárez", "Bianca Grauf", "Michael Carpenter"], "title": "Sunrise III: The Wavefront Correction System", "comment": "21 pages, 10 figures, submitted to Solar Physics as an article of the \"Sunrise III Topical Collection\"", "summary": "This paper describes the wave-front correction and image stabilisation system (CWS) developed for the Sunrise III balloon-borne telescope, and provides information about its performance as measured during the integration into the telescope and during the 2024 science flight. The fast image stabilisation is done by a correlation tracker (CT) and a fast tip-tilt mirror, low order aberrations such as defocus and coma are measured by a six-element Shack-Hartmann wavefront sensor (WFS) and corrected by an active telescope secondary mirror for automated focus and manual coma correction. The CWS is specified to deliver a stabilised image with a precision of 0.005 arcsec (rms). The autofocus adjustment is specified to maintain a focus stability of 0.01 waves in the focal plane of the CWS."}
{"id": "2602.07716", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2602.07716", "abs": "https://arxiv.org/abs/2602.07716", "authors": ["Lebogang L. Mfulwane", "James O. Chibueze", "Thulo P. Letsele", "Trevor M. Nyambe", "Christo Venter", "Mechiel Christiaan Bezuidenhout", "Benjamin W. Stappers", "Laura G. Spitler", "Manisha Caleb", "Adam Deller", "Jéferson André Sales Fortunato", "Bernardo Cornejo", "Fabian Schüssler", "Halim Ashkar", "Frederica Bradascio", "Surajit Kalita", "Anu Kundu", "Michael Kramer", "Evan. F. Keane", "Amanda Weltman"], "title": "A MeerKAT search for persistent radio sources towards twenty-five localised Fast Radio Bursts", "comment": "18 pages, 9 Figures", "summary": "The discovery of persistent radio sources (PRSs) associated with repeating fast radio bursts (FRBs) has shed light on the immediate environments and possible progenitors of these FRBs. The confirmed PRSs may support the theory that FRB progenitors are compact central engines, whilst the non-detections suggest diversity of FRB's local environment. We perform a subarcsecond-resolution MeerKAT search at 1.28 GHz on 25 well-localised FRB positions provided by ASKAP and MeerTRAP. We detect 14 radio sources and provide flux upper limits for 12 non-detections (both these numbers include a source that was detected during two epochs of observation, and not detected during one epoch, adding up to 26). One radio source shows variability as seen in flux variations over three epochs of observation. Archival optical data reveal excesses in the direction of 13 detected radio sources. Similarly for four sources in the X-ray band, with one possibly being a high-energy signature of a radio galaxy core. Since we cannot definitively classify our detected radio sources as PRSs, future high-resolution observations with e-MERLIN will be required to resolve the radio emission and pronounce on the presence of compact PRSs associated with the 14 detected sources presented here."}
{"id": "2602.07469", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2602.07469", "abs": "https://arxiv.org/abs/2602.07469", "authors": ["S. Riggi"], "title": "Toward Vision-Language Assistants for Radio Astronomical Source Analysis", "comment": "5 pages, 3 figures, Proceedings IAU Symposium No. 397, 2025", "summary": "Vision-language models (VLMs) have recently shown promise in general-purpose reasoning tasks, yet their applicability to domain-specific scientific workflows remains largely unexplored. In this work, we evaluated a series of open-weight and commercial VLMs on six tasks relevant to radio astronomy, such as source morphology classification. We also introduced radio-llava, a fine-tuned multimodal assistant built on the LLaVA architecture and adapted for the radio domain through instruction fine-tuning.\n  In zero-shot mode, commercial models like GPT-4.1 outperform open-weight VLMs on most radio benchmarks. However, radio-llava significantly improves upon both base LLaVA and commercial models across nearly all tasks. Despite these gains, specialized vision-only models still deliver substantially better performance across the board. Additionally, we observed that fine-tuning introduces catastrophic forgetting on general multimodal tasks, with performance drops up to 40% that can be partly mitigated with a more diverse training dataset or shallow fine-tuning."}
{"id": "2602.08065", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2602.08065", "abs": "https://arxiv.org/abs/2602.08065", "authors": ["Maria Rah", "Areg Mickaelian", "Francesco Flammini Dotti", "Rainer Spurzem"], "title": "Pulsars and Millisecond Pulsars I: Advancements, Open Questions and finding Gaps via statistical insights", "comment": "10 pages, 5 figures. Published in Communications of BAO, Vol. 71, Issue 2, 2024", "summary": "We present a statistical study of pulsars and millisecond pulsars (MSPs) based on multiwavelength observations in the Galactic Field and Globular Clusters. We examine their emission properties, timing behavior, and spatial distributions, and discuss how theoretical models are required to interpret these observational trends. We focus on the magnetic field spin relation, including spin up through accretion in binaries and spin down driven by magnetic dipole radiation. Using numerical tools such as NBODY6++GPU, CMC, and COMPASS, we explore how dynamical interactions and binary evolution shape the properties of compact objects. Despite major progress, several open questions remain regarding binary interactions, magnetic field evolution, and the incorporation of pulsar physics into large scale simulations. Our analysis highlights the need for improved modeling frameworks to better understand the formation pathways and long term evolution of pulsars and MSPs."}
{"id": "2602.07490", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2602.07490", "abs": "https://arxiv.org/abs/2602.07490", "authors": ["Belov S. M.", "Yanke V. G"], "title": "Scintillation muon telescope module with fiber-optic light collection", "comment": "15 pages, 9 figures", "summary": "A scintillation muon telescope module with fiber-optic light collection using silicon photomultipliers was developed, tested, and installed for continuous monitoring to study cosmic ray variations. The aim of this study was to create a scintillation muon telescope module, continuously monitor the muon component in test mode, and study the long-term stability of the detector parameters. Methods for processing the obtained data were developed. To assess the stability of the module parameters, an internal control technique was used, involving data from other detectors. The results of testing and long-term continuous monitoring showed that the stability of the developed muon detector is better than 0.1%/year, without the need for its operation in a thermostatic chamber. The study concludes that ease of operation, cost, compactness, low power consumption and stability are factors that determine the advantages of the developed module, which is an essential element for constructing a multidirectional muon telescope."}
{"id": "2602.08106", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2602.08106", "abs": "https://arxiv.org/abs/2602.08106", "authors": ["Maria Rah", "Rainer Spurzem", "Francesco Flammini Dotti", "Areg Mickaelian"], "title": "Pulsars and Millisecond Pulsars II: Deep diving into the Evolutionary Mechanisms", "comment": "10 pages, 4 figures. Accepted for publication in Communications of BAO, Vol. 72, 2025", "summary": "This second paper in our series investigates the evolutionary mechanisms that shape pulsars and millisecond pulsars (MSPs) across different astrophysical environments. We focus on the physical processes that govern spin evolution, magnetic field decay, binary interactions, and recycling pathways. Using observational constraints together with theoretical models, we examine how accretion, magnetic braking, and dynamical encounters contribute to the long-term evolution of compact objects. We also explore how these mechanisms differ between the Galactic Field and Globular Clusters, where stellar densities and interaction rates vary significantly. By integrating insights from population studies and numerical tools such as NBODY6++GPU, CMC, and COMPASS, we aim to clarify the dominant channels that lead to the formation and transformation of pulsars and MSPs. Our results highlight key uncertainties in current models and outline the physical ingredients required for more accurate simulations of compact object evolution."}
{"id": "2602.08037", "categories": ["astro-ph.IM", "astro-ph.EP"], "pdf": "https://arxiv.org/pdf/2602.08037", "abs": "https://arxiv.org/abs/2602.08037", "authors": ["Bumhoo Lim", "Seungwon Choi", "Yoonsoo P. Bach", "Masateru Ishiguro", "Sunho Jin", "Carey M. Lisse", "Max Mahlke", "Jooyeon Geem", "Jinguk Seo", "Sihu Ahn", "Hangbin Jo"], "title": "SOLO: wide-field asteroid light curve monitoring system for SPHEREx", "comment": "11 pages, submitted to the Journal of the Korean Astronomical Society", "summary": "We present the Solar system Objects Light curve Observatory (SOLO), a wide-field, high-cadence optical survey system designed to obtain absolutely calibrated asteroid light curves, converted to the Gaia G-band photometric system, in support of the SPHEREx Solar System Object Catalog (SSOC). SOLO was installed at the Sierra Remote Observatories (SRO) in California, USA, in July 2025 and is optimized for continuous, multi-night monitoring of asteroid brightness variations. We describe the system configuration, remote operation, and data reduction pipeline, and evaluate its optical and photometric performance using commissioning data. SOLO achieves stable photometric calibration across the 11.6 deg^2 field of view and reaches a 10-sigma limiting magnitude of G ~ 17.5 for a 180 sec exposure. Sample asteroid light curves obtained over multiple nights demonstrate consistent absolute photometry at the same rotational phase, validating the estimated performance. Finally, we outline the planned operational use of SOLO in connection with NASA's SPHEREx mission. Full science operations of SOLO are scheduled to begin in January 2026. Using these data, we aim to obtain on the order of 10^3 absolutely calibrated asteroid light curves per year in the Gaia G-band, which will be used to support the construction and scientific utilization of the SPHEREx SSOC."}
{"id": "2602.08152", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2602.08152", "abs": "https://arxiv.org/abs/2602.08152", "authors": ["D. Kaltenbrunner", "C. Maitra", "F. Haberl", "J. Bodensteiner", "D. Bogensberger", "D. A. H. Buckley", "M. R. L. Cioni", "J. Greiner", "I. Monageng", "A. Udalski", "G. Vasilopoulos", "R. Willer"], "title": "A comprehensive catalogue of high-mass X-ray binaries in the Large Magellanic Cloud detected during the first eROSITA all-sky survey", "comment": "61 pages, 33 figures, accepted for publication in A&A", "summary": "The Magellanic Clouds, the closest star-forming galaxies to the Milky Way, offer an excellent environment to study high-mass X-ray binaries. While the Small Magellanic Cloud has been thoroughly investigated with over 120 systems identified, the Large Magellanic Cloud has lacked a complete survey due to its large angular size. Most prior studies targeted central or high-star-formation regions. The SRG/eROSITA all-sky surveys now enable a comprehensive coverage of the LMC, particularly due to its close vicinity to the south ecliptic pole. This work aims to improve our understanding of the HMXB population in the LMC by building a flux-limited catalogue. This allows us to compare sample properties with those of HMXB populations in other nearby galaxies. Using detections during the first eROSITA all-sky survey, we cross-matched X-ray positions with optical and infrared catalogues to identify candidate HMXBs. We assigned flags based on multi-wavelength follow-up observations and archival data, using properties of known LMC HMXBs. These flags defined confidence classes for our candidates. We detect sources down to X-ray luminosities of a few $10^{34}$ erg s$^{-1}$, resulting in a catalogue of 53 objects, including 28 confirmed HMXBs and 21 new eROSITA detections. We identify several likely supergiant systems, including a candidate supergiant fast X-ray transient with phase-dependent flares. We find three Be stars with likely white dwarf companions. Two of the Be/WD candidates show steady luminosities across four eROSITA scans, unlike the post-nova states seen in the majority of previous Be/WD reports. Our catalogue is the first to cover the entire LMC since the ROSAT era, providing a basis for statistical population studies. Using the HMXB population, we estimate the LMC star-formation rate to be $(0.22^{+0.06}_{-0.07})$ M$_{\\odot}$yr$^{-1}$, which is in agreement with other tracers."}
{"id": "2602.08078", "categories": ["astro-ph.IM", "astro-ph.CO", "physics.data-an"], "pdf": "https://arxiv.org/pdf/2602.08078", "abs": "https://arxiv.org/abs/2602.08078", "authors": ["Nikolina Šarčević", "Matthijs van der Wild", "Cynthia Trendafilova"], "title": "DerivKit: stable numerical derivatives bridging Fisher forecasts and MCMC", "comment": "9 pages, 6 figures", "summary": "DerivKit is a Python package for derivative-based statistical inference. It implements stable numerical differentiation and derivative assembly utilities for Fisher-matrix forecasting and higher-order likelihood approximations in scientific applications, supporting scalar- and vector-valued models including black-box or tabulated functions where automatic differentiation is impractical or unavailable. These derivatives are used to construct Fisher forecasts, Fisher bias estimates, and non-Gaussian likelihood expansions based on the Derivative Approximation for Likelihoods (DALI). By extending derivative-based inference beyond the Gaussian approximation, DerivKit forms a practical bridge between fast Fisher forecasts and more computationally intensive sampling-based methods such as Markov chain Monte Carlo (MCMC)."}
{"id": "2602.08223", "categories": ["astro-ph.HE", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2602.08223", "abs": "https://arxiv.org/abs/2602.08223", "authors": ["Felix Aharonian", "Bing Theodore Zhang"], "title": "A Minimal Interpretation of the Galactic Cosmic-Ray Spectrum from GeV to PeV Energies", "comment": "12 pages, 3 figures", "summary": "High-precision measurements of the cosmic-ray (CR) proton spectrum have revealed significant deviations from a simple power-law behaviour. These deviations are characterised by three prominent features: (i) a progressive spectral hardening above approximately 200 GeV, (ii) an excess between 10 and 30 TeV (the ``multi-TeV bump''), followed by a sharp turnover around 100 TeV, and (iii) a pronounced structure between 0.1 and 10 PeV (the ``PeV bump''). We propose a minimal two cosmic-ray population framework that consistently accounts for the observed CR proton spectrum across six decades in energy, from GeV to PeV. In this scenario, the spectral complexity arises naturally from a transition between two Galactic CR proton populations in the 10-100 TeV energy range. The low-energy population exhibits a sharp cutoff at tens of TeV, while a second, higher-energy population emerges and dominates above 100 TeV, terminating with a smooth exponential cutoff at approximately 6.5 PeV. This framework reproduces all observed spectral features without invoking contributions from nearby sources or requiring non-standard assumptions about particle acceleration or propagation. Recent gamma-ray observations of supernova remnants, star-forming regions, and microquasars provide plausible astrophysical candidates for the origin of the two CR components."}
{"id": "2602.08091", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2602.08091", "abs": "https://arxiv.org/abs/2602.08091", "authors": ["S. Rosswog"], "title": "Particle hydrodynamics with accurate gradients: a comparison of different formulations", "comment": "20 pages, 17 figures", "summary": "We compare here several modern versions of SPH with a particular focus on the impact of gradient accuracy. We examine specifically an approximation to the \"linearly exact\" gradients (aLE) with standard SPH kernel gradients and with linearly reproducing kernels (RPKs) that fulfill the lowest order consistency relations exactly by construction. Most of the explored SPH formulations use shock dissipation (i.e. artificial viscosity and conductivity) with slope-limited reconstruction and parameters that trigger on both shocks and noise. We also compare with a recent particle hydrodynamics formulation that uses both RPKs and Roe's approximate Riemann solver instead of shock dissipation. Not too surprisingly, we find that the shock tests are rather insensitive to the gradient accuracy, but whenever instabilities are involved the gradient accuracy plays a crucial role. The reproducing kernel gradients perform best, but they are closely followed by the much simpler aLE gradients. The Riemann solver approach has some (minor) advantages in the shock tests, but shows some resistance against instability growth and at low resolution the corresponding Kelvin-Helmholtz simulations show substantially slower instability growth than the best shock dissipation approaches. Based on the battery of benchmark tests performed here, we consider a shock dissipation approach with reproducing kernels (our versions $V_3$ and $V_5$) as best, but closely followed by a similar version ($V_2$) that uses the simpler and computationally cheaper aLE gradients."}
{"id": "2602.08319", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2602.08319", "abs": "https://arxiv.org/abs/2602.08319", "authors": ["Hao-Yu Yuan", "Wen-Long Xu", "Kai Wang", "Wei-Hua Lei"], "title": "Neutrino Emission from Gamma-ray Burst Jet Propagating inside the Cavity within Active Galactic Nucleus Accretion Disks", "comment": null, "summary": "Short gamma-ray bursts (sGRBs) from the merger of binary compact objects (BCOs) could occur in the accretion disks of the active galactic nucleus (AGN). Before merging, the BCO will inevitably form a low-density cavity. The sGRB jet will interact with the AGN disk photons during its propagation through the cavity, leading to unique electromagnetic and neutrino signatures. In this work, we investigate the influence of the AGN disk photon field on neutrino emission within the internal dissipation regions of a two-component sGRB jet (a narrow core and a wide wing). We find that, due to the strong AGN disk photon field, the neutrino flux at high-energy part (e.g., PeV to EeV) will be suppressed, while the relatively lower-energy part (e.g., TeV to PeV) will be enhanced. Such a conclusion can enhance the constraints on GRB parameters (e.g., baryonic loading factor and bulk Lorentz factor) based on the future detection or non-detection of high-energy neutrinos from GRBs. Besides, the two-component jet can display two-bump structure at higher and lower energy in the neutrino spectrum. Therefore, the joint observations of electromagnetic and neutrinos emission can help us identify the sGRB jet and its structure in the AGN disk."}
{"id": "2602.08416", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2602.08416", "abs": "https://arxiv.org/abs/2602.08416", "authors": ["Susanne Pfalzner", "Stephan Hachinger", "Jolanta Zjupa", "Salvatore Cielo", "Frank W. Wagner", "Marcus Brüggen", "Annika Hagemeier"], "title": "Towards FAIR Astrophysical Simulations", "comment": "19 pages, 4 figures, accepted by Frontiers in Astronomy and Space Science", "summary": "Reproducibility is a cornerstone of science. FAIR (findable, accessible, interoperable, and reusable) data is often a vital step towards testing the reproducibility of results. The implementation of FAIR principles in the astrophysical simulation community is still varied. We approach the discussion of this topic mainly from a high-performance computing (HPC) point of view. We identify the main obstacles to FAIR astrophysics simulations: First, the vast datasets created in simulations on HPC facilities complicate FAIR data management. Second, missing incentives to fully share codes, results, and diagnostic data. Third, a lack of workflows that include data publication and technical support. Therefore, particularly smaller research groups struggle due to the unavailability of dedicated personnel and time in their efforts towards FAIR and open simulations. We propose actionable steps towards achieving ``FAIRer'' data and open source publication standards in numerical astrophysics. Our suggestions include low-threshold methods to fulfil the basic FAIR requirements as well as basic tools for FAIR (meta-)data generation and data/code publication. This work is a high-level overview intended to initiate discussions within the community, offering initial solutions to these challenges."}
{"id": "2602.08408", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2602.08408", "abs": "https://arxiv.org/abs/2602.08408", "authors": ["J. J. Rodes-Roca", "J. M. Torrejón", "G. Sanjurjo-Ferrín", "J. Planelles Villalva"], "title": "High-resolution X-ray spectroscopy of Cen X-3 with XMM-Newton", "comment": "13 pages, 9 figures, accepted for publication in Sect. 7 Stellar structure and evolution (Journal: Astronomy and Astrophysics)", "summary": "The spectral analysis of two XMM-Newton observations of the high-mass X-ray binary system Cen X-3 is presented. In particular, it is focused on the eclipse and out-of-eclipse spectra in order to compare the properties of the environment around the compact object. The high-resolution spectra obtained from the reflection grating spectrometer on board XMM-Newton was analysed focusing on studying eclipse and out-of-eclipse spectra separately. Several continuum models were explored in SPEX for which we studied the properties of emitting and absorbing matter depending on the emission and absorption lines identified in the spectra. It was found that the X-ray continuum is heavily absorbed by a neutral gas and photoionised matter. Emission lines from Si v, Mg xii, Mg xi, and Ne x were detected in the eclipse spectrum. In particular, H-like lines of Mg and Ne with a significance greater than 5 sigma in the eclipse spectrum and 3 sigma in the out-of-eclipse spectrum. But in the out-of-eclipse spectrum any absorption lines, if any, were detected with a significance less than 2 sigma. RGS light curve showed dips in the out-of-eclipse spectrum which are not due to an increase in the column absorption but may be produced by instabilities in the accretion stream. On the other hand, the level of counts above 20 was compatible with the X-ray background. A simple local continuum model was used to describe the He-like triplet of Ne and the derived values of R and G ratio parameters pointed out that the UV photospheric field should be important at the line production site and an electron density greater than 10(12) cm-3. As a consequence, a hybrid plasma may be present in the binary system."}
{"id": "2602.08921", "categories": ["astro-ph.HE", "astro-ph.IM", "hep-ex"], "pdf": "https://arxiv.org/pdf/2602.08921", "abs": "https://arxiv.org/abs/2602.08921", "authors": ["Alexander Kyriacou", "Steven Prohira", "Dave Besson"], "title": "Seasonal Variation of Polar Ice: Implications for Ultrahigh Energy Neutrino Detectors", "comment": null, "summary": "The upper $100 \\, \\mathrm{m}$ to $150 \\, \\mathrm{m}$ of the polar ice sheet, called the firn, has a time-dependent density due to seasonal variations in the surface temperature and snow accumulation. We present RF simulations of an in-ice neutrino-induced radio source that show that these density anomalies create variations in the amplitude and propagation times of radio signals propagating through polar firn at an altitude of ${\\sim}3000 \\, \\mathrm{m}$ above sea level. The received power from signals generated in the ice that refract within the upper ${\\sim} 15 \\, \\mathrm{m}$ firn are subject to a seasonal variation on the order of 10\\%. These variations result in an irreducible background uncertainty on the reconstructed neutrino energy and arrival direction for detectors using ice as a detection medium."}
{"id": "2602.08459", "categories": ["astro-ph.HE", "astro-ph.CO", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2602.08459", "abs": "https://arxiv.org/abs/2602.08459", "authors": ["Sumedha Biswas", "Andrew Levan", "Peter G. Jonker", "Kendall Ackley", "Gregory Ashton", "Nikhil Sarin"], "title": "Identifying Host Galaxies of Binary Black Hole Mergers with Next-Generation Gravitational Wave Detector Networks", "comment": "19 pages, 12 figures; Submitted to MNRAS;", "summary": "Identifying the host galaxy of a binary black hole (BBH) merger detected via gravitational waves (GWs) remains a challenge due to the absence of electromagnetic counterparts and the large localization volumes produced by current-generation detectors. A confident host association would provide stellar population properties to constrain BBH formation channels and enable measurements of cosmological parameters such as the Hubble constant, H0. We simulate BBH mergers in nearby (z<0.25) host galaxies to evaluate the feasibility of host identification with future GW detector networks, including configurations with the planned LIGO-India detector and third-generation detectors such as the Einstein Telescope (ET) and Cosmic Explorer (CE). We construct two injection grids to explore variations in BBH mass, distance, and directional sensitivity, and infer localization volumes using the Fisher Information Matrix (FIM)-based parameter estimation implemented through BILBY. To assess the prospects for unique host identification, we introduce a set of diagnostics: theoretical comoving volume thresholds for galaxies of a given stellar mass, derived from galaxy stellar mass functions, a metallicity-based volume threshold motivated by progenitor environment models, stellar mass fractions to quantify candidate host prominence, and the probability of chance alignment (p_c). These metrics provide ways to evaluate host associations and constrain BBH formation channels. We find that future networks that include ET and CE localize BBH mergers to volumes smaller than those theoretical thresholds, implying potentially unique host identification, out to ~1000 Mpc at a rate of ~100 yr^{-1}. While associations for individual events may remain uncertain, our framework is well-suited to population-level analyses, enabling constraints on BBH formation scenarios in the era of next-generation GW detector networks."}
{"id": "2602.08649", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2602.08649", "abs": "https://arxiv.org/abs/2602.08649", "authors": ["Nora Valtonen-Mattila", "Shlok Shah", "Segev BenZvi"], "title": "IceCube's Sensitivity Prospects to MeV-Scale Axion-Like Particles from Core-Collapse Supernovae", "comment": "PoS (TAUP2025) 059", "summary": "We present a novel framework to estimate the sensitivity and discovery potential of IceCube to axion-like particles (ALPs) produced in core-collapse supernovae (CCSNe), covering ALP masses from 1 MeV to several hundred MeV. A key feature of this work is the explicit handling of the final-state leptons produced in ALP interactions with $^{16}$O nuclei and protons, which can generate Cherenkov light detectable in IceCube. These processes are being fully integrated into a detector-level simulation chain, enabling realistic detector signal modeling beyond existing estimates. The framework enables sensitivity forecasts for both direct detection and constraints based on time delays relative to the neutrino burst, across a range of ALP emission models. This approach may also extend to other MeV-scale dark sector particles. Preliminary sensitivity estimates are in progress and will be presented."}
{"id": "2602.08710", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2602.08710", "abs": "https://arxiv.org/abs/2602.08710", "authors": ["Giovani H. Vicentin", "Elisabete M. de Gouveia Dal Pino", "George N. Wong", "Lia Medeiros", "Grzegorz Kowal", "James M. Stone", "Alex Lazarian"], "title": "Is plasmoid-mediated reconnection really important in accretion flows to drive flares in AGNs?", "comment": "8 pages, 3 figures. Proceedings of the High Energy Phenomena in Relativistic Outflows IX (HEPRO-IX)", "summary": "Based on very high-resolution resistive 2D and 3D magnetohydrodynamical (MHD) simulations of current sheets, our findings suggest that the answer to this question is likely no. In contrast, turbulence-mediated reconnection yields significantly faster reconnection rates - about an order of magnitude higher than the so-called universal rate for plasmoid-mediated reconnection in MHD flows ($V_\\text{rec}/V_A \\sim 0.01$). We conclude that turbulence-driven reconnection is the dominant mechanism responsible for fast reconnection and flares in systems such as accretion flows and relativistic jets in Active Galactic Nuclei (AGNs). In these environments, turbulence is driven by instabilities such as the magneto-rotational instability (MRI), Parker-Rayleigh-Taylor instability (PRTI), and current-driven kink instability (CDKI). Finally, we present 3D General Relativistic MHD simulations of accretion flows that confirm the crucial role of turbulence-mediated reconnection in AGN systems. These findings have important implications for understanding the origin of flares, particle acceleration, and the production of polarized radiation in these extreme environments."}
{"id": "2602.08921", "categories": ["astro-ph.HE", "astro-ph.IM", "hep-ex"], "pdf": "https://arxiv.org/pdf/2602.08921", "abs": "https://arxiv.org/abs/2602.08921", "authors": ["Alexander Kyriacou", "Steven Prohira", "Dave Besson"], "title": "Seasonal Variation of Polar Ice: Implications for Ultrahigh Energy Neutrino Detectors", "comment": null, "summary": "The upper $100 \\, \\mathrm{m}$ to $150 \\, \\mathrm{m}$ of the polar ice sheet, called the firn, has a time-dependent density due to seasonal variations in the surface temperature and snow accumulation. We present RF simulations of an in-ice neutrino-induced radio source that show that these density anomalies create variations in the amplitude and propagation times of radio signals propagating through polar firn at an altitude of ${\\sim}3000 \\, \\mathrm{m}$ above sea level. The received power from signals generated in the ice that refract within the upper ${\\sim} 15 \\, \\mathrm{m}$ firn are subject to a seasonal variation on the order of 10\\%. These variations result in an irreducible background uncertainty on the reconstructed neutrino energy and arrival direction for detectors using ice as a detection medium."}
{"id": "2602.08922", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2602.08922", "abs": "https://arxiv.org/abs/2602.08922", "authors": ["Karen I. Perez", "Vishal Gajjar", "Slavko Bogdanov", "Jules P. Halpern", "Paul B. Demorest", "Steve Croft", "Matt Lebofsky", "David H. E. MacMahon", "Andrew P. V. Siemion"], "title": "On the Deepest Search for Galactic Center Pulsars and an Examination of an Intriguing Millisecond Pulsar Candidate", "comment": "27 pages, 13 figures, published in ApJ", "summary": "We report results of one of the most sensitive pulsar surveys to date targeting the innermost region of the Galactic Center (GC) using the Robert C. Byrd Green Bank Telescope (GBT) at X-band (8--12GHz) using data from the Breakthrough Listen initiative. In total, we collected 9.5 hr of data covering the wider $\\sim 8'$ diameter of the GC bulge, and 11 hr on the inner $1.4'$ region between 2021 May and 2023 December. We conducted a comprehensive Fourier-domain periodicity search targeting both canonical pulsars (CPs) and millisecond pulsars (MSPs), using constant and linearly changing acceleration searches to improve sensitivity to compact binaries. Assuming weak scattering, our searches reached luminosity limits of $L_{\\rm min} \\approx 0.14~{\\rm mJy~kpc^{2}}$ for CPs and $L_{\\rm min} \\approx 0.26~{\\rm mJy~kpc^{2}}$ for MSPs -- sensitive enough to detect the most luminous pulsars expected in the GC. Among 5,282 signal candidates, we identify an interesting 8.19 ms MSP candidate (DM of 2775 pc cm$^{-3}$), persistent in time and frequency across a 1-hr scan at a flux density of $S_{\\rm min} \\approx 0.007~{\\rm mJy}$. We introduce a novel randomization test for evaluating candidate significance against noise fluctuations, including signal persistence via Kolmogorov-Smirnov tests and flux-vs-DM behavior. We are unable to make a definitive claim about the candidate due to a mixed degree of confidence from these tests and, more broadly, its non-detection in subsequent observations. This deepens the ongoing missing pulsar problem in the GC, reinforcing the idea that strong scattering and/or extreme orbital dynamics may obscure pulsar signals in this region."}
{"id": "2602.08926", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2602.08926", "abs": "https://arxiv.org/abs/2602.08926", "authors": ["Geethu Prabhakar", "Samir Mandal"], "title": "The Reawakening of 4U 1755-338 after 25 Years of Quiescence: Spectro-temporal Analysis Using Multi-instrument X-ray Data", "comment": null, "summary": "The black hole X-ray binary 4U 1755$-$338 underwent an outburst in 2020 after 25 years of quiescence. The comprehensive spectral analysis revealed that the system has a low interstellar neutral hydrogen column density of $0.34\\pm0.01 \\times$10$^{22}$ cm$^{-2}$. The outburst began with a low mass-accretion rate and was characterized as a low-luminosity outburst. The radius of the inner accretion disc remained constant throughout the outburst. Additionally, a growing neutral medium with constant density was detected in the local environment of 4U 1755$-$338.The hardness-intensity diagram (HID) did not follow the standard q-shaped pattern, indicating a non-canonical outburst. Instead, the HID showed a correlated evolution of hardness and source flux, suggesting a thermal disc origin of the flux. A wideband spectral analysis was performed using simultaneous NICER-NuSTAR data in two frameworks, based on kerrbb and bhspec. The results of bhspec (kerrbb) based modeling indicate that 4U 1755$-$338 is a high-inclination system, $67.44_{-3.03}^{+9.75}$ ($75.25_{-4.68}^{+5.59}$) degrees, and harbors a moderately spinning black hole with a spin parameter of $0.78_{-0.14}^{+0.02}$ ($0.50_{-0.43}^{+0.19}$) and a mass of $3.37_{-1.04}^{+0.45} (3.28_{-1.1}^{+1.7})M_{\\odot}$ respectively. The inferred key parameters: black hole mass, spin, and system inclination are consistent across both modeling approaches. No reflection features were detected in the spectra of 4U 1755$-$338. The high spectral index, the blackbody nature ($L\\propto T^4$) of the hardness ratio, the absence of reflection signatures, and the weak variability in the power density spectra indicate that the source remained in the high/soft state throughout the outburst."}
{"id": "2602.08940", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2602.08940", "abs": "https://arxiv.org/abs/2602.08940", "authors": ["Bing Theodore Zhang", "Shiqi Yu"], "title": "Microquasar Remnants as Pevatrons Illuminating the Galactic Cosmic Ray Knee", "comment": "4 + 1 figures and 1 table", "summary": "Microquasars are primary candidates for Galactic PeVatrons, yet their collective contribution to the cosmic ray (CR) ``knee\" remains poorly understood. We investigate this contribution by simulating anisotropic diffusive propagation through the Galactic magnetic field (GMF). Our results demonstrate that the GMF establishes a transport regime where magnetic connectivity between sources and the solar neighborhood determines the local flux. Active sources aligned with local GMF lines, such as Cygnus X-1, exhibit significant flux enhancements, while magnetically disconnected sources, such as V616 Mon, are strongly suppressed. By integrating source evolution with anisotropic transport, we show that the observed proton bump at the CR ``knee\" is best reproduced by the cumulative contribution of microquasar remnants, which is often dominated by a few nearby or recent events, rather than the active ones alone. We find that a harder injection spectrum allows CRs from remnants to reproduce the PeV bump after propagation, as low-energy CRs have sufficient time to accumulate while high-energy CRs escape the Galactic plane. Our findings suggest that the integrated history of microquasar remnants, governed by the interplay of source age and magnetic connectivity, is the primary driver populating the observed CR ``knee''."}
{"id": "2602.09025", "categories": ["astro-ph.HE", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2602.09025", "abs": "https://arxiv.org/abs/2602.09025", "authors": ["Aleksandr Rusakov", "Adam S. Burrows", "Tianshu Wang", "David Vartanyan"], "title": "An Exploration of the Equation of State Dependence of Core-Collapse Supernova Explosion Outcomes and Signatures", "comment": "Submitted to AAS Journal manuscript #: AAS73856;", "summary": "We explore, using a state-of-the-art simulation code in 3D and to late enough times to witness final observables, the dependence of core-collapse supernova explosions on the nuclear equation of state. Going beyond questions of explodability, we compare final explosion energies, nucleosynthetic yields, recoil kicks, and gravitational-wave and neutrino signatures using the SFHo and DD2 nuclear equations of state (EOS) for a 9-$M_{\\odot}$/solar-metallicity progenitor star. The DD2 EOS is stiffer and has a lower effective nucleon mass. The result is a more extended protoneutron star (PNS) and lower central densities. As a consequence, the mean neutrino energies, final explosion energy, and recoil kick speed are lower. Moreover, the evolution of PNS convection differs between the two EOS models in significant ways. This translates in part into interestingly altered neutrino ``light\" curves and noticeably altered gravitational-wave signal strengths and frequency characteristics that may be diagnostic. The faster exploding model (SFHo) yields slightly more neutron-rich ejecta and more species with atomic weights between 60 and 90 and a weak r-process. However, this is merely a preliminary study. The next step is a more comprehensive and multi-progenitor set of 3D supernova simulations for various EOSes to late times when the observables have asymptoted. Such a future investigation will have a direct bearing on the neutron star and black hole birth mass functions and the quest towards a fully quantitative theory of supernova observables."}
{"id": "2602.07490", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2602.07490", "abs": "https://arxiv.org/abs/2602.07490", "authors": ["Belov S. M.", "Yanke V. G"], "title": "Scintillation muon telescope module with fiber-optic light collection", "comment": "15 pages, 9 figures", "summary": "A scintillation muon telescope module with fiber-optic light collection using silicon photomultipliers was developed, tested, and installed for continuous monitoring to study cosmic ray variations. The aim of this study was to create a scintillation muon telescope module, continuously monitor the muon component in test mode, and study the long-term stability of the detector parameters. Methods for processing the obtained data were developed. To assess the stability of the module parameters, an internal control technique was used, involving data from other detectors. The results of testing and long-term continuous monitoring showed that the stability of the developed muon detector is better than 0.1%/year, without the need for its operation in a thermostatic chamber. The study concludes that ease of operation, cost, compactness, low power consumption and stability are factors that determine the advantages of the developed module, which is an essential element for constructing a multidirectional muon telescope."}
