{"id": "2601.09788", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.09788", "abs": "https://arxiv.org/abs/2601.09788", "authors": ["Giulia Brunelli", "Kaya Mori", "Jaegeun Park", "Jordan Eagle", "Moaz Abdelmaguid", "Melania Nynka", "Hongjun An", "Aya Bamba", "Joseph D. Gelfand", "Gabriele Ponti", "Samar Safi-Harb", "Vito Sguera", "Cristian Vignali", "Jooyun Woo", "Roberta Zanin"], "title": "New Hard X-Ray and Multiwavelength Study of the PeVatron Candidate PWN G0.9+0.1 in the Galactic Center Region", "comment": "Accepted for publication in the Astrophysical Journal", "summary": "We present a new X-ray study and multiwavelength spectral energy distribution (SED) modeling of the young pulsar wind nebula (PWN) powered by the energetic pulsar PSR J1747-2809, inside the composite supernova remnant (SNR) G0.9+0.1, located in the Galactic Center region. The source is detected by NuSTAR up to 30 keV with evidence for the synchrotron burnoff effect in the changing spatial morphology with increasing energy. The broadband 2-30 keV spectrum of PWN G0.9+0.1 is modeled by a single power law with photon index $Γ=2.11\\pm0.07$. We combined the new X-ray data with the multiwavelength observations in radio, GeV, and TeV gamma rays and modeled the SED, applying a one-zone and a multi-zone leptonic model. The comparison of the models is successful, as we obtained physically compatible results in the two cases. Through the one-zone model, we constrain the age of the system to $\\sim2.2$ kyr, as well as reproduce the observed PWN and SNR radio sizes. In both the one-zone and multi-zone leptonic models, the electron injection spectrum is well-described by a single power law with spectral index $p \\sim 2.6$ and a maximum electron energy of $\\sim2$ PeV, suggesting the source could be a leptonic PeVatron candidate. We estimate the average magnetic field to be $B_{\\rm PWN} \\sim 20\\ μ$G. We also report the serendipitous NuSTAR detection of renewed X-ray activity from the very faint X-ray transient XMMU J174716.1-281048 and characterize its spectrum."}
{"id": "2601.09799", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2601.09799", "abs": "https://arxiv.org/abs/2601.09799", "authors": ["Edward Skrabacz", "Lena Murchikova", "Sean M. Ressler", "Asad Ukani", "Siddhant Solanki"], "title": "Stellar-wind Fueled Accretion onto Sagittarius A* in the Presence of a Nuclear Star Cluster", "comment": "8 pages, 4 figures. Comments are welcome", "summary": "The Milky Way's Galactic Center hosts the black hole Sagittarius A* (Sgr A*), which provides us with a close-up view into supermassive black hole accretion and feedback. Recent works have shown that the winds from $\\sim 30$ Wolf-Rayet (WR) stars orbiting Sgr A* at about 4 arcsec are important contributors to feeding the supermassive black hole. A nuclear star cluster (NSC) with a mass of several $10^6 \\, \\text{M}_\\odot$, of which $10^6 \\, \\text{M}_\\odot$ is within 1 pc, also surrounds Sgr A*. The NSC contributes to the gravitational potential in the Galactic Center, affecting the orbits of the WR stars and their stellar winds. In this work, we examine the effects that the NSC has on the accretion of these stellar winds onto Sgr A* which have previously been neglected. We find that, on the parsec scale, the effect from the gravitational potential of the NSC is negligible on the wind-fed accretion flow, validating the existing simulations used in the literature."}
{"id": "2601.09807", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.09807", "abs": "https://arxiv.org/abs/2601.09807", "authors": ["Mikhail Malkov", "Immanuel Jebaraj"], "title": "Magnetic Pumping: Plasma Heating to Particle Acceleration", "comment": "12 pages, 8 figures", "summary": "One of the earliest mechanisms proposed for plasma heating was magnetic pumping (MP). However, its significance for astrophysical phenomena, including particle acceleration, has yet to be appreciated. MP-energized particles tap energy from magnetic-field oscillations. A particle's momentum component perpendicular to the local B-field increases during field growth by virtue of the adiabatic invariant $p_{\\perp}^{2}/B=const$. The gained $p_{\\perp}$ is then partially scattered elastically into the parallel momentum, $p_{\\parallel}$, with $p^{2}=p_{\\parallel}^{2}+p_{\\perp}^{2}=const$, thereby retaining some fraction of the gained energy before the field decreases to its minimum. This scattering breaks the reversibility of energy exchange between particles and oscillating magnetic fields, thereby increasing the particle energy after each MP cycle. Field oscillations are often assumed to be sinusoidal, and the resulting MP is treated perturbatively. These simplifications restrict astrophysical applications, leaving objects with strong magnetic perturbations outside the scope of adequate treatment. We develop a nonperturbative approach to MP that is suitable for a broad spectrum of magnetic turbulence. The treatment comprises two steps. The first step is common: converting a kinetic equation into an infinite hierarchy of moments of the particle distribution function. The second step is new in MP treatments: we find an exact closure at an arbitrary level of the moment system. The heating is treated exactly at the second-moment closure. Particle acceleration generally requires a higher-level closure to determine the power-law index and the maximum energy of accelerated particles. We propose a method for extracting these crucial acceleration data from the second moment for a broadband random field."}
{"id": "2601.09863", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.09863", "abs": "https://arxiv.org/abs/2601.09863", "authors": ["Ali Taani"], "title": "Gravitational Wave Strain and Orbital Dynamics of Binary Pulsars from LIGO-Virgo to LISA", "comment": "published by The European Physical Journal Plus, 2026, 141 (1), 21", "summary": "We summarize the current state of the art and calculate gravitational wave strain amplitudes for known binary pulsars, using data from current ground-based detectors (LIGO-Virgo-KAGRA) and the upcoming space-based missions (LISA). We present detailed calculations of the characteristic gravitational wave strain values, ranging from 3.0 to 73 $\\times10^{-22}$, across frequencies between 0.66 and 5.87 $\\times10^{-4}$ Hz. Our post-Newtonian approximation analysis yields predicted periastron advance rates from 1.6 to 80.5 deg/yr and orbital period decay rates between -5 and -176 $μ$s/yr for the binary pulsar population. We derive common envelope efficiency parameters ($α_{CE}$) for representative progenitor scenarios within our sample, finding values between 0.63 and 1.16, with notable sensitivity to the binding energy parameter $λ$. Binary neutron star merger rates are estimated at $22.77^{+6.83}_{-6.83}$ Myr$^{-1}$ for the Milky Way, corresponding to a volumetric rate of $227.71^{+68.31}_{-68.31}$ Gpc$^{-3}$ yr$^{-1}$, consistent with the latest LIGO-Virgo-KAGRA observational constraints. Our results illustrate how multi-band gravitational wave observations, from LIGO/Virgo to LISA, can contribute to precise measurements of binary pulsar strain and orbital evolution histories, improving merger time predictions and constraining neutron star physics and common envelope processes"}
{"id": "2601.09766", "categories": ["astro-ph.IM", "astro-ph.EP"], "pdf": "https://arxiv.org/pdf/2601.09766", "abs": "https://arxiv.org/abs/2601.09766", "authors": ["Giada Arney", "Niki Parenteau", "Natalie Hinkel", "Eric Mamajek", "Joshua Krissansen-Totton", "Stephanie Olson", "Edward Schwieterman", "Sara Walker", "Kevin Fogarty", "Ravi Kopparapu", "Jacob Lustig-Yaeger", "Mark Moussa", "Sukrit Ranjan", "Garima Singh", "Clara Sousa-Silva", "Ruslan Belikov", "Maxwell Frissell", "Samantha Gilbert-Janziek", "Vincent Kofman", "Natasha Latouf", "Mary Anne Limbach", "Rhonda Morgan", "Christopher Stark", "Armen Tokadjian", "Anna Grace Ulses", "Nicholas Wogan", "Mike Wong", "Amber Young"], "title": "Habitable Worlds Observatory (HWO): Living Worlds Community Working Group: The Search for Life on Potentially Habitable Exoplanets", "comment": "26 pages, 20 figures", "summary": "The discovery of a biosphere on another planet would transform how we view ourselves, and our planet Earth, in relation to the rest of the cosmos. We now know Earth is one planet among eight circling our sun; our sun is part of a swirling galaxy of over one hundred billion other suns; and our galaxy is one of untold billions in the universe. While we do not yet know how many, if any, other biospheres exist on the countless worlds orbiting countless other suns, we stand at the precipice of a new era of discovery, enabled by powerful new facilities able to peer across the light years into the atmospheres of planets similar to our own. This article is an adaptation of a science case document (SCDD) developed for the NASA Astrophysics Flagship mission the Habitable Worlds Observatory (HWO) Science, Technology, and Architecture Review Team (START) Living Worlds Community Working Group."}
{"id": "2601.09868", "categories": ["astro-ph.HE", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2601.09868", "abs": "https://arxiv.org/abs/2601.09868", "authors": ["Ali Taani"], "title": "Dynamics of Apsidal Motion in Non-Synchronous Binary Pulsars Coupled Orbit and Spin Evolution", "comment": "Published by Astrophysics and Space Science, 2025, 370, (11), 128", "summary": "The apsidal motion of a non-synchronous binary pulsar serves as a valuable probe of relativistic gravity, stellar stricture, and dynamical evolution of close binary systems, In this study, we investigate the combined influence of general relativity, stellar oblateness and tidal interaction on the apsidal motion of three binary pulsars: 1913+16, J0737-3039A/B, and J0621+1002. Zahn's tidal equations \\cite{1977A&A....57..383Z, 1989A&A...220..112Z} were employed for numerical integrations to describe tidal effects and their role in orbital and spin evolution. We estimated the timescales for tidal synchronization and orbital circularization for each system. The results indicate that tidal effects play only a minor role in orbital decay compared with energy loss due to gravitational wave emission. This is evident in the compact system PSR 1913+16, where the orbital period decreases by approximately 76.5 $μ$s/yr as a result of gravitational radiation. The double pulsar J0737-3039A/B exhibits faster orbital evolution, with synchronization occurring in about 8.4$\\times10{^3}$ years, whereas the wider system J0621+1002 shows negligible orbital change over timescales exceeding 10$^{10}$ years. The simulations demonstrate clear trends of decreasing semi-major axis and eccentricity, accompanied by an increase in spin rate among the binary pulsars studied. The derived apsidal motion constants [$k\\simeq0.1$] are consistent with theoretical expected values, and the corresponding tidal friction times (between a few hours to several days) agree well with theoretical predication. These results emphasize the dominant role of relativistic effects in neutron star binaries and highlight the importance of including gravitational-wave terms long-term orbital evolution"}
{"id": "2601.09768", "categories": ["astro-ph.IM", "astro-ph.GA", "cs.AI"], "pdf": "https://arxiv.org/pdf/2601.09768", "abs": "https://arxiv.org/abs/2601.09768", "authors": ["Lorenzo Monti", "Tatiana Muraveva", "Brian Sheridan", "Davide Massari", "Alessia Garofalo", "Gisella Clementini", "Umberto Michelucci"], "title": "CLiMB: A Domain-Informed Novelty Detection Clustering Framework for Scientific Discovery", "comment": "28 pages, 4 figures", "summary": "In data-driven scientific discovery, a challenge lies in classifying well-characterized phenomena while identifying novel anomalies. Current semi-supervised clustering algorithms do not always fully address this duality, often assuming that supervisory signals are globally representative. Consequently, methods often enforce rigid constraints that suppress unanticipated patterns or require a pre-specified number of clusters, rendering them ineffective for genuine novelty detection. To bridge this gap, we introduce CLiMB (CLustering in Multiphase Boundaries), a domain-informed framework decoupling the exploitation of prior knowledge from the exploration of unknown structures. Using a sequential two-phase approach, CLiMB first anchors known clusters using constrained partitioning, and subsequently applies density-based clustering to residual data to reveal arbitrary topologies. We demonstrate this framework on RR Lyrae stars data from the Gaia Data Release 3. CLiMB attains an Adjusted Rand Index of 0.829 with 90% seed coverage in recovering known Milky Way substructures, drastically outperforming heuristic and constraint-based baselines, which stagnate below 0.20. Furthermore, sensitivity analysis confirms CLiMB's superior data efficiency, showing monotonic improvement as knowledge increases. Finally, the framework successfully isolates three dynamical features (Shiva, Shakti, and the Galactic Disk) in the unlabelled field, validating its potential for scientific discovery."}
{"id": "2601.10317", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.10317", "abs": "https://arxiv.org/abs/2601.10317", "authors": ["Wenkang Lian", "He Gao", "Shunke Ai", "B. Theodore Zhang"], "title": "Multimessenger Prospects for Low-Luminosity Gamma-Ray Bursts: Joint Neutrino and X-Ray Observations", "comment": null, "summary": "Low--luminosity gamma-ray bursts (LLGRBs) are promising candidates for high-energy neutrinos, yet no coincident neutrino events have been detected so far. Recent advances in X-ray time-domain astronomy, together with the development of next-generation neutrino telescopes, open new opportunities for joint X-ray and neutrino observations of these transients. We calculate the jet dynamical evolution and the associated neutrino production for both non-magnetized and magnetized outflows. For individual events, joint X-ray and neutrino detection is generally limited to nearby LLGRBs or sources with high luminosities. Thus, we consider a next-generation neutrino telescope with an effective area enhanced by a factor of $\\sim30$ relative to IceCube. In the non-magnetized scenario, joint detection of individual events is enabled for sources with typical isotropic luminosities of $L_{\\mathrm{iso}}\\sim10^{47}\\,\\mathrm{erg\\,s^{-1}}$ out to luminosity distances of $D_L\\sim1.6\\times10^{2}\\,\\mathrm{Mpc}$, corresponding to an expected detection rate of order $1$ per year. In contrast, for the magnetized scenario at the same luminosity, the accessible distance is significantly reduced, with joint observations confined to sources within $D_L\\sim6.5\\times10^{1}\\,\\mathrm{Mpc}$ and an expected detection rate of order $0.5$ per year. For stacked samples of $\\sim100$ magnetized LLGRBs, stacking substantially enlarges the accessible distance range, enabling joint observations for sources with representative luminosities of $L_{\\mathrm{iso}}\\sim1\\times10^{47}\\,\\mathrm{erg\\,s^{-1}}$ out to $D_L\\lesssim7.0\\times10^{2}\\,\\mathrm{Mpc}$ and corresponding to an expected detection rate of order $2$ per year. These results demonstrate that joint X-ray and next-generation neutrino observations enable a practical multimessenger probe of LLGRBs."}
{"id": "2601.09918", "categories": ["astro-ph.IM", "gr-qc"], "pdf": "https://arxiv.org/pdf/2601.09918", "abs": "https://arxiv.org/abs/2601.09918", "authors": ["Preet Baxi", "Jessica Leviton", "Eilam Morag", "Matthew Pitkin", "Keith Riles"], "title": "Monitoring of Continuous-Wave Hardware Injections in LIGO Interferometers during the O4 Observing Run", "comment": null, "summary": "Although there have now been hundreds of transient gravitational-wave detections of merging compact stars by the LIGO-Virgo-KAGRA (LVK) detector network, no continuous-wave (CW) signals have yet been discovered. To ensure that such signals, expected to be exceedingly weak, can be detected in the ongoing O4 observing run by coherent integration over years, simulated waveforms ('hardware injections') are injected directly into the LIGO data by continuously modulating the positions of the interferometer mirrors so as to mimic nearly sinusoidal signals from fast-spinning galactic neutron stars. A set of 18 such simulated CW sources are injected with signal frequencies spanning much of the LIGO detection band and with varying sky locations. By verifying the successful recovery of the simulated signals, including preservation of absolute phase over as many as 10^{11} signal cycles, we validate our understanding of detector response and end-to-end search pipelines, including data cleaning. Daily and weekly monitoring of the signal reconstruction is meant to catch any unexpected sudden changes in interferometer response, to verify that signal-to-noise ratio increases as expected and to verify that simulated source parameters are recovered correctly. We describe three methods of monitoring: 1) a highly templated matched filter to extract signal amplitude and phase precisely; 2) a frequentist Fstatistic evaluation that marginalizes over amplitude, phase and orientation of the star; and 3) a Bayesian reconstruction of the source parameters together with noise characterization. Results from each method are shown, with emphasis on the new templated method, which yields precise measurement of the critical phase offset parameter and therefore validates understanding of absolute timing delays in the detector response and data stream."}
{"id": "2601.10393", "categories": ["astro-ph.HE", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2601.10393", "abs": "https://arxiv.org/abs/2601.10393", "authors": ["Nanda Rea", "Natasha Hurley-Walker", "Manisha Caleb"], "title": "Long Period Transients (LPTs): a comprehensive review", "comment": "23 pages, 12 figures, 3 tables. Under review at the Journal of High Energy Astrophysics. Comments welcome", "summary": "Long Period Transients (LPTs) are a recently identified class of sources characterized by periodic radio bursts lasting seconds to minutes, with flux densities that might reach several tens of Jy. These radio bursts repeat with periodicity from minutes to hours, and they exhibit strong polarization and transient activity periods. To date, about 12 such sources have been identified, which might encompass the same or different physical scenarios. Proposed explanations include binary systems with a white dwarf and a low-mass star companion, slow-spinning magnetars, highly magnetized isolated white dwarfs, and other exotic objects. In a few cases the optical counterpart indeed points toward a white dwarf with a low-mass companion, while in other cases, transient X-ray emission was detected, very common in magnetars. However, despite being able to reproduce partially some of the characteristics of LPTs, all the proposed scenarios find difficulty in explaining the exact physical origin of their bright, highly polarized and periodic radio emission. We review here the state-of-the-art in the observations and interpretation of this puzzling class of radio transients."}
{"id": "2601.10038", "categories": ["astro-ph.IM", "cs.AI", "cs.LG"], "pdf": "https://arxiv.org/pdf/2601.10038", "abs": "https://arxiv.org/abs/2601.10038", "authors": ["Yuan-Sen Ting", "André Curtis-Trudel", "Siyu Yao"], "title": "What Understanding Means in AI-Laden Astronomy", "comment": "Perspective article, 8 pages. Based on the \"Philosophy Sees the Algorithm\" workshop held December 11-12, 2025 at The Ohio State University. Supported by the Alfred P. Sloan Foundation, the Center for Cosmology and AstroParticle Physics (CCAPP), and the University of Cincinnati Center for Humanities and Technology", "summary": "Artificial intelligence is rapidly transforming astronomical research, yet the scientific community has largely treated this transformation as an engineering challenge rather than an epistemological one. This perspective article argues that philosophy of science offers essential tools for navigating AI's integration into astronomy--conceptual clarity about what \"understanding\" means, critical examination of assumptions about data and discovery, and frameworks for evaluating AI's roles across different research contexts. Drawing on an interdisciplinary workshop convening astronomers, philosophers, and computer scientists, we identify several tensions. First, the narrative that AI will \"derive fundamental physics\" from data misconstrues contemporary astronomy as equation-derivation rather than the observation-driven enterprise it is. Second, scientific understanding involves more than prediction--it requires narrative construction, contextual judgment, and communicative achievement that current AI architectures struggle to provide. Third, because narrative and judgment matter, human peer review remains essential--yet AI-generated content flooding the literature threatens our capacity to identify genuine insight. Fourth, while AI excels at well-defined problem-solving, the ill-defined problem-finding that drives breakthroughs appears to require capacities beyond pattern recognition. Fifth, as AI accelerates what is feasible, pursuitworthiness criteria risk shifting toward what AI makes easy rather than what is genuinely important. We propose \"pragmatic understanding\" as a framework for integration--recognizing AI as a tool that extends human cognition while requiring new norms for validation and epistemic evaluation. Engaging with these questions now may help the community shape the transformation rather than merely react to it."}
{"id": "2601.10612", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.10612", "abs": "https://arxiv.org/abs/2601.10612", "authors": ["Kratika Mazde", "Angelo Ricarte", "George N. Wong"], "title": "On the Physical Origins of the Millimeter Fundamental Plane in Active Galactic Nuclei", "comment": "13 pages, 5 figures, submitted to ApJ, comments welcome", "summary": "Observations of active galactic nuclei have revealed a correlation between millimeter luminosity, X-ray luminosity, and mass, suggesting the emission in each of these bands is powered by a common source. Starting with a set of five general relativistic magnetohydrodynamic simulations with dynamically important magnetic fields, we perform ray-tracing calculations to produce spectra including synchrotron emission, bremsstrahlung emission, and Compton scattering. Our models with similar Eddington ratios to the objects for which the relationship was inferred naturally reproduce observations without tuning. Our lower Eddington ratio models depart from this relationship, likely attributable to an observational bias against extremely low accretion rates. We find that inverse Compton scattering dominates the production of X-rays over bremsstrahlung radiation in almost all models, and in all models consistent with the observed correlation. We find only a modest spin dependence in this relationship. This study demonstrates that a compact, hot accretion flow with dynamically important magnetic fields can naturally explain observed millimeter and X-ray properties in low-luminosity active galactic nuclei. Future work should explore the impacts of non-thermal electron populations, weaker magnetic fields, and radiative cooling."}
{"id": "2601.10240", "categories": ["astro-ph.IM", "astro-ph.GA", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2601.10240", "abs": "https://arxiv.org/abs/2601.10240", "authors": ["David Gruner", "Sydney A. Barnes", "Ansgar Reiners", "Klaus G. Strassmeier", "Cristina Chiappini", "Jörg Weingrill", "Michael Weber", "Ilya Ilyin", "Thomas Granzer", "Özgün Adebali", "Jean-Michel Désert", "Marica Valentini", "Dario Fritzewski", "Paolo Ventura", "Alfio Bonanno", "Jose-Dias do Nascimento", "Jorge Melendez", "Santosh Joshi", "Yong-Cheol Kim"], "title": "Large-scale time-series spectroscopy for stellar ages", "comment": "White Paper submitted to ESO for the \"Expanding Horizons: Transforming Astronomy in the 2040s\" Call", "summary": "To date, Galactic Astronomy has largely concerned itself with astrophysical processes, and with the locations, space motions and compositions of objects. Consider, for example, the elucidation of the components of the Galaxy over the past decades, its mapping as enabled by Gaia and its predecessors, the photometric and spectroscopic characterization of innumerable astrophysical objects in various wavelength ranges, both from the ground and from space, and the expanding discovery and characterization of exoplanets; all focused on the current, static Galaxy. This White Paper proposes a dedicated program to derive stellar ages from time-series spectroscopy to hasten the transformation of this static conception into a dynamical one with age-labeled objects and events."}
{"id": "2601.10439", "categories": ["astro-ph.IM", "astro-ph.EP", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2601.10439", "abs": "https://arxiv.org/abs/2601.10439", "authors": ["André M. Silva", "J. P. Faria", "N. C. Santos", "S. G. Sousa", "P. T. P. Viana", "J. H. C. Martins"], "title": "ASTRA: A Python Package for Cross-Instrument Stellar and Telluric Template Construction", "comment": "4 pages, published in the Journal of Open Source Software; all code available at https://github.com/Kamuish/ASTRA", "summary": "ASTRA is a Python package that provides a modular, instrument-independent interface for working with high-resolution stellar spectra. Designed to support data from multiple spectrographs, including ESPRESSO (Pepe et al., 2021), HARPS (Mayor et al., 2003; Pepe et al., 2002), MAROON-X (Seifahrt et al., 2022), and CARMENES (Quirrenbach et al., 2014). ASTRA offers a unified abstraction over their data formats, enabling consistent access to fluxes, wavelengths, uncertainties, and metadata across instruments. Furthermore, it applies the necessary wavelength and flux calibrations that are needed, as described by the official pipelines of each instrument."}
{"id": "2601.10454", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2601.10454", "abs": "https://arxiv.org/abs/2601.10454", "authors": ["V. Vujcic", "V. A. Sreckovic", "S. Babarogic"], "title": "Alertissimo -- a tool for orchestration of LSST broker streams", "comment": "To appear in CAOSP", "summary": "The Vera C. Rubin Observatory, through its Legacy Survey of Space and Time, will soon start producing 10 million alerts on transient astronomical objects per night. Due to logistics and bandwidth, alerts will not be dispatched directly to the public but to 'brokers' i.e. tools selected by LSST to handle alert streams. Brokers offer both common, specific and micro-specific functionalities related to alert handling, analysis, representation and dissemination. In this ecosystem, potentially augmented by data streams from other astronomical sources, there is a - need demonstrated by the community - for use cases which combine features of individual brokers. In this paper we present initial efforts and a prototype of such a tool, along with a language that would allow users to define use cases / workflows in a manner tailored for the domain."}
