{"id": "2601.20902", "categories": ["astro-ph.IM", "astro-ph.EP"], "pdf": "https://arxiv.org/pdf/2601.20902", "abs": "https://arxiv.org/abs/2601.20902", "authors": ["Katy L. Chubb", "Mei Ting Mak", "Joanna K. Barstow", "Beth Biller", "Sarah Rugheimer", "Daphne M. Stam", "Victor Trees"], "title": "The power of polarimetry for characterising exoplanet atmospheres, clouds, and surfaces with NASA's Habitable Worlds Observatory", "comment": "White paper submitted to the UK Space Agency's initiative \"UK Space Frontiers 2035\"", "summary": "The Habitable Worlds Observatory (HWO), planned for launch in the 2040s, represents the next major step in exoplanet characterisation. HWO will, for the first time, enable detailed studies of the atmospheres and surfaces of Earth-like exoplanets through high-contrast reflection spectroscopy across the UV, optical, and near-infrared. These wavelength ranges provide access to key molecular absorption features, including O2, O3, H2O, CO2, and CH4, as well as potential surface biosignatures such as the vegetation red edge or ocean glint, making HWO a cornerstone mission for assessing planetary habitability.\n  Clouds are a dominant factor in determining planetary climate and observability, yet their properties remain highly degenerate when constrained using reflected flux alone. Spectropolarimetry, a measure of the polarisation state of reflected light as a function of wavelength and orbital phase, provides a powerful complementary diagnostic. Polarisation is highly sensitive to cloud particle size, composition, shape, vertical distribution, and surface type, enabling degeneracies between atmospheric and surface models to be broken. Numerous studies have demonstrated the value of polarimetry for characterising a wide range of exoplanets, from hot Jupiters to cooler potentially habitable worlds.\n  HWO's proposed instrument suite includes a coronagraph, a high-resolution imager, and a candidate high-resolution spectropolarimeter, offering multiple pathways to exploit polarimetry across diverse planetary regimes. This white paper argues that incorporating polarimetric capability into HWO instruments would significantly enhance the mission's scientific return. We highlight the unique opportunity for UK leadership in both instrument development and theoretical modelling, and advocate for a strong UK role in shaping HWO's polarimetric capabilities to maximise its impact on exoplanet science."}
{"id": "2601.20914", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2601.20914", "abs": "https://arxiv.org/abs/2601.20914", "authors": ["Nicolás Cardiel", "Sergio Pascual", "María Chillarón-Víctor", "Cristina Cabello", "Jesús Gallego", "Jaime Zamorano", "María Teresa Ceballos"], "title": "Teareduce: a Python package with utilities for teaching reduction techniques in Astronomy", "comment": "4 pages, 3 figures, proceeding 35th annual conference on Astronomical Data Analysis Software & Systems, 9-13 Nov 2025, Görlitz", "summary": "The Python package teareduce has been developed to support teaching activities related to the reduction of astronomical data. Specifically, it serves as instructional material for students participating in practical classes on the processing of astronomical images acquired with various instruments and telescopes. These classes are part of the course Experimental Techniques in Astrophysics, which belongs to the Master's Degree in Astrophysics at the Complutense University of Madrid. The code is publicly available on GitHub, accompanied by a documentation page that includes Jupyter notebooks demonstrating the use of its various classes and functions."}
{"id": "2601.21603", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2601.21603", "abs": "https://arxiv.org/abs/2601.21603", "authors": ["K. Karatsu", "A. Endo", "A. Moerman", "S. J. C. Yates", "R. Huiting", "A. Pascual Laguna", "S. Dabironezare", "V. Murugesan", "D. J. Thoen", "B. T. Buijtendorp", "S. Cray", "K. Fujita", "S. Hähnle", "S. Hanany", "R. Kawabe", "K. Kohno", "L. H. Marting", "T. Matsumura", "S. Nakatsubo", "L. G. G. Olde Scholtenhuis", "T. Oshima", "M. Rybak", "F. Steenvoorde", "R. Takaku", "T. Takekoshi", "Y. Tamura", "A. Taniguchi", "P. P. van der Werf", "J. J. A. Baselmans"], "title": "DESHIMA 2.0: A 200-400 GHz Ultra-wideband Integrated Superconducting Spectrometer", "comment": "14 pages, 10 figures", "summary": "DESHIMA (Deep Spectroscopic HIgh-redshift MApper) is a broadband integrated superconducting spectrometer (ISS) for millimeter (mm) / sub-millimeter (sub-mm) wave astronomy based on Kinetic Inductance Detectors (KIDs). This paper describes characterization of DESHIMA 2.0 in laboratory settings. The instrument features NbTiN superconducting microstrip (MS) filters with low-loss a-SiC:H dielectric and an ultra-wideband leaky-wave antenna. A laboratory setup was designed, incorporating the cryostat housing cryogenic optics and ISS chip comprising 339 KIDs connected to MS filters tuned for (sub-)mm wave frequencies. Room-temperature mirrors on a hexapod stage allowed precise positioning and alignment of optical elements. The sky-position chopper was positioned on a motor-controlled stage for fine-tuned control over its position and alignment. Thanks to the multiplexing capability of KIDs, we could simultaneously measure multiple performance metrics across the entire frequency range. We showed that DESHIMA 2.0 achieved significant improvements in performance compared to its predecessor (DESHIMA 1.0): measured instantaneous frequency coverage was 200$-$400 GHz with a mean filter $Q_{filter}$ of $340 \\pm 50$; instrument efficiency reached $\\sim8$ \\%, indicating 4 times wider band coverage and 4 times higher sensitivity. The yield rate for MS filters exceeded 98 \\%. The estimated aperture efficiency from measured beam patterns agreed well with the designed value of approximately 70 \\%. The telescope far-field beam patterns calculated from measured beam patterns also exhibited good agreement with design specifications. We also demonstrated validity of a new method of absolute frequency calibration using the data from beam pattern measurement."}
{"id": "2601.21946", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2601.21946", "abs": "https://arxiv.org/abs/2601.21946", "authors": ["Wesley Andrés Watters", "Laura Dominé", "Sarah Little", "Cameron Pratt", "Kevin H. Knuth"], "title": "Critical Evaluation of Studies Alleging Evidence for Technosignatures in the POSS1-E Photographic Plates", "comment": null, "summary": "Recent studies by B. Villarroel and colleagues have assembled and analyzed datasets of unidentified features measured from digital scans of photographic plates captured by the first-epoch Palomar Observatory Sky Survey (POSS1) in the pre-Sputnik era. These studies have called attention to (i) a purported deficit of features within Earth's shadow; (ii) the sporadic presence of linear clusters; and (iii) a positive correlation between the timing of feature observations and nuclear tests as well as Unidentified Aerial Phenomena (UAP) sighting reports. These observations were cited as evidence that some fraction of the unidentified features represent glinting artificial objects near Earth. We have examined these claims using two related, previously published datasets. When analyzing the most vetted of these, we do not observe the reported deficit in the terrestrial shadow. We determine that a third of the features in the reported linear clusters were not confidently distinguished from catalog stars. We find that the reported correlation between the timing of feature observations and nuclear tests becomes insignificant after properly normalizing by the number of observation days, and is almost completely determined by the observation schedule of the Palomar telescope. We uncover important inconsistencies in the definitions of the datasets used in these studies, as well as the use of unvalidated datasets containing catalog stars, scan artifacts, and plate defects. It has not been shown that any of the features in these datasets represent optical transients. We examine the spatial distribution of the plate-derived features, finding an overall gradual increase in number density toward the corners and edges of plates, as well as examples of (i) empty north-south strips that span multiple plates; (ii) clusters and voids having geometric shapes; and (iii) amorphous clusters."}
{"id": "2601.20934", "categories": ["astro-ph.HE", "hep-ph"], "pdf": "https://arxiv.org/pdf/2601.20934", "abs": "https://arxiv.org/abs/2601.20934", "authors": ["Mainak Mukhopadhyay", "Patrick Wusinich", "Kohta Murase"], "title": "Constraining high-energy neutrinos from tidal disruption events with IceCube high-energy starting events", "comment": "23 pages, 7 figures", "summary": "Tidal disruption events (TDEs) have been proposed as candidate sources of high-energy neutrinos. Successful and choked jets, as well as the accretion disk, corona, wind, and outflow regions in a TDE have been examined and shown to produce TeV - PeV neutrinos. In this work, we use the IceCube 12.5 year high energy starting events (HESE) dataset and perform a maximum likelihood analysis to investigate the spatial and temporal correlations between HESE dataset and a selected sample of 89 TDEs. Our results indicate that the currently observed data do not show any significant correlation and hence is consistent with the background only hypothesis. Using this result, we place constraints on the fraction of TDEs harboring intrinsic jets ($f_{\\rm jet}$) and the corresponding isotropic-equivalent cosmic ray (CR) energy ($\\mathcal{E}_{\\rm CR}$). We note that even with limited statistics, we can constrain the parameter space as $\\mathcal{E}_{\\rm CR} \\lesssim 3 \\times 10^{53}$ erg for $f_{\\rm jet} \\gtrsim 0.6$ at more than 90% C.L. Finally, we discuss the theoretical implications of our results and the limits on the all-sky diffuse neutrino flux from TDEs. With more observational data in the electromagnetic band for TDEs and neutrino observations from IceCube and KM3NeT, our analysis can be used to place stringent constraints on physical parameters associated with TDEs."}
{"id": "2601.21231", "categories": ["astro-ph.HE", "astro-ph.IM", "astro-ph.SR", "cs.LG"], "pdf": "https://arxiv.org/pdf/2601.21231", "abs": "https://arxiv.org/abs/2601.21231", "authors": ["Alex Ross", "Tianqi Zhao", "Sanjay Reddy"], "title": "Data-Driven Generation of Neutron Star Equations of State Using Variational Autoencoders", "comment": "12 pages, 8 figures. In preparation for submission to Machine Learning: Science and Technology", "summary": "We develop a machine learning model based on a structured variational autoencoder (VAE) framework to reconstruct and generate neutron star (NS) equations of state (EOS). The VAE consists of an encoder network that maps high-dimensional EOS data into a lower-dimensional latent space and a decoder network that reconstructs the full EOS from the latent representation. The latent space includes supervised NS observables derived from the training EOS data, as well as latent random variables corresponding to additional unspecified EOS features learned automatically. Sampling the latent space enables the generation of new, causal, and stable EOS models that satisfy astronomical constraints on the supervised NS observables, while allowing Bayesian inference of the EOS incorporating additional multimessenger data, including gravitational waves from LIGO/Virgo and mass and radius measurements of pulsars. Based on a VAE trained on a Skyrme EOS dataset, we find that a latent space with two supervised NS observables, the maximum mass $(M_{\\max})$ and the canonical radius $(R_{1.4})$, together with one latent random variable controlling the EOS near the crust--core transition, can already reconstruct Skyrme EOSs with high fidelity, achieving mean absolute percentage errors of approximately $(0.15\\%)$ for $(M_{\\max})$ and $(R_{1.4})$ derived from the decoder-reconstructed EOS."}
{"id": "2601.20953", "categories": ["astro-ph.HE", "gr-qc"], "pdf": "https://arxiv.org/pdf/2601.20953", "abs": "https://arxiv.org/abs/2601.20953", "authors": ["Eduardo M. Gutiérrez", "David Radice", "Jacob Fields", "James M. Stone"], "title": "Turbulent Dynamo Action in Binary Neutron Star Mergers", "comment": null, "summary": "Binary neutron star mergers are expected to generate intense magnetic fields that power relativistic and non-relativistic outflows and shape their multimessenger signatures. These fields likely arise from the turbulent amplification of initially weak magnetic fields during the merger, particularly via the Kelvin-Helmholtz instability at the collisional interface between the stars. While previous studies have shown efficient amplification to magnetar-level strengths, the degree of large-scale coherence of the resulting field remains uncertain. We present general-relativistic, dynamical spacetime, magnetohydrodynamic simulations following the evolution of initially weak, pulsar-like magnetic fields in a binary neutron star merger. We find rapid magnetic field growth at small scales with clear signatures of small-scale turbulent dynamo action. At the highest resolutions, we additionally observe the emergence of coherent magnetic structures on larger scales. Our results imply that strong, ordered magnetic fields may be present immediately after merger, with important implications for the subsequent evolution of the remnant and its observable electromagnetic and gravitational-wave signals."}
{"id": "2601.20964", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.20964", "abs": "https://arxiv.org/abs/2601.20964", "authors": ["Peter Clark", "Joseph Callow", "Or Graur", "Alexei V. Filippenko", "Thomas G. Brink", "WeiKang Zheng", "Jessica Aguilar", "Steven Ahlen", "Segev BenZvi", "Davide Bianchi", "David Brooks", "Todd Claybaugh", "Andrei Cuceu", "Axel de la Macorra", "Arjun Dey", "Peter Doel", "Jaime E. Forero-Romero", "Enrique Gaztañaga", "Satya Gontcho A Gontcho", "Gaston Gutierrez", "Victoria Fawcett", "Mustapha Ishak", "Jorge Jimenez", "Dick Joyce", "Stephanie Juneau", "Theodore Kisner", "Anthony Kremin", "Martin Landriau", "Laurent Le Guillou", "Marc Manera", "Aaron Meisner", "Ramon Miquel", "John Moustakas", "Seshadri Nadathur", "Will J. Percival", "Francisco Prada", "Ignasi Pérez-Ràfols", "Graziano Rossi", "Eusebio Sanchez", "David Schlegel", "Michael Schubnell", "Joseph Harry Silber", "David Sprayberry", "Gregory Tarlé", "Benjamin A. Weaver", "Rongpu Zhou", "Hu Zou"], "title": "Early results in the search for extreme coronal line emitters with the Dark Energy Spectroscopic Instrument", "comment": "Submitted to MNRAS. Main text 41 pages, 32 figures with additional appendices", "summary": "Here we present the results of our search through the Early Data Release (EDR) of the Dark Energy Spectroscopic Instrument (DESI) for extreme coronal line emitters (ECLEs) - a rare classification of galaxies displaying strong, high-ionization iron coronal emission lines within their spectra. With the requirement of a strong X-ray continuum to generate the coronal emission, ECLEs have been linked to both active galactic nuclei (AGNs) and tidal disruption events (TDEs). We focus our search on identifying TDE-linked ECLEs. We identify three such objects within the EDR sample, highlighting DESI's effectiveness for discovering new nuclear transients, and determine a galaxy-normalized TDE-linked ECLE rate of $R_\\mathrm{G}=5~^{+5}_{-3}\\times10^{-6}~\\mathrm{galaxy}^{-1}~\\mathrm{yr}^{-1}$ at a median redshift of z = 0.2 - broadly consistent with previous works. Additionally, we also identify more than 200 AGNs displaying coronal emission lines, which serve as the primary astrophysical contaminants in searches for TDE-related events. We also include an outline of the custom python code developed for this search."}
{"id": "2601.20965", "categories": ["astro-ph.HE", "hep-ph", "hep-th"], "pdf": "https://arxiv.org/pdf/2601.20965", "abs": "https://arxiv.org/abs/2601.20965", "authors": ["Willy Fischler", "Tom Banks"], "title": "Proposal to Search for the CP Violating Electromagnetic Vacuum Angle at the Event Horizon Telescope", "comment": "8 pages, no figures", "summary": "We examine the possibility that evidence for a non-zero value of the CP violating $ \\frac{e^2 }{32π^2}θ_{EM} \\int d^4 x {\\vec E}\\cdot {\\vec B}$ coupling might be extracted from Event Horizon Telescope observations of the black holes SgA* and M87*. The Fischler-Kundu\\cite{FK} effect predicts a universal Hall current in the relaxation of charge falling onto the black hole horizon. We argue that this leads to a non-zero value of a certain CP-violating observable ${\\cal C}$, defined below. The effect can be masked by parity violating plasma currents. In particular, evidence for polarization flips \\cite{flip} in the signals from M87* indicate strong plasma effects in the data. We suggest that time averaging the data over periods including the flip might leave over a residual that would be an indicator of the FK signal. In addition, similarities in the polarization patterns between the two very different black holes, and a part of the signal that is uniform in frequency, might enable us to distinguish the universal topological signal from source and frequency dependent plasma effects. Current data does not appear to be sufficient to perform such a test."}
{"id": "2601.21041", "categories": ["astro-ph.HE", "astro-ph.CO"], "pdf": "https://arxiv.org/pdf/2601.21041", "abs": "https://arxiv.org/abs/2601.21041", "authors": ["Dylan L. Jow", "Delon Shen"], "title": "Towards precision astrometry of scattered images of compact radio sources: scintillometry theory and prospects", "comment": null, "summary": "Compact radio sources such as pulsars and FRBs undergo scintillation in the interstellar medium (ISM) when scattered images interfere at the observer. ``Scintillometry'' refers to the range of techniques to extract astrometric information -- such as the angular positions of the images and distances to the scattering screen and source -- from scintillation observations. Pulsar scintillometry has proven to be a powerful technique, revealing rich and unexpected scattering phenomenology in the ISM and also shedding light on the emission physics of pulsars. FRB scintillometry stands to be a similarly powerful probe of FRB emission, as well as structure on tiny scales in ionized media beyond our galaxy, such as the circumgalactic medium (CGM). However, nascent FRB scintillation studies are far from the sophisticated lensing geometry reconstructions that have been performed for scintillating pulsars. In this paper, we introduce a novel theoretical framework for scintillometry, demonstrating that the full astrometric content of scintillation observations is contained within a single underlying observable: the instantaneous spatial wavefield. We relate the instantaneous spatial wavefield to more familiar concepts from the pulsar scintillometry literature, such as the dynamic spectrum. Using this framework, we discuss prospects and limitations for FRB scintillometry, towards the goal of full astrometric reconstructions of FRB lensing geometries. We show how key degeneracies in two-screen scattering measurements can be ameliorated. In addition, we discuss the possibility of inferring dispersion measure gradients across scintillation screens, which may shed light on the highly unconstrained physics of the cool CGM phase on tiny ($\\sim 100\\,{\\rm au}$) scales."}
{"id": "2601.21099", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2601.21099", "abs": "https://arxiv.org/abs/2601.21099", "authors": ["M. Berton", "E. Järvelä", "S. Chen", "L. Crepaldi", "I. Varglund", "M. Coloma Puga", "A. Jimenez-Gallardo", "A. Lähteenmäki", "S. Panda", "C. Piscitelli", "A. Tortosa"], "title": "NOCTURNE. I. The radio spectrum of narrow-line Seyfert 1 galaxies", "comment": "10 pages, 5 figures, appendix 11 pages. Resubmitted to A&A after revision", "summary": "The origin of the radio emission in active galactic nuclei (AGN) is still debated. Multiple physical mechanisms can contribute to the spectrum at these frequencies, including relativistic jets, the jet base, outflows, star formation, and synchrotron emission from the hot corona. Recently, new extreme radio variability has been observed in the class of low-mass/high-Eddington AGN known as narrow-line Seyfert 1 (NLS1) galaxies, suggesting that another, more exotic mechanism may also play a role, especially at frequencies above 10 GHz. To investigate this relatively unexplored area of the radio spectrum, we observed a sample of 50 NLS1s with the Karl G. Jansky Very Large Array (JVLA), and 20 of them were observed twice. In this sample, 24 sources were not detected, while the others are typically characterized by a steep spectrum that can be modeled with a power law. We also identified two new candidate jetted NLS1s, including a high-frequency peaker, which is an extremely young relativistic jet. We found no significant variability in the sources observed twice. We conclude that the radio spectrum of NLS1s is typically dominated by optically thin emission, likely from low-power outflows, or by circumnuclear star formation, with a limited contribution from relativistic jets. Further studies at different spatial scales and at other wavelengths are necessary to fully constrain the origin of the radio emission in this class of active galaxies."}
{"id": "2601.21231", "categories": ["astro-ph.HE", "astro-ph.IM", "astro-ph.SR", "cs.LG"], "pdf": "https://arxiv.org/pdf/2601.21231", "abs": "https://arxiv.org/abs/2601.21231", "authors": ["Alex Ross", "Tianqi Zhao", "Sanjay Reddy"], "title": "Data-Driven Generation of Neutron Star Equations of State Using Variational Autoencoders", "comment": "12 pages, 8 figures. In preparation for submission to Machine Learning: Science and Technology", "summary": "We develop a machine learning model based on a structured variational autoencoder (VAE) framework to reconstruct and generate neutron star (NS) equations of state (EOS). The VAE consists of an encoder network that maps high-dimensional EOS data into a lower-dimensional latent space and a decoder network that reconstructs the full EOS from the latent representation. The latent space includes supervised NS observables derived from the training EOS data, as well as latent random variables corresponding to additional unspecified EOS features learned automatically. Sampling the latent space enables the generation of new, causal, and stable EOS models that satisfy astronomical constraints on the supervised NS observables, while allowing Bayesian inference of the EOS incorporating additional multimessenger data, including gravitational waves from LIGO/Virgo and mass and radius measurements of pulsars. Based on a VAE trained on a Skyrme EOS dataset, we find that a latent space with two supervised NS observables, the maximum mass $(M_{\\max})$ and the canonical radius $(R_{1.4})$, together with one latent random variable controlling the EOS near the crust--core transition, can already reconstruct Skyrme EOSs with high fidelity, achieving mean absolute percentage errors of approximately $(0.15\\%)$ for $(M_{\\max})$ and $(R_{1.4})$ derived from the decoder-reconstructed EOS."}
{"id": "2601.21411", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2601.21411", "abs": "https://arxiv.org/abs/2601.21411", "authors": ["Chengchao Yuan", "Ruo-Yu Liu"], "title": "TeV Gamma-Rays from the Low-Luminosity Active Galactic Nucleus NGC 4278: Implications for the Diffuse Neutrino Background", "comment": "11 pages, 4 figures, 2 tables", "summary": "This work investigates the origin of the TeV emission detected by the Large High Altitude Air Shower Observatory (LHAASO) from NGC 4278, a galaxy hosting a low-luminosity active galactic nucleus (LLAGN). Considering two plausible scenarios, AGN jets and winds, we model the X-ray, GeV, and TeV emission during both TeV-low (quasi-quiet) and TeV-high (active) states. The spectral energy distributions can be explained either by single-zone leptonic emission from moderately relativistic jets or by lepto-hadronic emission from sub-relativistic winds. The best-fit parameters suggest that the transition from the quasi-quiet to the active state may be driven jointly by an enhanced accretion rate and the expansion of jets or winds. We further show that future MeV and very-high-energy $γ$-ray observations can discriminate between the {leptonic and lepto-hadronic scenarios}. Although the neutrino flux from NGC~1068 predicted by the wind model is too low to be detected with current neutrino observatories, a lepto-hadronic wind scenario can account for the PeV diffuse neutrino background when adopting a local LLAGN density corrected for the TeV duty cycle, $n_{\\rm L,0}(ΔT_{\\rm TeV}/T) \\sim 10^{-5}~\\rm Mpc^{-3}$, as inferred from the LHAASO detection."}
{"id": "2601.21537", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.21537", "abs": "https://arxiv.org/abs/2601.21537", "authors": ["Samuzal Barua", "Hengxiao Guo", "Minfeng Gu", "Wenwen Zuo"], "title": "Compton hump reverberation lag in the bright Seyfert 1 galaxy IC 4329A with NuSTAR", "comment": "Accepted for Publication in ApJ, 14 pages, 8 figures, 1 Table", "summary": "Recent reverberation delay measurements have moved beyond the 10 keV X-ray range, providing evidence for the Compton hump (a.k.a. reflection hump) in the lag spectra. We report the relativistic reverberation of the reflection hump in the bright Seyfert\\,1 galaxy IC\\,4329A based on a long {\\it NuSTAR} observation. We find a delayed response of the 20--30 keV X-ray band, with a lag time of $\\sim1825$ s at frequencies $0.5-1.5 \\times 10^{-4}$ Hz. The lag amplitude drops to $\\sim195$ s as the frequencies increase to $(1.5-10)\\times10^{-4}$ Hz. Including IC\\,4329A, so far five sources have been explored for reflection hump reverberation. We perform reverberation modelling of the 3--50 keV lag-energy spectra using the general relativistic transfer function code, which provides independent timing-based measurements of the black hole mass $M_{\\rm BH}=1.37_{-0.36}^{+0.33}\\times10^8~M_{\\odot}$ and the coronal height $h=2.45_{-2.36}^{+1.92}~R_{\\rm g}$ (with uncertainties at 90\\% confidence). Within the uncertainties, the measured mass is found to be consistent with the previous finding. Furthermore, we undertake reflection spectroscopy to account for the hump feature and the associated relativistic effect using the time-averaged flux spectrum. Further sampling of the {\\it NuSTAR} data (with a bin width of 0.2/0.4 keV below and above 10 keV) that reshapes the spectral resolution allows us to constrain the coronal temperature at $50.26_{-4.03}^{+5.58}$ keV -- consistent with the previous result from the combined {\\it Suzaku} and {\\it NuSTAR} data."}
{"id": "2601.21689", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.21689", "abs": "https://arxiv.org/abs/2601.21689", "authors": ["Agnibha De Sarkar"], "title": "Investigating the emission signatures of pulsar halo candidate HESS J1813-126", "comment": "15 pages, 8 figures, 2 tables; accepted for publication in Astronomy & Astrophysics (A&A) and in press", "summary": "Extended gamma-ray sources surrounding middle-aged pulsars, primarily observed at teraelectronvolt energies, have been interpreted as pulsar halos, where relativistic $e^\\pm$ diffuse into the interstellar medium and produce inverse-Compton (IC) emission. HESS J1813-126, associated with the energetic, radio-quiet gamma-ray pulsar PSR J1813-1246, has been suggested as a candidate pulsar halo, though its nature remains uncertain. We interpreted the high-energy emission of PSR J1813-1246 using the synchro-curvature (SC) radiation model and tested whether the gamma-ray spectral energy distribution (SED) of HESS J1813-126 can be explained as a pulsar halo powered by PSR J1813-1246. We explain the X-ray and gamma-ray SEDs of the pulsar using the SC framework. We further computed the transport and losses of $e^\\pm$ injected by the pulsar through time-dependent diffusion-loss equations, exploring various common pulsar halo transport models. The resulting IC emission was compared with \\textit{Fermi}-LAT, H.E.S.S., HAWC, and LHAASO data. We present predictions for the surface brightness profiles (SBPs) and the aperture-dependent emission for the different transport models, providing key diagnostics for assessing the observability of HESS J1813-126 with current and future instruments. The SC framework successfully reproduces the emission of PSR J1813-1246. The SED of HESS J1813-126 can be consistently reproduced within different pulsar halo frameworks, albeit with distinct predictions across different transport models. The corresponding SBP predictions and aperture-dependent emission offer testable signatures for future imaging atmospheric Cherenkov telescopes, which will be crucial for discriminating between the transport models. We further examined the link between the pulsar central engine and its extended halo by comparing the pair multiplicities in the magnetospheric and halo regions."}
{"id": "2601.21693", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.21693", "abs": "https://arxiv.org/abs/2601.21693", "authors": ["Liang Li", "Yu Wang", "Jin-Jun Geng", "Yong-Feng Huang", "Rong-Gen Cai"], "title": "Pulse-resolved Classification and Characteristics of Long-duration GRBs with \\emph{Swift}-BAT Data.I. Precursors versus Main Bursts", "comment": "33 pages, 6 figures (including 73 panels), 6 tables", "summary": "We present a systematic pulse-by-pulse analysis of 22 long-duration GRBs observed by \\emph{Swift}, each exhibiting a well-separated precursor before the main burst. We compare duration, spectral hardness ratio, minimum variability timescale (MVT), and spectral lag between these components. Both precursors and main bursts have durations and hardness broadly consistent with Type II GRBs. However, precursors show longer MVTs (by factors of 3-10) and diverse lags with near-zero median values, while main bursts display variable MVTs and positive lags. These differences suggest precursors may originate from distinct dissipation conditions, possibly due to cocoon shock breakout or early magnetically dominated outflows. Despite temporal differences, both episodes are consistent with a single collapsar origin, providing no evidence for dual-progenitor events. Our findings support pulse-resolved classification and show that precursors offer critical insights into jet formation and pre-burst activity."}
{"id": "2601.21827", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.21827", "abs": "https://arxiv.org/abs/2601.21827", "authors": ["Zhi-Qiu Huang", "Om Sharan Salafia", "Lara Nava", "Annalisa Celotti", "Giancarlo Ghirlanda"], "title": "Late-time X-ray afterglows of GRBs: Implications for particle acceleration at relativistic shocks", "comment": "submitted to A&A", "summary": "Particle-in-cell (PIC) numerical simulations are currently among the most advanced tools to investigate particle acceleration at relativistic shocks. Still, they come with limitations imposed by finite computing power, whose impact is not straightforward to evaluate a priori. Observational features are hence required as verification. energy electrons accelerated at external shocks, provides a testbed for such predictions. Current numerical studies suggest that in GRB afterglows the maximum synchrotron photon energy, which corresponds to the limit of electron acceleration, may fall within the $\\sim$ 0.1--10 keV X-ray energy band at late times, $t\\gtrsim 10^6 - 10^7$ s. To test this prediction, we analyzed the X-ray spectra of six GRBs with \\emph{Swift}/XRT detections beyond $10^7$ s: our analysis reveals no clear evidence of a spectral cutoff. Using a model that accounts for the effect of the finite opening angle of the shock on the observed maximum synchrotron photon energy, we show that these observations are incompatible with PIC simulation predictions, unless one or more physical afterglow parameters attain values at odds with those typically inferred from afterglow modeling (small radiative efficiency, low ambient density, large equipartition fraction $ε_{\\rm B}$ of the magnetic field). These findings challenge existing numerical simulation results and imply a more efficient acceleration of electrons to high-energies than seen in PIC simulations, with important implications for our understanding of particle acceleration in relativistic shocks."}
{"id": "2601.21870", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.21870", "abs": "https://arxiv.org/abs/2601.21870", "authors": ["Wen-Long Zhang", "Jun-Jie Wei"], "title": "Extreme-Value Distribution Analysis of the Second CHIME/FRB Catalog: Assessing the Rarity of the One-off FRB 20250316A", "comment": "9 pages, 4 figures", "summary": "We present a statistical analysis of the extreme brightness of the fast radio burst FRB 20250316A, a luminous, apparently non-repeating event detected by CHIME/FRB. Employing a model-agnostic framework based on the Generalized Extreme Value (GEV) distribution applied to the second CHIME/FRB catalog, we quantify its rarity within the current population. Bayesian fitting of GEV models to block maxima of peak flux and fluence data reveals FRB 20250316A to be a profound statistical outlier. For the peak flux, the analysis yields a return period of $\\sim$ 600 years ($1σ$ credible level), with the underlying distribution being of the heavy-tailed, unbounded Fréchet type ($ξ> 0$). The fluence analysis indicates greater complexity: while the full sample suggests a Fréchet-type distribution with a $\\sim50$-year return period in $1σ$ credible level, the removal of three other notable outliers points toward a light-tailed Weibull-type distribution ($ξ< 0$) with a finite upper bound far exceeded by FRB 20250316A. This dichotomy highlights the challenge in characterizing the tail of the FRB luminosity function with limited data. Although less extreme in recurrence time than the ``Brightest Of All Time'' gamma-ray burst GRB 221009A, FRB 20250316A constitutes a similarly exceptional event (a potential FRB ``BOAT'') within the short observational history of wide-field radio surveys. Our results underscore the existence of rare, highly luminous events that may probe the upper limits or distinct sub-populations of the FRB luminosity distribution."}
{"id": "2601.21974", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.21974", "abs": "https://arxiv.org/abs/2601.21974", "authors": ["Collin M. Dabbieri", "Jessie C. Runnoe", "Michael Eracleous", "Mary E. Kaldor", "Mary Ogborn", "Niana N. Mohammed"], "title": "Spectroscopic Variability of the Broad H$β$ Emission Line in Sloan Digital Sky Survey Quasars", "comment": null, "summary": "We present a catalog of broad H$β$ variability properties for all spectra of quasars with $z<0.8$ and at least two observations included in the Sloan Digital Sky Survey (SDSS) Data Release 16 quasar catalog. For each spectrum, we perform a spectral decomposition to isolate the broad H$β$ emission. We measure the luminosity, FWHM, equivalent width, centroid, and Pearson skewness coefficient of broad H$β$ and provide derived physical properties such as the single-epoch black hole mass and the bolometric luminosity. For each pair of spectra in the sample, we calculate the change in radial velocity of the centroid of broad H$β$ emission ($Δv_{rad}$) as well as other derived properties related to broad H$β$ shape variability. We use forward-modeling methods to estimate the uncertainty in our measurements and discuss an improved method for estimating the uncertainty in $Δv_{rad}$ in the case where a spectral decomposition is used to isolate the broad H$β$ emission. We find that $Δv_{rad}$ is not normally distributed and that the shape of the distribution depends on the interval between observations. We discuss the effect of the predominance of the Reverberation Mapping subsample in the sample of pairs of spectra in SDSS."}
{"id": "2601.21995", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.21995", "abs": "https://arxiv.org/abs/2601.21995", "authors": ["Julien A. Kearns", "Dominic O. Chang", "Daniel C. M. Palumbo", "Shane W. Davis"], "title": "Constraining Black Hole Parameters from Shadow and Inner-Shadow Morphology Considering Effects from Thick Disk Accretion Flows", "comment": "10 pages, 6 figures", "summary": "We study the effects of emission geometry on the capability to constrain black hole parameters from measurements of the shadow and inner-shadow of a Reissner-Nordström black hole. We investigate the capability to constrain mass, charge, observer inclination, and emission co-latitude from images of black hole accretion flows that would arise from thick and thin accretion disks. We confirm previous studies that have shown that independent radii measurements of the shadow and inner-shadow can constrain black hole parameters if the viewing inclination is known, but find that it is only possible if the true emission geometry is also assumed. We study the constraining capabilities of the shadow and inner-shadow observations of M87* and Sgr A* like systems within the context of the BHEX and NgEHT future observatories."}
