{"id": "2601.11695", "categories": ["astro-ph.IM", "astro-ph.EP"], "pdf": "https://arxiv.org/pdf/2601.11695", "abs": "https://arxiv.org/abs/2601.11695", "authors": ["Jens Kammerer", "Sydney Vach", "Sylvestre Lacour", "Mathias Nowak", "Thomas Winterhalder", "Antoine Mérand", "Akke Corporaal", "Guillaume Bourdarot", "Stefan Kraus", "Sasha Hinkley"], "title": "Exoplanet atmospheres and demographics in the 2040s", "comment": "Submitted as science white paper to ESO Expanding Horizons call", "summary": "Direct observations of exoplanets probe the demographics and atmospheric composition of young self-luminous companions, yielding insight into their formation and early evolution history. In the near future, Gaia will reveal hundreds of nearby young exoplanets amenable to direct follow-up observations. Long-baseline interferometry with current and future facilities is best capable of exploiting this unique synergy which is poised to deliver a statistical sample of benchmark planets with precise dynamical masses and in-depth atmospheric characterization. This will enable tackling the longstanding question of how giant planets form from multiple angles simultaneously, shining light on the complex physical processes underlying planet formation."}
{"id": "2601.11803", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2601.11803", "abs": "https://arxiv.org/abs/2601.11803", "authors": ["Lee D. Feinberg", "Breann N. Sitarski", "Michael W. McElwain", "Giada Arney", "Caleb Baker", "Matthew D. Bolcar", "Marie Levine", "Alice Liu", "Bertrand Mennesson", "Aki Roberge", "J. Scott Smith", "Feng Zhao", "John Ziemer"], "title": "Habitable Worlds Observatory's Concept and Technology Maturation: Initial Feasibility and Trade Space Exploration", "comment": null, "summary": "The Habitable Worlds Observatory is the first telescope ever designed to search for life and will be a powerhouse of discovery across topics in astrophysics. The observatory was the top recommendation of the Astro2020 Decadal Survey for large missions and a new HWO Technology Maturation Project Office was formed in August 2024 to mature the architecture, science and technology. In this paper we review the overall approach taken to mature the mission concept. We show progress on architecture development, integrated modeling, science cases, and technology roadmaps consistent with pre-formulation studies. We discuss plans for instrument studies and international engagement and science engagement including a Community Science and Instrument Team. Finally, we describe the plan forward to the Mission Concept Review."}
{"id": "2601.11842", "categories": ["astro-ph.IM", "gr-qc"], "pdf": "https://arxiv.org/pdf/2601.11842", "abs": "https://arxiv.org/abs/2601.11842", "authors": ["Daniel Ratner"], "title": "Template-free search for gravitational wave events using coincident anomaly detection", "comment": null, "summary": "Gravitational-wave (GW) observatories have used template-based search to detect hundreds of compact binary coalescences (CBCs). However, template-based search cannot detect astrophysical sources that lack accurate waveform models, including core-collapse supernovae, neutron star glitches, and cosmic strings. Here, we present a novel approach for template-free search using coincident anomaly detection (CoAD). CoAD requires neither labeled training examples nor background-only training sets, instead exploiting the coincidence of events across spatially separated detectors as the training loss itself: two neural networks independently analyze data from each detector and are trained to maximize coincident predictions. Additionally, we show that integrated gradient analysis can localize GW signals from the neural-network weights, providing a path toward data-driven template construction of unmodeled sources, and further improving precision by frequency matching. Using the CodaBench dataset of real LIGO backgrounds with injected simulated CBCs and sine-Gaussian low-frequency bursts, CoAD achieves recall up to 0.91 and 0.85 respectively at a false-alarm rate of one event per year, and achieves recall above 0.5 at signal-to-noise ratios below 10. The fully-unsupervised nature of CoAD makes it especially well-suited for next-generation detectors with greater sensitivity and associated increases in GW event rates."}
{"id": "2601.12094", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.12094", "abs": "https://arxiv.org/abs/2601.12094", "authors": ["John Banovetz", "Claire-Alice Hebert", "Peter B. Denton", "Dan Scolnic", "Anze Slosar", "Chris Walter"], "title": "Uncovering the Next Galactic Supernova with the Vera C. Rubin Observatory", "comment": "12 pages, 9 figures, submitted to Open Journal of Astrophysics", "summary": "Supernovae are observed to occur approximately 1-2 times per century in a galaxy like the Milky Way. Based on historical records, however, the last core-collapse galactic supernova observed by humans occurred almost 1,000 years ago. Luckily, we are well positioned to catch the next one with the advent of new neutrino detectors and astronomical observatories. Neutrino observatories can provide unprecedented triggers for a galactic supernova event as they are likely to see a supernova neutrino signal anywhere from minutes to days before the shock breakout causes the supernova to brighten in optical wavelengths. Given its large etendue, the Vera C. Rubin Observatory is ideally positioned to rapidly localize the optical counterpart based on the neutrino trigger. In this paper we simulate events to study the efficiency with which supernovae are optimally localized by the Vera C. Rubin Observatory. We find that the observatory is ideal for initial localization of nearly all observable supernova triggers and has a 57-97% chance of catching any supernova based on theoretical stellar mass density predictions and observations. We provide an analysis of optimal filter selection and exposure times and discuss observational caveats."}
{"id": "2601.11718", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.11718", "abs": "https://arxiv.org/abs/2601.11718", "authors": ["Andrea Gnarini", "Swati Ravi", "Philip Kaaret", "Anna Bobrikova", "Juri Poutanen", "Sofia V. Forsblom", "Francesco Ursini", "Maria Cristina Baglio", "Stefano Bianchi", "Fiamma Capitanio", "Massimo Cocchi", "Maria Alejandra Diaz Teodori", "Sergio Fabiani", "Ruben Farinelli", "Giorgio Matt", "Mason Ng", "Alexander Salganik", "Paolo Soffitta", "Antonella Tarana", "Silvia Zane"], "title": "Discovery of High X-Ray Polarization from the Neutron Star Low-Mass X-Ray Binary Cyg X-2 in the Horizontal Branch", "comment": "to appear in ApJ", "summary": "We present results from simultaneous X-ray polarimetric and spectroscopic observations of the bright neutron star low-mass X-ray binary Cyg X-2, performed by the Imaging X-ray Polarimetry Explorer (IXPE) and the Nuclear Spectroscopic Telescope Array (NuSTAR). IXPE detected significant polarization (15 sigma) from the source in the 2-8 keV energy band with an average polarization degree (PD) of 4.5% +/- 0.3% and a polarization angle (PA) of 128 +/- 2 degrees as the source moved along the horizontal branch of its Z-track. The PD increases with energy reaching 9.9% +/- 2.8% in the 7-8 keV band, with no evidence for energy-dependent variation in the PA. The PA is roughly consistent with previous measurements obtained during the normal and flaring branches and also with the known radio jet axis. From spectropolarimetric analysis, the main contribution to the polarized radiation is due to Comptonized photons, but the polarization is higher than predicted in typical spreading layer geometries. The observed high polarization may be due to a combination of a highly polarized reflected component and a moderately polarized spreading layer on the neutron star surface or produced by electron scattering in an equatorial wind."}
{"id": "2601.12669", "categories": ["astro-ph.IM", "astro-ph.EP"], "pdf": "https://arxiv.org/pdf/2601.12669", "abs": "https://arxiv.org/abs/2601.12669", "authors": ["Yui Kasagi", "Hajime Kawahara", "Ziying Gu", "Teruyuki Hirano", "Takayuki Kotani", "Masayuki Kuzuhara", "Kento Masuda"], "title": "PyIRD: A Python-Based Data Reduction Pipeline for Subaru/IRD and REACH", "comment": "Published in JOSS (Journal of Open Source Software)", "summary": "PyIRD is a Python-based pipeline for reducing spectroscopic data obtained with IRD (InfraRed Doppler; Kotani et al. (2018)) and REACH (Rigorous Exoplanetary Atmosphere Characterization with High dispersion coronagraphy; Kotani et al. (2020)) on the Subaru Telescope. It is designed to process raw images into one-dimensional spectra in a semi-automatic manner. Unlike traditional methods, it does not rely on IRAF (Tody, 1986; 1993), a software used for astronomical data reduction. This approach simplifies the workflow while maintaining efficiency and accuracy. Additionally, the pipeline includes an updated method for removing readout noise patterns from raw images, enabling efficient extraction of spectra even for faint targets such as brown dwarfs.\n  The code is open source and available at https://github.com/prvjapan/pyird ."}
{"id": "2601.11754", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.11754", "abs": "https://arxiv.org/abs/2601.11754", "authors": ["Andrew Mummery"], "title": "Black hole accretion disks with outflows II. Time dependent Green's function solutions in Newtonian gravity", "comment": "13 pages + 5 figures", "summary": "We present Green's function solutions of the Newtonian time-dependent thin disk equations in the presence of outflows, showing that simple and exact analytical expressions exist in various natural limits of the problem. These Green's functions are mathematically very similar to the classical Lynden-Bell & Pringle solutions in the absence of outflows, but differ strongly in their precise physical details and observational implications. Solutions are presented for phenomenological radius-dependent outflows which both do and do not torque the local accretion flow, and for outflows which are launched proportional to the local accretion rate. Generically, outflows lead to a more rapid decay of the bolometric luminosity of the disk, flatten the radial dependence of the disk temperature, and suppress variability in the accretion rate at small radii and low frequencies (on long timescales). Observational implications of these four results are discussed in detail."}
{"id": "2601.13068", "categories": ["astro-ph.IM", "astro-ph.GA", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2601.13068", "abs": "https://arxiv.org/abs/2601.13068", "authors": ["Pu Lin", "Haonan Yang", "Bin Ma", "Jinji Li", "Haoran Zhang", "Michael C. B. Ashley", "Zhong-Nan Dong", "Lu Feng", "Wei Huang", "Yi Hu", "Zhaohui Shang", "Yun Shi", "Shijie Sun", "Xu Yang", "Yong Zhang"], "title": "Antarctic Infrared Binocular Telescope: Early Data Release of observations in the 1.4 μm water-vapor-absorption band", "comment": "14 pages, 13 figures, accepted for publication in AJ", "summary": "Ground-based observations around 1.4 $μ$m are normally limited by strong absorption of telluric water-vapor. However, Dome A, Antarctica has exceptionally dry conditions that offer a unique opportunity for observations in this band. We designed a new filter covering 1.34--1.48 $μ$m, namely $W'$, and installed it on the Antarctic Infrared Binocular Telescope (AIRBT) at Dome A in 2025. AIRBT comprises two identical 15 cm optical tube assemblies and two InGaAs cameras equipped with $J$ and $W'$ filters, respectively. With this Early Data Release (EDR), we aim to evaluate the performance of the $W'$ band at Dome A to observe objects with water-vapor features. This EDR covers $\\thicksim 20 \\ \\mathrm{deg^2}$ in the Galactic plane using $\\thicksim 20,000$ images in three nights. For 2 s exposures, the 5 $σ$ limiting magnitude histogram peaks at $J \\thicksim 11.5$ mag (Vega) and $W' \\thicksim 9.9$ mag, respectively. The $J-W'$ vs $J-H$ color-color diagram distinguishes ultracool candidates with water-vapor-absorption features from reddened early type stars. Furthermore, later-type stars tend to exhibit stronger water-vapor absorption. Some sources show larger $ΔW'$ than $ΔJ$ across the three nights, which we attribute to variations of their water-vapor-absorption depth. We conclude that it will be efficient to search for ultracool stars and estimate their spectral subtypes using $W'$ band imaging at Dome A, where the atmospheric transmission is high and stable."}
{"id": "2601.11784", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.11784", "abs": "https://arxiv.org/abs/2601.11784", "authors": ["Y. L. Wang", "F. Coti Zelati", "E. Parent", "A. Marino", "N. Rea", "V. S. Dhillon", "J. Blanco-Pozo", "I. Ribas", "S. P. Littlefair", "Z. H. Yang", "G. B. Zhang", "S. Guillot", "K. R. Ni", "J. H. Wu", "A. Patruno", "Y. Cavecchi", "G. Illiano", "A. Papitto", "F. Ambrosino", "B. F. Liu", "H. Q. Cheng", "H. Feng", "J. W. Hu", "C. C. Jin", "H. Sun", "L. Tao", "Y. J. Xu", "H. N. Yang", "W. Yuan", "Q. C. Zhao"], "title": "Einstein Probe discovery of EP J171159.4-333253: an eclipsing neutron star low-mass X-ray binary with clocked bursts", "comment": "26 pages, 16 figures; submitted to ApJ", "summary": "EP J171159.4-333253 is a new neutron-star low-mass X-ray binary discovered in outburst by the Einstein Probe (EP) on 2025 June 23, exhibiting clocked type-I X-ray bursts, eclipses and dips. In this paper, we report on the results of the X-ray spectral and timing analyses for EP J171159.4-333253 using data collected by EP and NuSTAR during the first 21 days of the outburst. The X-ray burst recurrence time can be characterized over a subset of nine bursts spanning 1.6 days around the NuSTAR observation, and the result is $t_{\\rm rec}=8196 \\pm 177\\,$s with indications of a possible decreasing trend. From the X-ray eclipse events, the binary orbital period and the eclipse duration are estimated to be $P_{\\rm orb}=6.48301 \\pm 0.00003\\,$hr and $D_{\\star,X} = 1245.5^{+6.9}_{-6.5}\\,$s, respectively. These enable an estimate of the mass and radius of the companion star and the binary inclination, which are $M_2\\approx0.6-0.8\\,M_\\odot$, $R_2\\approx0.7-0.8\\,R_\\odot$ and $i\\approx73-75^\\circ$, respectively. We also report on joint ULTRACAM and EP observations on 2025 July 21--22, detecting the source optical counterpart and covering an eclipse in both X-ray and optical bands. The optical eclipse is wavelength-dependent and broader than in X-rays, indicating that part of the optical emission arises from an extended region in the accretion flow. Despite a moderate variation in the source flux, the properties of the persistent X-ray emission are typical of a hard spectral state. We further evaluated the ratio of the accretion energy to the thermonuclear energy to be 120--130, implying helium bursts with the accreted hydrogen being depleted in-between bursts."}
{"id": "2601.13221", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2601.13221", "abs": "https://arxiv.org/abs/2601.13221", "authors": ["M. J. Clark", "M. A. Ravine", "M. A. Caplinger", "B. A. Lindenfeld", "J. D. Laramee", "R. S. Bronson", "A. D. Giglio", "B. G. Crowther"], "title": "Optomechanical design of the DragonCam microscopic camera", "comment": "16 pages, 22 figures", "summary": "The DragonCam Microscopic Camera is an instrument being developed for NASA's Dragonfly mission [1] to Saturn's moon Titan. The Microscopic Camera will be body-fixed to the Dragonfly vehicle and will image the surface at a distance of about one meter (98.6 cm nominal) with a pixel scale of better than 60 microns/pixel and a nominal 52 degree angle to the Titan surface. With the 4.8 um pixel pitch of the sensor, this is a focal length of about 77.5 mm. To accommodate range variations due to vehicle pose and surface topography, the Microscopic Camera has a focus mechanism to give it a depth of field (DOF) of about 130mm. Since the Microscopic Camera's boresight is tilted by 52° off the vertical, the optical configuration has a compensating tilted focal plane, taking advantage of the Scheimpflug imaging principle. The optics are all-refractive with nine elements, a six-element stationary group and a three-element moving group. A plano-plano window seals the optics from the environment and also serves as the substrate for a bandpass filter. The optomechanical system is derived from the Mars Hand Lens Imager [11]; the moving group is mounted to a linear slide which is translated via a cam follower by the rotation of a cam driven by a stepper motor. The Microscopic Camera is designed to survive at temperatures as low as -130C without power. The camera is enclosed in a cavity in the foam insulation covering the spacecraft and looking through a single-pane window. Prior to imaging, the camera will be heated to operating temperature (nominal -30C) for proper actuation of the mechanism. STOP analysis has been performed to demonstrate that optical performance is maintained after heating. Software focus merging will be performed in the onboard camera control electronics to minimize image data downlink requirements."}
{"id": "2601.11887", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.11887", "abs": "https://arxiv.org/abs/2601.11887", "authors": ["Ke Bian", "Can-Min Deng"], "title": "Prediction of Multi-Wavelength Afterglows Associated with FRB 20200120E and FRB 20201124A", "comment": "21 pages, 18 figures", "summary": "Fast radio bursts (FRBs) are mysterious radio transients with uncertain origins and environments. Recent studies suggest that some active FRBs may originate from compact objects in binary systems. In this work, we develop a unified theoretical framework to model the multi-wavelength afterglows of FRBs resided in binary systems and apply it to two representative repeaters, FRB 20200120E and FRB 20201124A. By solving the dynamics and radiation processes of FRB ejecta interacting with the surrounding medium, we compute afterglow light curves in the radio, optical, and X-ray bands. Our results show that radio afterglows offer the best prospects for detection, with their brightness highly sensitive to ejecta kinetic energy and ambient density. Future high-sensitivity radio telescopes, such as the Square Kilometre Array (SKA), could detect these signals. Optical afterglows, though short-lived and challenging to observe, may be significantly enhanced in dense environments, potentially making them detectable with facilities like the Large Synoptic Survey Telescope (LSST). In contrast, X-ray afterglows are predicted to be too faint for detection with current instruments. Our study highlights the potential of multi-wavelength afterglows as probes of FRB progenitors and their surrounding environments, offering crucial insights into the nature of these mysterious transients."}
{"id": "2601.13438", "categories": ["astro-ph.IM", "gr-qc"], "pdf": "https://arxiv.org/pdf/2601.13438", "abs": "https://arxiv.org/abs/2601.13438", "authors": ["Riccardo DeSalvo", "Emerald Gingell", "Jesús Leonardo González López", "Nelson Leon", "Marina Mondin", "Harry Themann", "Fabián Erasmo Peña Arellano"], "title": "A dual tunnel structure for the Einstein Telescope", "comment": null, "summary": "We present a novel tunnel architecture for the Einstein Telescope that departs from the traditional large-cavern approach and reduces the excavated volume by an order of magnitude. In the proposed design, all seismic isolation systems are housed in raise-bore wells drilled upward from the main tunnel toward an upper service tunnel. The pre-isolators for the most sensitive optics are located in the service tunnel, seating directly on strong and compact rock, while the other filters are distributed along the wells within compact, side-access vacuum chambers. Shorter, separate wells accommodate the seismic isolation systems for less demanding optics. This configuration provides substantial advantages: easier lock acquisition and improved robustness of the interferometers, lower-frequency pendulum stages, reduced congestion around the test masses, simplified installation and maintenance, improved vacuum partitioning, strong physical decoupling between the high- and low-frequency interferometers, and enhanced compatibility with future advances of Newtonian-noise cancellation. A novel technique for real-time, precision monitoring of rock motion and tilt provides a new signal for Newtonian noise cancellation and enables correction of seismic disturbances even during earthquakes, offering unique geophysical measurement capabilities."}
{"id": "2601.11889", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.11889", "abs": "https://arxiv.org/abs/2601.11889", "authors": ["Ke Bian", "Can-Min Deng"], "title": "Possible Multi-band Afterglows of FRB 20171020A and its Implication", "comment": "9 pages, 4 figures", "summary": "Fast Radio Bursts (FRBs) are millisecond-duration radio transients of mysterious origin, with growing evidence linking at least some of them to magnetars. While FRBs are primarily observed in the radio band, their potential multi-wavelength afterglows remain largely unexplored. We investigate the possible afterglow of FRB 20171020A, a rare nearby and bright FRB localized in a galaxy at only 37 Mpc. Assuming that this source produces a future bright burst, we model the expected afterglow emission in the radio, optical, and X-ray bands under both uniform and wind-like ambient media, within the framework of the magnetar model. Our results show that the optical afterglow is the most promising for detection, but it fades rapidly and requires follow-up within a few hundred seconds post-burst. The radio afterglow may be detectable under favorable conditions in a dense stellar wind, whereas the X-ray counterpart is too faint for current telescopes. These findings suggest that rapid optical follow-up offers the best opportunity to detect the afterglow of the next bright burst from FRB 20171020A, providing unique insights into the progenitor and its environment. To assess observational feasibility, we estimate the event rate of nearby FRBs with sufficient energy to power detectable afterglows, finding a rate of $\\sim$0.3 per year for CHIME surveys. Although this rate is low and the optical detection timescale is short, coordinated fast-response strategies using global telescope networks could significantly improve the chance of success. As more nearby FRBs are discovered, multi-wavelength observations will be essential in unveiling the physical nature of these enigmatic events."}
{"id": "2601.13447", "categories": ["astro-ph.IM", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2601.13447", "abs": "https://arxiv.org/abs/2601.13447", "authors": ["Elliott P. Horch", "Sebastian M. Lucero", "Max Martone", "Riley C. Barrett", "Ana I. Baculima Durán", "Fiona T. Powers Özyurt", "Gage Posick", "Alexander Petroski", "James W. Davidson,", "Steven R. Majewski", "Richard A. Pellegrino", "Paul M. Klaucke", "Xavier Lesley-Saldaña", "Torrie Sutherland", "Olivia S. Weiss"], "title": "Observations with the Southern Connecticut Stellar Interferometer. II. First Three-Telescope Observations and a New Diameter Measurement of Arcturus", "comment": "16 pages, 12 figures", "summary": "We discuss the most recent observations made with the Southern Connecticut Stellar Interferometer (SCSI), which is a three-station stellar intensity interferometer located on the campus of Southern Connecticut State University, in New Haven, Connecticut. Two different kinds of observations are presented. We first analyze observations of Vega taken in a three-telescope mode. (Previously, the instrument had only two operational stations.) We show that, while the efficiency remains nearly identical to that reported in our last paper, the addition of the third station allows more photon data to be recorded simultaneously, and therefore we can build up the photon-bunching peak in the data stream in fewer hours on sky for an unresolved source. In the second part of the paper, we report our observations to date of the nearby red giant star, Arcturus, most of which occurred in the first half of 2025. These show that, as a partially resolved source at the baselines we used, we detect fewercorrelations in the photon-bunching peak than for an unresolved source of comparable brightness. Combining the data with speckle imaging observations taken at Apache Point Observatory, we derive a new measurement of Arcturus' diameter that extends the time baseline of interferometric observations of the star and is consistent with previous analyses made by other investigators."}
{"id": "2601.11917", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.11917", "abs": "https://arxiv.org/abs/2601.11917", "authors": ["Kazuo Makishima", "Nagomi Uchida", "Teruaki Enoto"], "title": "Evidence for 1.01 s Pulsations of the Central Compact Object in the Supernova Remnant RCW 103 with ASCA, XMM-Newton, and NuSTAR", "comment": "Accepted for publication in the Publications in the Astronomical Society of Japan", "summary": "The neutron-star X-ray source 1E 161348-5055, associated with the supernova remnant RCW 103, exhibits clear intensity variations with a period of 6.67 hr. To clarify the nature of this object and its long periodicity, detailed timing studies were applied to its archival X-ray data, taken with ASCA (in 1993), XMM-Newton (in 2001, 2005, and 2016), and NuSTAR (2016 and 2017). It was assumed that the 6.67 hr period arises due to the beat between the rotation and free precession periods of the star that is slightly aspherical. By removing timing perturbations to be caused by this long periodicity, the six data sets consistently yielded evidence for pulsations at periods of P~1.01 s, to be interpreted as the objects' spin period, although the optimum energy range differed among the data sets. The measured six periods accurately line up on a linear spin-down trend of dP/dt = 1.097x 10^{-12} s/s. The object is implied to have a characteristic age of 14.7 kyr, a spin-down luminosity of 4.2x10^{34} erg/s, which is insufficient to power the X-ray luminosity, a dipole magnetic field of ~4.6x10^{13} G, and a toroidal field of ~7 x10^{15} G. Its similarity and dissimilarity to magnetars are discussed. An emission geometry, which crudely explain these results, is presented."}
{"id": "2601.13587", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2601.13587", "abs": "https://arxiv.org/abs/2601.13587", "authors": ["Xuan Song", "Xiaofeng Wang", "Jin Zhu", "Jian Li", "Jincheng Guo", "Danfeng Xiang", "Xin Li", "Cheng Liu", "Yuanhang Ning", "Zhishuai Ge", "Zhenzhen Shao", "Xiaochen Zheng", "Yi Yang", "Lei Zhang", "Yaqing Shi", "Dongyao Zhao", "Xiangyun Zeng", "Jun Mo", "Tengfei Song", "Yufeng Fan", "Yu Liu", "Jingxing Wang", "Shousheng He", "Ciren Wangdui", "Jujia Zhang", "Xuefei Zhang", "Kai Ye", "Jinming Bai", "Xiaojun Jiang", "Xiaoming Zhang", "Peng Qiu", "Jicheng Zhang"], "title": "The R2Pub Telescopes for Surveying: An Overview and Performance Evaluation of the System", "comment": "Accepted for publication in Publications of the Astronomical Society of the Pacific", "summary": "The R2Pub telescope, built by the Beijing Planetarium, is a 60 cm equatorial binocular telescope located at the Daocheng site of Yunnan Observatories in China, at an altitude of about 4700 m. This paper presents an overview of the R2Pub telescope system, including its design, instrumentation, and survey capabilities, and reports an initial evaluation of its system performance. R2Pub is a prime-focus binocular system, with each optical tube covering a field of view of approximately 18 square degrees. It is designed to detect a wide range of transient and variable sources in the local universe, such as variable stars, eclipsing binaries, supernovae, gamma-ray burst afterglows, tidal disruption events, active galactic nuclei, and other unknown transients. The observatory infrastructure, including the dome, equatorial mount, optical tubes, and associated subsystems, has been fully constructed and installed, and the system has entered the commissioning phase. Benefiting from the high-altitude location, good seeing conditions, and dark sky background at the Daocheng site, performance tests during commissioning show that the R2Pub system can reach a 5-sigma limiting magnitude of about 18.7 mag in the Pan-STARRS r' band with a 60 s exposure. Ongoing observations with R2Pub are expected to contribute to studies of variable and transient phenomena and to enhance public outreach in astronomy. The binocular design enables simultaneous dual-band observations, providing instantaneous color information for transient sources and improving the classification and physical characterization of their properties and evolution."}
{"id": "2601.11925", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.11925", "abs": "https://arxiv.org/abs/2601.11925", "authors": ["Yuhe Zeng", "Zhen Pan"], "title": "Captured are circularized: A relativistic treatment of extreme mass ratio inspirals crossing accretion disks", "comment": "15 pages, 14 figures", "summary": "A small body orbiting around an accreting massive object and periodically crossing its accretion disk is a common configuration in astrophysics. In this work, we investigate the secular evolution of extreme mass-ratio inspirals (EMRIs), in which a stellar-mass object (SMO), e.g., a star or a stellar-mass black hole (sBH), collides with the accretion disk of a central supermassive black hole (SMBH), within a fully relativistic framework. We find (1) the disk always tends to align the SMO no matter what the initial orbital inclination $ι$ relative to the disk is, (2) the final orbital eccentricity of the SMO captured by the disk is always low though the orbital eccentricity may temporarily grow when the orbital inclination $ι$ is large and the SMO is an sBH, and (3) via collisions with the accretion disk only, only a small fraction of sBHs that are initially close to the SMBH and close to the disk can be captured by the disk within typical disk lifetime of active galactic nuclei. Two-body scatterings between SMOs in the nuclear stellar cluster play an essential role in randomly kicking sBHs towards the disk and boosting the capture rate."}
{"id": "2601.13901", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2601.13901", "abs": "https://arxiv.org/abs/2601.13901", "authors": ["Fernando L. Ventura", "Kshitij Thorat", "Anna Bosman", "Roger Deane", "Christopher Cleghorn"], "title": "Prospecting MeerKAT Continuum Data for Enigmatic Radio Sources with Unsupervised Vector-Quantised Variational Autoencoders", "comment": "12 pages, 14 figures, submitted to RAS Techniques and Instruments", "summary": "We present a novel application of Vector quantised variational autoencoders (VQ-VAEs) to deep 1.28 GHz radio continuum images taken from the MeerKAT Galaxy Cluster Legacy Survey (MGCLS).VQ-VAEs are deep learning models widely used in modern computer vision applications and pipelines. Designed for image generation, VQ-VAEs are trained to reconstruct the input dataset via a low-dimensional discrete embedding. VQ-VAEs effectively learn the distribution of training data, where samples that do not fit the distribution well yield the highest reconstruction errors. This property makes VQ-VAEs a good candidate for the task of anomaly detection. In this work, we examine the effectiveness of VQ-VAEs in identifying radio continuum sources with anomalous structures in the image-plane domain. We find VQ-VAEs to be useful as part of a solution for searching such large datasets. We observe that they are able to remove a majority of the typical sources in such data, even when trained in an unsupervised manner on unlabelled data. We also provide our testing set of a large sample of manually labelled radio sources, in particular radio galaxies, taken from the MGCLS at 1.28 GHz. Automated approaches to searching through high volumes of data are key in extracting the full scientific potential of the Square Kilometre Array and its pathfinders."}
{"id": "2601.11950", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.11950", "abs": "https://arxiv.org/abs/2601.11950", "authors": ["A. M. Anpilogov", "S. A. Tyul'bashev"], "title": "Pushchino Multibeam Pulsar Search. IX. Detection of a minute-long transient on the LPA antenna", "comment": "9 pages, 5 figures, 1 table; paper translated by Yandex translator with correction of scientific lexis; accepted to Astronomy Reports", "summary": "A transient (LPA J0108+13) with repeated bursts was detected on the Large Phased Array (LPA) radio telescope at a central frequency of 110.4 MHz in the direction of the radio galaxy 3C 33. The flux density of bursts ranges from tens to hundreds of Jy, and the duration of the bursts is \\approx 1^m - 4^m. In daily observations, the total duration of which at the location of the transient exceeds 200 hours in the observation interval 2013-2025, 6 bursts were found. The nature of the source could not be determined. We believe that a new type of transients has been discovered."}
{"id": "2601.13957", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.13957", "abs": "https://arxiv.org/abs/2601.13957", "authors": ["Kathrin Grunthal", "David J. Champion", "Eric Thrane", "Rowina S. Nathan", "Michael Kramer", "Matthew T. Miles"], "title": "Optimising gravitational-wave sky maps for pulsar timing arrays", "comment": "10 + 1 pages, 9 figures, in print with Astronomy&Astrophysics", "summary": "Pulsar timing arrays (PTAs) have recently reported compelling evidence for the presence of a gravitational-wave background signal. Mapping the gravitational-wave background is key to understanding how it is formed, since anisotropy is a tracer for, for example, a supermassive black hole binary origin. In this work we refine the frequentist regularised gravitational-wave mapping analysis developed in our previous work (as part of the MeerKAT PTA 4.5-year data release). We derive a point-spread function describing the angular resolution of a PTA. We investigate how the point spread function changes for different PTA constellations and determine the best possible angular resolution achievable within our framework. Using simulated data, we demonstrate that previous methods do not capture the actual resolution - especially in regions of the sky with a high density of pulsars. We propose an improved scheme that accounts for a variable local resolution and test it using realistic simulations of the latest MeerKAT dataset. We demonstrate that we are able to identify a continuous gravitational wave signal in a region with good pulsar sky coverage with approximately a factor of two increase in significance compared to our previous method."}
{"id": "2601.12108", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.12108", "abs": "https://arxiv.org/abs/2601.12108", "authors": ["Run-Chao Chen", "Jun Yang", "Yi-Han Iris Yin", "Bin-Bin Zhang"], "title": "Detection of a Millisecond Periodicity in BATSE Short Gamma-Ray Bursts", "comment": "19 pages, 11 figures; ApJ accepted; author's version", "summary": "Coherent oscillations at kilohertz frequencies have recently been detected in a small number of gamma-ray bursts (GRBs), suggesting quasi-periodic dynamics in their central engines. A prominent example is GRB~230307A, which exhibited a brief, highly coherent, energy-dependent periodic signal interpreted as the possible spin signature of a nascent millisecond magnetar formed after a compact binary merger. Motivated by these developments, we conducted a comprehensive search for similar signals, accounting for both temporal and spectral dependencies, in 532 short GRBs with time-tagged event data recorded by the Burst and Transient Source Experiment (BATSE) onboard the \\textit{Compton Gamma-Ray Observatory}. Within this sample, we identify a single statistically significant case: GRB~960616 (BATSE trigger~5502), in which the $\\sim$30~ms main emission episode is coherently modulated at 1100~Hz, with the strongest modulation above 320~keV and a fractional amplitude of $\\sim$47\\%. Assuming the presence of a coherent periodic modulation, we use data-driven Monte Carlo simulations to place an upper limit of $\\sim$8\\% on the fraction of the total radiated energy that can be modulated by the QPO. This event, exhibiting a periodicity at $\\sim$0.91~ms, further supports the possibility that millisecond periodicities can arise during GRBs in merger-driven scenarios."}
{"id": "2601.14235", "categories": ["astro-ph.IM", "astro-ph.CO", "cs.AI", "cs.LG", "stat.ML"], "pdf": "https://arxiv.org/pdf/2601.14235", "abs": "https://arxiv.org/abs/2601.14235", "authors": ["LSST Dark Energy Science Collaboration", "Eric Aubourg", "Camille Avestruz", "Matthew R. Becker", "Biswajit Biswas", "Rahul Biswas", "Boris Bolliet", "Adam S. Bolton", "Clecio R. Bom", "Raphaël Bonnet-Guerrini", "Alexandre Boucaud", "Jean-Eric Campagne", "Chihway Chang", "Aleksandra Ćiprijanović", "Johann Cohen-Tanugi", "Michael W. Coughlin", "John Franklin Crenshaw", "Juan C. Cuevas-Tello", "Juan de Vicente", "Seth W. Digel", "Steven Dillmann", "Mariano Javier de León Dominguez Romero", "Alex Drlica-Wagner", "Sydney Erickson", "Alexander T. Gagliano", "Christos Georgiou", "Aritra Ghosh", "Matthew Grayling", "Kirill A. Grishin", "Alan Heavens", "Lindsay R. House", "Mustapha Ishak", "Wassim Kabalan", "Arun Kannawadi", "François Lanusse", "C. Danielle Leonard", "Pierre-François Léget", "Michelle Lochner", "Yao-Yuan Mao", "Peter Melchior", "Grant Merz", "Martin Millon", "Anais Möller", "Gautham Narayan", "Yuuki Omori", "Hiranya Peiris", "Laurence Perreault-Levasseur", "Andrés A. Plazas Malagón", "Nesar Ramachandra", "Benjamin Remy", "Cécile Roucelle", "Jaime Ruiz-Zapatero", "Stefan Schuldt", "Ignacio Sevilla-Noarbe", "Ved G. Shah", "Tjitske Starkenburg", "Stephen Thorp", "Laura Toribio San Cipriano", "Tilman Tröster", "Roberto Trotta", "Padma Venkatraman", "Amanda Wasserman", "Tim White", "Justine Zeghal", "Tianqing Zhang", "Yuanyuan Zhang"], "title": "Opportunities in AI/ML for the Rubin LSST Dark Energy Science Collaboration", "comment": "84 pages. This is v1.0 of the DESC's white paper on AI/ML, a collaboration document that is being made public but which is not planned for submission to a journal", "summary": "The Vera C. Rubin Observatory's Legacy Survey of Space and Time (LSST) will produce unprecedented volumes of heterogeneous astronomical data (images, catalogs, and alerts) that challenge traditional analysis pipelines. The LSST Dark Energy Science Collaboration (DESC) aims to derive robust constraints on dark energy and dark matter from these data, requiring methods that are statistically powerful, scalable, and operationally reliable. Artificial intelligence and machine learning (AI/ML) are already embedded across DESC science workflows, from photometric redshifts and transient classification to weak lensing inference and cosmological simulations. Yet their utility for precision cosmology hinges on trustworthy uncertainty quantification, robustness to covariate shift and model misspecification, and reproducible integration within scientific pipelines. This white paper surveys the current landscape of AI/ML across DESC's primary cosmological probes and cross-cutting analyses, revealing that the same core methodologies and fundamental challenges recur across disparate science cases. Since progress on these cross-cutting challenges would benefit multiple probes simultaneously, we identify key methodological research priorities, including Bayesian inference at scale, physics-informed methods, validation frameworks, and active learning for discovery. With an eye on emerging techniques, we also explore the potential of the latest foundation model methodologies and LLM-driven agentic AI systems to reshape DESC workflows, provided their deployment is coupled with rigorous evaluation and governance. Finally, we discuss critical software, computing, data infrastructure, and human capital requirements for the successful deployment of these new methodologies, and consider associated risks and opportunities for broader coordination with external actors."}
{"id": "2601.12127", "categories": ["astro-ph.HE", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2601.12127", "abs": "https://arxiv.org/abs/2601.12127", "authors": ["A. A. Nucita", "S. M. Lezzi", "F. De Paolis", "Strafella", "D. Licchelli", "A. Franco", "M. Maiorano"], "title": "Timing analysis of a sample of five cataclysmic variable candidates observed by the XMM-Newton satellite", "comment": "13 pages, 10 figures, published on Monthly Notices of the Royal Astronomical Society, 2022, Volume 517, Issue 1, pp.118-129. Note however, that in the published paper, by mistake, Figure 8 is wrong. The archive version contains the correct figure", "summary": "Intermediate polars are a class of cataclysmic variables in which a white dwarf accretes material from a companion star. The intermediate polar nature confirmation usually derives from the detection of two periods in both $X$-ray and optical photometry. In this respect, the high energy signal is often characterized by modulations on the white dwarf spin and the orbital period. However, noting that the periodograms may be characterized by strong features also at the synodic period and/or other sidebands, the timing analysis of the $X$-ray signal may offer the unique possibility to firmly discover an intermediate polar candidate. Here, we concentrate on a sample of five cataclysmic variable {binary} candidates: {i.e. SAXJ1748.2-2808, 1RXS J211336.1+542226, CXOGC J174622.7-285218, CXOGC J174517.4-290650, and V381 Vel, listed in the IPHome catalogue. Our main aim is to confirm if they belong to the intermediate polar class or not. The results of our analysis show that we can safely assess the intermediate polar nature of all the considered sources, apart for the case of V381 Vel which instead behaves like a cataclysmic variable of the polar subclass. Moreover, the source SAXJ1748.2-2808, previously classified as a HMXB, appears to be, most likely, an intermediate polar variable."}
{"id": "2601.13311", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2601.13311", "abs": "https://arxiv.org/abs/2601.13311", "authors": ["Colin J. Burke", "Priyamvada Natarajan"], "title": "Variability as a new discovery channel for Intermediate-Mass Black Holes in the Time Domain Era", "comment": "Perspective piece published in Nature Astronomy", "summary": "Between the groundbreaking detections of stellar-mass black holes by LIGO/Virgo/KAGRA and JWST's revelation of a surprisingly abundant population of supermassive black holes, one crucial missing link remains: the elusive intermediate-mass black holes (IMBHs). IMBHs represent a key phase in the hierarchical growth of black holes, yet they have persistently evaded detection. Traditional methods, effective for both actively accreting and quiescent black holes, have largely failed to uncover this hidden population. Here, we argue that novel observational strategies--particularly time-domain variability studies of active galactic nuclei (AGN) and tidal disruption events--provide a promising path forward. Finding IMBHs will resolve critical gaps in our understanding of black hole formation and the various mechanisms driving their subsequent growth. The upcoming Vera C. Rubin Observatory, with its unprecedented capacity to monitor the dynamic sky, stands to revolutionize our ability to detect these long-sought IMBHs, shedding new light on the assembly history of black holes across cosmic time."}
{"id": "2601.12130", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.12130", "abs": "https://arxiv.org/abs/2601.12130", "authors": ["Pei-Xin Zhu", "Xiao-Ping Zheng", "Quan Cheng", "Chenghui Niu", "Erbil Gügercinoğlu"], "title": "Exploring Superfluid Angular Momentum Reservoir Effect on Pulsar Glitches and Forecasting Next Glitches of the Crab Pulsar", "comment": null, "summary": "Pulsar glitches are generally viewed as stochastic events driven by sudden angular momentum transfer from the neutron star's superfluid interior to its crust. Except two peculiar pulsars with quasi-periodic glitches, this stochastic view has prevailed. Here, by clustering temporally proximate small glitches of the Crab pulsar, we uncover clear evidence of an underlying quasi-periodic modulation, challenging the paradigm of purely random behavior. Furthermore, our correlation analyses reveal a strong positive relationship between glitch cluster size and waiting time since the preceding clusters. These findings demonstrate the effect of angular momentum reservoir operating over long-term scales and enable the predictions of next glitching window. Remarkably, two minor glitches detected in July and August 2025, which align with our initial prediction made in June, should be confirmed as the onset of this predicted activity. Inspired by the initial success, we forecast the occurrence of a major glitch from now until August 2026, with possible glitch size up to a relative change in rotational frequency of $697.2 \\times 10^{-9}$. Physically, the observed long-term quasi-periodicity and cluster size-waiting time correlations imply that each glitch event releases only a fraction of the stored superfluid angular momentum. This partial-release mechanism provides a unified framework for both stochastic and quasi-periodic glitch behaviors across different pulsars, underscoring the universality of the superfluid angular momentum reservoir effect. As the most intensively monitored object, the Crab pulsar serves as a natural laboratory for studying angular momentum inside neutron stars."}
{"id": "2601.13356", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2601.13356", "abs": "https://arxiv.org/abs/2601.13356", "authors": ["Boris Georgiev", "Paul Tiede", "Sebastiano D. von Fellenberg", "Michael Janssen", "Iniyan Natarajan", "Lindy Blackburn", "Jongho Park", "Erandi Chavez", "Andrew T. West", "Kotaro Moriyama", "Jun Yi Koay", "Hendrik Müller", "Dhanya G. Nair", "Avery E. Broderick", "Maciek Wielgus", "Kazunori Akiyama", "Ezequiel Albentosa-Ruíz", "Antxon Alberdi", "Walter Alef", "Juan Carlos Algaba", "Richard Anantua", "Keiichi Asada", "Rebecca Azulay", "Uwe Bach", "Anne-Kathrin Baczko", "David Ball", "Mislav Baloković", "Bidisha Bandyopadhyay", "John Barrett", "Michi Bauböck", "Bradford A. Benson", "Dan Bintley", "Raymond Blundell", "Katherine L. Bouman", "Geoffrey C. Bower", "Michael Bremer", "Roger Brissenden", "Silke Britzen", "Dominique Broguiere", "Thomas Bronzwaer", "Sandra Bustamante", "Douglas F. Carlos", "John E. Carlstrom", "Andrew Chael", "Chi-kwan Chan", "Dominic O. Chang", "Koushik Chatterjee", "Shami Chatterjee", "Ming-Tang Chen", "Yongjun Chen", "Xiaopeng Cheng", "Paul Chichura", "Ilje Cho", "Pierre Christian", "Nicholas S. Conroy", "John E. Conway", "Thomas M. Crawford", "Geoffrey B. Crew", "Alejandro Cruz-Osorio", "Yuzhu Cui", "Brandon Curd", "Rohan Dahale", "Jordy Davelaar", "Mariafelicia De Laurentis", "Roger Deane", "Gregory Desvignes", "Jason Dexter", "Vedant Dhruv", "Indu K. Dihingia", "Sheperd S. Doeleman", "Sergio A. Dzib", "Ralph P. Eatough", "Razieh Emami", "Heino Falcke", "Joseph Farah", "Vincent L. Fish", "Edward Fomalont", "H. Alyson Ford", "Marianna Foschi", "Raquel Fraga-Encinas", "William T. Freeman", "Per Friberg", "Christian M. Fromm", "Antonio Fuentes", "Peter Galison", "Charles F. Gammie", "Roberto García", "Olivier Gentaz", "Ciriaco Goddi", "Roman Gold", "Arturo I. Gómez-Ruiz", "José L. Gómez", "Minfeng Gu", "Mark Gurwell", "Kazuhiro Hada", "Daryl Haggard", "Ronald Hesper", "Dirk Heumann", "Luis C. Ho", "Paul Ho", "Mareki Honma", "Chih-Wei L. Huang", "Lei Huang", "David H. Hughes", "Shiro Ikeda", "C. M. Violette Impellizzeri", "Makoto Inoue", "Sara Issaoun", "David J. James", "Buell T. Jannuzi", "Britton Jeter", "Wu Jiang", "Alejandra Jiménez-Rosales", "Michael D. Johnson", "Svetlana Jorstad", "Adam C. Jones", "Abhishek V. Joshi", "Taehyun Jung", "Ramesh Karuppusamy", "Tomohisa Kawashima", "Garrett K. Keating", "Mark Kettenis", "Dong-Jin Kim", "Jae-Young Kim", "Jongsoo Kim", "Junhan Kim", "Motoki Kino", "Prashant Kocherlakota", "Yutaro Kofuji", "Patrick M. Koch", "Shoko Koyama", "Carsten Kramer", "Joana A. Kramer", "Michael Kramer", "Thomas P. Krichbaum", "Cheng-Yu Kuo", "Noemi La Bella", "Deokhyeong Lee", "Sang-Sung Lee", "Aviad Levis", "Shaoling Li", "Zhiyuan Li", "Rocco Lico", "Greg Lindahl", "Michael Lindqvist", "Mikhail Lisakov", "Jun Liu", "Kuo Liu", "Elisabetta Liuzzo", "Wen-Ping Lo", "Andrei P. Lobanov", "Laurent Loinard", "Colin J. Lonsdale", "Amy E. Lowitz", "Ru-Sen Lu", "Nicholas R. MacDonald", "Jirong Mao", "Nicola Marchili", "Sera Markoff", "Daniel P. Marrone", "Alan P. Marscher", "Iván Martí-Vidal", "Satoki Matsushita", "Lynn D. Matthews", "Lia Medeiros", "Karl M. Menten", "Izumi Mizuno", "Yosuke Mizuno", "Joshua Montgomery", "James M. Moran", "Monika Moscibrodzka", "Wanga Mulaudzi", "Cornelia Müller", "Alejandro Mus", "Gibwa Musoke", "Ioannis Myserlis", "Hiroshi Nagai", "Neil M. Nagar", "Masanori Nakamura", "Gopal Narayanan", "Antonios Nathanail", "Santiago Navarro Fuentes", "Joey Neilsen", "Chunchong Ni", "Michael A. Nowak", "Junghwan Oh", "Hiroki Okino", "Héctor Raúl Olivares Sánchez", "Tomoaki Oyama", "Feryal Özel", "Daniel C. M. Palumbo", "Georgios Filippos Paraschos", "Harriet Parsons", "Nimesh Patel", "Ue-Li Pen", "Dominic W. Pesce", "Vincent Piétu", "Alexander Plavin", "Aleksandar PopStefanija", "Oliver Porth", "Ben Prather", "Giacomo Principe", "Dimitrios Psaltis", "Hung-Yi Pu", "Alexandra Rahlin", "Venkatessh Ramakrishnan", "Ramprasad Rao", "Mark G. Rawlings", "Angelo Ricarte", "Luca Ricci", "Bart Ripperda", "Jan Röder", "Freek Roelofs", "Cristina Romero-Cañizales", "Eduardo Ros", "Arash Roshanineshat", "Helge Rottmann", "Alan L. Roy", "Ignacio Ruiz", "Chet Ruszczyk", "Kazi L. J. Rygl", "León D. S. Salas", "Salvador Sánchez", "David Sánchez-Argüelles", "Miguel Sánchez-Portal", "Mahito Sasada", "Kaushik Satapathy", "Saurabh", "Tuomas Savolainen", "F. Peter Schloerb", "Jonathan Schonfeld", "Karl-Friedrich Schuster", "Lijing Shao", "Zhiqiang Shen", "Sasikumar Silpa", "Des Small", "Randall Smith", "Bong Won Sohn", "Jason SooHoo", "Kamal Souccar", "Joshua S. Stanway", "He Sun", "Fumie Tazaki", "Alexandra J. Tetarenko", "Remo P. J. Tilanus", "Michael Titus", "Kenji Toma", "Pablo Torne", "Teresa Toscano", "Efthalia Traianou", "Tyler Trent", "Sascha Trippe", "Matthew Turk", "Ilse van Bemmel", "Huib Jan van Langevelde", "Daniel R. van Rossum", "Jesse Vos", "Jan Wagner", "Derek Ward-Thompson", "John Wardle", "Jasmin E. Washington", "Jonathan Weintroub", "Robert Wharton", "Kaj Wiik", "Gunther Witzel", "Michael F. Wondrak", "George N. Wong", "Jompoj Wongphexhauxsorn", "Qingwen Wu", "Nitika Yadlapalli", "Paul Yamaguchi", "Aristomenis Yfantis", "Doosoo Yoon", "André Young", "Ziri Younsi", "Wei Yu", "Feng Yuan", "Ye-Fei Yuan", "Ai-Ling Zeng", "J. Anton Zensus", "Shuo Zhang", "Guang-Yao Zhao", "Shan-Shan Zhao"], "title": "Locating the missing large-scale emission in the jet of M87* with short EHT baselines", "comment": "15 pages, 8 figures, Submitted to Astronomy & Astrophysics", "summary": "In Very-Long Baseline Interferometric arrays, nearly co-located stations probe the largest scales and typically cannot resolve the observed source. In the absence of large-scale structure, closure phases constructed with these stations are zero and, since they are independent of station-based errors, they can be used to probe data issues. Here, we show with an expansion about co-located stations, how these trivial closure phases become non-zero with brightness distribution on smaller scales than their short baseline would suggest. When applied to sources that are made up of a bright compact and large-scale diffuse component, the trivial closure phases directly measure the centroid relative to the compact source and higher-order image moments. We present a technique to measure these image moments with minimal model assumptions and validate it on synthetic Event Horizon Telescope (EHT) data. We then apply this technique to 2017 and 2018 EHT observations of M87* and find a weak preference for extended emission in the direction of the large-scale jet. We also apply it to 2021 EHT data and measure the source centroid about 1 mas northwest of the compact ring, consistent with the jet observed at lower frequencies."}
{"id": "2601.12240", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.12240", "abs": "https://arxiv.org/abs/2601.12240", "authors": ["Wenjie Zhang"], "title": "Discovery of a soft X-ray lag in the tidal disruption event AT2021ehb", "comment": "accepted for publication in A&A Letters", "summary": "In this Letter, we report the detection of soft X-ray time lags-i.e. variability in the softer photons lagging behind that in the harder photons-in seven XMM-Newton observations of the tidal disruption event (TDE) candidate AT2021ehb. We find correlated variability between the soft (0.3-0.7 keV) and hard (0.9-10 keV) bands on about 10^4 s time-scales, and measure a soft lag of about 500 s. This behaviour is broadly consistent with the disk-corona reverberation scenario established in active galactic nuclei (AGNs). Together with the previously reported strong hard X-ray emission and broad Fe K line, our results suggest the presence of a compact corona and prominent relativistic disk reflection in AT2021ehb. The unusually high blackbody temperature (peaking at about 200 eV) is difficult to reconcile with thermal emission from a standard accretion disk around a about 10^7 Msun black hole, and may instead be analogous to the soft excess commonly observed in AGNs, whose physical origin remains debated. Finally, the measured lags offer a possible explanation for the rapid X-ray flux decline that occurred only three days after the peak, pointing to a scenario in which the corona cools following a sudden loss of the magnetic support required to sustain it."}
{"id": "2601.14107", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2601.14107", "abs": "https://arxiv.org/abs/2601.14107", "authors": ["M. Abdullahi", "M. Abrate", "J. H. Adams", "D. Allard", "P. Alldredge", "R. Aloisio", "R. Ammendola", "A. Anastasio", "L. Anchordoqui", "V. Andreoli", "A. Anzalone", "E. Arnone", "D. Badoni", "P. von Ballmoos", "B. Baret", "D. Barghini", "M. Battisti", "R. Bellotti", "A. A. Belov", "M. Bertaina", "M. Betts", "P. Biermann", "F. Bisconti", "S. Blin-Bondil", "M. Boezio", "A. N. Bowaire", "I. Buckland", "L. Burmistrov", "J. Burton-Heibges", "F. Cafagna", "D. Campana", "F. Capel", "J. Caraca", "R. Caruso", "M. Casolino", "C. Cassardo", "A. Castellina", "K. Černý", "L. Conti", "A. G. Coretti", "R. Cremonini", "A. Creusot", "A. Cummings", "S. Davarpanah", "C. De Santis", "C. de la Taille", "A. Di Giovanni", "A. Di Salvo", "T. Ebisuzaki", "J. Eser", "F. Fenu", "S. Ferrarese", "G. Filippatos", "W. W. Finch", "C. Fornaro", "C. Fuglesang", "P. Galvez Molina", "S. Garbolino", "D. Garg", "D. Gardiol", "G. K. Garipov", "A. Golzio", "C. Guépin", "A. Haungs", "T. Heibges", "F. Isgrò", "R. Iuppa", "E. G. Judd", "F. Kajino", "L. Kupari", "S. -W. Kim", "P. A. Klimov", "I. Kreykenbohm", "J. F. Krizmanic", "J. Lesrel", "F. Liberatori", "H. P. Lima", "E. M'sihid", "D. Mandát", "M. Manfrin", "A. Marcelli", "L. Marcelli", "W. Marszał", "G. Masciantonio", "V. Masone", "J. N. Matthews", "E. Mayotte", "A. Meli", "M. Mese", "S. S. Meyer", "M. Mignone", "M. Miller", "H. Miyamoto", "T. Montaruli", "J. Moses", "R. Munini", "C. Nathan", "A. Neronov", "R. Nicolaidis", "T. Nonaka", "M. Mongelli", "A. Novikov", "F. Nozzoli", "T. Ogawa", "S. Ogio", "H. Ohmori", "A. V. Olinto", "Y. Onel", "G. Osteria", "B. Panico", "E. Parizot", "G. Passeggio", "T. Paul", "M. Pech", "K. Penalo Castillo", "F. Perfetto", "L. Perrone", "C. Petta", "P. Picozza", "L. W. Piotrowski", "Z. Plebaniak", "G. Prévôt", "M. Przybylak", "H. Qureshi", "E. Reali", "M. H. Reno", "F. Reynaud", "E. Ricci", "M. Ricci", "A. Rivetti", "G. Saccà", "R. E. Saraev", "H. Sagawa", "O. Saprykin", "F. Sarazin", "R. E. Saraev", "P. Schovánek", "V. Scotti", "S. A. Sharakin", "V. Scherini", "H. Schieler", "K. Shinozaki", "F. Schröder", "A. Sotgiu", "R. Sparvoli", "B. Stillwell", "J. Szabelski", "M. Takeda", "Y. Takizawa", "S. B. Thomas", "R. A. Torres Saavedra", "R. Triggiani", "D. A. Trofimov", "M. Unger", "T. M. Venters", "M. Venugopal", "C. Vigorito", "M. Vrábel", "S. Wada", "D. Washington", "A. Weindl", "L. Wiencke", "J. Wilms", "S. Wissel", "I. V. Yashin", "M. Yu. Zotov", "P. Zuccon"], "title": "The JEM-EUSO Collaboration: Contributions to the 39th International Cosmic Ray Conference (ICRC2025)", "comment": null, "summary": "This is a collection of papers presented by the JEM-EUSO Collaboration at the 39th International Cosmic Ray Conference (ICRC 2025) (Geneva, Switzerland, July 14--24, 2025)."}
{"id": "2601.12275", "categories": ["astro-ph.HE", "astro-ph.GA", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2601.12275", "abs": "https://arxiv.org/abs/2601.12275", "authors": ["Paul Disberg", "Arash Bahramian", "Ilya Mandel"], "title": "Reconciling the Systemic Kicks of Observed Millisecond Pulsars, Spider Pulsars, and Low-mass X-ray Binaries", "comment": "12 pages, 8 figures, submitted to ApJL", "summary": "Millisecond pulsars (MSPs) have been proposed as evolutionary products of low-mass X-ray binaries (LMXBs) through a stage in which they are spider pulsars (i.e., redbacks and black widows). However, recent work has found that the systemic kicks of observed MSPs are significantly lower than the kicks of LMXBs and spiders, which appears to be in tension with this evolutionary model. We argue that this tension can be relieved, at least to some degree, by considering the fact that the observed MSPs are located at relatively short distances, whereas spider pulsars are located at greater distances and LMXBs are situated even further away. We model the distance-dependent kinematic bias for dynamically old objects, which favors observing objects that have received low kicks at short distances and correct the observed systemic kicks for this bias. We find that this kinematic bias can be big enough to close the gap between the MSP and LMXB kicks, although the spider pulsars appear to come from a slightly different systemic kick distribution, but this difference is not necessarily physical. All corrected systemic kick distributions are consistent with predictions from binary population synthesis for progenitor systems with a post-supernova orbital period of $P_{\\text{orb}}\\leq10\\,$d and a companion mass of $M_{c}\\leq1\\,M_{\\odot}$, where the natal kicks are calibrated to the velocities of young isolated pulsars. We conclude that the difference in observed systemic kicks is not necessarily in tension with a common origin for MSPs, spider pulsars, and LMXBs."}
{"id": "2601.12417", "categories": ["astro-ph.HE", "hep-ph"], "pdf": "https://arxiv.org/pdf/2601.12417", "abs": "https://arxiv.org/abs/2601.12417", "authors": ["Yi-Long Duan", "Tuohuniyazi Tuniyazi", "Gang Guo"], "title": "Probing Circumstellar Material and Shock Acceleration in Core-Collapse Supernovae with High-Energy Neutrinos", "comment": "16 pages, 10 figures", "summary": "We study high-energy (HE) neutrino production from interactions between supernova (SN) ejecta and the surrounding circumstellar material (CSM), focusing on regular Type~II and Type~IIn SNe. Using observationally inferred CSM density distributions, we calculate the resulting neutrino fluxes and examine their dependence on key parameters, including the CSM density normalization $D_*$, outer radius $R_{\\rm csm}$, proton acceleration efficiency $ε_p$, and magnetic energy fraction $ε_B$. Detection prospects are assessed with a binned likelihood analysis for IceCube, indicating that nearby SNe with moderately dense, confined CSM can produce detectable signals, with a typical detection horizon of $\\sim 0.1$ - 1 Mpc. For a Galactic SN at $\\sim 10$ kpc, high-statistics neutrino data with detailed temporal and spectral information can constrain $D_*$, $R_{\\rm csm}$, and $ε_p$ to within a factor of $\\sim 10$ or to a precision of $\\sim 20\\%$, depending on the assumed values of $D_*$ and $R_{\\rm csm}$. These neutrino signals thus provide a complementary probe of the CSM profile and shock acceleration, alongside traditional electromagnetic observations."}
{"id": "2601.12422", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.12422", "abs": "https://arxiv.org/abs/2601.12422", "authors": ["Jiří Blažek", "Jan Ebr", "Jakub Vícha", "Eva dos Santos", "Tanguy Pierog", "Ralf Ulrich"], "title": "Modified hadronic interactions in 3-dimensional simulations", "comment": "submitted to PRD", "summary": "We present a method to test the impact of ad-hoc modifications of some of the generic parameters of hadronic interactions -- cross section, elasticity, and multiplicity -- on any observable quantity using full 3-dimensional simulations of extensive air showers induced by ultra-high-energy cosmic rays. Our approach not only extends the existing 1-dimensional tools to three dimensions, but also introduces more flexible features to better respond to the needs of both theory and experiment. We first thoroughly validate the \\conexD framework for the simulation of both longitudinal and lateral features of air showers, in particular for a non-standard configuration of the framework in which different energy thresholds for modifications are applied. Moreover, we show that the implementations of the ad-hoc modifications in this configuration are consistent with the previous one-dimensional simulations. Lastly, we discuss the importance of studying the interaction modifications in three dimensions and the effects of parallel modifications of multiple parameters."}
{"id": "2601.12474", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.12474", "abs": "https://arxiv.org/abs/2601.12474", "authors": ["Chiara Bartolini", "Elina Lindfors", "Andrea Tramacere", "Marcello Giroletti", "Davide Cerasole", "Ivan Agudo", "Emmanouil Angelakis", "Elisabetta Bissaldi", "Fausto Casaburo", "Filippo D'Ammando", "Leonardo Di Venere", "Vandad Fallah Ramazani", "Federica Giacchino", "Fracesco Giordano", "Mark Gurwell", "Jenni Jormanainen", "Svetlana Jorstad", "Garrett Keating", "Pouya M. Kouch", "Alexander Kraus", "Anne Lahteenmaki", "Serena Loporchio", "Nicola Marchili", "Alan Marscher", "Ioannis Myserlis", "Ramprasad Rao", "Simona Righini", "Merja Tornikoski"], "title": "A long-term multiwavelength study of the flat spectrum radio quasar OP 313", "comment": "22 pages, 13 figures, accepted for publication in A&A", "summary": "The Flat Spectrum Radio Quasar OP 313 is a high-redshift (z = 0.997) blazar that entered an intense gamma-ray active phase from November 2023 to March 2024, as observed by the Large Area Telescope (LAT) on board the Fermi Gamma-ray Space Telescope. We present a multiwavelength analysis covering 15 years of data, from August 2008 to March 2024, to contextualize this period of extreme gamma-ray activity within the long-term emission of the source. We analyzed a long-term, comprehensive, multiwavelength dataset from different facilities and projects from radio to gamma-rays. We identified the 7 most intense gamma-ray flaring periods and performed a kinematic analysis of Very Long Baseline Array (VLBA) data to determine whether new jet components emerged before or during these flares. For 2 of these flaring periods, we performed the modeling of the spectral energy distribution (SED). The VLBA-BU-BLAZAR and MOJAVE datasets reveal a new jet component appearing in both visibility datasets prior to the onset of one of the strongest gamma-ray flares. By comparing the timing of the VLBA-BU-BLAZAR knots ejection with the gamma-ray flaring periods, we constrained the setup of the SED modeling. We also found that the first gamma-ray flaring period is less Compton-dominated than the others. Our results suggest that the recent activity of OP 313 is triggered by new jet components emerging from the core and interacting with a standing shock. The γ-ray emission likely arises from dusty torus photons upscattered via Inverse Compton (IC) by relativistic jet electrons. The SED modeling indicates that this component is less dominant during the first γ-ray flaring period than the later ones."}
{"id": "2601.12508", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.12508", "abs": "https://arxiv.org/abs/2601.12508", "authors": ["Roland Diehl", "Michael Wiescher"], "title": "Nuclear astrophysics", "comment": "66 pages (+ref's), 18 figures, accepted for publication in the European Physical Journal A - \"Hadrons and Nuclei\"", "summary": "Reactions between atomic nuclei are measured in great detail in terrestrial laboratory experiments; transferring and extrapolating this knowledge to how the same reactions act within cosmic environments presents major challenges. Cross-disciplinary efforts are needed in view of the many nuclear reactions that govern the chemical evolution of the universe, and occur in a broad range of stellar plasma conditions that require astrophysical exploration. Since the early identification of 'processes' of nucleosynthesis, new insights have been obtained on the complexity of nuclear reaction mechanisms. We use 12C induced capture and fusion processes to illustrate the challenge of low-energy measurements and of using theoretical methods to extrapolate measurements towards energy regimes within cosmic sources. Particle beam experiments at accelerator facilities above and deep underground simulate stellar reactions, new experimental facilities and methods complement these, and this is further complemented by improved theoretical tools to calculate the quantum effects of nuclear reactions at the various cosmic conditions. Astronomical signatures of cosmic nuclear reactions are deduced from light curves characterizing cosmic explosions through gamma-ray lines and presolar grains to the detection of rare neutrino particles from our Sun to distant cosmic events. High resolution spectroscopy of stars has been expanded to objects measured in the X-ray and the gamma energy range of the electromagnetic spectrum. Astro-seismology and isotopic analysis of meteoritic inclusions provide new tools. Chemical-evolution models describe the complex dynamics during the evolution of galaxies. This article summarizes the experimental and theoretical work, and the broad range of observational tools that test the experimental data and the theoretical interpretation of nuclear processes in the cosmos."}
{"id": "2601.12611", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.12611", "abs": "https://arxiv.org/abs/2601.12611", "authors": ["Xander J. Hall", "Antonella Palmese", "Segev BenZvi", "John Banovetz", "Brendan O'Connor", "Lei Hu", "Erica Hammerstein", "Ariel Amsellem", "Jessica Nicole Aguilar", "Steven Ahlen", "Steven Bailey", "Davide Bianchi", "David Brooks", "Todd Claybaugh", "Andrei Cuceu", "Kyle Dawson", "Axel de la Macorra", "John Della Costa", "Arjun Dey", "Peter Doel", "Simone Ferraro", "Andreu Font-Ribera", "Jaime E. Forero-Romero", "Enrique Gaztanaga", "Satya Gontcho A Gontcho", "Alma Xochitl Gonzalez-Morales", "Or Graur", "Gaston Gutierrez", "Mustapha Ishak", "Jorge Jimenez", "Dick Joyce", "Stephanie Juneau", "Anthony Kremin", "Ofer Lahav", "Claire Lamman", "Martin Landriau", "Laurent Le Guillou", "Alexie Leauthaud", "Michael Levi", "Marc Manera", "Aaron Meisner", "Ramon Miquel", "John Moustakas", "Adam Myers", "Seshadri Nadathur", "Will Percival", "Claire Poppett", "Ignasi Perez-Rafols", "Francisco Prada", "Graziano Rossi", "Eusebio Sanchez", "Edward Schlafly", "David Schlegel", "Michael Schubnell", "David Sprayberry", "Gregory Tarle", "Benjamin Alan Weaver", "Rongpu Zhou", "Hu Zou"], "title": "The DESI Transients Survey: Legacy Classifications and Methodology", "comment": null, "summary": "We present the first systematic spectroscopic observations of extragalactic transients from the Dark Energy Spectroscopic Instrument (DESI), as part of the DESI Transients Survey program. With 5,000 fibers and an ${\\sim} 8$ deg$^2$ field of view, we exploit DESI as a machine for the discovery and classification of transients. We present transient classifications from archival DESI data in Data Releases 1 and 2, relying on a combination of a secondary target program and serendipitous observations. We also present observations from the first 6 months of the DESI spare fiber program dedicated to transients. The program is run in coordination with a dedicated DECam time-domain survey, serving as a pathfinder for what we will be able to achieve in conjunction with the Rubin Observatory Legacy Survey of Space and Time (LSST). We classify over 250 transients, of which the majority were previously unclassified. The sample comprises thermonuclear and core-collapse supernovae and tidal disruption events (TDEs), including a TDE observed before its discovery in imaging. We demonstrate DESI's ability to classify a population of faint transients down to $r\\sim 22.5$ mag during main survey operations, with negligible impacts on DESI's main observations. can you make this plain text for arxiv abstarct"}
{"id": "2601.12691", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2601.12691", "abs": "https://arxiv.org/abs/2601.12691", "authors": ["Yujun Yao", "Luming Sun", "Tao Wu", "Ning Jiang", "Shiyan Zhong", "Xinwen Shu"], "title": "Rate of Repeating Tidal Disruption Events with 5--19 years interval constrained by CRTS and ZTF", "comment": "12 pages, 4 figures, to be submitted, comments welcome", "summary": "Statistics on tidal disruption events (TDEs) may be contaminated by repeating TDEs (rTDEs), which have been extensively discovered recently. However, the origin of rTDEs remains unclear. In addition, no statistical research on rTDEs with time intervals $>5$ years has been made yet. In this work, we searched for rTDEs with time intervals of 5--19 years using CRTS data in a sample of 16 ZTF BTS TDEs at $z<0.05$. We found 2 rTDE candidates, AT 2019azh and AT 2024pvu, with time intervals of 13.2 and 17.1 years, respectively. The peak luminosities of CRTS flares are close to those of ZTF flares. For the CRTS flare of AT 2024pvu, using GALEX UV observations near the peak, we measured a blackbody temperature of $\\sim19500$ K, consistent with TDEs and higher than SNe. Moreover, we estimated the expected number of SNe in the sample to be $\\lesssim0.08$, and hence the probability that both CRTS flares are SNe is only 0.3\\%. Therefore, the possibility that both CRTS flares are SNe can be ruled out, and it is likely that both are TDEs. Using the two rTDEs, we inferred that the TDE rate is 2--3 orders of magnitude higher than the average over 5--19 years prior to TDE detection. Considering another two rTDEs with intervals of $\\sim$2 years in the sample and possible rTDEs missed by CRTS, rTDEs with intervals of $<20$ years may account for 25\\%--60\\% of the TDE sample. We prefer to explain rTDEs as repeating partial TDEs, but the possibility of independent TDEs cannot be ruled out and requires future observational tests."}
{"id": "2601.13056", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.13056", "abs": "https://arxiv.org/abs/2601.13056", "authors": ["Emma Dreas", "Andrea Pavan", "Riccardo Ciolfi", "Annalisa Celotti"], "title": "Simulating the quasi-ballistic regime of a short Gamma-Ray Burst jet", "comment": "5 pages, 3 figures. Submitted to Memorie della Società Astronomica Italiana (MemSAIt) for the Proceedings of the 8th Heidelberg International Symposium on High-Energy Gamma-Ray Astronomy (Gamma-2024), 2024", "summary": "This study extends the 3D magnetohydrodynamic (MHD) simulation of a jet emerging from a binary neutron star (BNS) merger presented in Pavan et al. (2023), in which an incipient jet was manually injected into the realistic environment imported from a previous general-relativistic MHD simulation of a merging BNS system. The jet evolution is followed up to almost 10 seconds without loss of resolution. Our results reveal that the jet faces challenges in penetrating the dense surroundings, leading to a barely successful outflow that exhibits structural asymmetries and low Lorentz factors. By the end of the extended simulation, 98% of the jet energy is converted to kinetic form and its angular structure is stabilized. The physical quantities inferred thus provide reliable inputs for afterglow emission calculations. This work demonstrates a method for simulating jets in 3D up to nearly ballistic regimes that is general and ready to be applied to any jet in a BNS merger context."}
{"id": "2601.13113", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.13113", "abs": "https://arxiv.org/abs/2601.13113", "authors": ["Di Wang", "Fa-Yin Wang"], "title": "Tidal capture and repeating partial tidal disruption events of giant stars", "comment": "9 pages,9 figures. Accepted for publication in Astronomy & Astrophysics", "summary": "When an object is scattered near a supermassive black hole (SMBH), tidal oscillations excited within it reduce its orbital energy, leading to capture by the SMBH. This process, called tidal capture, can also occur when the object approaches even closer to the SMBH, resulting in a partial tidal disruption event (pTDE). Previous studies on pTDEs of main-sequence stars have shown that as the disruption intensifies, dynamical effects dominate over tidal oscillations, causing the remnant material to acquire a kick velocity instead of being captured by the SMBH. In this work, we performed hydrodynamic numerical simulations of pTDEs involving giant stars. We found that for weaker disruptions, the dynamical behavior of the remnant material resembles that of main-sequence stars. However, as the disruptions deepen, the remnant material transitions from gaining energy to losing energy, leading to capture by the SMBH. This behavior markedly differs from that of main-sequence stars, demonstrating that the presence of a compact core significantly influences the dynamical processes in pTDEs. Our simulations reveal that the energy change of the remnant material strongly correlates with asymmetric mass -- lossspecifically, the difference in mass outflow between the Lagrange points L1 and L2. This suggests that the energy change stems from asymmetric mass loss, consistent with conclusions from previous studies on main-sequence stars. However, quantitative analysis contradicts earlier models, indicating that the dynamical model of pTDEs requires further refinement. Finally, we discuss the characteristics of repeating pTDEs produced by this process and their potential observability, as well as the implications for the long-term orbital evolution of high eccentricity extreme mass ratio inspiral systems."}
{"id": "2601.13138", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2601.13138", "abs": "https://arxiv.org/abs/2601.13138", "authors": ["Emma L. Elley", "James H. Matthews", "Dipanjan Mukherjee", "Bhargav Vaidya"], "title": "Simulating radio emission from flickering AGN jets: travelling shocks and hotspot brightening", "comment": null, "summary": "We investigate the impact of flickering variability in jet power on the luminosity and morphology of radio galaxies. We use a Lagrangian particle method together with relativistic hydrodynamics simulations using the PLUTO code to track the evolution of electron spectra through particle acceleration at shocks and cooling processes. We introduce an adapted version of this method which improves tracking of adiabatic cooling in regimes where low density jet material mixes with high density from the ambient medium in the lobes. We find that rapid increases in jet power can lead to large increases in hotspot luminosity due to the interaction of a travelling shock structure with the pre-existing shock structure at the jet head. We show that in some cases it may be possible to identify a bright region of emission corresponding to a shock travelling along the jet axis. We find that the time-averaged radiative efficiency of variable jets is similar to their steady counterparts, but find significant departures from this on an instantaneous basis. We suggest that, together with environmental effects and differences in the average powers of jets, variable jet powers may have a significant impact on how we understand the diversity of radio jets seen in observations and have significant implications for interpretations of jet powers, energy budgets and luminosity-linear size diagrams."}
{"id": "2601.13181", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.13181", "abs": "https://arxiv.org/abs/2601.13181", "authors": ["Zeeshan Nazir", "Sikandar Akbar", "Zahir Shah", "Athar A. Dar", "Zahoor Malik"], "title": "Broadband Variability Analysis of FSRQ PKS\\,0402-362 with Indications of Quasi-Periodic Modulation", "comment": "Accepted for publication in ApJ", "summary": "We present a comprehensive temporal and spectral study of the flat-spectrum radio quasar PKS~0402$-$362 using \\textit{Fermi}-LAT/Swift-XRT/UVOT observations spanning from MJD 54686-60321. The $γ$-ray light curve exhibits multiple phases of enhanced activity, with the fractional variability parameter ($F_{\\mathrm{var}}$) showing larger amplitudes at longer timescales, consistent with variability trends observed in other FSRQs. Statistical analysis of the flux and spectral index distributions using the Anderson--Darling test and histogram fitting reveals that both distributions deviate from a single log-normal form and are better represented by a double log-normal profile, indicating two distinct flux states. A search for quasi-periodic oscillations in the $γ$-ray emission using the Lomb--Scargle periodogram identified a significant periodic signal at $\\sim$413~days with a confidence level exceeding $3σ$. However the proximity of the timescale to one year and limited number of observed cycles prevents a definitive interpretation. Broadband spectral energy distributions for six flux states were modeled using a one-zone leptonic framework incorporating synchrotron, synchrotron self-Compton (SSC), and external Compton (EC) components. The SEDs are well reproduced with physically reasonable parameters: high-flux states exhibit harder electron spectra and lower magnetic field strengths ($B \\sim 0.2--0.6\\,\\mathrm{G}$), while low-flux states show softer spectra and stronger magnetic fields ($B \\sim 1.3\\,\\mathrm{G}$). The fitted break energy decreases during high-flux states, suggesting enhanced radiative cooling and a transition toward a particle- or kinetic-energy-dominated jet. These trends are consistent with the ``harder-when-brighter'' behavior commonly observed in blazars."}
{"id": "2601.13307", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.13307", "abs": "https://arxiv.org/abs/2601.13307", "authors": ["Zachary Gelles", "Andrew Chael", "Eliot Quataert"], "title": "Signatures of Black Hole Spin and Plasma Acceleration in Jet Polarimetry II: Off-Axis Jets", "comment": "31 pages, 19 figures. Submitted to ApJ", "summary": "We analyze the polarization of optically thin, stationary, axisymmetric black hole jets at scales of order the light cylinder radius. Our work generalizes the face-on results of Gelles et al. (2025) to arbitrary viewing inclination. Due to a combination of geometry and relativistic aberration, the polarization of the jet is not left-right symmetric, and the degree of asymmetry can shed light on both the viewing angle and the plasma bulk Lorentz factor. We show that there is always a radius in the jet at which the polarization transitions from azimuthal to radial; this radius is different along the spine and limb of the jet. We propose metrics that can be used to constrain the black hole spin, inclination angle, and plasma Lorentz factor from these polarimetric signatures, and we discuss the impact of limb-brightening on these measurements. We anticipate that these polarimetric signatures can be studied with current or forthcoming data in M87, NGC 315, NGC 4261, Centaurus A, Cygnus A, and other systems. Observations of the polarization of the base of the counter-jet in higher inclination sources would provide a particularly promising probe of black hole spin."}
{"id": "2601.13311", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2601.13311", "abs": "https://arxiv.org/abs/2601.13311", "authors": ["Colin J. Burke", "Priyamvada Natarajan"], "title": "Variability as a new discovery channel for Intermediate-Mass Black Holes in the Time Domain Era", "comment": "Perspective piece published in Nature Astronomy", "summary": "Between the groundbreaking detections of stellar-mass black holes by LIGO/Virgo/KAGRA and JWST's revelation of a surprisingly abundant population of supermassive black holes, one crucial missing link remains: the elusive intermediate-mass black holes (IMBHs). IMBHs represent a key phase in the hierarchical growth of black holes, yet they have persistently evaded detection. Traditional methods, effective for both actively accreting and quiescent black holes, have largely failed to uncover this hidden population. Here, we argue that novel observational strategies--particularly time-domain variability studies of active galactic nuclei (AGN) and tidal disruption events--provide a promising path forward. Finding IMBHs will resolve critical gaps in our understanding of black hole formation and the various mechanisms driving their subsequent growth. The upcoming Vera C. Rubin Observatory, with its unprecedented capacity to monitor the dynamic sky, stands to revolutionize our ability to detect these long-sought IMBHs, shedding new light on the assembly history of black holes across cosmic time."}
{"id": "2601.13356", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2601.13356", "abs": "https://arxiv.org/abs/2601.13356", "authors": ["Boris Georgiev", "Paul Tiede", "Sebastiano D. von Fellenberg", "Michael Janssen", "Iniyan Natarajan", "Lindy Blackburn", "Jongho Park", "Erandi Chavez", "Andrew T. West", "Kotaro Moriyama", "Jun Yi Koay", "Hendrik Müller", "Dhanya G. Nair", "Avery E. Broderick", "Maciek Wielgus", "Kazunori Akiyama", "Ezequiel Albentosa-Ruíz", "Antxon Alberdi", "Walter Alef", "Juan Carlos Algaba", "Richard Anantua", "Keiichi Asada", "Rebecca Azulay", "Uwe Bach", "Anne-Kathrin Baczko", "David Ball", "Mislav Baloković", "Bidisha Bandyopadhyay", "John Barrett", "Michi Bauböck", "Bradford A. Benson", "Dan Bintley", "Raymond Blundell", "Katherine L. Bouman", "Geoffrey C. Bower", "Michael Bremer", "Roger Brissenden", "Silke Britzen", "Dominique Broguiere", "Thomas Bronzwaer", "Sandra Bustamante", "Douglas F. Carlos", "John E. Carlstrom", "Andrew Chael", "Chi-kwan Chan", "Dominic O. Chang", "Koushik Chatterjee", "Shami Chatterjee", "Ming-Tang Chen", "Yongjun Chen", "Xiaopeng Cheng", "Paul Chichura", "Ilje Cho", "Pierre Christian", "Nicholas S. Conroy", "John E. Conway", "Thomas M. Crawford", "Geoffrey B. Crew", "Alejandro Cruz-Osorio", "Yuzhu Cui", "Brandon Curd", "Rohan Dahale", "Jordy Davelaar", "Mariafelicia De Laurentis", "Roger Deane", "Gregory Desvignes", "Jason Dexter", "Vedant Dhruv", "Indu K. Dihingia", "Sheperd S. Doeleman", "Sergio A. Dzib", "Ralph P. Eatough", "Razieh Emami", "Heino Falcke", "Joseph Farah", "Vincent L. Fish", "Edward Fomalont", "H. Alyson Ford", "Marianna Foschi", "Raquel Fraga-Encinas", "William T. Freeman", "Per Friberg", "Christian M. Fromm", "Antonio Fuentes", "Peter Galison", "Charles F. Gammie", "Roberto García", "Olivier Gentaz", "Ciriaco Goddi", "Roman Gold", "Arturo I. Gómez-Ruiz", "José L. Gómez", "Minfeng Gu", "Mark Gurwell", "Kazuhiro Hada", "Daryl Haggard", "Ronald Hesper", "Dirk Heumann", "Luis C. Ho", "Paul Ho", "Mareki Honma", "Chih-Wei L. Huang", "Lei Huang", "David H. Hughes", "Shiro Ikeda", "C. M. Violette Impellizzeri", "Makoto Inoue", "Sara Issaoun", "David J. James", "Buell T. Jannuzi", "Britton Jeter", "Wu Jiang", "Alejandra Jiménez-Rosales", "Michael D. Johnson", "Svetlana Jorstad", "Adam C. Jones", "Abhishek V. Joshi", "Taehyun Jung", "Ramesh Karuppusamy", "Tomohisa Kawashima", "Garrett K. Keating", "Mark Kettenis", "Dong-Jin Kim", "Jae-Young Kim", "Jongsoo Kim", "Junhan Kim", "Motoki Kino", "Prashant Kocherlakota", "Yutaro Kofuji", "Patrick M. Koch", "Shoko Koyama", "Carsten Kramer", "Joana A. Kramer", "Michael Kramer", "Thomas P. Krichbaum", "Cheng-Yu Kuo", "Noemi La Bella", "Deokhyeong Lee", "Sang-Sung Lee", "Aviad Levis", "Shaoling Li", "Zhiyuan Li", "Rocco Lico", "Greg Lindahl", "Michael Lindqvist", "Mikhail Lisakov", "Jun Liu", "Kuo Liu", "Elisabetta Liuzzo", "Wen-Ping Lo", "Andrei P. Lobanov", "Laurent Loinard", "Colin J. Lonsdale", "Amy E. Lowitz", "Ru-Sen Lu", "Nicholas R. MacDonald", "Jirong Mao", "Nicola Marchili", "Sera Markoff", "Daniel P. Marrone", "Alan P. Marscher", "Iván Martí-Vidal", "Satoki Matsushita", "Lynn D. Matthews", "Lia Medeiros", "Karl M. Menten", "Izumi Mizuno", "Yosuke Mizuno", "Joshua Montgomery", "James M. Moran", "Monika Moscibrodzka", "Wanga Mulaudzi", "Cornelia Müller", "Alejandro Mus", "Gibwa Musoke", "Ioannis Myserlis", "Hiroshi Nagai", "Neil M. Nagar", "Masanori Nakamura", "Gopal Narayanan", "Antonios Nathanail", "Santiago Navarro Fuentes", "Joey Neilsen", "Chunchong Ni", "Michael A. Nowak", "Junghwan Oh", "Hiroki Okino", "Héctor Raúl Olivares Sánchez", "Tomoaki Oyama", "Feryal Özel", "Daniel C. M. Palumbo", "Georgios Filippos Paraschos", "Harriet Parsons", "Nimesh Patel", "Ue-Li Pen", "Dominic W. Pesce", "Vincent Piétu", "Alexander Plavin", "Aleksandar PopStefanija", "Oliver Porth", "Ben Prather", "Giacomo Principe", "Dimitrios Psaltis", "Hung-Yi Pu", "Alexandra Rahlin", "Venkatessh Ramakrishnan", "Ramprasad Rao", "Mark G. Rawlings", "Angelo Ricarte", "Luca Ricci", "Bart Ripperda", "Jan Röder", "Freek Roelofs", "Cristina Romero-Cañizales", "Eduardo Ros", "Arash Roshanineshat", "Helge Rottmann", "Alan L. Roy", "Ignacio Ruiz", "Chet Ruszczyk", "Kazi L. J. Rygl", "León D. S. Salas", "Salvador Sánchez", "David Sánchez-Argüelles", "Miguel Sánchez-Portal", "Mahito Sasada", "Kaushik Satapathy", "Saurabh", "Tuomas Savolainen", "F. Peter Schloerb", "Jonathan Schonfeld", "Karl-Friedrich Schuster", "Lijing Shao", "Zhiqiang Shen", "Sasikumar Silpa", "Des Small", "Randall Smith", "Bong Won Sohn", "Jason SooHoo", "Kamal Souccar", "Joshua S. Stanway", "He Sun", "Fumie Tazaki", "Alexandra J. Tetarenko", "Remo P. J. Tilanus", "Michael Titus", "Kenji Toma", "Pablo Torne", "Teresa Toscano", "Efthalia Traianou", "Tyler Trent", "Sascha Trippe", "Matthew Turk", "Ilse van Bemmel", "Huib Jan van Langevelde", "Daniel R. van Rossum", "Jesse Vos", "Jan Wagner", "Derek Ward-Thompson", "John Wardle", "Jasmin E. Washington", "Jonathan Weintroub", "Robert Wharton", "Kaj Wiik", "Gunther Witzel", "Michael F. Wondrak", "George N. Wong", "Jompoj Wongphexhauxsorn", "Qingwen Wu", "Nitika Yadlapalli", "Paul Yamaguchi", "Aristomenis Yfantis", "Doosoo Yoon", "André Young", "Ziri Younsi", "Wei Yu", "Feng Yuan", "Ye-Fei Yuan", "Ai-Ling Zeng", "J. Anton Zensus", "Shuo Zhang", "Guang-Yao Zhao", "Shan-Shan Zhao"], "title": "Locating the missing large-scale emission in the jet of M87* with short EHT baselines", "comment": "15 pages, 8 figures, Submitted to Astronomy & Astrophysics", "summary": "In Very-Long Baseline Interferometric arrays, nearly co-located stations probe the largest scales and typically cannot resolve the observed source. In the absence of large-scale structure, closure phases constructed with these stations are zero and, since they are independent of station-based errors, they can be used to probe data issues. Here, we show with an expansion about co-located stations, how these trivial closure phases become non-zero with brightness distribution on smaller scales than their short baseline would suggest. When applied to sources that are made up of a bright compact and large-scale diffuse component, the trivial closure phases directly measure the centroid relative to the compact source and higher-order image moments. We present a technique to measure these image moments with minimal model assumptions and validate it on synthetic Event Horizon Telescope (EHT) data. We then apply this technique to 2017 and 2018 EHT observations of M87* and find a weak preference for extended emission in the direction of the large-scale jet. We also apply it to 2021 EHT data and measure the source centroid about 1 mas northwest of the compact ring, consistent with the jet observed at lower frequencies."}
{"id": "2601.13360", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.13360", "abs": "https://arxiv.org/abs/2601.13360", "authors": ["E. Tremou", "S. Corbel", "R. Fender", "P. Woudt", "J. C. A Miller-Jones", "I. Heywood", "F. Carotenuto", "S. Motta", "A. Tzioumis", "P. J. Groot", "D. M. Russell", "J. Crook-Mansour", "P. Saikia", "W. Yu", "J. van den Eijnden", "A. J. van der Horst", "D. R. A. Williams-Baldwin", "X. Zhang"], "title": "The odyssey of the black hole low mass X-ray binary GX339-4: Five years of dense multi-wavelength monitoring", "comment": "Accepted for publication in MNRAS. Release of calibrated radio maps from ThunderKAT project is available at https://doi.org/10.48479/4fpq-sd16", "summary": "We present the longest and the densest quasi-simultaneous radio, X-ray and optical campaign of the black hole low mass X-ray binary GX339-4, covering five years of weekly GX339-4 monitoring with MeerKAT, Swift-XRT and MeerLICHT, respectively. Complementary high frequency radio data with the Australia Telescope Compact Array are presented to track in more detail the evolution of GX339-4 and its transient ejecta. During the five years, GX339-4 has been through two \"hard-only\" outbursts and two \"full\" outbursts, allowing us to densely sample the rise, quenching and re-activation of the compact jets. Strong radio flares were also observed close to the transition between the hard and the soft states. Following the radio flare, a transient optically thin ejection was spatially resolved during the 2020 outburst, and was observed for a month. We also discuss the radio/X-ray correlation of GX339-4 during this five year period, which covers several states in detail from the rising phase to the quiescent state. This campaign allowed us to follow ejection events and provide information on the jet proper motion and its intrinsic velocity. With this work we publicly release the weekly MeerKAT L-band radio maps from data taken between September 2018 and October 2023."}
{"id": "2601.13378", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.13378", "abs": "https://arxiv.org/abs/2601.13378", "authors": ["Lucas M. Pasquevich", "Gustavo E. Romero", "Matías M. Reynoso"], "title": "Neutrinos from hidden ultraluminous X-ray sources in the Galaxy", "comment": "15 pages, 19 figures, accepted for publication in Astroparticle Physics", "summary": "Ultraluminous X-ray sources (ULXs) are point-like sources that exhibit apparent X-ray luminosities exceeding the Eddington limit for stellar-mass compact objects. A widely accepted interpretation is that these systems are X-ray binaries accreting matter possibly at super-Eddington rates. In this regime, photon trapping inflates the accretion disk, making it geometrically and optically thick. Radiation-driven winds launched from the supercritical disk form funnel-shaped walls along the symmetry axis. While the apparent X-ray luminosity can exceed the Eddington limit due to geometrical beaming within this funnel, a misalignment with the observer's line of sight strongly suppresses the X-ray emission, rendering the ULX electromagnetically obscured.\n  This work explores the potential for high-energy neutrino production in black hole-hosting ULXs. We model proton acceleration via magnetic reconnection in the region above the super-accreting black hole. Although electromagnetic emission is efficiently absorbed by the dense wind and radiation fields, neutrinos generated from photomeson interactions can escape. Our model self-consistently accounts for energy losses of pions and muons in this environment. The results indicate that misaligned, electromagnetically obscured Galactic ULXs could produce a neutrino flux detectable by instruments like KM3NeT and IceCube within several years of observation."}
{"id": "2601.13557", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.13557", "abs": "https://arxiv.org/abs/2601.13557", "authors": ["Ashwin Aravindaraj", "Hsiang-Kuang Chang"], "title": "Observational Relationship between Spectral Properties of Gamma-ray and X-ray Emissions from Pulsars", "comment": null, "summary": "Correlations between gamma-ray and X-ray spectral properties of pulsars are investigated in order to provide observational hints on physics involved in pulsars' high-energy emissions. Using a sample of 43 pulsars detected in both X-ray and gamma-ray bands, we find that pulsars' gamma-ray luminosity, $L_γ$, clearly correlates with the luminosity of non-thermal X-ray emission, $L_{\\rm p}$, and anti-correlates with non-thermal X-ray photon index. Other gamma-ray spectral parameters show weaker or negligible correlations. The found relation that $L_γ\\propto L_{\\rm p}^{0.49\\pm 0.05}$ implies a certain connection between radiation mechanisms and energy distributions of radiating particles for these high-energy emissions. Pulsars with and without detected thermal emissions seem to show different dependencies in those correlations, suggesting the possible existence of two different kinds of pulsars. The ones without detected thermal emissions may represent a population of pulsars with low surface temperature. The origin and energetics of high-energy emitting electron-positron pairs for this group of pulsars probably do not depend on their surface thermal emissions, while that of the other group do. The low surface temperatures might be evidence for the working of some exotic processes of neutron-star cooling. Similar to $L_{\\rm p}$, some tempting relationships are found among each gamma-ray spectral parameter, surface temperature and thermally radiating area radius. It again strengthens the connection between gamma-ray and X-ray emissions from pulsars."}
{"id": "2601.13701", "categories": ["astro-ph.HE", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2601.13701", "abs": "https://arxiv.org/abs/2601.13701", "authors": ["Frédéric Marin", "Daniele Tagliacozzo", "Francesco Ursini", "Damien Hutsemékers", "Mitsuru Kokubo", "Thibault Barnouin", "Andrea Gnarini", "Alessandro Leonardo Lai", "Jirí Svoboda", "Stefano Bianchi", "Vittoria Elvezia Gianolli", "Ephraim Gau", "Kun Hu", "Henric Krawczynski", "W. Peter Maksym", "Andrea Marinucci", "Herman Marshall", "Giorgio Matt", "Riccardo Middei", "Pierre-Olivier Petrucci", "Simonetta Puccetti", "Nicole Rodriguez", "Roberto Serafinelli", "Francesco Tombesi"], "title": "XPE and VLT /FORS2 polarimetry challenge the Seyfert-1.9 classification of MCG-05-23-16", "comment": "15 pages, 11 figures, 2 tables, 4 tables, accepted for publication in A&A", "summary": "We report the third observation of the Seyfert-1.9 active galactic nucleus (AGN) MCG-05-23-16 with the Imaging X-ray Polarimetry Explorer (\\textit{IXPE}), together with optical spectro-polarimetry obtained at the Very Large Telescope (VLT), and combined with archival near-ultraviolet, optical and near-infrared polarimetric data. No X-ray polarization was detected in the 2-8 keV band, with a 99\\% confidence upper limit of $\\leq$2.9\\%, further reduced to $\\leq$2.5\\% when combined with the two past IXPE observations of the same target. Monte Carlo simulations suggest that equatorial coronal models are disfavored if the AGN is indeed a type-1.9/2 AGN, but coronae coplanar to the accretion disk remain consistent if the source is less inclined than previously assumed. \\textit{VLT}/FORS2 data reveal a typical type-2 spectrum in total flux, a broad H$α$ line in polarized flux, and strongly wavelength dependent polarization degree and angle, rotating by nearly 70$^\\circ$ across the optical band. Comparison with historical measurements confirms long-term stability of the polarization spectrum and a $\\sim$90$^\\circ$ rotation in the near-ultraviolet. Interpreting the multi-wavelength polarization relative to the AGN ionization axis indicates that the main obscurer is not a compact circumnuclear torus, but a distant kpc-scale dust lane crossing the galaxy. This result implies that MCG-05-23-16 is in fact a type-1 AGN seen through foreground dust. The low X-ray column density becomes consistent with the absence of polarization, provided that the nuclear inclination is low."}
{"id": "2601.13940", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.13940", "abs": "https://arxiv.org/abs/2601.13940", "authors": ["Xue-Zhi Liu", "Ming-Yu Ge", "Xiao-Ping Zheng", "Xiao-Bo Li", "Han-Long Peng", "Wen-Tao Ye", "Bo-Yan Chen", "Shi-Jie Zheng", "Fang-Jun Lu", "Shuang-Nan Zhang"], "title": "Secular Evolution of PSR J2021+4026: Long-Term γ-Ray Flux and Spin-Down Variability Beyond State Transitions", "comment": "6 pages, 3 figures", "summary": "PSR J2021+4026 is a remarkable $γ$-ray pulsar exhibiting repeated transitions between high $γ$-ray flux (HGF) and low $γ$-ray flux (LGF) states. With 17-yr Fermi-LAT monitoring, we reveal persistent secular evolution and enhanced spin-down rate variability within individual emission states -- beneath the quasi-periodic state transitions. After removing discrete jumps, the jump-corrected flux $δF_γ$ shows a three-phase evolution: rise ($+2.02^{+0.17}_{-0.15}\\%~\\mathrm{yr}^{-1}$), decline ($-3.72^{+0.34}_{-0.47}\\%~\\mathrm{yr}^{-1}$), and rapid rise ($+14.9^{+6.4}_{-4.4}\\%~\\mathrm{yr}^{-1}$), with all rates quoted relative to the long-term mean flux $\\langle F_γ\\rangle=7.8\\times 10^{-10}\\,\\mathrm{erg}\\,\\mathrm{cm}^{-2}\\,\\mathrm{s}^{-1}$. Moreover, the flux of the LGF state is gradually approaching the stable HGF level at a rate of $+0.72 \\pm 0.11\\%~\\mathrm{yr}^{-1}$. These results demonstrate that secular flux evolution in PSR J2021+4026 operates largely independently of discrete state transitions, yet jointly with them drives the system toward a stable high-flux equilibrium."}
{"id": "2601.13941", "categories": ["astro-ph.HE", "hep-ph", "nucl-th"], "pdf": "https://arxiv.org/pdf/2601.13941", "abs": "https://arxiv.org/abs/2601.13941", "authors": ["Adamu Issifu", "Andreas Konstantinou", "Prashant Thakur", "Tobias Frederico"], "title": "Rotational enhancement and stability of protoquark stars during thermal evolution", "comment": "12 pages, 1 table, 8 figures", "summary": "We present the first systematic study of rigidly rotating protoquark stars based on isentropic equations of state (EOS) within the density-dependent quark mass (DDQM) framework. Using a quasi-static equilibrium approach, we follow the Kelvin--Helmholtz evolution from hot, lepton-rich matter to a cold, catalyzed quark star. Rotation substantially enhances the maximum stable mass (by up to $\\sim 40\\%$), equatorial radius, and key rotational observables, with the ratio of rotational kinetic to gravitational potential energy, $T_{\\rm kin}/|W|$, reaching $0.18$--$0.19$ near the Keplerian limit, indicating a heightened susceptibility to gravitational-wave--emitting instabilities. Thermal evolution introduces a clear ordering: all stellar properties peak during the lepton-rich stages and decrease monotonically as the star cools. Compared to hadronic stars, rotating protoquark stars exhibit larger radii, higher moments of inertia, and stronger quadrupolar deformation, producing a distinct signature in the mass--radius--spin plane that can accommodate objects such as HESS~J1731--347 and PSR~J0740+6620. These results demonstrate that future multimessenger observations must account for both thermal history and rotation to robustly identify quark matter in compact stars."}
{"id": "2601.13978", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.13978", "abs": "https://arxiv.org/abs/2601.13978", "authors": ["Satoshi Takashima", "Hirokazu Odaka", "Ryota Tomaru", "Atsushi Tanimoto", "Aya Bamba", "Toru Tamagawa"], "title": "X-ray Analysis and Photon-transport Simulations of SMC X-1: A Warped-disc Origin of the Superorbital Modulation", "comment": "18 pages, 18 figures, Accepted for publication in MNRAS", "summary": "The luminous accreting pulsar SMC X-1 is an appropriate target to explore the accretion dynamics. SMC X-1 shows unique quasi-periodic flux variability of 40-65$\\,$days known as superorbital modulation. To constrain the accretion structure of SMC X-1 based on timing and spectral study, we have analysed X-ray data of SMC X-1 observed by Suzaku and NuSTAR at various epochs between 2011 and 2022. The spectral analysis shows that the hydrogen column density ($N_\\mathrm{H}$) increases from $1.1 \\times 10^{22}\\,\\mathrm{cm^{-2}}$ to $1.24 \\times 10^{23}\\,\\mathrm{cm^{-2}}$ as the flux decreases with the superorbital modulation. The neutral iron K$α$ line at 6.4$\\,$keV has a broad width of 0.3$\\,$keV, and its equivalent width increases as toward superorbital low states. The line broadening is consistent with Keplerian motion at the inner disc rather than the stellar wind velocity of the donor star. These findings support that the superorbital modulation is a consequence of X-ray attenuation by the warped accretion disc. To test this interpretation, we have conducted photon transport simulations of a system consisting of a neutron star, a warped disc, and optically-thin disc atmosphere. Occultation of the central source by the disc successfully reproduces the observed variations in the equivalent width of neutral iron K$α$ line, pulse profiles, and flux in hard X-rays. Notably, a disc precession angle of approximately $30^\\circ$ can account for the observational features. For the radiation pattern of the photon source, the preferred beam width corresponds to a standard deviation of $30^\\circ$."}
{"id": "2601.14065", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.14065", "abs": "https://arxiv.org/abs/2601.14065", "authors": ["An-Chieh Hsu", "Tetsuya Hashimoto", "Tomotsugu Goto", "Tomoki Wada", "Bjorn Jasper Raquel"], "title": "Unveiling Hidden Clustering: An Unsupervised Machine Learning Study of Repeating FRB 20220912A", "comment": null, "summary": "Fast Radio Bursts (FRBs) are millisecond-duration radio transients of extragalactic origin. Classifying repeating FRBs is essential for understanding their emission mechanisms, but remains challenging due to their short durations, high variability, and increasing data volume. Traditional methods often rely on subjective criteria and struggle with high-dimensional data. In this study, we apply an unsupervised machine learning framework that combines Uniform Manifold Approximation and Projection (UMAP) and Hierarchical Density-Based Spatial Clustering of Applications with Noise (HDBSCAN) to eight observed parameters from FRB 20220912A. Our analysis reveals three distinct clusters of bursts with varying spectral and fluence properties. Comparisons with clustering studies on other repeaters show that some of our clusters share similar features with sources such as FRB 20201124A and FRB 121102, suggesting possible common emission mechanisms. We also provide qualitative interpretations for each cluster, highlighting the spectral diversity within a single source. Notably, one cluster shows broadband emission and high fluence, which are typically seen in non-repeating FRBs. This raises the possibility that some non-repeaters may be misclassified repeaters due to observational limitations. Our results demonstrate the utility of machine learning in uncovering intrinsic diversity in FRB emission and provide a foundation for future classification studies."}
{"id": "2601.14107", "categories": ["astro-ph.HE", "astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2601.14107", "abs": "https://arxiv.org/abs/2601.14107", "authors": ["M. Abdullahi", "M. Abrate", "J. H. Adams", "D. Allard", "P. Alldredge", "R. Aloisio", "R. Ammendola", "A. Anastasio", "L. Anchordoqui", "V. Andreoli", "A. Anzalone", "E. Arnone", "D. Badoni", "P. von Ballmoos", "B. Baret", "D. Barghini", "M. Battisti", "R. Bellotti", "A. A. Belov", "M. Bertaina", "M. Betts", "P. Biermann", "F. Bisconti", "S. Blin-Bondil", "M. Boezio", "A. N. Bowaire", "I. Buckland", "L. Burmistrov", "J. Burton-Heibges", "F. Cafagna", "D. Campana", "F. Capel", "J. Caraca", "R. Caruso", "M. Casolino", "C. Cassardo", "A. Castellina", "K. Černý", "L. Conti", "A. G. Coretti", "R. Cremonini", "A. Creusot", "A. Cummings", "S. Davarpanah", "C. De Santis", "C. de la Taille", "A. Di Giovanni", "A. Di Salvo", "T. Ebisuzaki", "J. Eser", "F. Fenu", "S. Ferrarese", "G. Filippatos", "W. W. Finch", "C. Fornaro", "C. Fuglesang", "P. Galvez Molina", "S. Garbolino", "D. Garg", "D. Gardiol", "G. K. Garipov", "A. Golzio", "C. Guépin", "A. Haungs", "T. Heibges", "F. Isgrò", "R. Iuppa", "E. G. Judd", "F. Kajino", "L. Kupari", "S. -W. Kim", "P. A. Klimov", "I. Kreykenbohm", "J. F. Krizmanic", "J. Lesrel", "F. Liberatori", "H. P. Lima", "E. M'sihid", "D. Mandát", "M. Manfrin", "A. Marcelli", "L. Marcelli", "W. Marszał", "G. Masciantonio", "V. Masone", "J. N. Matthews", "E. Mayotte", "A. Meli", "M. Mese", "S. S. Meyer", "M. Mignone", "M. Miller", "H. Miyamoto", "T. Montaruli", "J. Moses", "R. Munini", "C. Nathan", "A. Neronov", "R. Nicolaidis", "T. Nonaka", "M. Mongelli", "A. Novikov", "F. Nozzoli", "T. Ogawa", "S. Ogio", "H. Ohmori", "A. V. Olinto", "Y. Onel", "G. Osteria", "B. Panico", "E. Parizot", "G. Passeggio", "T. Paul", "M. Pech", "K. Penalo Castillo", "F. Perfetto", "L. Perrone", "C. Petta", "P. Picozza", "L. W. Piotrowski", "Z. Plebaniak", "G. Prévôt", "M. Przybylak", "H. Qureshi", "E. Reali", "M. H. Reno", "F. Reynaud", "E. Ricci", "M. Ricci", "A. Rivetti", "G. Saccà", "R. E. Saraev", "H. Sagawa", "O. Saprykin", "F. Sarazin", "R. E. Saraev", "P. Schovánek", "V. Scotti", "S. A. Sharakin", "V. Scherini", "H. Schieler", "K. Shinozaki", "F. Schröder", "A. Sotgiu", "R. Sparvoli", "B. Stillwell", "J. Szabelski", "M. Takeda", "Y. Takizawa", "S. B. Thomas", "R. A. Torres Saavedra", "R. Triggiani", "D. A. Trofimov", "M. Unger", "T. M. Venters", "M. Venugopal", "C. Vigorito", "M. Vrábel", "S. Wada", "D. Washington", "A. Weindl", "L. Wiencke", "J. Wilms", "S. Wissel", "I. V. Yashin", "M. Yu. Zotov", "P. Zuccon"], "title": "The JEM-EUSO Collaboration: Contributions to the 39th International Cosmic Ray Conference (ICRC2025)", "comment": null, "summary": "This is a collection of papers presented by the JEM-EUSO Collaboration at the 39th International Cosmic Ray Conference (ICRC 2025) (Geneva, Switzerland, July 14--24, 2025)."}
{"id": "2601.14113", "categories": ["astro-ph.HE", "gr-qc"], "pdf": "https://arxiv.org/pdf/2601.14113", "abs": "https://arxiv.org/abs/2601.14113", "authors": ["Orhan Donmez", "Sushant G. Ghosh", "M. Yousaf", "G. Mustafa", "Farruh Atamurotov"], "title": "Accretion flow around Kerr metric in the infra-red limit of asymptotically safe gravity", "comment": "17 pages, 8 figures, 1 Table", "summary": "We investigate accretion disk dynamics and the formation of quasi-periodic oscillations (QPOs) in the infrared limit around Kerr-like black holes in asymptotically safe gravity. Relativistic hydrodynamic solutions of Bondi-Hoyle-Lyttleton (BHL) accretion reveal that quantum corrections significantly modify the structure of the shock cone formed around the black hole. The black hole spin controls the asymmetric of the shock cone through frame-dragging effects, whereas the quantum correction parameter softens the effective gravitational potential, resulting in a wider shock opening angle, weaker post-shock compression, and reduced density concentration within the cone. Time-dependent mass accretion rates reveal oscillation modes trapped within the shock cone. The power spectral density (PSD) investigations suggest that these modes naturally generate low-frequency QPOs, whose amplitudes, coherence, and harmonic structure depend on both the spin and the quantum correction parameter. The PSD analyses performed at different radial locations reveal that identical QPO frequencies are obtained in all cases. The numerically detected frequencies result from the excitation of global oscillation modes trapped within the post-shock region. The resulting global modes are found to consist of fundamental frequencies, their associated harmonic overtones, and near-commensurate frequency ratios such as 2:1 and 3:2. Coherent oscillations are enhanced and near-commensurate frequency ratios are produced when moderate rotation and moderate quantum corrections are coupled. Large quantum correction parameters, on the other hand, wash out unique spectral peaks and suppress oscillation amplitudes."}
{"id": "2601.14137", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.14137", "abs": "https://arxiv.org/abs/2601.14137", "authors": ["An Li", "Chen-Wei Wang", "Niccolò Passaleva", "Jie An", "Bin-Bin Zhang", "Eleonora Troja", "Yi-Han Iris Yin", "Yuan Liu", "Shao-Lin Xiong", "Li-Ping Xin", "Yi-Xuan Shao", "Jun Yang", "Hui Sun", "Dong Xu", "Yu-Han Yang", "Roberto Ricci", "He Gao", "Sarah Antier", "Rosa L. Becerra", "Jia-Xin Cao", "Alberto Javier Castro-Tirado", "Xin-Lei Chen", "Ye-Hao Cheng", "Yong Chen", "Hua-Qing Cheng", "Valerio D'Elia", "Massimiliano De Pasquale", "Yong-Wei Dong", "Eslam Elhosseiny", "Rob A. J. Eyles-Ferris", "Maria Gritsevich", "Xu-Hui Han", "Dieter Hartmann", "You-Dong Hu", "Jing-Wei Hu", "Shu-Mei Jia", "Nino Kochiashvili", "Wei-Hua Lei", "Andrew J. Levan", "Cheng-Kui Li", "Dong-Yue Li", "Hua-Li Li", "Xiao-Bo Li", "Zhi-Xing Ling", "He-Yang Liu", "Hou-Jun Lv", "Daniele B. Malesani", "Brendan O'Connor", "Hai-Wu Pan", "Shashi Bhushan Pandey", "Ignacio Perez-Garcia", "Daniëlle L. A. Pieterse", "Marion Pillas", "Yu-Lei Qiu", "Andrea Saccardi", "Rubén Sánchez-Ramírez", "Wen-Jun Tan", "Manasanun Tanasan", "Nial R. Tanvir", "Susanna D. Vergani", "Jing Wang", "Xiao-Feng Wang", "Qin-Yu Wu", "Shu-Xu Yi", "Tillayev Yusufjon", "Chen Zhang", "Wen-Da Zhang", "Yi-Jia Zhang", "Guo-Ying Zhao", "Chao Zheng", "Shi-Jie Zheng", "Chang Zhou", "Ping Zhou", "Bertrand Cordier", "Jian-Yan Wei", "Weimin Yuan", "Shuang-Nan Zhang", "Bing Zhang"], "title": "Minutes-long soft X-ray prompt emission from a compact object merger", "comment": "52 pages, 10 figures, 5 tables", "summary": "Compact object mergers are multi-messenger sources and progenitors of some gamma-ray bursts (GRBs), primarily understood by gamma-ray observations, while poorly constrained in the prompt low-energy phase. A long-lasting X-ray emission was discussed as afterglows following several short-duration ($\\lesssim$2 s) bursts, yet this prompt X-ray component was not directly observed or confirmed. Here we report the discovery of a minutes-long ($\\sim$560 s) flash of soft X-rays immediately following the short ($\\sim$0.4 s) GRB 250704B. The long-soft bump points to a distinct phase of prompt emission in X-rays detected by Einstein Probe in an event that otherwise appear as an ordinary short GRB, showing that long-lasting X-ray emission is likely a common feature of merger-driven bursts and a promising electromagnetic counterpart to gravitational-wave sources."}
{"id": "2601.14156", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.14156", "abs": "https://arxiv.org/abs/2601.14156", "authors": ["A. W. Shaw", "K. Mukai", "C. O. Heinke", "C. G. Nixon", "D. A. H. Buckley", "P. A. Dubovský", "F. -J. Hambsch", "J. Hilburn", "K. Petrík", "R. M. Plotkin", "S. B. Potter", "N. Rawat", "T. Shahbaz", "Sharif. Dufoer", "S. Dvorak", "D. Messier", "G. Myers", "P. Nelson", "R. Sabo", "J. Ulowetz", "T. Vanmunster"], "title": "A multi-wavelength study of the 2025 low state of the intermediate polar BG CMi", "comment": "19 pages, 10 figures, 1 table. Accepted for publication in ApJ", "summary": "We present multi-wavelength observations of the first recorded low state of the intermediate polar BG CMi. Optical monitoring of the source by members of the American Association of Variable Star Observers reveals a decrease of ~0.5 mag that lasted ~50 d in early 2025. During the low state the optical timing properties imply that BG CMi underwent a change in the accretion mode, as power at the spin frequency $ω$ dramatically dropped. An XMM-Newton observation revealed a substantial decrease in intrinsic absorption and a slight increase in intrinsic X-ray luminosity, compared to archival Suzaku data. Timing analysis of the X-ray light curves shows that power shifted from the orbital frequency $Ω$ (prominent in Suzaku data) to $2Ω$ in the low state XMM-Newton data, along with the strengthening of certain orbital sidebands. We suggest that BG CMi transitioned to disk-overflow accretion, where the white dwarf accreted matter via both a disk and a stream, the latter becoming more dominant during the low state due to a decrease in the mass and size of the disk."}
{"id": "2601.14257", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.14257", "abs": "https://arxiv.org/abs/2601.14257", "authors": ["O. S. Salafia", "A. Celotti", "E. Sobacchi", "L. Nava", "G. Oganesyan", "G. Ghirlanda", "S. Boula", "M. E. Ravasio", "G. Ghisellini"], "title": "A self-consistent explanation of the MeV line in GRB 221009A unveils a dense circum-stellar medium", "comment": "19 pages, 8 figures. Submitted to A&A. Comments are welcome!", "summary": "GRB~221009A has been the brightest gamma-ray burst (GRB) observed to date, and its afterglow has been characterised with unprecedented detail at TeV energies by LHAASO. Quite puzzlingly, it is also the most energetic GRB known. Among the riddles posed by this mysterious source, however, the sheer energetics are hardly the most intriguing: an unprecedented, narrow, luminous emission line at around 10 MeV has been uncovered by a detailed spectral analysis of \\textit{Fermi}/GBM data immediately following the brightest peak in the GRB prompt emission and the peak of the TeV afterglow. As noted in the discovery article, the temporal evolution of the line properties can be explained as being due to high-latitude emission from a geometrically thin, relativistically expanding shell where annihilation of a large number of electron-positron pairs took place. We show that this interpretation yields stringent constraints on the properties of such shell, that point to a process that happens at radii typical of external shocks. We then demonstrate that the shell could have been the blastwave associated with the GRB precursor, with the line arising after pair loading of such blastwave as it was illuminated by the bright and hard radiation of the GRB main event. The scenario, which also explains the abrupt initial rise of the LHAASO afterglow, requires the progenitor of the GRB to have been surrounded by a circum-stellar medium (CSM) extending out to a few $10^{15}\\,\\mathrm{cm}$, with a density $n_\\mathrm{ext}\\sim 10^{8}-10^{9}\\,\\mathrm{cm^{-3}}$ reminiscent of those found from studies of Type IIn supernovae. This provides a precious clue to the nature of the progenitor of this peculiar GRB, which could also be present in other bursts that feature a long quiescence followed by a bright emission episode with a hard spectrum."}
{"id": "2601.12094", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.12094", "abs": "https://arxiv.org/abs/2601.12094", "authors": ["John Banovetz", "Claire-Alice Hebert", "Peter B. Denton", "Dan Scolnic", "Anze Slosar", "Chris Walter"], "title": "Uncovering the Next Galactic Supernova with the Vera C. Rubin Observatory", "comment": "12 pages, 9 figures, submitted to Open Journal of Astrophysics", "summary": "Supernovae are observed to occur approximately 1-2 times per century in a galaxy like the Milky Way. Based on historical records, however, the last core-collapse galactic supernova observed by humans occurred almost 1,000 years ago. Luckily, we are well positioned to catch the next one with the advent of new neutrino detectors and astronomical observatories. Neutrino observatories can provide unprecedented triggers for a galactic supernova event as they are likely to see a supernova neutrino signal anywhere from minutes to days before the shock breakout causes the supernova to brighten in optical wavelengths. Given its large etendue, the Vera C. Rubin Observatory is ideally positioned to rapidly localize the optical counterpart based on the neutrino trigger. In this paper we simulate events to study the efficiency with which supernovae are optimally localized by the Vera C. Rubin Observatory. We find that the observatory is ideal for initial localization of nearly all observable supernova triggers and has a 57-97% chance of catching any supernova based on theoretical stellar mass density predictions and observations. We provide an analysis of optimal filter selection and exposure times and discuss observational caveats."}
{"id": "2601.13957", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2601.13957", "abs": "https://arxiv.org/abs/2601.13957", "authors": ["Kathrin Grunthal", "David J. Champion", "Eric Thrane", "Rowina S. Nathan", "Michael Kramer", "Matthew T. Miles"], "title": "Optimising gravitational-wave sky maps for pulsar timing arrays", "comment": "10 + 1 pages, 9 figures, in print with Astronomy&Astrophysics", "summary": "Pulsar timing arrays (PTAs) have recently reported compelling evidence for the presence of a gravitational-wave background signal. Mapping the gravitational-wave background is key to understanding how it is formed, since anisotropy is a tracer for, for example, a supermassive black hole binary origin. In this work we refine the frequentist regularised gravitational-wave mapping analysis developed in our previous work (as part of the MeerKAT PTA 4.5-year data release). We derive a point-spread function describing the angular resolution of a PTA. We investigate how the point spread function changes for different PTA constellations and determine the best possible angular resolution achievable within our framework. Using simulated data, we demonstrate that previous methods do not capture the actual resolution - especially in regions of the sky with a high density of pulsars. We propose an improved scheme that accounts for a variable local resolution and test it using realistic simulations of the latest MeerKAT dataset. We demonstrate that we are able to identify a continuous gravitational wave signal in a region with good pulsar sky coverage with approximately a factor of two increase in significance compared to our previous method."}
