{"id": "2512.24067", "categories": ["astro-ph.IM", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2512.24067", "abs": "https://arxiv.org/abs/2512.24067", "authors": ["Dan Zhou", "Jing Zhong", "Jianchun Shi", "Zhenghong Tang", "Shiyin Shen", "Peng Jiang", "Jie Zhu", "Yong Yu", "Lixin Zheng", "Jianjun Cao", "Guoping Chen", "Xinyu Yao", "Congcong Zhang", "Lurun Shen", "Hui Zhang", "Xiang Pan", "Chenwei Yang", "Tuo Ji", "Xian Shi", "Hengxiao Guo", "Zhen Yan", "Donghai Zhao", "Liang Chen", "Jianeng Zhou", "Minfeng Gu", "Fuguo Xie", "Wenbiao Han", "Jinliang Hou", "Bixuan Zhao", "Wenwen Zuo", "Chun Xu", "Zhengyi Shao", "Lei Hao", "Jian Fu"], "title": "Antarctic TianMu Staring Observation Project I: Overview and Implementation of the Prototype Telescope", "comment": "15 pages, 10 figures, accepted for publication in Astronomical Techniques and Instruments (ATI)", "summary": "Wide-field rapid sky surveys serve as critical observational methods for time-domain astronomical research. The Antarctic region, with several months of continuous dark nights annually, is an ideal site for time-domain astronomical observations. The Antarctic TianMu Staring Observation Project aims to deploy a fleet of small telescopes, adopting an array observation model to conduct time-domain optical observations in Antarctica, featuring wide-sky coverage, high-cadence sampling, long-period staring, and simultaneous multi-band measurements. Considering the severe challenges optical telescopes face in Antarctica, including extremely low temperatures, unattended operation, and limited power supply and network transmission, we have designed and developed the Antarctic TianMu prototype telescope based on drift-scan charge-coupled device technology. In October 2022, our prototype (with an aperture of 18 cm), named AT-Proto was transported to Zhongshan Station in Antarctica aboard China's 39th Antarctic Research Expedition. It has since operated stably and reliably in the frigid environment for over two years, demonstrating the significant advantages of this technology in polar astronomical observations. The experimental observation results of AT-Proto provide a solid foundation for the subsequent construction of a time-domain astronomy observation array in Antarctica."}
{"id": "2512.24068", "categories": ["astro-ph.IM", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2512.24068", "abs": "https://arxiv.org/abs/2512.24068", "authors": ["Hubiao Niu", "Jing Zhong", "Yu Zhang", "Jianchun Shi", "Rui Rong", "Jinzhong Liu", "Shiyin Shen", "Zhenghong Tang", "Dan Zhou"], "title": "Antarctic TianMu Staring Observation Project II: Data reduction and preliminary results", "comment": "17 pages, 12 figures, accepted for publication in Astronomical Techniques and Instruments (ATI)", "summary": "The Antarctic TianMu Staring Observation Program is a time-domain optical sky survey project carried out in Antarctica, capable of large sky coverage, high-cadence sampling, and long-period staring. It utilizes the exceptional observing conditions in Antarctica to conduct high-cadence time-domain sky surveys. At present, we have successfully developed an 18-cm aperture Antarctic TianMu prototype, which has been deployed at Zhongshan Station in Antarctica for two consecutive years of trouble-free observations, during which more than 300,000 original images were obtained. This paper systematically outlines the commissioning data of the prototype telescope in 2023, the primary data processing pipeline, and the preliminary data products. The core pipeline encompasses four key stages: Data preprocessing, instrumental effect correction, astrometric solution, and full-field stellar photometry. Here, we release the 2023 data products, which specifically include reduced image data and a photometric catalog, for which, preliminary analyses demonstrate robust performance. Using Gaia Data Release 3 as a reference catalog, the astrometric precision, quantified by the root mean square of positional errors, is determined to be better than approximately 2 arcseconds, validating the observational capabilities of the system. For a 30-second exposure, the detection limit in the G-band is achieved at 15.00~mag, with a detection threshold of 1.5~$σ$. The photometric errors are below 0.1~mag for the majority of stars brighter than 14.00~mag. Furthermore, it improves significantly, reaching better than 0.01~mag for most stars brighter than 11.00~mag and 12.00~mag when employing the adaptive aperture photometry and point spread function photometry methods, respectively."}
{"id": "2512.24187", "categories": ["astro-ph.IM", "astro-ph.GA", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.24187", "abs": "https://arxiv.org/abs/2512.24187", "authors": ["Susanna Bisogni", "Giustina Vietri", "Andrea Travascio", "Adriana Gargiulo", "Chiara Mancini", "Swayamtrupta Panda"], "title": "Connecting disc-corona physics and ionised outflows in AGN in the 2040s", "comment": "Cover page plus 3 pages according to the guidelines issued by the ESO Expanding Horizons initiative 2025 (call for White Papers)", "summary": "We outline a science case for next-generation wide-field spectroscopic surveys aimed at connecting the physics of the accretion disc and X-ray corona in active galactic nuclei (AGN) with the properties of their nebular regions and circumgalactic medium (CGM). We focus on the non-linear Lx-Luv relation and on deviations from this canonical coupling encoded in $Δα_{OX}$, the offset of the optical-to-X-ray index from the mean relation, and propose to use broad and narrow line emission and CGM nebulae as calorimeters of the ionising SED to trace different accretion \"states\". We propose an observational strategy based on rest-frame UV/optical spectroscopy of $\\sim 10^{4}-10^{5}$ AGN, a time-domain reverberation-mapping tier for a well-defined subsample, coordinated X-ray coverage, and wide-field IFU mapping of CGM emission (including H$α$ and Ly$α$). From these goals we derive requirements for a future ESO facility in the 2040s: a dedicated, wide-field, high-multiplex optical-NIR spectroscopic telescope with time-domain flexibility and arcmin-scale IFU capability."}
{"id": "2512.24299", "categories": ["astro-ph.IM", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2512.24299", "abs": "https://arxiv.org/abs/2512.24299", "authors": ["Rainer Spurzem"], "title": "From Nbody1 to Nbody7: the Growth of Sverres Industry", "comment": "10 pages, 3 figures; talk presented at IAU symposium No.398, Compact Objects and Binaries in Dense Star Clusters, in Seoul, Korea (Rep.), June 16-20, 2025, in special session about the work and life of Sverre Aarseth; accepted for publication in Proceedings of IAU Symposium No. 398, H.M. Lee, J. Hong, R. Spurzem, eds., Cambridge Univ. Press", "summary": "From NBODY1 to NBODY6 : The Growth of an Industry is the title of a 1999 invited review by Sverre Aarseth, for Publications of the Astronomical Society of the Pacific (PASP). I took this as an inspiration for the title of this paper; it describes how Sverres NBODY Industry has further grown since 90s of the previous century, and how it is further flourishing and hopefully developing, in his spirit, even after the sad news of his passing away reached us. My contact and friendship with Sverre started a few decades ago being sent to Cambridge to learn NBODY5, counting input parameters, and learning about the fact that even a sophisticated code (which had already at that time quite a history) requires permanent maintenance and bug fixes. Managed by Sverre, who relentlessly ran his code and responded to the widely spread crowd of customer colleagues. There has been a phase of massive and fast development and improvements due to vectorization, parallelization, GRAPE and GPU acceleration, and Sverre has been always on top of it if not ahead, but also fully adopting ideas of collaborators, once they tested well. NBODY6++GPU and NBODY7 entered the scene, and also recent new competitors, such as PETAR or BIFROST . We all have learnt a lot from Sverre, and strive to continue in his open-minded spirit, for open source and exchange. A striking evidence for the further growth of the industry is the number of papers here (and two of them follow in this session, but also in other sessions) using and further developing the aforementioned codes, as well as the occurrence of new and competing codes, which keep the field alive."}
{"id": "2512.23758", "categories": ["astro-ph.HE", "astro-ph.IM", "hep-ph"], "pdf": "https://arxiv.org/pdf/2512.23758", "abs": "https://arxiv.org/abs/2512.23758", "authors": ["Wasif Husain"], "title": "Machine-Learning Classification of Neutron-Star Matter Composition from Macroscopic and Oscillation Observables", "comment": null, "summary": "The microscopic composition of neutron star interiors remains uncertain, with possible scenarios including nucleonic matter, hyperonic matter, dark matter admixed cores, and strange self-bound matter. Traditional constraints on the equation of state rely on Tolman Oppenheimer Volkoff modelling and comparison with multimessenger observations, but machine learning provides a complementary pathway by learning composition dependent patterns directly from astrophysically accessible observables. This work presents a compact supervised learning framework for EOS family classification using stellar properties derived from TOV modelling, asteroseismology, and gravitational wave descriptors. A labelled dataset of neutron star configurations spanning four EOS families (nucleonic, strange matter, dark matter admixed, and hyperonic) is constructed using seven input features: gravitational mass, radius, fundamental f mode frequency, quadrupole moment, redshift, damping time, and characteristic strain. A multilayer perceptron is trained to infer the underlying matter composition. On a held out test set, the classifier achieves an accuracy of 97.4 percent with strong class wise precision and recall. Permutation based feature importance analysis shows that oscillation related quantities, especially the f mode frequency and damping time, dominate the discriminatory power, while mass and radius provide secondary support. Residual misclassifications occur in physically intuitive regions where different EOS families produce partially overlapping macroscopic signatures. These results show that lightweight neural models can reliably identify EOS family fingerprints from a modest set of observables, providing a reproducible baseline for future extensions incorporating Bayesian uncertainty and observational posteriors from NICER and gravitational wave events."}
{"id": "2512.24465", "categories": ["astro-ph.IM", "physics.soc-ph"], "pdf": "https://arxiv.org/pdf/2512.24465", "abs": "https://arxiv.org/abs/2512.24465", "authors": ["Ava Polzin", "Katherine E. Whitaker", "C. Megan Urry", "Henna Abunemeh", "Sanyukta Agarwal", "Aadya Agrawal", "Nathaniel Alden", "Ann-Marsha Alexis", "Sydney Andersen", "Melanie Archipley", "Yasmeen Asali", "Katie Auchettl", "Bradford Benson", "Binod Bhattarai", "Sarah Biddle", "Madison Brady", "Katelyn Breivik", "Disha Chakraborty", "Mikel Charles", "Hsiao-Wen Chen", "Josephine Chishala", "Anirudh Chiti", "Panagiota Eleftheria Christopoulou", "Mi Dai", "Flaminia Fortuni", "Shanika Galaudage", "Daniel Glazer", "Anika Goel", "Andrea Gokus", "Jenny E. Greene", "Ryn Grutkoski", "Yiqing Guo", "Joseph Guzman", "Renée Hložek", "Lindsay R. House", "Lillian N. Joseph", "Molly Beth Jourdan", "Tanvi Karwal", "Zuzanna Kocjan", "Emily Koivu", "Varun Kore", "Andrey Kravtsov", "Keerthi Kunnumkai", "Shalini Kurinchi-Vendhan", "Johannes U. Lange", "Sarah R. Loebman", "Kira Lund", "Julie Malewicz", "Olivia McAuley", "Rebecca McClain", "Stephen McKay", "Emily McPike", "Cassidy Metzger", "Lamiya A. Mowla", "Katherine Myers", "Erica Nelson", "Aline Novais", "Camilla Nyhagen", "Micah Oeur", "Lou Baya Ould Rouis", "Paarmita Pandey", "Raagini Patki", "Sonu Tabitha Paulson", "Haile M. L. Perkins", "Ashi Poorey", "Izabella Pozo", "Heather L. Preston", "Pazit Rabinowitz", "Alexandra S. Rahlin", "Janiris Rodriguez-Bueno", "Francisco Rodríguez Montero", "Huei Sears", "Álvaro Segovia Otero", "Uliana Solovieva", "Rachel Somerville", "Jessica Speedie", "Tjitske Starkenburg", "Laura Stiles-Clarke", "Chin Yi Tan", "Yu-Hsuan Teng", "Tanya Urrutia", "Padmavathi Venkatraman", "Margaret E. Verrico", "Amanda Wasserman", "Claire E. Williams", "Tony Wong", "Shirin Gul Zaidi", "Chantene Zichterman"], "title": "Picture an Astronomer: Best Practices for Retaining Talent in Astrophysics", "comment": "White paper from Picture an Astronomer symposium", "summary": "Women are consistently underrepresented in astrophysics yet are simultaneously subject to disproportionate attrition at every career stage. This disparity between demonstrated efficacy in job performance and ultimate career outcome was the primary motivation for the Picture an Astronomer series, which included both targeted public outreach to increase representation of women in astrophysics and high-level, solution-oriented discussions among professional astronomers. In March 2025, more than 200 astronomers came together in a hybrid-format symposium focused on the state of the field for female scientists, combining scientific exchange with discussions of policies and practices to strengthen retention of talent in the field. This white paper is the result of those discussions, offering a wide range of recommendations developed in the context of gendered attrition in astrophysics but which ultimately support a healthier climate for all scientists alike."}
{"id": "2512.23815", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.23815", "abs": "https://arxiv.org/abs/2512.23815", "authors": ["Marco Turchetta", "Manuel Linares", "Karri Koljonen", "Paulo A. Miles-Páez", "Jordan A. Simpson"], "title": "COBIPLANE: A Systematic Search for Compact Binary Millisecond Pulsars at Low Galactic Latitudes", "comment": "38 pages, 87 figures, 5 tables. This paper has been accepted for publication in ApJ", "summary": "We present the main results obtained from the COmpact BInary Pulsar search in the low-LAtitude NEighborhood (COBIPLANE), an optical photometric survey designed to find new `spider' binary millisecond pulsars. We conducted observations targeting 30 unidentified sources from the 4FGL-DR3 Fermi Large Area Telescope (Fermi-LAT) catalog, selected for their pulsar-like $γ$-ray properties. Extending to Galactic latitudes as low as $\\pm3^{\\circ}$, this survey reaches closer to the Galactic plane than its predecessor survey, the COmpact BInary PULsar SEarch (COBIPULSE). We report the discovery of five optical variables coincident with the localizations of 4FGL J0821.5-1436, 4FGL J1517.9-5233, 4FGL J1639.3-5146, 4FGL J1748.8-3915, and 4FGL J2056.4+3142. These systems show optical flux modulation at the presumed orbital periods of $0.41576(6) \\ \\mathrm{d}$, $0.305(2) \\ \\mathrm{d}$, $0.204(7) \\ \\mathrm{d}$, $0.3(2) \\ \\mathrm{d}$, and $0.4395(1) \\ \\mathrm{d}$, respectively, and photometric temperatures of $4000$--$6000 \\ \\mathrm{K}$, consistent with the companion stars of `redback' subtype of spider pulsar binaries. Based on their optical light curve shapes and X-ray properties characteristic for spider systems -- namely, a luminosity of $1.5 \\times 10^{32} \\ (D / 3.9 \\ \\mathrm{kpc})^2 \\ \\mathrm{erg} \\ \\mathrm{s}^{-1}$ ($0.3$--$10 \\ \\mathrm{keV}$) for 4FGL J1748.8-3915, and upper limits of $\\sim10^{31}$--$10^{33} \\ \\mathrm{erg} \\ \\mathrm{s}^{-1}$ ($0.2$--$12 \\ \\mathrm{keV}$) for the others -- we classify these sources as new spider candidate systems."}
{"id": "2512.24475", "categories": ["astro-ph.IM"], "pdf": "https://arxiv.org/pdf/2512.24475", "abs": "https://arxiv.org/abs/2512.24475", "authors": ["Akanksha Dagore", "Prajwel Joseph", "S. N. Tandon", "Annapurni Subramaniam", "S. K. Ghosh", "C. S. Stalin"], "title": "Nine years of UVIT: assessing sensitivity variation", "comment": "Accepted for publication in The Astronomical Journal", "summary": "The Ultra-Violet Imaging Telescope (UVIT) is one of the five payloads onboard the first Indian multiwavelength astronomical observatory, AstroSat, launched by the Indian Space Research Organisation on 28 September 2015. UVIT, designed for simultaneous imaging in the far-ultraviolet (FUV; 1300-1800 Å) and near-ultraviolet (NUV; 2000-3000 Å) channels, has completed nine years in orbit in 2024 despite the failure of the NUV channel in 2018. As the FUV optics is subject to possible reduction in sensitivity due to microscopic amounts of contaminants, we used the FUV data acquired by UVIT over the past nine years on the open cluster NGC 188 and the white dwarf HZ 4 to study sensitivity variations in the UVIT FUV channel. Our findings indicate no significant reduction in the sensitivity of the FUV channel over the last nine years, with no significant episodic variations due to unknown causes."}
{"id": "2512.23826", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.23826", "abs": "https://arxiv.org/abs/2512.23826", "authors": ["Vladimir Karas"], "title": "A secondary orbiter under collisions with an accretion disk", "comment": "Write-up from a conference: Proceedings of RAGtime #26--28: Workshops on black holes and neutron stars (Silesian University in Opava), 11 pp., in prep", "summary": "Dynamics of stellar orbits in dense stellar systems and nuclear star clusters (NSC) with an embedded supermassive black hole (SMBH) is governed a complex interplay of different forces. In particular, star--star gravitational collisions (relaxation), physical collisions between stars, and the hydrodynamical interaction with any surrounding gaseous environment, such as an accretion disk. These processes influence the stellar distribution, the feeding of the central black hole, and the generation of observable phenomena. Furthermore, the self-gravity of the accretion medium modulates the long-term evolution, adding significant complexity to the system's dynamics. By employing elementary arguments we outline the mentioned influences in their mutual competition."}
{"id": "2512.24479", "categories": ["astro-ph.IM", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2512.24479", "abs": "https://arxiv.org/abs/2512.24479", "authors": ["Malcolm K. Druett", "Graham S. Kerr", "Joel C. Allred", "Philippa K. Browning", "Giulio Del Zanna", "Jaroslav Dudík", "Robertus Erdélyi", "Andrzej Fludra", "David R. Graham", "Hamish A. S. Reid", "Laura A. Hayes", "Sarah A. Matthews", "James A. McLaughlin", "Christopher M. J. Osborne", "Alex G. M. Pietrow", "Vanessa Polito", "Alex J. B. Russell", "Peter F. Wyper"], "title": "Understanding Solar Flares and Energetic Events: Open questions, observational requirements, and instrumental needs over the coming decade", "comment": "A white Paper in response to Space Frontiers 2035. Primary Thematic Area: Heliophysics", "summary": "Solar flares are the largest energy-release events in the Solar System, allowing us to study fundamental physical phenomena under extreme conditions. Those include magnetic reconnection, particle acceleration, radiation transport, and various plasma physics processes, all of which occur throughout the heliosphere and rest of the Universe. Flares and eruptive events are also components of geo-effective space weather. Their impacts from a space weather perspective are numerous, such as harm to satellites, disruption to GPS, communications and power systems, and impacts on passenger air travel. A comprehensive understanding of solar flares is therefore not just a compelling science problem, but also important for national security and infrastructure. This white paper (WP) addresses critical open science questions related to solar flares. Key observations and capabilities required to make significant advancements over the coming decade are identified. The UK has a robust and vibrant solar flare community. We are key partners in international collaborations, and also provide instrumentation for existing and upcoming ESA/NASA/JAXA space missions. Continuing this effort over the coming decade is vital to maintain UK leadership in this field, achieve Solar System Advisory Panel roadmap goals, and to work under the UK Space Agency's National Space Strategy Pillars. Several complementary WPs have been submitted that discuss instruments or concepts that would directly address the observational requirements we describe (including: SPARK, solar optimised IFUs, Solar-C/EUVST, and OSIRIS), as well as required numerical modelling efforts and infrastructure."}
{"id": "2512.23999", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.23999", "abs": "https://arxiv.org/abs/2512.23999", "authors": ["Mageshwaran Tamilan"], "title": "Time-Dependent Accretion Disks with Magnetically Driven Winds: Green's Function Solutions", "comment": "44 pages, 12 figures, accepted for publication in Progress of Theoretical and Experimental Physics (PTEP)", "summary": "We present Green's function solutions for a geometrically thin, one-dimensional Keplerian accretion disk that includes angular momentum extraction and mass loss due to magnetohydrodynamic (MHD) winds. The disk viscosity is assumed to vary radially as $ν\\propto r^{n}$. We derive solutions for three types of boundary conditions applied at the inner radius $r_{\\rm in}$: (i) zero torque, (ii) zero mass accretion rate, and (iii) finite torque and finite accretion rate, and investigate the time evolution of a disk with an initial surface density represented by a Dirac-delta function. The mass accretion rate at the inner radius decays with time as $t^{-3/2}$ for $n = 1$ at late times in the absence of winds under the zero-torque condition, consistent with Lynden-Bell \\& Pringle (1974), while the presence of winds leads to a steeper decay. All boundary conditions yield identical asymptotic time evolution for the accretion and wind mass-loss rates, though their radial profiles differ near $r_{\\rm in}$. Applying our solutions to protoplanetary disks, we find that the disk follows distinct evolutionary tracks in the accretion rate-disk mass plane depending on $ψ$, a dimensionless parameter that regulates the strength of the vertical stress driving the wind, with the disk lifetime decreasing as $ψ$ increases due to enhanced wind-driven mass loss. The inner boundary condition influences the evolution for $ψ< 1$ but becomes negligible at higher $ψ$, indicating that strong magnetically driven winds dominate and limit mass inflow near the boundary. Our Green's function solutions offer a general framework to study the long-term evolution of accretion disks with magnetically driven winds."}
{"id": "2512.24754", "categories": ["astro-ph.IM", "cs.AI"], "pdf": "https://arxiv.org/pdf/2512.24754", "abs": "https://arxiv.org/abs/2512.24754", "authors": ["Yutong Wang", "Yunxiang Xiao", "Yonglin Tian", "Junyong Li", "Jing Wang", "Yisheng Lv"], "title": "AstroReview: An LLM-driven Multi-Agent Framework for Telescope Proposal Peer Review and Refinement", "comment": null, "summary": "Competitive access to modern observatories has intensified as proposal volumes outpace available telescope time, making timely, consistent, and transparent peer review a critical bottleneck for the advancement of astronomy. Automating parts of this process is therefore both scientifically significant and operationally necessary to ensure fair allocation and reproducible decisions at scale. We present AstroReview, an open-source, agent-based framework that automates proposal review in three stages: (i) novelty and scientific merit, (ii) feasibility and expected yield, and (iii) meta-review and reliability verification. Task isolation and explicit reasoning traces curb hallucinations and improve transparency. Without any domain specific fine tuning, AstroReview used in our experiments only for the last stage, correctly identifies genuinely accepted proposals with an accuracy of 87%. The AstroReview in Action module replicates the review and refinement loop; with its integrated Proposal Authoring Agent, the acceptance rate of revised drafts increases by 66% after two iterations, showing that iterative feedback combined with automated meta-review and reliability verification delivers measurable quality gains. Together, these results point to a practical path toward scalable, auditable, and higher throughput proposal review for resource limited facilities."}
{"id": "2512.24003", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.24003", "abs": "https://arxiv.org/abs/2512.24003", "authors": ["Hosein Rajabi", "Zhejian Liu", "Fereshteh Rajabi", "Martin Houde"], "title": "Machine-learning approaches to dispersion measure estimation for fast radio bursts", "comment": "13 pages, 6 figures, and 8 tables", "summary": "Fast radio bursts (FRBs) are bright, mostly millisecond-duration transients of extragalactic origin whose emission mechanisms remain unknown. As FRB signals propagate through ionized media, they experience frequency-dependent delays quantified by the dispersion measure (DM), a key parameter for inferring source distances and local plasma conditions. Accurate DM estimation is therefore essential for characterizing FRB sources and testing physical models, yet current dedispersion methods can be computationally intensive and prone to human bias. In this proof-of-concept study, we develop and benchmark three deep-learning architectures, a conventional convolutional neural network (CNN), a fine-tuned ResNet-50, and a hybrid CNN-LSTM model, for automated DM estimation. All models are trained and validated on a large set of synthetic FRB dynamic spectra generated using CHIME/FRB-like specifications. The hybrid CNN-LSTM achieves the highest accuracy and stability while maintaining low computational cost across the investigated DM range. Although trained on simulated data, these models can be fine-tuned on real CHIME/FRB observations and extended to future facilities, offering a scalable pathway toward real-time, data-driven DM estimation in large FRB surveys."}
{"id": "2512.24764", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.24764", "abs": "https://arxiv.org/abs/2512.24764", "authors": ["Peng Zhang", "Chen-Wei Wang", "Zheng-Hang Yu", "Ren-Zhou Gui", "Shao-Lin Xiong", "Xiao-Bo Li", "Li-Ming Song", "Shi-Jie Zheng", "Xiao-Yun Zhao", "Yue Huang", "Wang-Chen Xue", "Ya-Qi Wang", "Long-Bo Han", "Jia-Cong Liu", "Chao Zheng", "Wen-Jun Tan", "Sheng-Lun Xie", "Ce Cai", "Yan-Qiu Zhang", "Hao-Xuan Guo", "Yue Wang", "Yang-Zhao Ren"], "title": "LUNCH: A Lightweight Unified Deep-Learning Framework for General Transients Classification in High-Energy Time-Domain Astronomy", "comment": null, "summary": "The increasing data volume of high-energy space monitors necessitates real-time, automated transient classification for multi-messenger follow-up. Conventional methods rely on empirical features like hardness ratios and reliable localization, which are not always precisely available during early detection. We developed the Lightweight Unified Neural Classifier for High-energy Transients (LUNCH) - an end-to-end deep-learning framework that performs general transient classification directly from raw multi-band light curves, eliminating the need for background subtraction or source localization. Its dual-scale architecture fuses long- and short-scale temporal evolution adaptively. Evaluated on 15 years of Fermi/GBM triggers, the optimal model achieves 97.23% accuracy when trained on complete energy spectra. A lightweight version using only three broad energy bands retains 95.07% accuracy, demonstrating that coarse spectral information fused with temporal context enables robust discrimination. The system significantly outperforms the GBM in-flight classifier on three months of independent test data. Feature visualization reveals well-separated class clusters, confirming physical interpretability. LUNCH combines high accuracy, low computational cost, and instrument-agnostic inputs, offering a practical solution for real-time in-flight processing that enables timely triggers for immediate multi-wavelength and multi-messenger follow-up observations in future time-domain missions."}
{"id": "2512.24085", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.24085", "abs": "https://arxiv.org/abs/2512.24085", "authors": ["Xueying Shao", "He Gao"], "title": "SSC Radiation in the ICMART Model: Spectral Simulations and Application to the Record-Breaking GRB 221009A", "comment": null, "summary": "This paper presents simulations of the synchrotron self-Compton (SSC) spectrum within the Internal-Collision-induced Magnetic Reconnection and Turbulence (ICMART) model. We investigate how key parameters like the magnetization $σ_0$ shape the broadband spectral energy distribution by regulating the electron distribution and magnetic field strength. The overall spectrum typically comprises two components: synchrotron radiation peaking at $E_{\\rm p}$ with a low-energy spectral index $α$ between -1 and -1.5, and an SSC component peaking at $E_{\\rm ssc}$. At high energies, Klein-Nishina suppression causes an exponential cutoff. The flux ratio Y between these components is critical: when Y is small, the SSC peak can be suppressed. Spectral features of the synchrotron component reveal the underlying physical conditions: harder spectra with $α\\sim-1$ indicate a large Y parameter and strong KN suppression. We find a positive correlation between Y and $σ_0$, contrasting with internal shock model predictions. Applied to GRB 221009A, our model suggests $σ_0\\leq20$ can reproduce the MeV-TeV observations. This study underscores the value of combined MeV-TeV observations in probing GRB emission mechanisms."}
{"id": "2512.24782", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.24782", "abs": "https://arxiv.org/abs/2512.24782", "authors": ["Ranfang Zheng", "Zheyu Lin", "Xu Kong", "Dezheng Meng", "Zelin Xu", "Lulu Fan", "Ji-an Jiang", "Ning Jiang", "Jie Lin", "Tinggui Wang", "Qingfeng Zhu", "Feng Li", "Ming Liang", "Hao Liu", "Zheng Lou", "Wentao Luo", "Jinlong Tang", "Hairen Wang", "Jian Wang", "Yongquan Xue", "Dazhi Yao", "Hong-fei Zhang", "Wen Zhao", "Xianzhong Zheng", "Yingxi Zuo"], "title": "TTC: Transformer-based TDE Classifier for the Wide Field Survey Telescope (WFST)", "comment": "17 pages, 9 figures, 7 tables; accepted by ApJ", "summary": "We propose the Transformer-based Tidal disruption events (TDE) Classifier (\\texttt{TTC}), specifically designed to operate effectively with both real-time alert streams and archival data of the Wide Field Survey Telescope (WFST). It aims to minimize the reliance on external catalogs and find TDE candidates from pure light curves, which is more suitable for finding TDEs in faint and distant galaxies. \\texttt{TTC} consists of two key modules that can work independently: (1) A light curve parametric fitting module and (2) a Transformer (\\texttt{Mgformer})-based classification network. The training of the latter module and evaluation for each module utilize a light curve dataset of 7413 spectroscopically classified transients from the Zwicky Transient Facility (ZTF). The \\texttt{Mgformer}-based module is superior in performance and flexibility. Its representative recall and precision values are 0.79 and 0.76, respectively, and can be modified by adjusting the threshold. It can also efficiently find TDE candidates within 30 days from the first detection. For comparison, the parametric fitting module yields values of 0.72 and 0.40, respectively, while it is $>$10 times faster in average speed. Hence, the setup of modules allows a trade-off between performance and time, as well as precision and recall. \\texttt{TTC} has successfully picked out all spectroscopically identified TDEs among ZTF transients in a real-time classification test, and selected $\\sim$20 TDE candidates in the deep field survey data of WFST. The discovery rate will greatly increase once the differential database for the wide field survey is ready."}
{"id": "2512.24141", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.24141", "abs": "https://arxiv.org/abs/2512.24141", "authors": ["Prantik Nandi", "Narendranath Layek", "Sandip K Chakrabarti", "Sachindra Naik", "Priyadarshee P. Dash"], "title": "Evolution of Accretion Properties in Mrk 1040 using long-term X-ray Observations", "comment": null, "summary": "We present a comprehensive long-term, multi-epoch spectral and timing study of the Seyfert 1 Active Galactic Nucleus (AGN) Mrk~1040, utilizing X-ray observations spanning from 2009 to 2024 ($\\sim$15 years). The source exhibits pronounced spectral and temporal variability, indicative of transitions between different accretion regimes in the vicinity of the central supermassive black hole. The earlier reported soft excess is re-examined within a uniform, physically motivated multi-epoch framework. We confirm the presence of this soft excess in the 2009 observation, where it is well described by a warm, extended Comptonizing corona with $kT_{\\rm e,warm} \\sim 0.26$~keV and a radial extent of $R_{\\rm warm} \\sim 30~r_g$. In subsequent epochs, the soft excess is not statistically significant, possibly due to a combination of enhanced ionized absorption, intrinsic weakening of the warm Comptonizing region, or partial truncation of the inner disc. A strong correlation between the soft and hard X-ray fluxes suggests a common physical origin for both components, likely within a multi-layered Comptonizing structure that evolved into a compact and thermally stable corona after 2013. The observed spectral variability, together with changes in the Fe~K$α$ line strength, reflects the evolving coronal geometry and accretion flow dynamics. Variations in the intrinsic column density ($N_H$) further indicate that Mrk~1040 is embedded within a clumpy, dynamically variable absorber responding to changes in the accretion rate. Using the TCAF model, we estimate the black hole mass as $M_{\\rm BH} = (4.50 \\pm 1.62) \\times 10^7~M_\\odot$, consistent with previous estimates."}
{"id": "2512.24895", "categories": ["astro-ph.IM", "astro-ph.GA"], "pdf": "https://arxiv.org/pdf/2512.24895", "abs": "https://arxiv.org/abs/2512.24895", "authors": ["Cody Carr", "Renyue Cen", "Brian Fleming", "Sophia Flury", "Stephan McCandliss", "Sally Oey", "Allison Strom"], "title": "Resolving the Origins and Pathways of Ionizing Radiation Escape with UV Integral Field Spectroscopy", "comment": "26 pages, 2 figures, comments welcome. arXiv admin note: substantial text overlap with arXiv:2506.23105", "summary": "The Epoch of Reionization marks the last major phase transition in the early Universe, during which the majority of neutral hydrogen once filling the intergalactic medium was ionized by the first galaxies. The James Webb Space Telescope (JWST) is now identifying promising galaxy candidates capable of producing sufficient ionizing photons to drive this transformation. However, the fraction of these photons that escape into intergalactic space--the escape fraction--remains highly uncertain. Stellar feedback is thought to play a critical role in carving low-density channels that allow ionizing radiation to escape, but the dominant mechanisms, their operation, and their connection to observable signatures are not well understood. Local analogs of high-redshift galaxies offer a powerful alternative for studying these processes, since ionizing radiation is unobservable at high redshift due to intergalactic absorption. However, current UV space-based instrumentation lacks the spatial resolution and sensitivity required to fully address this problem. The core challenge lies in the multiscale nature of LyC escape: ionizing photons are generated on scales of 1--100 pc in super star clusters but must traverse the circumgalactic medium which can extend beyond 100 kpc. The proposed Habitable Worlds Observatory (HWO) will provide a platform for future UV instruments capable of resolving these scales. In this article, we present a science case for understanding how LyC photons escape from star-forming galaxies and define the observational requirements for future instruments aboard HWO, including a UV integral field spectrograph (IFS)."}
{"id": "2512.24178", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.24178", "abs": "https://arxiv.org/abs/2512.24178", "authors": ["Emma Kun", "Santiago del Palacio", "Imre Bartos", "Francis Halzen", "Julia Becker Tjus", "Peter L. Biermann", "Anna Franckowiak", "Claudio Ricci"], "title": "A Seyfert galaxy as a hidden counterpart to a neutrino-associated blazar", "comment": "12 pages, 4 figures. Submitted. Comments welcome", "summary": "The origin and production mechanisms of high-energy astrophysical neutrinos remain open questions in multimessenger astronomy. Previous studies have hinted at a possible linear correlation between the hard X-ray and high-energy neutrino emission in active galactic nuclei. New \\textit{NuSTAR} observations, first presented here, reveal that blazar PKS 1424+240, located within a prominent IceCube neutrino hotspot, is far fainter in hard X-rays than expected from this trend. Motivated by this apparent ambiguity, we identify the nearby Seyfert galaxy NGC 5610, also coincident with the hotspot, whose unabsorbed hard X-ray flux exceeds that of PKS 1424+240 by about an order of magnitude. When the local IceCube neutrino flux is apportioned between the two AGN in proportion to their hard X-ray emission, both align with the previously suggested X-ray-neutrino correlation. This suggests that certain IceCube hotspots may be unresolved blends of multiple AGN, and supports a multimessenger scenario in which high-energy neutrinos and hard X-rays originate from the same hadronic interactions, with the X-ray emission produced through cascade reprocessing."}
{"id": "2512.23758", "categories": ["astro-ph.HE", "astro-ph.IM", "hep-ph"], "pdf": "https://arxiv.org/pdf/2512.23758", "abs": "https://arxiv.org/abs/2512.23758", "authors": ["Wasif Husain"], "title": "Machine-Learning Classification of Neutron-Star Matter Composition from Macroscopic and Oscillation Observables", "comment": null, "summary": "The microscopic composition of neutron star interiors remains uncertain, with possible scenarios including nucleonic matter, hyperonic matter, dark matter admixed cores, and strange self-bound matter. Traditional constraints on the equation of state rely on Tolman Oppenheimer Volkoff modelling and comparison with multimessenger observations, but machine learning provides a complementary pathway by learning composition dependent patterns directly from astrophysically accessible observables. This work presents a compact supervised learning framework for EOS family classification using stellar properties derived from TOV modelling, asteroseismology, and gravitational wave descriptors. A labelled dataset of neutron star configurations spanning four EOS families (nucleonic, strange matter, dark matter admixed, and hyperonic) is constructed using seven input features: gravitational mass, radius, fundamental f mode frequency, quadrupole moment, redshift, damping time, and characteristic strain. A multilayer perceptron is trained to infer the underlying matter composition. On a held out test set, the classifier achieves an accuracy of 97.4 percent with strong class wise precision and recall. Permutation based feature importance analysis shows that oscillation related quantities, especially the f mode frequency and damping time, dominate the discriminatory power, while mass and radius provide secondary support. Residual misclassifications occur in physically intuitive regions where different EOS families produce partially overlapping macroscopic signatures. These results show that lightweight neural models can reliably identify EOS family fingerprints from a modest set of observables, providing a reproducible baseline for future extensions incorporating Bayesian uncertainty and observational posteriors from NICER and gravitational wave events."}
{"id": "2512.24203", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.24203", "abs": "https://arxiv.org/abs/2512.24203", "authors": ["Sohini Kayal", "P. Gayatri", "Mridweeka Singh", "Kuntal Misra"], "title": "Abundance Stratification in Type Iax SN 2020rea with TARDIS", "comment": "10 pages, 4 figures, accepted for publication in Journal of Astrophysics and Astronomy", "summary": "Using the 1D Monte Carlo-based radiative transfer code TARDIS, we investigate the spectral evolution of the Type Iax supernova (SN) 2020rea from -7 days before to +21 days after maximum light. Our best-fit models indicate stratified, velocity-dependent abundances at early times, successfully reproducing most observed spectral features. As the SN evolves, the ejecta transition from a layered to a more homogeneous composition, posing an alternative to pure deflagration models that predict fully mixed ejecta. These results highlight the need for further investigation, as current pure deflagration models cannot fully explain the origin or spectral properties of Type Iax SNe like SN 2020rea."}
{"id": "2512.24228", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.24228", "abs": "https://arxiv.org/abs/2512.24228", "authors": ["H. E. S. S. collaboration"], "title": "H.E.S.S. detection and multi-wavelength study of the $z \\sim$ 1 blazar PKS 0346$-$27", "comment": "Accepted for publication in A&A; Corresponding authors: O. Chibueze, B. Bi, M. Boettcher, F. Jankovsky, A. Luashvili", "summary": "PKS 0346-27 is a Low Synchrotron Peaked (LSP) blazar at redshift 0.991. The very-high-energy (VHE, E > 100 GeV) spectra of blazars are always affected by $γγ$ absorption by the Extragalactic Background Light (EBL) and subsequently, no blazars have been detected in VHE $γ$-rays at redshifts exceeding 1. Extending the redshift range of VHE-detected blazars to $z \\gtrsim 1$ will yield insights into the cosmological evolution of both the VHE blazar population and the EBL. This is the goal of a target-of-opportunity (ToO) programme by H.E.S.S. to observe flaring high-redshift ($z \\gtrsim 1$) blazars. We report on H.E.S.S. ToO and multi-wavelength observations of the blazar PKS\\,0346$-$27. Along with H.E.S.S., simultaneous data from {\\it Fermi}-LAT, {\\it Swift} (XRT and UVOT), and ATOM have been analysed and modelled using single-zone leptonic and hadronic models. PKS~0346-27 has been detected by H.E.S.S at a significance of 6.3$σ$ during one night, on 3 November 2021, while for other nights before and after this day, upper limits on the VHE flux are determined. No evidence for intra-night $γ$-ray variability has been found. A flare in high-energy (HE, $E > 100$~MeV) $γ$-rays detected by {\\it Fermi}-LAT preceded the H.E.S.S. detection by 2 days. A fit with a single-zone emission model to the contemporaneous spectral energy distribution during the detection night was possible with a proton-synchrotron-dominated hadronic model, requiring a proton-kinetic-energy-dominated jet power temporarily exceeding the source's Eddington limit, although alternative (e.g. multi-zone) models can not be ruled out. A one-zone leptonic model is, in principle, also able to fit the flare-state SED, however, requiring implausible parameter choices, in particular, extreme Doppler and bulk Lorentz factors of $\\gtrsim 80$."}
{"id": "2512.24257", "categories": ["astro-ph.HE", "astro-ph.SR"], "pdf": "https://arxiv.org/pdf/2512.24257", "abs": "https://arxiv.org/abs/2512.24257", "authors": ["J. H. Gillanders", "A. Flors", "R. Ferreira da Silva"], "title": "Improved lanthanide constraints for the kilonova AT 2017gfo", "comment": "Submitted to MNRAS; comments welcome", "summary": "Spectroscopic observations of the kilonova AT 2017gfo provide a unique opportunity to identify signatures from individual heavy elements freshly synthesised via the {\\it r}-process, the nucleosynthetic channel responsible for producing $\\sim$half of all trans-iron-group elements. Limitations in the available atomic data have historically hampered comprehensive line identification studies; however, renewed interest has led to the generation of improved (more complete and accurately calibrated) line lists for {\\it r}-process species. Here we demonstrate the utility of such data, by exploiting newly generated line lists for the lanthanides to model the photospheric-phase 3.4d X-shooter spectrum of AT 2017gfo with the radiative transfer tool \\textsc{tardis}. We find the data can only be reproduced by invoking a substantially diminished lanthanide mass fraction ($X_{\\textsc{ln}}$) than that proposed by previous studies. Specifically, our model necessitates $X_{\\textsc{ln}} \\approx 2.5 \\times 10^{-3}$, a value $20 \\times$ lower than previously claimed. This substantial reduction in $X_{\\textsc{ln}}$ is driven by our inclusion of much more complete lanthanide line information that enables better estimation of their total contribution to the observations. We encourage future modelling works to exploit all atomic data advances, and also encourage continued efforts to generate the necessary data for the remaining {\\it r}-process species of interest."}
{"id": "2512.24563", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.24563", "abs": "https://arxiv.org/abs/2512.24563", "authors": ["Xue-Zhao Chang", "HouJun Lü", "Jia-Ming Chen", "En-Wei Liang"], "title": "Evidence for the transition from thermal to non-thermal emission in the prompt emission of GRB 161117A", "comment": "18 pages, 7 figures, and 2 tables. Accepted for publication in ApJ", "summary": "GRB 161117A is a long-duration GRB with three main overlapping peaks. By analyzing the time-resolved spectra of its data observed with the Gamma-Ray Burst Monitor (GBM) on board the Fermi mission, we find that the spectral evolution shows a transition from thermal (single BB) to hybrid (PL$+$BB), and finally to non-thermal (Band and CPL) emissions. Such a transition suggests that the jet composition of GRB 161117A should be changed from a fireball to a Poynting-flux-dominated jet. The bulk Lorentz factor ($Γ_{\\rm ph}$), radii ($R_{\\rm ph}$ and $R_{0}$), magnetization factor at the central engine ($σ_0$), and dimensionless entropy ($η$) of the outflow can be inferred by invoking the observed quasi-thermal component within two models (e.g., pure fireball and hybrid). It is found that $Γ_{\\rm ph}$ seems to be tracking with the light curve, and $R_{0}$ remains a constant at $\\sim$ $10^{8}$ cm. The low magnetization ($1+σ_0 \\sim$ 1) and high dimensionless entropy ($η\\gg$ 1) during the first seven time-intervals suggest to be a pure fireball outflow. Moreover, we also estimate the lower limit of magnetization parameter at the photosphere radius ($σ_{\\rm ph}\\sim 1.4$ and 0.75) for late phase via the non-thermal spectra, and it indicates that the particle acceleration mechanism is dominated by internal shocks rather than magnetic dissipation processes. Finally, the $ν\\barν$ annihilation mechanism of NDAF model to explain the thermal emission of GRB 161117A is also discussed."}
{"id": "2512.24729", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.24729", "abs": "https://arxiv.org/abs/2512.24729", "authors": ["Asim Kumar Saha", "Tuhin Malik", "Ritam Mallick"], "title": "The role of PSR J0614-3329 in defining the high-density matter at Neutron star cores", "comment": "17 pages, 10 Figures and 3 Tables", "summary": "In this work, we investigate how astrophysical observations from NICER and GW data constrain the matter properties at high densities, with a primary focus on the recent PSR J0614-3329 data. We have constructed three distinct classes of an ensemble of agnostic equation of state by speed of sound parametrisation. Bayesian inference is then employed to constrain the EoS construction parameters-namely, the squared speed of sound and chemical potential at each interpolation segment-using the observational data. Both the NICER and GW constraints hint towards a smoother EoS where PT occurs late, significantly reducing the maximum mass of NS. Also, the maximum-mass and maximum-compact sequences are distinctly different, as the former allows for the maximally stiff EoS to maximise the star mass. In contrast, the latter prefers a softer low-density and stiffer high-density EoS to maximise the compactness. The Bayesian analysis demonstrates that the observational bounds are effective in significantly constraining the low-density region of the equation of state. It is also seen that the astrophysical bound prefers the phase transition in the intermediate-density range and also prefers a small density jump for a discontinuous equation of state."}
{"id": "2512.24936", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.24936", "abs": "https://arxiv.org/abs/2512.24936", "authors": ["J. I. Katz"], "title": "Searching for Periodicity in FRB 20240114A", "comment": "12 pp., 2 figs", "summary": "FRB 20240114A is extraordinarily active, and therefore presents an opportunity to search for the periodicity predicted by magnetar models of Fast Radio Bursts (FRB). Zhang, et al. (2025) observed 11,553 bursts, including 3196 on MJD 60381 (March 12, 2024). We find no significant peak in the periodogram of those bursts, which occur within 15628 s, short enough that even with a characteristic slowing age of 1 year a signal with period $\\ge 0.1\\,$s it would not significantly dephase within the observation. Introducing modulation artificially shows that an amplitude of 0.15 would have been detected robustly. Implications for magnetar models of FRB are briefly considered."}
{"id": "2512.24978", "categories": ["astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.24978", "abs": "https://arxiv.org/abs/2512.24978", "authors": ["C. Dudeja", "J. Roy", "U. Panda", "S. Bhattacharyya"], "title": "Multi-Frequency Study of FRB20201124A with the uGMRT", "comment": null, "summary": "We present results from multi-epoch observations of the repeating fast radio burst FRB 20201124A with the upgraded Giant Metrewave Radio Telescope (uGMRT) during its active phase between 8 May and 28 May 2021. The bursts exhibit significant morphological diversity, including multiple sub-bursts, downward frequency drifts, and intrinsic widths ranging from 1.032 - 32.159 ms. Bursts were detected in both Band 4 (550 - 950 MHz) and Band 5 (1060 - 1460 MHz), with the last Band 5 burst occurring on 24 May, while Band 4 activity persisted until 28 May, indicating a frequency-dependent decline. Consecutive bursts were observed with separations of 16.7 - 291.5 ms, revealing short repetition intervals or potential sub-second quasi-periodicity. The waiting-time and energy distributions are bimodal, suggesting at least two distinct emission timescales and energy modes. Burst fluence ranges from 1.72 - 78.47 Jy ms, and the cumulative fluence distribution follows a broken power law. Multi-frequency analysis further shows closely spaced burst pairs across Band 4 and Band 5, with sub-second offsets of 1.08 - 1.15 s, and no strict simultaneity with contemporaneous FAST detections. These findings demonstrate that FRB 20201124A exhibits closely spaced, patchy, multi-frequency emission with frequency-dependent activity, highlighting the complex and dynamic nature of repeating FRBs."}
{"id": "2512.24187", "categories": ["astro-ph.IM", "astro-ph.GA", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.24187", "abs": "https://arxiv.org/abs/2512.24187", "authors": ["Susanna Bisogni", "Giustina Vietri", "Andrea Travascio", "Adriana Gargiulo", "Chiara Mancini", "Swayamtrupta Panda"], "title": "Connecting disc-corona physics and ionised outflows in AGN in the 2040s", "comment": "Cover page plus 3 pages according to the guidelines issued by the ESO Expanding Horizons initiative 2025 (call for White Papers)", "summary": "We outline a science case for next-generation wide-field spectroscopic surveys aimed at connecting the physics of the accretion disc and X-ray corona in active galactic nuclei (AGN) with the properties of their nebular regions and circumgalactic medium (CGM). We focus on the non-linear Lx-Luv relation and on deviations from this canonical coupling encoded in $Δα_{OX}$, the offset of the optical-to-X-ray index from the mean relation, and propose to use broad and narrow line emission and CGM nebulae as calorimeters of the ionising SED to trace different accretion \"states\". We propose an observational strategy based on rest-frame UV/optical spectroscopy of $\\sim 10^{4}-10^{5}$ AGN, a time-domain reverberation-mapping tier for a well-defined subsample, coordinated X-ray coverage, and wide-field IFU mapping of CGM emission (including H$α$ and Ly$α$). From these goals we derive requirements for a future ESO facility in the 2040s: a dedicated, wide-field, high-multiplex optical-NIR spectroscopic telescope with time-domain flexibility and arcmin-scale IFU capability."}
{"id": "2512.24764", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.24764", "abs": "https://arxiv.org/abs/2512.24764", "authors": ["Peng Zhang", "Chen-Wei Wang", "Zheng-Hang Yu", "Ren-Zhou Gui", "Shao-Lin Xiong", "Xiao-Bo Li", "Li-Ming Song", "Shi-Jie Zheng", "Xiao-Yun Zhao", "Yue Huang", "Wang-Chen Xue", "Ya-Qi Wang", "Long-Bo Han", "Jia-Cong Liu", "Chao Zheng", "Wen-Jun Tan", "Sheng-Lun Xie", "Ce Cai", "Yan-Qiu Zhang", "Hao-Xuan Guo", "Yue Wang", "Yang-Zhao Ren"], "title": "LUNCH: A Lightweight Unified Deep-Learning Framework for General Transients Classification in High-Energy Time-Domain Astronomy", "comment": null, "summary": "The increasing data volume of high-energy space monitors necessitates real-time, automated transient classification for multi-messenger follow-up. Conventional methods rely on empirical features like hardness ratios and reliable localization, which are not always precisely available during early detection. We developed the Lightweight Unified Neural Classifier for High-energy Transients (LUNCH) - an end-to-end deep-learning framework that performs general transient classification directly from raw multi-band light curves, eliminating the need for background subtraction or source localization. Its dual-scale architecture fuses long- and short-scale temporal evolution adaptively. Evaluated on 15 years of Fermi/GBM triggers, the optimal model achieves 97.23% accuracy when trained on complete energy spectra. A lightweight version using only three broad energy bands retains 95.07% accuracy, demonstrating that coarse spectral information fused with temporal context enables robust discrimination. The system significantly outperforms the GBM in-flight classifier on three months of independent test data. Feature visualization reveals well-separated class clusters, confirming physical interpretability. LUNCH combines high accuracy, low computational cost, and instrument-agnostic inputs, offering a practical solution for real-time in-flight processing that enables timely triggers for immediate multi-wavelength and multi-messenger follow-up observations in future time-domain missions."}
{"id": "2512.24782", "categories": ["astro-ph.IM", "astro-ph.HE"], "pdf": "https://arxiv.org/pdf/2512.24782", "abs": "https://arxiv.org/abs/2512.24782", "authors": ["Ranfang Zheng", "Zheyu Lin", "Xu Kong", "Dezheng Meng", "Zelin Xu", "Lulu Fan", "Ji-an Jiang", "Ning Jiang", "Jie Lin", "Tinggui Wang", "Qingfeng Zhu", "Feng Li", "Ming Liang", "Hao Liu", "Zheng Lou", "Wentao Luo", "Jinlong Tang", "Hairen Wang", "Jian Wang", "Yongquan Xue", "Dazhi Yao", "Hong-fei Zhang", "Wen Zhao", "Xianzhong Zheng", "Yingxi Zuo"], "title": "TTC: Transformer-based TDE Classifier for the Wide Field Survey Telescope (WFST)", "comment": "17 pages, 9 figures, 7 tables; accepted by ApJ", "summary": "We propose the Transformer-based Tidal disruption events (TDE) Classifier (\\texttt{TTC}), specifically designed to operate effectively with both real-time alert streams and archival data of the Wide Field Survey Telescope (WFST). It aims to minimize the reliance on external catalogs and find TDE candidates from pure light curves, which is more suitable for finding TDEs in faint and distant galaxies. \\texttt{TTC} consists of two key modules that can work independently: (1) A light curve parametric fitting module and (2) a Transformer (\\texttt{Mgformer})-based classification network. The training of the latter module and evaluation for each module utilize a light curve dataset of 7413 spectroscopically classified transients from the Zwicky Transient Facility (ZTF). The \\texttt{Mgformer}-based module is superior in performance and flexibility. Its representative recall and precision values are 0.79 and 0.76, respectively, and can be modified by adjusting the threshold. It can also efficiently find TDE candidates within 30 days from the first detection. For comparison, the parametric fitting module yields values of 0.72 and 0.40, respectively, while it is $>$10 times faster in average speed. Hence, the setup of modules allows a trade-off between performance and time, as well as precision and recall. \\texttt{TTC} has successfully picked out all spectroscopically identified TDEs among ZTF transients in a real-time classification test, and selected $\\sim$20 TDE candidates in the deep field survey data of WFST. The discovery rate will greatly increase once the differential database for the wide field survey is ready."}
